# LayoutEditorBundle.properties
#
# Revision $Revision$
#
# Japanese Text properties for jmrit.display.LayoutEditor and associated modules
# Translated by Sakae Akanuma <sakaeakanuma@gmail.com>

Title  = \u63CF\u753B\u30D1\u30CD\u30EB

# menu items
MenuPanels  = \u30D1\u30CD\u30EB
MenuEdit    = \u7DE8\u96C6
MenuFile    = \u30D5\u30A1\u30A4\u30EB
MenuTools   = \u30C4\u30FC\u30EB
MenuZoom    = \u62E1\u5927
NoZoom	    = \u5B9F\u5BF8

# colors
Black = \u9ED2\u8272
DarkGray = \u6697\u7070\u8272
Gray = \u7070\u8272
LightGray = \u660E\u7070\u8272
White = \u767D\u8272
Red = \u8D64\u8272
Pink = \u6843\u8272
Orange = \u6A59\u8272
Yellow = \u9EC4\u8272
Green = \u7DD1\u8272
Blue = \u9752\u8272
Magenta = \u7D2B\u8272
Cyan = \u7D3A\u8272

# edit mode items
RightHandAbbreviation = \u53F3\u5074\u5206\u5C90
RHToolTip = \u53F3\u5206\u5C90\u3092\u9078\u629E\u3057\u305F\u72B6\u614B\u3067\u3001\u5E0C\u671B\u306E\u4F4D\u7F6E\u3067\u30B7\u30D5\u30C8\u30AD\u30FC\u3092\u62BC\u3057\u306A\u304C\u3089\u30AF\u30EA\u30C3\u30AF\u3059\u308B\u3068\u3001\u305D\u3053\u306B\u53F3\u5074\u5206\u5C90\u304C\u7F6E\u304B\u308C\u307E\u3059\u3002
LeftHandAbbreviation = \u5DE6\u5074\u5206\u5C90
LHToolTip = \u5DE6\u5206\u5C90\u3092\u9078\u629E\u305F\u72B6\u614B\u3067\u3001\u5E0C\u671B\u306E\u4F4D\u7F6E\u3067\u30B7\u30D5\u30C8\u30AD\u30FC\u3092\u62BC\u3057\u306A\u304C\u3089\u30AF\u30EA\u30C3\u30AF\u3059\u308B\u3068\u3001\u305D\u3053\u306B\u5DE6\u5074\u5206\u5C90\u304C\u7F6E\u304B\u308C\u307E\u3059\u3002
WYEAbbreviation = \u4E21\u5074\u5206\u5C90
WYEToolTip = \u4E21\u65B9\u5411\u5206\u5C90\u3092\u9078\u629E\u3057\u305F\u72B6\u614B\u3067\u3001\u5E0C\u671B\u306E\u4F4D\u7F6E\u3067\u30B7\u30D5\u30C8\u30AD\u30FC\u3092\u62BC\u3057\u306A\u304C\u3089\u30AF\u30EA\u30C3\u30AF\u3059\u308B\u3068\u3001\u305D\u306E\u4F4D\u7F6E\u306B\u4E21\u5074\u5206\u5C90\u304C\u3072\u3068\u3064\u8FFD\u52A0\u3055\u308C\u307E\u3059\u3002
DoubleCrossOver = \u30C0\u30D6\u30EB\u30AF\u30ED\u30B9\u30AA\u30FC\u30D0\u30FC
DoubleCrossOverToolTip = \u30C0\u30D6\u30EB\u30AF\u30ED\u30B9\u30AA\u30FC\u30D0\u30FC\u5206\u5C90\u3092\u9078\u629E\u3057\u305F\u72B6\u614B\u3067\u3001\u5E0C\u671B\u306E\u4F4D\u7F6E\u3067\u30B7\u30D5\u30C8\u30AD\u30FC\u3092\u62BC\u3057\u306A\u304C\u3089\u30AF\u30EA\u30C3\u30AF\u3059\u308B\u3068\u3001\u305D\u306E\u4F4D\u7F6E\u306B\u305D\u308C\u304C\u3072\u3068\u3064\u8FFD\u52A0\u3055\u308C\u307E\u3059\u3002
RHCrossOver = \u53F3\u30AF\u30ED\u30B9\u30AA\u30FC\u30D0\u30FC
RHCrossOverToolTip = \u53F3\u30AF\u30ED\u30B9\u30AA\u30FC\u30D0\u30FC\u3092\u9078\u629E\u3057\u305F\u72B6\u614B\u3067\u3001\u5E0C\u671B\u306E\u4F4D\u7F6E\u3067\u30B7\u30D5\u30C8\u30AD\u30FC\u3092\u62BC\u3057\u306A\u304C\u3089\u30AF\u30EA\u30C3\u30AF\u3059\u308B\u3068\u3001\u305D\u306E\u4F4D\u7F6E\u306B\u305D\u308C\u304C\u3072\u3068\u3064\u8FFD\u52A0\u3055\u308C\u307E\u3059\u3002
LHCrossOver = \u5DE6\u30AF\u30ED\u30B9\u30AA\u30FC\u30D0\u30FC
LHCrossOverToolTip = \u5DE6\u30AF\u30ED\u30B9\u30AA\u30FC\u30D0\u30FC\u3092\u9078\u629E\u3057\u305F\u72B6\u614B\u3067\u3001\u5E0C\u671B\u306E\u4F4D\u7F6E\u3067\u30B7\u30D5\u30C8\u30AD\u30FC\u3092\u62BC\u3057\u306A\u304C\u3089\u30AF\u30EA\u30C3\u30AF\u3059\u308B\u3068\u3001\u305D\u306E\u4F4D\u7F6E\u306B\u305D\u308C\u304C\u3072\u3068\u3064\u8FFD\u52A0\u3055\u308C\u307E\u3059\u3002
Dashed = \u7834\u7DDA\u306B\u3059\u308B
DashedCheckBoxTip =\u30C8\u30E9\u30C3\u30AF\u30BB\u30B0\u30E1\u30F3\u30C8\u30B9\u30BF\u30A4\u30EB\u306E\u6307\u5B9A - \u30C1\u30A7\u30C3\u30AF\u3059\u308B\u3068\u7834\u7DDA\u3001\u30C1\u30A7\u30C3\u30AF\u3057\u306A\u3044\u3068\u5B9F\u7DDA\u304C\u5F15\u304B\u308C\u307E\u3059\u3002
MainlineBox = \u672C\u7DDA
MainlineCheckBoxTip = \u8DEF\u7DDA\u7A2E\u5225\u306E\u8A2D\u5B9A - \u30C1\u30A7\u30C3\u30AF\u3059\u308B\u3068\u672C\u7DDA\u3001\u30C1\u30A7\u30C3\u30AF\u3057\u306A\u3044\u3068\u652F\u7DDA\u304C\u5F15\u304B\u308C\u307E\u3059\u3002
Solid = \u5B9F\u7DDA
Style = \u69D8\u5F0F
Block = \u30D6\u30ED\u30C3\u30AF
LevelCrossingToolTip = \u30EC\u30D9\u30EB\u30AF\u30ED\u30C3\u30B7\u30F3\u30B0\u30C8\u30E9\u30C3\u30AF\u3092\u9078\u629E\u3057\u305F\u72B6\u614B\u3067\u3001\u30B7\u30D5\u30C8\u30AD\u30FC\u3092\u62BC\u3057\u306A\u304C\u3089\u3001\u5E0C\u671B\u306E\u4F4D\u7F6E\u3067\u30AF\u30EA\u30C3\u30AF\u3059\u308B\u3068\u30EC\u30D9\u30EB\u30AF\u30ED\u30C3\u30B7\u30F3\u30B0\u304C\u7F6E\u304B\u308C\u307E\u3059\u3002
TrackSegment = \u8DEF\u7DDA\u30BB\u30B0\u30E1\u30F3\u30C8
TrackSegmentToolTip = \u8DEF\u7DDA\u30BB\u30B0\u30E1\u30F3\u30C8\u3092\u9078\u629E\u3057\u305F\u72B6\u614B\u3067\u3001\u5E0C\u671B\u306E\u4F4D\u7F6E\u3067\u30B7\u30D5\u30C8\u30AD\u30FC\u3092\u62BC\u3057\u306A\u304C\u3089\u30AF\u30EA\u30C3\u30AF\u3001\u30C9\u30E9\u30C3\u30B0\u3059\u308B\u3068\u3001\u8DEF\u7DDA\u3092\u8A2D\u7F6E\u3067\u304D\u307E\u3059\u3002
DashedToolTip = \u30C8\u30E9\u30C3\u30AF\u30BB\u30B0\u30E1\u30F3\u30C8\u306E\u672C\u7DDA\uFF0F\u652F\u7DDA\u3092\u9078\u3093\u3067\u4E0B\u3055\u3044\u3002
MainlineToolTip = \u8DEF\u7DDA\u30BB\u30B0\u30E1\u30F3\u30C8\u3092\u3001\u672C\u7DDA\uFF0F\u652F\u7DDA\u306E\u3069\u3061\u3089\u304B\u3092\u9078\u629E\u3057\u3066\u4E0B\u3055\u3044\u3002
EndBumperToolTip = \u30A8\u30F3\u30C9\u30D0\u30F3\u30D1\u30FC\u3092\u9078\u629E\u3057\u305F\u72B6\u614B\u3067\u3001\u5E0C\u671B\u306E\u4F4D\u7F6E\u3067\u30B7\u30D5\u30C8\u30AD\u30FC\u3092\u62BC\u3057\u306A\u304C\u3089\u30AF\u30EA\u30C3\u30AF\u3059\u308B\u3068\u3001\u305D\u306E\u4F4D\u7F6E\u306B\u305D\u308C\u304C\u3072\u3068\u3064\u8FFD\u52A0\u3055\u308C\u307E\u3059\u3002
AnchorToolTip = \u57FA\u6E96\u3092\u9078\u629E\u3057\u305F\u72B6\u614B\u3067\u3001\u5E0C\u671B\u306E\u4F4D\u7F6E\u3067\u30B7\u30D5\u30C8\u30AD\u30FC\u3092\u62BC\u3057\u306A\u304C\u3089\u30AF\u30EA\u30C3\u30AF\u3059\u308B\u3068\u3001\u305D\u306E\u4F4D\u7F6E\u306B\u8DEF\u7DDA\u3092\u8A2D\u7F6E\u3059\u308B\u305F\u3081\u306E\u57FA\u6E96\u70B9\u304C\u3072\u3068\u3064\u8FFD\u52A0\u3055\u308C\u307E\u3059\u3002
Labels = \u30E9\u30D9\u30EB
TextLabel = \u30C6\u30AD\u30B9\u30C8\u30E9\u30D9\u30EB
TextLabelToolTip = \u3092\u9078\u629E\u3057\u305F\u72B6\u614B\u3067\u3001\u5E0C\u671B\u306E\u4F4D\u7F6E\u3067\u30B7\u30D5\u30C8\u30AD\u30FC\u3092\u62BC\u3057\u306A\u304C\u3089\u30AF\u30EA\u30C3\u30AF\u3059\u308B\u3068\u3001\u305D\u306E\u4F4D\u7F6E\u306B\u305D\u308C\u304C\u3072\u3068\u3064\u8FFD\u52A0\u3055\u308C\u307E\u3059\u3002
TextToolTip = \u65B0\u898F\u30C6\u30AD\u30B9\u30C8\u30D1\u30CD\u30EB\u306B\u8868\u793A\u3059\u308B\u6587\u5B57\u5217\u3092\u5165\u529B\u3057\u3066\u4E0B\u3055\u3044\u3002
Memory = \u30E1\u30E2\u30EA\u30FC\u30E9\u30D9\u30EB
MemoryBoxToolTip = \u30E1\u30E2\u30EA\u30FC\u30E9\u30D9\u30EB\u3092\u9078\u629E\u3057\u3066\u3001\u5E0C\u671B\u306E\u4F4D\u7F6E\u3067\u30B7\u30D5\u30C8\u30AD\u30FC\u3092\u62BC\u3057\u306A\u304C\u3089\u30AF\u30EA\u30C3\u30AF\u3059\u308B\u3068\u30E1\u30E2\u30EA\u30FC\u30E9\u30D9\u30EB\u304C\u8FFD\u52A0\u3055\u308C\u307E\u3059\u3002
MemoryToolTip = \u65B0\u898F\u30E1\u30E2\u30EA\u30FC\u30E9\u30D9\u30EB\u306B\u8868\u793A\u3055\u308C\u308B\u5909\u6570\u306E\u540D\u524D\u3092\u5165\u529B\u3057\u3066\u4E0B\u3055\u3044\u3002
MultiSensor = \u30DE\u30EB\u30C1\u30BB\u30F3\u30B5\u30FC
MultiSensorToolTip = \u30DE\u30EB\u30C1\u30BB\u30F3\u30B5\u30FC\u3092\u9078\u629E\u3057\u305F\u72B6\u614B\u3067\u3001\u5E0C\u671B\u306E\u4F4D\u7F6E\u3067\u30B7\u30D5\u30C8\u30AD\u30FC\u3092\u62BC\u3057\u306A\u304C\u3089\u30AF\u30EA\u30C3\u30AF\u3059\u308B\u3068\u3001\u305D\u306E\u4F4D\u7F6E\u306B\u305D\u308C\u304C\u3072\u3068\u3064\u8FFD\u52A0\u3055\u308C\u307E\u3059\u3002
ChangeIcons = \u30A2\u30A4\u30B3\u30F3\u5909\u66F4
ChangeIconToolTip = \u30AF\u30EA\u30C3\u30AF\u3059\u308B\u3068\u3001\u30E9\u30D9\u30EB\u3001\u4FE1\u53F7\u3001\u30BB\u30F3\u30B5\u30FC\u306E\u30A2\u30A4\u30B3\u30F3\u3092\u5909\u66F4\u3067\u304D\u307E\u3059\u3002(whichever is checked at the right).
SensorIcon = \u30BB\u30F3\u30B5\u30FC\u30A2\u30A4\u30B3\u30F3
SensorBoxToolTip = \u30BB\u30F3\u30B5\u30FC\u30A2\u30A4\u30B3\u30F3\u3092\u9078\u629E\u3057\u305F\u72B6\u614B\u3067\u3001\u5E0C\u671B\u306E\u4F4D\u7F6E\u3067\u30B7\u30D5\u30C8\u30AD\u30FC\u3092\u62BC\u3057\u306A\u304C\u3089\u30AF\u30EA\u30C3\u30AF\u3059\u308B\u3068\u3001\u305D\u306E\u4F4D\u7F6E\u306B\u305D\u308C\u304C\u3072\u3068\u3064\u8FFD\u52A0\u3055\u308C\u307E\u3059\u3002
SensorIconToolTip = \u65B0\u898F\u30BB\u30F3\u30B5\u30FC\u30A2\u30A4\u30B3\u30F3\u306E\u540D\u79F0\u3092\u5165\u529B\u3057\u3066\u4E0B\u3055\u3044\u3002.
SignalIconToolTip = \u65B0\u898F\u4FE1\u53F7\u6A5F\u30A2\u30A4\u30B3\u30F3\u3067\u8868\u3055\u308C\u308B\u4FE1\u53F7\u6A5F\u306E\u540D\u79F0\u3092\u5165\u529B\u3057\u3066\u4E0B\u3055\u3044\u3002
SignalIcon = \u4FE1\u53F7\u6A5F\u30A2\u30A4\u30B3\u30F3
SignalBoxToolTip = \u4FE1\u53F7\u6A5F\u30A2\u30A4\u30B3\u30F3\u3092\u9078\u629E\u3057\u305F\u72B6\u614B\u3067\u3001\u5E0C\u671B\u306E\u4F4D\u7F6E\u3067\u30B7\u30D5\u30C8\u30AD\u30FC\u3092\u62BC\u3057\u306A\u304C\u3089\u30AF\u30EA\u30C3\u30AF\u3059\u308B\u3068\u3001\u305D\u306E\u4F4D\u7F6E\u306B\u305D\u308C\u304C\u3072\u3068\u3064\u8FFD\u52A0\u3055\u308C\u307E\u3059\u3002
IconLabel = \u30A2\u30A4\u30B3\u30F3\u30E9\u30D9\u30EB
IconLabelToolTip = \u30A2\u30A4\u30B3\u30F3\u30E9\u30D9\u30EB\u3092\u9078\u629E\u3057\u305F\u72B6\u614B\u3067\u3001\u5E0C\u671B\u306E\u4F4D\u7F6E\u3067\u30B7\u30D5\u30C8\u30AD\u30FC\u3092\u62BC\u3057\u306A\u304C\u3089\u30AF\u30EA\u30C3\u30AF\u3059\u308B\u3068\u3001\u305D\u306E\u4F4D\u7F6E\u306B\u305D\u308C\u304C\u3072\u3068\u3064\u8FFD\u52A0\u3055\u308C\u307E\u3059\u3002
Turnout = \u5206\u5C90
Type = \u30BF\u30A4\u30D7
Rotation = \u56DE\u8EE2\u89D2
Rotate = \u56DE\u8EE2
RotationToolTip = \u6642\u8A08\u65B9\u5411\u306E\u56DE\u8EE2\u89D2\u5EA6\u3092\u5165\u529B\u3057\u3066\u4E0B\u3055\u3044\u3002\uFF08\u5EA6\uFF09
Name = \u540D\u79F0
TurnoutNameToolTip = \u5206\u5C90\u70B9\u306E\u5B9F\u969B\u306E\u540D\u79F0\u3092\u5165\u529B\u3057\u3066\u4E0B\u3055\u3044\u3002
StateToolTip = \u672C\u7DDA\u306B\u3064\u306A\u304C\u308B\u65B9\u5411\u3092\u9078\u629E\u3057\u3066\u4E0B\u3055\u3044\u3002
ContinuingState = Continuing Route Turnout State
BlockID = \u30D6\u30ED\u30C3\u30AF: \u540D\u79F0
BlockIDToolTip = Enter name of block for new turnout, level crossing, or track segment.
OccupancySensor = \u5B58\u5728\u30BB\u30F3\u30B5\u30FC
OccupancySensorToolTip = Enter name of occupancy sensor for this block; no entry means don't change.
Track = \u30C8\u30E9\u30C3\u30AF
Location = \u4F4D\u7F6E
Nodes = \u30C8\u30E9\u30C3\u30AF\u30CE\u30FC\u30C9
EditIcon = \u30A2\u30A4\u30B3\u30F3\u5909\u66F4
EditSensorIcons = \u30BB\u30F3\u30B5\u30FC\u306E\u30A2\u30A4\u30B3\u30F3\u3092\u5909\u66F4\u3059\u308B
EditSignalIcons = \u4FE1\u53F7\u6A5F\u306E\u30A2\u30A4\u30B3\u30F3\u3092\u5909\u66F4\u3059\u308B
IconChangeInfo = \u65B0\u898F\u30D5\u30A1\u30A4\u30EB\u3092\u9078\u3073\u3001\u5909\u66F4\u3059\u308B\u30A2\u30A4\u30B3\u30F3\u3092\u62BC\u3057\u3066\u4E0B\u3055\u3044\u3002

# individual edit pane items
EditTurnout = \u5206\u5C90\u3092\u7DE8\u96C6\u3059\u308B
EditXing = \u30EC\u30D9\u30EB\u30AF\u30ED\u30C3\u30B7\u30F3\u30B0\u3092\u7DE8\u96C6
EditTrackSegment = \u30C8\u30E9\u30C3\u30AF\u30BB\u30B0\u30E1\u30F3\u30C8\u3092\u7DE8\u96C6\u3059\u308B
EditTurntable = \u30BF\u30FC\u30F3\u30C6\u30FC\u30D6\u30EB\u7DE8\u96C6
TurntableRadius = \u30BF\u30FC\u30F3\u30C6\u30FC\u30D6\u30EB\u306E\u89D2\u5EA6
TurntableRadiusHint = \u89D2\u5EA6\u5165\u529B (screen units) of turntable circle.
RayAngle = \u8A2D\u7F6E\u3059\u308B\u8DEF\u7DDA\u306E\u89D2\u5EA6
AddRayTrack = \u65B0\u305F\u306B\u8DEF\u7DDA\u3092\u6577\u304F
DeleteRayTrack = \u6577\u3044\u305F\u8DEF\u7DDA\u3092\u524A\u9664\u3059\u308B
RayAngleHint = \u6577\u304F\u3001\u307E\u305F\u306F\u524A\u9664\u3059\u308B\u8DEF\u7DDA\u306E\u89D2\u5EA6\u3092\u5165\u529B\u3057\u3066\u4E0B\u3055\u3044(12\u6642\u65B9\u5411 = 0\u5EA6, 3\u6642\u65B9\u5411 = 90\u5EA6\u306A\u3069)\u3002
AddRayTrackHint = Click to add a new ray track at the angle entered above.
DeleteRayTrackHint = Click to delete the ray track closest to the angle entered above.
EditTurnoutNameHint = Edit turnout name to change the physical turnout linked to this \u30D1\u30CD\u30EB turnout.
EditBlockNameHint = Edit block name to change the linked block. If new name, block will be created.
EditBlockBNameHint = Edit this block name to change the block linked to second connecting point.
EditBlockCNameHint = Edit this block name to change the block linked to third connecting point.
EditBlockDNameHint = Edit this block name to change the block linked to fourth connecting point.
Done = \u5B8C\u4E86
DoneHint = \u5B8C\u4E86\u30DC\u30BF\u30F3\u3092\u62BC\u3059\u3068\u3001\u3044\u307E\u307E\u3067\u306B\u884C\u3063\u305F\u5909\u66F4\u304C\u9069\u7528\u3055\u308C\u3001\u3053\u306E\u30C0\u30A4\u30E4\u30ED\u30B0\u304C\u9589\u3058\u307E\u3059\u3002
Cancel = \u53D6\u308A\u6D88\u3057
CancelHint = \u53D6\u308A\u6D88\u3057\u30DC\u30BF\u30F3\u3092\u62BC\u3059\u3068\u3001\u5909\u66F4\u3092\u53D6\u308A\u6D88\u3057\u3066\u3053\u306E\u30C0\u30A4\u30E4\u30ED\u30B0\u304C\u9589\u3058\u307E\u3059\u3002
EditBlock = \u30D6\u30ED\u30C3\u30AF\u4F5C\u6210\uFF0F\u7DE8\u96C6
EditBlock1 = \u30D6\u30ED\u30C3\u30AF\uFF11\u4F5C\u6210\uFF0F\u7DE8\u96C6
EditBlock2 = \u30D6\u30ED\u30C3\u30AF\uFF12\u4F5C\u6210\uFF0F\u7DE8\u96C6
EditBlock3 = \u30D6\u30ED\u30C3\u30AF\uFF13\u4F5C\u6210\uFF0F\u7DE8\u96C6
EditBlock4 = \u30D6\u30ED\u30C3\u30AF\uFF14\u4F5C\u6210\uFF0F\u7DE8\u96C6
EditBlockHint = \u3053\u3053\u3092\u30AF\u30EA\u30C3\u30AF\u3059\u308B\u3068\u3001\u4EE5\u4E0B\u306E\u30D6\u30ED\u30C3\u30AF\u306E\u60C5\u5831\u3092\u4F5C\u6210\uFF0F\u7DE8\u96C6\u3067\u304D\u307E\u3059\u3002
EditBlockBHint = \u3053\u3053\u3092\u30AF\u30EA\u30C3\u30AF\u3059\u308B\u3068\u3001\u4EE5\u4E0B\u306E\u30D6\u30ED\u30C3\u30AF\uFF12\u306E\u60C5\u5831\u3092\u4F5C\u6210\uFF0F\u7DE8\u96C6\u3067\u304D\u307E\u3059\u3002
EditBlockCHint = \u3053\u3053\u3092\u30AF\u30EA\u30C3\u30AF\u3059\u308B\u3068\u3001\u4EE5\u4E0B\u306E\u30D6\u30ED\u30C3\u30AF\uFF13\u306E\u60C5\u5831\u3092\u4F5C\u6210\uFF0F\u7DE8\u96C6\u3067\u304D\u307E\u3059\u3002
EditBlockDHint = \u3053\u3053\u3092\u30AF\u30EA\u30C3\u30AF\u3059\u308B\u3068\u3001\u4EE5\u4E0B\u306E\u30D6\u30ED\u30C3\u30AF\uFF14\u306E\u60C5\u5831\u3092\u4F5C\u6210\uFF0F\u7DE8\u96C6\u3067\u304D\u307E\u3059\u3002
UseCount = \u73FE\u5728\u306E\u4F7F\u7528\u30AB\u30A6\u30F3\u30C8
OccupiedSense = \u8ECA\u4E21\u5B58\u5728\u691C\u77E5
SensorActive = \u6709\u52B9
SensorInactive = \u7121\u52B9
OccupiedSenseHint = Select the occupancy sensor state when the block is occupied.
MemoryVariable = \u30E1\u30E2\u30EA\u30FC\u5909\u6570\u540D
MemoryVariableTip = \u30E1\u30E2\u30EA\u30FC\u5909\u6570\u306E\uFF08\u30B7\u30B9\u30C6\u30E0\u307E\u305F\u306F\u30E6\u30FC\u30B6\u30FC\uFF09\u540D\u3092\u5165\u529B\u3057\u3066\u4E0B\u3055\u3044\u3002(system or user) of Memory Variable (optional).
TrackColor = \u8DEF\u7DDA\u306E\u8272:
TrackColorHint = Select the track color when this block is unoccupied.
OccupiedColor = \u8ECA\u4E21\u5B58\u5728\u6642\u8DEF\u7DDA\u8272:
OccupiedColorHint = \u3053\u306E\u30D6\u30ED\u30C3\u30AF\u306B\u8ECA\u4E21\u304C\u5B58\u5728\u3059\u308B\u3068\u304D\u306E\u8DEF\u7DDA\u306E\u8272\u3092\u9078\u629E\u3057\u3066\u4E0B\u3055\u3044\u3002.
EnterTrackWidth = \u8DEF\u7DDA\u5E45\u5165\u529B
SideTrackWidth = \u5074\u7DDA\u306E\u5E45
SideTrackWidthHint = \u5074\u7DDA\u306E\u5E45\u3092\u5165\u529B\u3057\u3066\u4E0B\u3055\u3044\u3002(1\u304B\u308910\u306E\u7BC4\u56F2).
MainlineTrackWidth = \u672C\u7DDA\u306E\u5E45
MainlineTrackWidthHint = Enter width for mainline track (1 - 10 allowed).
ReporterName = \u30EC\u30DD\u30FC\u30BF\u30FC\u540D
ReporterNameHint = \u30EC\u30DD\u30FC\u30BF\u30FC\u540D\u3092\u5165\u529B(\u30B7\u30B9\u30C6\u30E0\u540D\u307E\u305F\u306F\u30E6\u30FC\u30B6\u30FC\u540D\uFF09\u3002
ReporterLocationX = \u4F4D\u7F6E: x
ReporterLocationXHint = Enter horizontal coordinate of upper left corner.
ReporterLocationY = , y
ReporterLocationYHint = Enter vertical coordinate of upper left corner.
AddNewLabel = \u65B0\u898F\u30E9\u30D9\u30EB\u3092\u8FFD\u52A0\u3059\u308B
ReporterDoneHint = Click to add new Reporter Icon as specified above.
HideTrack = Hide Track
HiddenToolTip = Check to hide this track segment when not in edit mode.
ScaleTrackDiagram = Scale/Translate Track Diagram
XFactorLabel = \u6C34\u5E73\u65B9\u5411(x)\u500D\u7387:
YFactorLabel = \u5782\u76F4\u65B9\u5411(y) \u500D\u7387:
FactorHint = Enter factor for expanding (greater than 1.0) or contracting (less than 1.0).
XTranslateLabel = Horizontal (x) Translation:
YTranslateLabel = Vertical (y) Translation:
XTranslateHint = Enter units to move (0 - don't move, negative - move left, positive - move right).
YTranslateHint = Enter units to move (0 - don't move, negative - move up, positive - move down).
Message1Label = Note: Translation occurs before scaling.
Message2Label = \u8B66\u544A: Scaling and translation cannot be undone.
ScaleTranslate = Scale/Translate
ScaleTranslateHint = Click here to translate and/or scale the track diagram.
TranslateSelection = Translate Selection
Message3Label = Only items within selection rectangle will be moved.
MoveSelection = \u9078\u629E\u3057\u3066\u79FB\u52D5
MoveSelectionHint = Click here to move items within the selection rectangle.
UndoTranslateSelection = \u9078\u629E\u3057\u305F\u3082\u306E\u306E\u79FB\u52D5\u3092\u53D6\u308A\u6D88\u3059

# help area items
Help1 = \u30C8\u30E9\u30C3\u30AF\u30BB\u30B0\u30E1\u30F3\u30C8\u4EE5\u5916\u306E\u30A2\u30A4\u30C6\u30E0\u3092\u8FFD\u52A0\u3059\u308B\u306B\u306F\u3001\u30A2\u30A4\u30C6\u30E0\u306E\u7A2E\u985E\u3092\u9078\u629E\u3057\u3001\u5FC5\u8981\u306A\u30C7\u30FC\u30BF\u3092\u5165\u529B\u3057\u305F\u5F8C\u306B\u3001\u30D1\u30CD\u30EB\u4E0A\u306E\u5E0C\u671B\u306E\u4F4D\u7F6E\u3067\u30B7\u30D5\u30C8\u30AD\u30FC\u3092\u62BC\u3057\u306A\u304C\u3089\u30AF\u30EA\u30C3\u30AF\u3057\u3066\u4E0B\u3055\u3044\u3002
Help2 = \u8DEF\u7DDA\u30BB\u30B0\u30E1\u30F3\u30C8\u3092\u8FFD\u52A0\u3059\u308B\u306B\u306F\u3001\u63A5\u7D9A\u70B9\u3067\u30B7\u30D5\u30C8\u30AD\u30FC\u3092\u62BC\u3057\u306A\u304C\u3089\u30AF\u30EA\u30C3\u30AF\u3057\u3066\u3001\u4ED6\u306E\u63A5\u7D9A\u70B9\uFF0F\u57FA\u6E96\u70B9\u307E\u3067\u30C9\u30E9\u30C3\u30B0\u3057\u3066\u4E0B\u3055\u3044\u3002
Help3 = \u4F55\u304B\u3092\u79FB\u52D5\u3059\u308B\u3068\u304D\u306F\u3001\u30B7\u30D5\u30C8\u30AD\u30FC\u3092\u62BC\u3057\u306A\u304C\u3089\u305D\u308C\u306E\u4E2D\u5FC3\u90E8\u3092\u30C9\u30E9\u30C3\u30B0\u3057\u3066\u4E0B\u3055\u3044\u3002 \u30A2\u30A4\u30C6\u30E0\u306E\u30DD\u30C3\u30D7\u30A2\u30C3\u30D7\u30E1\u30CB\u30E5\u30FC\u3092\u8868\u793A\u3055\u305B\u308B\u306B\u306F\u3001ALT\u30AD\u30FC\u3092\u62BC\u3057\u306A\u304C\u3089\u5DE6\u30AF\u30EA\u30C3\u30AF\u3057\u3066\u4E0B\u3055\u3044\u3002
Help3Mac = \u30A2\u30A4\u30C6\u30E0\u3092\u79FB\u52D5\u3059\u308B\u3068\u304D\u306F\u3001\u30B3\u30DE\u30F3\u30C9\u30AD\u30FC\u3092\u62BC\u3057\u306A\u304C\u3089\u30C9\u30E9\u30C3\u30B0\u3057\u3066\u4E0B\u3055\u3044\u3002\u30DD\u30C3\u30D7\u30A2\u30C3\u30D7\u30E1\u30CB\u30E5\u30FC\u3092\u8868\u793A\u3055\u305B\u308B\u306B\u306F\u3001\u30A2\u30A4\u30C6\u30E0\u4E0A\u3067\u30B3\u30F3\u30C8\u30ED\u30FC\u30EB\u30AD\u30FC\u3092\u62BC\u3057\u306A\u304C\u3089\u5DE6\u30AF\u30EA\u30C3\u30AF\u3092\u62BC\u3057\u3066\u4E0B\u3055\u3044\u3002
Help3Win = To move an item, drag it with the right mouse button. To show its popup menu, right-click on it.

# popup menu items
ToolTipGeneric = \u30AA\u30EB\u30BF\u30CD\u30FC\u30C8\u30AD\u30FC\uFF08Alt\uFF09\u3092\u62BC\u3057\u306A\u304C\u3089\u30AF\u30EA\u30C3\u30AF\u3059\u308B\u3068\u30E1\u30CB\u30E5\u30FC\u304C\u8868\u793A\u3055\u308C\u307E\u3059\u3002\u30E1\u30BF\u30AD\u30FC\u3092\u62BC\u3057\u306A\u304C\u3089\u30C9\u30E9\u30C3\u30B0\u3059\u308B\u3068\u79FB\u52D5\u3057\u307E\u3059\u3002
ToolTipGenericMac = Control-click to see menu, drag with command key down to move.
ToolTipGenericWin = \u53F3\u30AF\u30EA\u30C3\u30AF\u3067\u30E1\u30CB\u30E5\u30FC\u304C\u8868\u793A\u3055\u308C\u307E\u3059\u3002\u53F3\u30DC\u30BF\u30F3\u3092\u62BC\u3057\u306A\u304C\u3089\u30C9\u30E9\u30C3\u30B0\u3059\u308B\u3068\u30A2\u30A4\u30C6\u30E0\u3092\u79FB\u52D5\u3055\u305B\u308B\u3053\u3068\u304C\u3067\u304D\u307E\u3059\u3002
NoBlock = No Block Set
NoBlock1 = Block 1 Not Set
NoBlock2 = Block 2 Not Set
NoTurnout = \u5206\u5C90\u8A2D\u5B9A\u7121\u3057
NotConnected = <\u63A5\u7D9A\u7121\u3057>
EnterRotation = \u56DE\u8EE2\u89D2\u5EA6\u5165\u529B ( \u6642\u8A08\u56DE\u308A\u306E\u89D2\u5EA6 )
Block1ID = \u30D6\u30ED\u30C3\u30AF 1
Block2ID = \u30D6\u30ED\u30C3\u30AF 2
Block3ID = \u30D6\u30ED\u30C3\u30AF 3
Block4ID = \u30D6\u30ED\u30C3\u30AF 4
UseSizeAsDefault = \u898F\u5B9A\u306E\u5927\u304D\u3055
Remove = \u9664\u53BB
SetSignals = \u4FE1\u53F7\u6A5F\u306E\u30BB\u30C3\u30C8...
Edit = \u7DE8\u96C6...
RHTurnout = \u53F3\u5074\u5206\u5C90
LHTurnout = \u5DE6\u5074\u5206\u5C90
XOverTurnout = \u30C0\u30D6\u30EB\u30AF\u30ED\u30B9\u30AA\u30FC\u30D0\u30FC
RHXOverTurnout = \u53F3\u5074\u30AF\u30ED\u30B9\u30AA\u30FC\u30D0\u30FC
LHXOverTurnout = \u5DE6\u5074\u30AF\u30ED\u30B9\u30AA\u30FC\u30D0\u30FC
WYETurnout = \u4E21\u5074\u5206\u5C90
LevelCrossing = \u30EC\u30D9\u30EB\u30AF\u30ED\u30C3\u30B7\u30F3\u30B0
Anchor = \u57FA\u6E96\u70B9
EndBumper = \u7DDA\u8DEF\u306E\u7D42\u7AEF
BlockDivider = \u30D6\u30ED\u30C3\u30AF\u30C7\u30A3\u30D0\u30A4\u30C0
Mainline = \u672C\u7DDA
NotMainline = \u652F\u7DDA
Hidden = \u96A0\u3059
NotHidden = \u96A0\u3055\u306A\u3044
Disabled = \u4E0D\u80FD
Momentary = \u4E00\u6642
Unknown = <\u4E0D\u660E>
Inconsistent = <\u30A4\u30F3\u30B3\u30F3\u30B7\u30B9\u30C6\u30F3\u30C8>
FontSize = \u30D5\u30A9\u30F3\u30C8\u30B5\u30A4\u30BA
FontStyle = \u30D5\u30A9\u30F3\u30C8\u30B9\u30BF\u30A4\u30EB
FontColor = \u30D5\u30A9\u30F3\u30C8\u306E\u8272
Italic = \u659C\u4F53
Bold = \u5F37\u8ABF
Tooltip = \u30C4\u30FC\u30EB\u30C1\u30C3\u30D7
Fixed = \u56FA\u5B9A
Tristate = \u30C8\u30E9\u30A4\u30B9\u30C6\u30FC\u30C8
WhenClicked = \u30AF\u30EA\u30C3\u30AF\u3055\u308C\u305F\u3068\u304D
ChangeAspect = \u30A2\u30B9\u30DA\u30AF\u30C8\u3092\u5909\u66F4
AlternateLit = \u8F1D\u5EA6\u5909\u66F4
AlternateHeld = alternate held
WhenNotLit = \u6D88\u706F\u6642
ShowAppearance = \u30A2\u30D4\u30A2\u30E9\u30F3\u30B9\u3092\u8868\u793A
ShowDarkIcon = \u6697\u3044\u30A2\u30A4\u30B3\u30F3\u3092\u8868\u793A
EditLogic = \u8AD6\u7406\u7DE8\u96C6
SignalLogicFor = Signal Logic for
Turntable = \u30BF\u30FC\u30F3\u30C6\u30FC\u30D6\u30EB

# coordinate edit items
EnterXTooltip = Enter new x coordinate
EnterYTooltip = Enter new y coordinate
Set = \u30BB\u30C3\u30C8
SetXY = X\u3068Y\u3092\u8A2D\u5B9A
SetButtonToolTip = Press to change x and y coordinates
CancelButtonToolTip = \u5909\u66F4\u3092\u53D6\u308A\u6D88\u3057\u307E\u3059

# option menu items
Options = \u30AA\u30D7\u30B7\u30E7\u30F3
EditMode = \u7DE8\u96C6\u30E2\u30FC\u30C9
AllowRepositioning = \u4F4D\u7F6E\u306E\u5909\u66F4\u3092\u8A31\u53EF\u3059\u308B
AllowLayoutControl = \u30EC\u30A4\u30A2\u30A6\u30C8\u30B3\u30F3\u30C8\u30ED\u30FC\u30EB\u3092\u8A31\u53EF
AllowTurnoutAnimation = \u8EE2\u8F4D\u52D5\u4F5C\u30A2\u30CB\u30E1\u30FC\u30B7\u30E7\u30F3
ShowEditHelp = \u7DE8\u96C6\u30E2\u30FC\u30C9\u6642\u30D8\u30EB\u30D7\u30D0\u30FC\u8868\u793A
ShowEditGrid = \u7DE8\u96C6\u30E2\u30FC\u30C9\u6642\u7F6B\u7DDA\u8868\u793A
SnapToGridOnAdd = \u7F6B\u7DDA\u306B\u5408\u308F\u305B\u3066\u8FFD\u52A0
SnapToGridOnMove = \u7F6B\u7DDA\u306B\u5408\u308F\u305B\u3066\u79FB\u52D5
ScrollBarsSubMenu   = \u30B9\u30AF\u30ED\u30FC\u30EB\u30D0\u30FC\u306E\u8868\u793A\u306E\u6709\u7121
ScrollNone          = \u30B9\u30AF\u30ED\u30FC\u30EB\u30D0\u30FC\u7121\u3057
ScrollBoth          = \u30B9\u30AF\u30ED\u30FC\u30EB\u30D0\u30FC\u3042\u308A
ScrollHorizontal    = \u6C34\u5E73\u306E\u307F
ScrollVertical      = \u5782\u76F4\u306E\u307F
AntialiasingOn = \u30A2\u30F3\u30C1\u30A8\u30A4\u30EA\u30A2\u30B9\u6709\u52B9 (\u5E73\u6ED1\u5316)
NewTitle = \u65B0\u898F\u30BF\u30A4\u30C8\u30EB
AddBackground = \u80CC\u666F\u30A4\u30E1\u30FC\u30B8\u8FFD\u52A0
AddTurntable = \u8EE2\u8ECA\u53F0\u8FFD\u52A0
AddReporter = \u30EC\u30DD\u30FC\u30BF\u30FC\u30E9\u30D9\u30EB\u3092\u8FFD\u52A0
EnterTitle = \u65B0\u898F\u30BF\u30A4\u30C8\u30EB\u3092\u5165\u529B
SetTrackWidth = \u8DEF\u7DDA\u5E45\u3092\u8A2D\u5B9A
SetLocation = \u4F4D\u7F6E\u3068\u5927\u304D\u3055\u3092\u4FDD\u5B58\u3059\u308B
AddFastClock = \u30D5\u30A1\u30B9\u30C8\u30AF\u30ED\u30C3\u30AF\u3092\u8FFD\u52A0
DefaultTrackColor = \u7DDA\u8DEF\u8272\u898F\u5B9A\u5024\u3092\u8A2D\u5B9A\u3059\u308B

# items specific to Layout Editor tools 
ResetTurnoutSize = \u5206\u5C90\u5668\u306E\u30B5\u30A4\u30BA\u3092\u898F\u5B9A\u5024\u306B\u3059\u308B
SkipInternalTurnout = \u4FE1\u53F7\u6A5F\u306E\u306A\u3044\u5185\u90E8\u5206\u5C90\u3092\u30B9\u30AD\u30C3\u30D7\u3059\u308B
SignalsAtTurnout = \u5206\u5C90\u306B\u4ED8\u5C5E\u3059\u308B\u4FE1\u53F7\u6A5F\u306E\u8A2D\u5B9A
SignalsAtBoundary = \u30D6\u30ED\u30C3\u30AF\u5883\u754C\u306E\u4FE1\u53F7\u6A5F\u306E\u8A2D\u5B9A
SignalsAtXoverTurnout = \u30AF\u30ED\u30B9\u30AA\u30FC\u30D0\u30FC\u306E\u4FE1\u53F7\u6A5F\u3092\u8A2D\u5B9A
SignalsAtLevelXing = \u30EC\u30D9\u30EB\u533A\u516D\u5BDD\u5177\u306E\u4FE1\u53F7\u6A5F\u3092\u8A2D\u5B9A
SignalsAtTToTTurnout = Set Signals at Throat-to-Throat Turnouts
SignalsAt3WayTurnout = \uFF13\u65B9\u5206\u5C90\u30DD\u30A4\u30F3\u30C8\u306E\u4FE1\u53F7\u6A5F\u8A2D\u7F6E
TurnoutAName = \u5206\u5C90\uFF21\u306E\u540D\u524D(throat\u306B\u6700\u3082\u8FD1\u3044)
TurnoutBName = \u5206\u5C90\uFF22\u306E\u540D\u524D(throat\u304B\u3089\u6700\u3082\u9060\u3044)
BlockAtA = \u30D6\u30ED\u30C3\u30AF 1
BlockAtC = \u30D6\u30ED\u30C3\u30AF 2
SignalsTurnoutNameHint = Enter name (system or user) of turnout where signals are needed.
SignalsBlockNameHint = Enter name of one block where signals are needed at block boundary.
SignalHeads = \u4FE1\u53F7\u6A5F
GetSaved = \u4FDD\u5B58\u3055\u308C\u307E\u3057\u305F
GetSavedHint = Click to retrieve signal heads previously stored.
ThroatContinuing = Throat - Continuing
ThroatDiverging = Throat - Diverging
Continuing = Continuing
ContinuingTrack = continuing track
Diverging = Diverging
DivergingA = Diverging A
DivergingB = Diverging B
DivergingTrack = diverging track
SignalLocated = Signal located at 
ProtectsTurnout = \u5206\u5C90\u5668\u3092\u56FA\u5B9A\u3059\u308B
OrBoth = (\u307E\u305F\u306F\u4E21\u65B9\u306E\u5206\u5C90
Throat = \u53CD\u4F4D
Tracks) = tracks)
EnterXOverTurnout = \u30AF\u30ED\u30B9\u30AA\u30FC\u30D0\u30FC\u5206\u5C90\u306E\u540D\u79F0\u3092\u5165\u529B\u3057\u3066\u4E0B\u3055\u3044:
AContinuing = A\u30B3\u30FC\u30CA\u30FC - \u7D99\u7D9A
ADiverging = A \u30B3\u30FC\u30CA\u30FC - \u5206\u96E2
BContinuing = B \u30B3\u30FC\u30CA\u30FC - \u7D99\u7D9A
BDiverging = B \u30B3\u30FC\u30CA\u30FC - \u5206\u96E2
CContinuing = C \u30B3\u30FC\u30CA\u30FC - \u7D99\u7D9A
CDiverging = C \u30B3\u30FC\u30CA\u30FC - \u5206\u96E2
DContinuing = D \u30B3\u30FC\u30CA\u30FC - \u7D99\u7D9A
DDiverging = D \u30B3\u30FC\u30CA\u30FC - \u5206\u96E2
ATrack = A \u63A5\u7D9A\u70B9
BTrack = B \u63A5\u7D9A\u70B9
CTrack = C \u63A5\u7D9A\u70B9
DTrack = D \u63A5\u7D9A\u70B9
PlaceHead = \u30D1\u30CD\u30EB\u306B\u4FE1\u53F7\u6A5F\u30A2\u30A4\u30B3\u30F3\u3092\u8FFD\u52A0
PlaceHeadHint = Check to place icon for above signal head on panel near turnout.
AnchorPlaceHeadHint = Check to place icon for above signal head on panel near anchor point.
SetLogic = \u30BB\u30C3\u30C8\u30A2\u30C3\u30D7\u30ED\u30B8\u30C3\u30AF
East/SouthBound = \u6771(\u307E\u305F\u306F\u5357)\u5883\u754C
West/NorthBound = \u897F(\u307E\u305F\u306F\u5317)\u5883\u754C
SetLogicHint = \u4E0A\u8A18\u306E\u4FE1\u53F7\u6A5F\u306E\u5358\u7D14\u4FE1\u53F7\u8AD6\u7406\u3092\u8A2D\u5B9A\u3057\u307E\u3059\u3002
ChangeSignalIcon = \u30B7\u30B0\u30CA\u30EB\u30A2\u30A4\u30B3\u30F3\u5909\u66F4
ChangeSignalIconHint = Click to change icons used to represent signal heads. (\u5DE6\u5411\u304D\u306E\u30A2\u30A4\u30B3\u30F3\u3092\u4F7F\u7528\u3057\u3066\u4E0B\u3055\u3044\u3002)
SignalHeadNameHint = Enter name (system or user) of signal head located here.
SignalHeadEastNameHint = Enter name (system or user) of signal head for right-bound (east) or down-bound (south) trains.
SignalHeadWestNameHint = Enter name (system or user) of signal head for left-bound (west) or up-bound (north) trains.
SignalDoneHint = \u5B8C\u4E86\u3092\u30AF\u30EA\u30C3\u30AF\u3057\u3066\u4EE5\u4E0A\u306E\u51E6\u7406\u3092\u7D42\u4E86\u3057\u3001\u30C0\u30A4\u30A2\u30ED\u30B0\u3092\u9589\u3058\u307E\u3059\u3002
SignalsError1 = \u30A8\u30E9\u30FC - No turnout name was entered. Please enter a turnout name or cancel.
SignalsError2 = \u30A8\u30E9\u30FC - No turnout is defined for "{0}". Please enter \na turnout name in the Turnout Table and on the panel.
SignalsError3 = \u30A8\u30E9\u30FC - Turnout "{0}" is not drawn on the panel.\nPlease enter the name of a drawn turnout.
SignalsError4 = \u30A8\u30E9\u30FC - Signal head "{0}" does not exist. Please correct name\nor enter this Signal Head in the Signal Table, and try again.
SignalsError5 = \u30A8\u30E9\u30FC - Signal head name was not entered. Please enter\na signal head name for required positions or cancel.
SignalsError6 = \u30A8\u30E9\u30FC - Cannot place signal head "{0}" on the panel\nbecause it is already on the panel.
SignalsError7 = \u30A8\u30E9\u30FC - The two blocks entered do not join at an anchor point.\nPlease enter the correct blocks and try again.
SignalsError8 = \u30A8\u30E9\u30FC - Cannot assign signal head "{0}" to this turnout\nbecause it is already on the panel at a different place.
SignalsError9 = \u30A8\u30E9\u30FC - Block name was not entered. Please\nenter the name of a block on the panel.
SignalsError10 = \u30A8\u30E9\u30FC - Block "{0}" does not exist. Please correct name\nor assign this block to track on the panel.
SignalsError11 = \u30A8\u30E9\u30FC - Block "{0}" exists, but is not\nassigned to track on this panel.
SignalsError12 = \u30A8\u30E9\u30FC - No signal heads entered.\nPlease enter signal heads or cancel.
SignalsError13 = \u30A8\u30E9\u30FC - Cannot assign signal head "{0}" to this block boundary\nbecause it is already on the panel at a different place.
SignalsError14 = \u30A8\u30E9\u30FC - This tool requires signal heads be entered as pairs, A and C,\nand/or B and D. You entered only one head of a pair.
SignalsError15 = \u30A8\u30E9\u30FC - There are no level crossings on your panel.\nPlease add a level crossing or cancel.
SignalsError16 = \u30A8\u30E9\u30FC - The entered block names match "{0}" level crossings.\nPlease enter block names that match only one level crossing.
SignalsError17 = \u30A8\u30E9\u30FC - No level crossing matches the block(s)\nentered. Please try again or cancel.
SignalsError18 = \u30A8\u30E9\u30FC - This tool requires two turnouts (RH, LH, or WYE) \nconnected throat-to-throat by a single track segment.
SignalsError19 = \u30A8\u30E9\u30FC - This tool requires two turnouts (RH or LH) connected, \nas specified, by a short track segment. Cannot find these.
InfoMessage1 = \u3053\u306E\u30C4\u30FC\u30EB\u3067\u306F\u30AF\u30ED\u30B9\u30AA\u30FC\u30D0\u30FC\u5206\u5C90\u306F\u4F7F\u7528\u3067\u304D\u307E\u305B\u3093\u3002
InfoMessage2 = \u305D\u306E\u5206\u5C90\u70B9\u306B\u306F\u4FE1\u53F7\u6A5F\u3092\u8A2D\u7F6E\u3067\u304D\u307E\u305B\u3093\u3002\n\u5782\u76F4\u304B\u6C34\u5E73\u306B\u7F6E\u304B\u308C\u305F\u5206\u5C90\u70B9\u306B\u3057\u304B\u4FE1\u53F7\u6A5F\u306F\u8A2D\u7F6E\u3067\u304D\u307E\u305B\u3093\u3002
InfoMessage3 = Sorry, cannot place signal heads at anchor points\nwhere track is not oriented vertical or horizontal.
InfoMessage4 = Cannot set up logic because block "{0}"\ndoesn''t have an occupancy sensor.
InfoMessage5 = Cannot set up logic because the next signal (in or \nat the end of block "{0}") apparently is not yet defined.
InfoMessage6 = Cannot set up logic because blocks have\nnot been defined around this item.
InfoMessage7 = Cannot set up logic because all connections\nhave not been defined around this item.
InfoMessage8 = Sorry, Set Signals at Crossover does\nnot work with other types of turnouts.
InfoMessage9 = Sorry, Layout Editor does not support setting up \nlogic for a single head at the throat of a 3-way turnout.
SignalsWarn1 = Warning - Logic was set up at signal head "{0}", but no sensors\nto protect for cross traffic at the level crossing were found.
SignalsWarn2 = Warning - Per your instructions, the absense of signals at turnout "{0}" \nwas ignored when setting up logic for signal head "{1}".
# reminder messages
ReminderTitle = \u899A\u3048\u66F8\u304D
Reminder1 = \u3053\u306E\u30D1\u30CD\u30EB\u306F\u5909\u66F4\u3055\u308C\u307E\u3057\u305F.
Reminder2 = \u3042\u3068\u3067\u30C7\u30A3\u30B9\u30AF\u306B\u4FDD\u5B58\u3059\u308B\u3053\u3068\u3092\u5FD8\u308C\u306A\u3044\u3067\u4E0B\u3055\u3044\u3002
Reminder3 = ( Select 'Store panels...' in the Panels menu or the File menu of any panel.)

# error messages
Error = \u30A8\u30E9\u30FC
EntryError = Error in entry
ErrorEnterLocoID = \u5165\u529B\u30A8\u30E9\u30FC - Loco ID required.
TryAgain = \u518D\u5EA6\u5165\u529B\u307E\u305F\u306F\u30AD\u30E3\u30F3\u30BB\u30EB
Error1 = \u30A8\u30E9\u30FC - Cannot create or edit a block without a name.\nPlease enter a block name and try again.
Error2 = \u30A8\u30E9\u30FC - Entered value "{0}" is not in the allowed range.\nPlease enter a number from 1 to 10.
Error2a = \u30A8\u30E9\u30FC - Entered value "{0}" is not in the allowed range.
Error3 = \u305D\u306E\u56DE\u8EE2\u89D2\u5EA6\u306F\u4E0D\u6B63\u3067\u3059:
Error4 = \u30A8\u30E9\u30FC - Physical turnout "{0}" is already linked to a different Panel Turnout.\nPlease enter another turnout name and try again.
Error5 = \u30A8\u30E9\u30FC - You are currently editing this "{0}".\nOnly one editor may be open a the same time.\nPlease cancel or complete that edit and try again.
Error6 = \u30A8\u30E9\u30FC - Sensor "{0}" is already assigned as the occupancy sensor \n of Block "{1}". Please check which is correct before continuing.
Error7 = \u30A8\u30E9\u30FC - Cannot assign occupancy sensor because there\nis no sensor defined for "{0}".\nPlease enter sensor via the Sensor Table and try again.
Error8 = \u30A8\u30E9\u30FC - Cannot assign turnout because there\nis no turnout defined for "{0}".\nPlease enter turnout via the Turnout Table and try again.
Error9 = \u30A8\u30E9\u30FC - Cannot create a signal icon because there is no signal head\ndefined for - "{0}". Please enter the name of a Signal Head in\nthe Signal Table and try again.
Error10 = \u30A8\u30E9\u30FC - Cannot create a sensor icon because no name is entered in the\nSensor Icon field. Please enter the name of a sensor and try again.
Error11 = \u30A8\u30E9\u30FC - Cannot create a memory label because no name is entered in the\nMemory Label field. Please enter the name of a memory variable and try again.
Error12 = \u30A8\u30E9\u30FC - Cannot translate selection because no selection has been made.\nPlease select by dragging with the mouse and try again.
Error13 = \u30A8\u30E9\u30FC - Cannot delete a ray track because none are within 30 degrees of the\nentered angle. Please try again with a more precise angle entry.
Error14 = \u30A8\u30E9\u30FC - Required throat-to-throat arrangement not found. Please set up as two turnouts connected throat-to-throat by a single track segment.
Error15 = \u30A8\u30E9\u30FC - Cannot proceed because there is no turnout is assigned to one or more of the turnout diagrams. Please assign turnout(s) and try again.
Error16 = \u30A8\u30E9\u30FC - Cannot attach Memory to Block because no memory is defined for "{0}. Please enter a Memory defined in the Memory Table and try again.
Error17 = \u30A8\u30E9\u30FC - Reporter manager not available. Cannot add Reporter Icon.
Error18 = \u30A8\u30E9\u30FC - Could not provide Reporter {0}. \u30EC\u30DD\u30FC\u30BF\u30FC\u30A2\u30A4\u30B3\u30F3\u306F\u8FFD\u52A0\u3055\u308C\u307E\u305B\u3093\u3002
# question messages
ButtonNo = \u3044\u3044\u3048
ButtonYes = \u306F\u3044
ButtonYesPlus = \u306F\u3044 - \u8B66\u544A\u505C\u6B62
ButtonOK = \u78BA\u8A8D
ButtonOKPlus = \u78BA\u8A8D - \u8B66\u544A\u3092\u505C\u6B62
WarningTitle = \u8B66\u544A
Question1 = \u672C\u5F53\u306B\u3053\u306E\u5206\u5C90\u3092\u30D1\u30CD\u30EB\u304B\u3089\u524A\u9664\u3057\u307E\u3059\u304B turnout from the panel, along with any connected Track Segments?
Question2 = \u672C\u5F53\u306B\u3053\u306E\u70B9\u3092\u30D1\u30CD\u30EB\u304B\u3089\u524A\u9664\u3057\u307E\u3059\u304Bpoint from the panel, along with any connected Track Segments?
Question3 = \u672C\u5F53\u306B\u3053\u306E\u30EC\u30D9\u30EB\u3092\u30D1\u30CD\u30EB\u304B\u3089\u524A\u9664\u3057\u307E\u3059\u304Blevel crossing from the panel, along with any connected Track Segments?
Question4 = \u672C\u5F53\u306B\u3053\u306E\u30BF\u30FC\u30F3\u30C6\u30FC\u30D6\u30EB\u3092\u3001\u63A5\u7D9A\u3055\u308C\u305F\u30C8\u30E9\u30C3\u30AF\u30BB\u30B0\u30E1\u30F3\u30C8\u3054\u3068\u30D1\u30CD\u30EB\u304B\u3089\u524A\u9664\u3057\u3066\u3082\u826F\u3044\u3067\u3059\u304B\uFF1F
Warn1 = \u8B66\u544A - Connectivities for block "{0}" in panels "{1}" and "{2}" are not compatible.
Warn2 = Bean Settings needed for Block operation could not be created. Check that all turnouts have been assigned.

# rename panel error messages
CanNotRename = \u30D1\u30CD\u30EB\u306E\u540D\u524D\u3092\u3001\u65E2\u306B\u5B58\u5728\u3059\u308B\u30D1\u30CD\u30EB\u3068\u540C\u3058\u540D\u524D\u306B\u5909\u66F4\u3059\u308B\u4E8B\u306F\u3067\u304D\u307E\u305B\u3093\u3002
PanelExist = \u540C\u4E00\u540D\u79F0\u306E\u30D1\u30CD\u30EB\u304C\u65E2\u306B\u5B58\u5728\u3057\u307E\u3059\uFF01
