# LayoutEditorBundle_de.properties
#
# German properties for jmrit.display.LayoutEditor and associated modules
# Translation by Egbert Broerse

#Title  = Zeichentafel

# menu items
#MenuPanels    = Gleisbilder
#MenuTools     = Werkzeuge
MenuDispatcher = Leitstelle
MenuItemOpen  = \u00d6ffne
MenuItemNewTrain = Erstelle neue Lok
#MenuZoom      = Zoom

NoZoom        = Kein Zoom
ZoomIn = Zoom In
ZoomOut = Zoom Out
NoZoomMnemonic = N
zoomInMnemonic = I
zoomOutMnemonic = O
zoomOutAccelerator = SUBTRACT
zoomInAccelerator = ADD

MenuDispatcherMnemonic = D
MenuPanelsMnemonic = P
MenuEditMnemonic = B
MenuFileMnemonic = A
MenuToolsMnemonic = W
MenuZoomMnemonic = Z
MenuItemOpenMnemonic = O
BeanNameLayoutBlock=Anlageblock
Active=Aktives Pfad
Memory=Speicheranschrift
MemoryBoxToolTip=Selektiere um ein {0} hinzu zu f\u00fcgen beim n\u00e4chsten Klick mit Shift gedr\u00fcckt.
SignalIcon=Signalschirm
Valid=G\u00fcltig
RightHandAbbreviation=Rechts
LeftHandAbbreviation=Links
DoubleCrossOver=Doppelgleiswechsel
RHCrossOverToolTip=W\u00e4hle um mit Shift Taste gedr\u00fcckt eine Gleiswechsel Rechts auf die Tafel zu legen.
LHCrossOverToolTip=W\u00e4hle um mit Shift Taste gedr\u00fcckt eine Gleiswechsel Links auf die Tafel zu legen.
Type=Typ:
Tristate=Dreiweg
WYETurnout=Symm.Weiche
LayoutDoubleSlip=Doppelkreuzungsweiche
LayoutSingleSlip=Kreuzungsweiche
LevelCrossing=Kreuzung
WYEAbbreviation=Symmetrisch
Track=Gleis
Nodes=Gleisknoten
EditIcon=\u00c4ndere Sinnbild
ChangeTo=\u00c4ndere nach
Line=Linie
RHToolTip=W\u00e4hle um mit Shift Taste gedr\u00fcckt eine Weiche Rechts auf die Tafel zu legen.
LHToolTip=W\u00e4hle um mit Shift Taste gedr\u00fcckt eine Weiche Links auf die Tafel zu legen.
WYEToolTip=W\u00e4hle um mit Shift Taste gedr\u00fcckt eine symmetrische (Y) Weiche auf die Tafel zu legen.
DoubleCrossOverToolTip=W\u00e4hle um mit Shift Taste gedr\u00fcckt eine Doppelgleiswechsel auf die Tafel zu legen.
Dashed=Gestrichelt
DashedCheckBoxTip=Definiert Linienstil - selektiere f\u00fcr gestrichelte Linie, deselektiere f\u00fcr durchgezogene Linie.
MainlineBox=Hauptstrecke
MainlineCheckBoxTip=Definiert Gleistyp - selektiere f\u00fcr Hauptstrecke, deselektiere f\u00fcr Nebenstrecke.
Solid=Durchgezogen
Style=Stil
EdgeConnector=Gleisanschluss
Labels=Anschrift
Rotation=Drehung:
Rotate=Drehe
RotationToolTip=Gebe Winkel ein (in Grad rechtsherum) f\u00fcr Weichensinnbild.
LevelCrossingToolTip=W\u00e4hle um mit Shift Taste gedr\u00fcckt eine Kreuzung auf die Tafel zu legen.
SingleSlipToolTip=W\u00e4hle um mit Shift Taste gedr\u00fcckt eine Kreuzungsweiche auf die Tafel zu legen.
DoubleSlipToolTip=W\u00e4hle um mit Shift Taste gedr\u00fcckt eine Doppelkreuzungsweiche auf die Tafel zu legen.
TrackSegment=Gleisstrecke
TrackSegmentToolTip=W\u00e4hle um ein Gleisstrecke auf die Tafel zu zeichnen durch Schleppen mit Shift Taste gedr\u00fcckt.
DashedToolTip=W\u00e4hle Linienstil f\u00fcr Gleise.
MainlineToolTip=Selektiere wenn Gleis eine Hauptbahnstrecke bildet, deselektiere f\u00fcr Nebenstrecke.
EndBumper=Prellblock
EndBumperToolTip=W\u00e4hle um mit Shift Taste gedr\u00fcckt ein Prellblock auf die Tafel zu legen.
EdgeConnectorToolTip=W\u00e4hle um mit Shift Taste gedr\u00fcckt ein Gleisanschluss zum n\u00e4chstem Gleisstellbild zu erstellen.
AnchorToolTip=W\u00e4hle um mit Shift Taste gedr\u00fcckt einen Verankerungspunkt auf die Tafel zu legen.
TextLabelToolTip=W\u00e4hle um mit Shift Taste gedr\u00fcckt ein Anschrift mit dem eingegeben Text auf die Tafel zu legen.
TextToolTip=Gebe den Text f\u00fcr Anschrift ein.
MemoryToolTip=Gebe den Namen des Speichervariables ein welche als Anschrift in der Tafel gezeigt werden soll.
BlockContentsBoxToolTip=W\u00e4hle um mit Shift Taste gedr\u00fcckt eine Blockanschrift auf die Tafel zu legen.
BlockContentsToolTip=Gebe den Namen des Blockvariables ein welche als Anschrift in der Tafel gezeigt werden soll.
Connected=Verbunden mit
CreateEdit=Erstelle/Bearbeite
MultiSensorToolTip=W\u00e4hle um mit Shift Taste gedr\u00fcckt ein MultiDetektorsinnbild auf die Tafel zu legen.
ChangeIcons=Sinnbilder \u00e4ndern
SignalMastIcon=Signalmast
ChangeIconToolTip=Klicke um Sinnbilder zu \u00e4ndern f\u00fcr Detektoren, Signalmasten oder Anschrifte (abh. Auswahl rechts).
SensorIcon=Detektorsinnbild
SensorBoxToolTip=W\u00e4hle um mit Shift Taste gedr\u00fcckt eine Detektorsinnbild auf die Tafel zu legen.
EditTurnout=Bearbeite Weiche
EditXing=Bearbeite Kreuzung
Location=Position
SignalMastBoxToolTip=W\u00e4hle um mit Shift Taste gedr\u00fcckt ein Signalmastsinnbild auf die Tafel zu legen.
SignalBoxToolTip=W\u00e4hle um mit Shift Taste gedr\u00fcckt ein Signalschirmsinnbild auf die Tafel zu legen.
SensorIconToolTip=Gebe Namen des Detektors f\u00fcr neues Sinnbild ein.
SignalIconToolTip=Gebe Namen des Signalschirms f\u00fcr neues Sinnbild ein.
IconLabel=Sinnbildanschrift
IconLabelToolTip=W\u00e4hle um mit Shift Taste gedr\u00fcckt ein universelles Sinnbild auf die Tafel zu legen.
EditSlip=Bearbeite Kreuzungsweiche
ThrowTwoTurnouts=
SupportingTurnout=
OccupancySensorUseGlobal=
OccupancySensorToolTip=Gebe Namen ein f\u00fcr den Besetztmeldedetektor dieses Blockes; keine Eingabe l\u00e4sst den Wert unge\u00e4ndert.
OccupancySensorDebounceInActiveToolTip=
OccupancySensorDebounceActive=
Slip=Kreuzungsweiche
SecondName=Zus\u00e4tzliche Name
TurnoutNameToolTip=Gebe Name der Anlageweiche ein.
StateToolTip=W\u00e4hle Weichenzustand f\u00fcr das gerade Pfad.
ContinuingState=Weichenposition Gerade
BlockID=
BlockIDToolTip=Gebe Namen des Blockes ein f\u00fcr neue Weiche, Kreuzung oder Gleisstrecke.
