<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">

<html lang="fr">
<head>
<!-- Updated by Blorec Herv&#233;  2017-02-05-->
<title>JMRI Hardware Support - Maple Systems</title>

<!-- Style -->
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<link rel="stylesheet" type="text/css" href="/css/default.css" media="screen">
<link rel="stylesheet" type="text/css" href="/css/print.css" media="print">
<link rel="icon" href="/images/jmri.ico" type="image/png">
<link rel="home" title="Home" href="/">
<!-- /Style -->
</head>

<body>
<!--#include virtual="/Header" -->
<div id="mBody">
    <!--#include virtual="../SidebarUp" -->
    <div id="mainContent">
        <!-- Page Body -->

<h1>Mat&#233;riel ris en charge: Syst&#232;mes Maple</h1>

<a href="http://www.maplesystems.com/images/silverseries/SilverSeries_7-16-07.jpg"><img src="http://www.maplesystems.com/images/silverseries/SilverSeries_7-16-07.jpg" align="right" height="93" width="173"></a><br>

<a href="http://www.maplesystems.com/">Maple Systems</a>
 a fait plusieurs s&#233;ries de
<a href="http://www.maplesystems.com/products/silverseries/silverseries_ezw.htm">panneaux &#224; &#233;cran tactile </a>
qui peuvent &#234;tre tr&#232;s utile sur les chemins de fer mod&#232;le.

<p>
Chaque panneau est vraiment un ordinateur autonome.
C'est configur&#233; et charg&#233; en utilisant un
 <a href="http://www.maplesystems.com/products/software/ezware.htm">programme de configuration </a>
fourni par Maple Systems.
Cette configuration d&#233;finit les affichages, les &#233;tiquettes de bouton et Emplacements, etc.

<a name="limitations"></a><h2>Limitations</h2>
<p>
Ceci est encore au stade tr&#232;s pr&#233;coce, donc les d&#233;tails changent rapidement.
Si vous souhaitez utiliser ces dispositifs, s'il ".vous pla&#238;t contacter les d&#233;veloppeurs JMRI.

<a name="connecting"></a><h2>Connexion</h2>
<h3>R&#233;glages</h3><p>
JMRI interagit avec le panneau d'entr&#233;e et par les bits de sortie
(appel&#233;s "bobines", comme dans les bobines de relais)
dans le panneau.
Le panneau de configuration peut d&#233;finir ceux-ci en r&#233;ponse &#224; divers &#233;v&#233;nements.
JMRI fournit des objets Capteur qui les rendent disponibles pour d&#233;clencher des actions
dans JMRI.
JMRI peut d&#233;finir les objets Aiguillages qui peuvent les r&#233;gler, auquel cas le
panneau de configuration peut changer ce qui appara&#238;t.

<p>Vous avez &#224; configurerun N&#339;ud Maple Systems dans JMRI avec le bouton "Configure Nodes" 
sur le Volet des Pr&#233;f&#233;rences JMRI. Sur le volet qui s'ouvre, entrez le num&#233;ro du n&#339;ud
( ex 1 ou 2, etc ) dans le champ "UA" et cliquez "Add". Laissez tous les autres vides;
Le support Maple a &#233;t&#233; cr&#233;&#233; &#224; partir du support JMRI C/MRI et &#224; partir de
JMRI version 2.3.7 la migration n'est pas compl&#232;te.</p>

<h4>D&#233;nomination</h4>
<p>
La lettre du syst&#232;me pour les connexions Maple est "K"

<p>
Vous configurez le p&#233;riph&#233;rique Maple Syst&#232;mes pour utiliser l'une des vitesses support&#233;es
(voir le volet JMRI pr&#233;f&#233;rences pour les connexions Maple),
et utiliser le "Protocole simple ASCII". Plus d'informations sur le
protocole et la mani&#232;re de configurer le p&#233;riph&#233;rique Maple Systems est
sur la
<a href="http://www.maplesystems.com/1033/10330073.PDF"> feuille de donn&#233;es PDF </a>.

<p>
JMRI communique avec le p&#233;riph&#233;rique Maple Systems en lisant et en &#233;crivant
 dans des emplacements " m&#233;moire discr&#232;te". Lieux, autrement connu comme registres "LB".

<p>Les registres LB 1 &#224; 48 sont disponibles pour JMRI comme entr&#233;e "Capteurs" 1
&#224; 48.

<p>Les registres LB 101 &#224; 148 sont disponibles pour JMRI comme sortie "Aiguillages" 1 &#224; 48.

<p>
Le num&#233;ro des n&#339;uds Maple Systems (programm&#233; dans "Param&#232;tre 5", la "station HMI ID #")
peut &#234;tre de 1 &#224; 99. Il apparait comme  le chiffre des milliers des noms de Capteur et Aiguillages JMRI.
Par exemple, KS3001 est le 1er capteur sur le n&#339;ud 3, et serait donc LB 1 dans ce Syst&#232;me d'unit&#233; Maple
. KT3001 est le 1er aiguillage de ce n&#339;ud, et serait donc LB 101 dans cette unit&#233;.

<p>
<strong>Il est tr&#232;s probable que nous allons retravailler et am&#233;liorer l'adressage bient&#244;t.</strong>

<a name="tools"></a><h2>Outils JMRI Maple Systems </h2>
N/A

<a name="documentation"></a><h2>Documentation</h2>
<h3>Autre source d'info</h3>
<p><a href="http://www.maplesystems.com">site web Maple Systems</a>

<!--#include virtual="/Footer" -->
  </div><!-- closes #mainContent-->
</div> <!-- closes #mBody-->
</body>
</html>
