<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//FR
"http://www.w3.org/TR/html4/loose.dtd">

<html lang="fr">
< t&#234;te>
  <meta name="generator" content=
  "HTML Tidy for Mac OS X" (vers 31 octobre 2006 - Apple Inc. build 15.17), voir www.w3.org">
  <meta name="keywords" content="JMRI help CBUS MERG naming long short actions action add sensor hex">
  <titre>Support mat&#233;riel JMRI - CBUS MERG - Nommage</titre>
  <!-- Style -->
  <meta http-equiv="Content-Type" content=
  "text/html ; charset=utf-8">
  <link rel="stylesheet" type="text/css" href="/css/default.css"
  media="screen">
  <link rel="stylesheet" type="text/css" href="/css/print.css"
  media="print">
  <link rel="icon" href="/images/jmri.ico" type="image/png">
  <link rel="home" title="Home" href="/">
  <!-- /Style -->
</head>

<body>
  <!--#include virtual="/Header.shtml" -->
  <div id="mBody">
      <!--#include virtual="Sidebar.shtml" -->
    <div id="mainContent">

      <h1>Assistance mat&#233;rielle de JMRI : CBUS MERG - Nommage</h1>

        <ul class="snav">
        <li><a href="#actions">Nom et num&#233;rotation de l'&#233;v&#233;nement</a></li>
        <li><a href="#reporters">Rapporteurs</a></li>
        <li><a href="#sysname">Noms Syst&#232;mes</a></li>
        <li><a href="#summary">R&#233;sum&#233; des Actions CBUS MERG</a></li>
        <li><a href="#namingspec">Sp&#233;cification de l'appellation des Actions</a></li>
        <li><a href="#hex">Envoi de cha&#238;nes hexad&#233;cimales</a></li>
        <li><a href="#opc">Codes d'op&#233;ration CBUS MERG dans JMRI</a><</li>
        </ul>
      
        <!--
        Une grandes partie du texte discutant des options de d&#233;nomination + tableau de d&#233;nomination 
        + capteurs d&#233;plac&#233;s ici de /help/fr/html/hardware/can/cbus/index.shtml
        @icklesteve juin 2018
        -->      
        <p>Cette page d&#233;crit comment JMRI utilise les Noms Syst&#232;mes pour acc&#233;der
        aux ressources li&#233;es &#224; CBUS MERG.</p>
      
      
      <h2><a name="actions" id="actions">Nom et num&#233;rotation de l'&#233;v&#233;nement</a><</h2>
      
        <h3>Conventions d'Actions</h3>
          <div>
        <h4>Suggestions d'Actions de courte dur&#233;e</h4>
            <p>Suggestion de Mike Bolton :</p>
            
            <p>Son club a adopt&#233; la convention de 1 &#224; 9999 pour les aiguillages 
            et &#224; partir de 10000 pour les capteurs. 
            <br>
            Cela permet d'&#233;viter la possibilit&#233; d'envoyer les capteurs d'Actions de 
            leurs CANCAB (9999 maximum) 
            <br>mais ils lient les capteurs pertinents aux chiffres des aiguillages 
            par exemple 
            <br>TO_1 est +1 et le retour d'information est +10001 pour un 
            et +11001 pour l'autre sens. 
            <br>
            En utilisant des Actions courts (ou des num&#233;ros d'appareils) de cette mani&#232;re, on rend la vie 
            tr&#232;s simple avec JMRI. 
            <br>Ils contr&#244;lent &#233;galement les d&#233;parts des CANCAB (&#233;galement commandes
            Smartphone ), cela se refl&#232;te dans le panneau JMRI et fait plaisir !
            <br>Le panneau de contr&#244;le du r&#233;seau est sur un &#233;cran tactile 
            connect&#233; &#224; un RPi 3B fonctionnant en JMRI,
            avec des panneaux de commande suppl&#233;mentaires grâce &#224; 
            <a href="../../../web/index.shtml">Serveur Web JMRI</a>.
            </p>
            
            
            <p>Une autre utilisation de la segmentation des Actions pourrait &#234;tre pour des r&#233;seaux modulaires de clubs, 
            o&#249; divers membres du club construisent une section chez eux, 
            puis en les rassemblant en un seu grand r&#233;seau.
            <br>
            Le module 1 comporterait des Actions de 1 000 > 1 999 Le module 2 comporterait des Actions de 2 000 > 2 999 etc.
            </p>
            
            
            <h4>Suggestions pour les longs Actions</h4>
            
            <p>Suggestion de Pete Brownlow:</p>
            <p>Pete utilise presque exclusivement des Actions longs.
            <br>Pour les Actions envoy&#233;s par JMRI, il segmente par num&#233;ro de N&#156;ud que JMRI g&#233;n&#232;re 
            (par exemple, le n&#156;ud 99 pour les aiguillages, le n&#156;ud 98 pour les signaux et le n&#156;ud 97 pour les capteurs de contr&#244;le). 
            <br>Il est ainsi tr&#232;s facile de voir &#224; quoi servent les Actions lorsqu'on consulte un journal des Actions. 
            <br>Pour tous les capteurs d'entr&#233;e du CBUS, il laisse l'&#233;v&#233;nement long tel que g&#233;n&#233;r&#233; par le module CBUS, 
            il conservera donc le num&#233;ro de N&#156;ud de ce module, 
            (par exemple, le n&#156;ud 256, &#233;v&#233;nement 1), il n'y a donc aucun risque de g&#233;n&#233;rer le m&#234;me &#233;v&#233;nement qu'un TCO  
            <br>Parce qu'il n'utilise pas d'Actions courts, il n'est pas n&#233;cessaire de segmenter par le num&#233;ro d'&#233;v&#233;nement/de dispositif.  
            Il &#233;vite &#233;galement d'avoir &#224; enseigner les Actions du producteur, 
            en utilisant simplement ce qui provient des modules par d&#233;faut. 
            </p>
            
            

            <h4>Polarit&#233; des Actions</h4>
            
            <p> Vous pouvez inverser la polarit&#233; des Actions ON et OFF</p>
      <ul>
      <li> sur le module producteur initial </li>
      <li>Format de d&#233;signation du mat&#233;riel lorsqu'il est saisi en tant que capteur JMRI, aiguillage ou lumi&#232;re</li>
      <li>R&#233;glages du capteur ou dde l'aiguillage au sein de JMRI</li>
      </ul>

              <h4>&#201;v&#233;nements de d&#233;but de journ&#233;e</h4>
        
        <p>Lorsque JMRI est lanc&#233;, il ne sait pas si tous les capteurs, les aiguillages et 
        les feux sont actifs ou inactifs, ils ont un statut inconnu.</p>
        
        <p> La grande majorit&#233; des kits de modules MERG peuvent envoyer le statut actuel de leur 
       entr&#233;es ou sorties en r&#233;ponse &#224; un &#233;v&#233;nement de r&#233;seau enseign&#233; &#224; ce module.</p>
        
        <p>JMRI peut stocker des informations crois&#233;es telles que les Variables de M&#233;moire et les 
        Valeurs de Cantons (valeur du descripteur de train)</p>      
        
        <p>Lorsque JMRI charge un panneau, et que l'alimentation de la voie est activ&#233;e, les valeurs des cantons des 
        sessions pr&#233;c&#233;dentes sont charg&#233;es si le canton est actif.</p>
        
        <p>Il peut &#234;tre judicieux de r&#233;gler l'alimentation de la voie sur Off au d&#233;marrage de JMRI et lorsqu'un panneau se charge, 
       et alimenter la voie apr&#232;s que le panneau ait &#233;t&#233; enti&#232;rement charg&#233;.</p>
      
      <h4><a name="automatic" id="automatic">Capteurs - Cr&#233;ation automatique JMRI</a><</h4>

        <p>JMRI NE TENTE PAS de cr&#233;er des objets capteurs &#224; partir de
        le trafic qu'il entend sur le r&#233;seau CBUS du MERG, 
        contrairement &#224; certains autres syst&#232;mes mat&#233;riels.</p>
        
        <p>C'est parce que le CBUS MERG est essentiellement un protocole de r&#233;seau, 
        et non un g&#233;n&#233;rateur de capteurs.
        Les Actions ne sont pas intrins&#232;quement associ&#233;s &#224;
        des objets mat&#233;riels sp&#233;cifiques, les gens peuvent utiliser les Actions de nombreuses façons.</p>
        
        <p>Vous pouvez demander l'&#233;tat d'un capteur en cliquant sur Requ&#234;te dans le tableau des capteurs. </p>
      
       <h4><a name="turnout" id="turnout">Op&#233;ration Aiguillage</a></h4>
      
      <p>CBUS MERG est configur&#233; dans JMRI pour 4 types de retour d'information (sortie) de l'aiguillage.</p>
      <p> Les aiguillages ont 2 &#233;tats, l'&#233;tat command&#233; et l'&#233;tat de retour 
      qui est utilis&#233; sur les panneaux d'affichage et ailleurs.
      
      <ul>
      <li>Direct - Lorsque l'&#233;tat command&#233; est modifi&#233;, 
      l'&#233;tat de r&#233;troaction refl&#233;tera l'&#233;tat command&#233;.</li>
      <li>Retard&#233; - Lorsque l'&#233;tat command&#233; est modifi&#233;, 
      l'&#233;tat de r&#233;troaction refl&#233;tera l'&#233;tat command&#233; apr&#232;s un bref d&#233;lai.</li>
      <li>1 Capteur - Lorsque l'&#233;tat command&#233; est modifi&#233;, l'&#233;tat de r&#233;troaction ne change pas.
      <br>L'&#233;tat de r&#233;troaction change lorsque le capteur connect&#233; change d'&#233;tat (par exemple, Actions de microcommutateur unique)</li>
      <li>2 Capteur - Lorsque l'&#233;tat command&#233; est modifi&#233;, l'&#233;tat de r&#233;troaction ne change pas.
      <br>L'&#233;tat de r&#233;troaction change lorsque les deux capteurs s'accordent sur l'&#233;tat (par exemple, les Actions de fin de course du servo).
      </ul>
      
      <p>Vous pouvez demander l'&#233;tat d'un aiguillage en cliquant sur "Requ&#234;te" dans le tableau des aiguillages. </p>
      <p>Si un aiguillage utilise 1 ou 2 capteurs, ces &#233;tats seront &#233;galement demand&#233;s.
      
      <p>See <a href="../../../doc/Technical/TurnoutFeedback.shtml">JMRI : R&#233;trosignalisation Aiguillage</a> pour plus d'info.</p>
      
      
      <h4><a name="reporters" id="reporters">Donn&#233;es des reporters (y compris RFID) du CBUS</a><</h4>
      <p><a href="../../../tools/Reporters.shtml">JMRI Reporters</a> n'ont pas d'Actions Off ou On,
        ils utilisent simplement un dispositif (&#233;v&#233;nement court) ou un num&#233;ro de N&#156;ud.
        
        <p>Les rapports sont cr&#233;&#233;s en cliquant sur le bouton "Nouveau" dans le 
        <a href="../../../../package/jmri/jmrit/beantable/ReporterTable.shtml">Tableau de rapport</a>.</p>
        <p> Vous pouvez cr&#233;er plusieurs rapports en cochant l'option Ajouter une plage s&#233;quentielle.</p>
        
        <p>Comme les Capteurs et les Aiguillages et les Lumi&#232;res, ceux-ci ne sont pas cr&#233;&#233;s automatiquement dans CBUS.</p>
        
      <p>Un Nom Syst&#232;me typique pour un rapport serait 
        <code>MR123</code> ou <code>MR1234</code> ( aucun &#233;v&#233;nement activ&#233; ou d&#233;sactiv&#233; ) .</p>
      <p>Le Code Op&#233;ration DDES et l'ACDAT sont utilis&#233;s pour les donn&#233;es des d&#233;clarants.
      <p>Quand un Code Op&#233;ration DDES ou ACDAT entrant est entendu sur le r&#233;seau, 
       JMRI cherchera un rapport correspondant au num&#233;ro de l'appareil ou du N&#156;ud dans le tableau des rapports.
      
      <p>Si un rapporteur existe, la <a href="../../../tools/IdTags.shtml">balise ID</a> 
        dans les 5 octets de donn&#233;es sera recherch&#233;s dans la
      <a href="../../../../package/jmri/jmrit/beantable/IdTagTable.shtml"> table ID Tag </a>.</p>
      
      <p>S'il n'y a pas d'ID Tag correspondant dans la table, une sera cr&#233;&#233; et mise &#224; jour.</p>
      
      <p>Si la balise ID &#233;tait pr&#233;c&#233;demment active pour un autre rapport, 
        le rapport pr&#233;c&#233;dent verra la balise supprim&#233;e dans celui-ci.</p>
      
      <p>Les num&#233;ros de d&#233;clarants valides sont au minimum 0, au maximum 65535.</p>
      <Les messages DDES (donn&#233;es relatives au num&#233;ro de l'appareil) et ACDAT (donn&#233;es relatives aux N&#156;uds) sont 
      actuellement trait&#233;s exactement de la m&#234;me mani&#232;re, c'est-&#224;-dire que les 2 premiers octets sont utilis&#233;s comme identifiant du rapport.</p>
      <p>Cela signifie qu'un rapport cr&#233;&#233; via un num&#233;ro 77 r&#233;pondra 
        &#224; la fois le dispositif DDES 77 et l'ACDAT du N&#156;ud 77.</p>
      
      <p>Les rapports sont enregistr&#233;s dans votre fichier de panneau principal, avec les aiguillages et les capteurs, etc.</p>
      <p>ID Tags crois&#233;s automatiquement, aucune sauvegarde n'est n&#233;cessaire.</p>
      </div>
      
      
      
      <h2><a name="sysname" id="sysname">Noms Syst&#232;mes</a><</h2>
       <div>
        <p>Lors de l'ajout d'un &#233;l&#233;ment &#224; votre JMRI
        <a href="../../../../package/jmri/jmrit/beantable/TurnoutTable.shtml"> Table Aiguillage</a>,
        <a href="../../../../package/jmri/jmrit/beantable/SensorTable.shtml">Table des capteurs</a>,
        <a href="../../../../package/jmri/jmrit/beantable/LightTable.shtml">Table Lumi&#232;res</a> ou
        <a href="../../../../package/jmri/jmrit/beantable/ReporterTable.shtml">Table de rapport</a>,

        Un Nom Syst&#232;me JMRI est automatiquement cr&#233;&#233; &#224; partir de l'adresse du mat&#233;riel que vous saisissez.
        </p>
      
        <p><strong>C'est vraiment tout ce que vous devez savoir pour commencer</strong>, le reste des informations sur cette page 
        est destin&#233; aux cas d'utilisation avanc&#233;s, au d&#233;bogage des fichiers xml du panneau et au d&#233;veloppement du syst&#232;me.
      
        <p>JMRI associe en interne les Actions CBUS du MERG aux objets individuels de JMRI
        (capteurs, aiguillages, feux, etc.) via le <a href="../../../doc/Technical/Names.shtml">Noms Syst&#232;mes JMRI</a>.
        </p>        

        <p>Selon les identifiants d'Actions CBUS du MERG utilis&#233;s sur un
        r&#233;seau particuli&#232;r, ces nNoms Syst&#232;mes peuvent devenir tr&#232;s longs, en
        auquel cas les "Noms d'Utilisateur" sont beaucoup plus utiles.</p>
        
        <p>La 1&#232;re lettre du nom d'un Capteur, d'un Aiguillage ou d'un syst&#232;me de Lumi&#232;re est la Lettre Syst&#232;me JMRI
       , g&#233;n&#233;ralement "M" pour les connexions MERG.
        </p>
        
        <ul>
        <li><a href="../../../tools/Sensors.shtml">Capteurs JMRI</a> utilisez la lettre "S", 
        par exemple <code>MS+123;-345</code>" d&#233;finit un
        Capteur qui suit les Actions "123 ON" et "345 OFF" pour changer d'&#233;tat. </li>
        <li><a href="../../../tools/Turnouts.shtml">Aiguillages JMRI</a> utilisez la lettre "T",
        par exemple <code>MT+123;-345</code> </li>
        <li><a href="../../../tools/Lights.shtml">Lumi&#232;res JMRI</a> utilisez la lettre "L", par exemple
        <code>ML+123;-345</code></li>
        <li><a href="../../../tools/Reporters.shtml">Rapports JMRI</a> utilisez la lettre "R", par exemple
        <code>MR123</code></li>
        </ul>         
      
      
    <h3><a name="summary" id="summary">R&#233;sum&#233; des Actionss CBUS MERG ( Capteurs, Aiguillages et lumi&#232;res )</a><</h3>
      
      <table border="1">
        <tbody><tr>
          <th>In/Out</th>
          <th>Entr&#233;e comme adresse mat&#233;rielle</th>
          <th>Signification</th>
          <th>fait le Nom Syst&#232;me</th>
          <th>Masque</th>
          <th>Equivalent</th>
          <th>Min.</th>
          <th>Max.</th>
          <th>Notes</th>
        </tr>
        <tr>
          <td>both</td>
          <td>+18</td>
          <td>Action 18 On ;
            <br>Action 18 Off</td>
          <td>MT+18</td>
          <td>entier</td>
          <td>+18;-18</td>
          <td>01</td>
          <td>65535
          </td>
          <td>SLiM Actions Courtes ASON/ASOF
          </td>
        </tr>
        <tr>
          <td>both</td>
          <td>+N2E18</td>
          <td>N&#156;eud 2 Action 18 ; On Event = Active ; 
          <br>Off &#201;v&#233;nement = Inactif</td>
          <td>MT+N2E18;-N2E18</td>
          <td></td>
          <td></td>
          <td>N1E1;<br>N1E1</td>
          <td>N 65535 E 65535 ;
          <br>N 65535 E 65535</td>
          <td>FLiM Action Longues ACON / ACOF</td>
        </tr>
        <tr>
          <td>both</td>
          <td>+18;+21</td>
          <td>action 18 On ;
          <br>&#233;v&#233;nement 21 On</td>
          <td>MT18;21</td>
          <td>int&#233;gral;integer</td>
          <td>+18;+21</td>
          <td> 1 ; 1</td>
          <td> 65535 ; 65535</td>
          <td> </td>
        </tr>
        <tr>
          <td>both</td>
          <td>+18;-21</td>
          <td>action 18 On ; 
          <br>action21 Off</td>
          <td>MT+18;-21</td>
          <td>idem sign&#233;</td>
          <td>+18;-21</td>
          <td> </td>
          <td> </td>
          <td> </td>
        </tr>
        <tr>
          <td>both</td>
          <td>X90002D002E;X91FFFFFFFE</td>
          <td>hex CAN trame msg. Active ;
          <br>hex CAN trame msg. Inactif</td>
          <td>MTX90002D002E;X91FFFFFFFE</td>
          <td>hex;hex</td>
          <td>N/A</td>
          <td colspan="2">D&#233;pend de Opscode</td>
          <td>Par exemple, le jet&#233; envoie l'&#233;v&#233;nement long N 45 E 46 <br>le ferm&#233; envoie l'&#233;v&#233;nement long N 65535 E 65534 </td>
        </tr>
        <tr>
          <td>both</td>
          <td>200018</td>
          <td>Node 2 Event 18 ; On Event = Active ; 
          <br>Off &#201;v&#233;nement = Inactif</td>
          <td>MS200018</td>
          <td>node + (5 chiffres)</td>
          <td>N2E18</td>
          <td> 100001</td>
          <td> 6553565535</td>
          <td> Le maximum actuel qui peut &#234;tre saisi (JMRI 4.12) est 2147483647</td>
        </tr>
        </tbody></table>
        
      <!-- ce tableau est un exceprt du tableau dans le fichier help/fr/html/doc/Technical/Names.shtml
      sur la base des informations fournies dans les pages d'aide sur le mat&#233;riel
      par Egbert Broerse @silverailscolo Juillet 2017 
      
      
      Veuillez &#233;galement mettre &#224; jour cette page lorsque vous ajoutez / am&#233;liorez des noms qui fonctionneront ou non
      
      
      -->
        
        <p>65 536 N&#156;uds et 65 535 actions donnent environ 4 294 901 760 combinaisons d'actions.</p>
        
        <p>65,535 est irr&#233;aliste pour les actions au sein d'un N&#156;ud mais permet une segmentation utile des plages d'action.</p>
        <p>Les kits de modules MERG peuvent utiliser toute la gamme des num&#233;ros d'action CBUS, lors d'un d&#233;marrage de r&#233;initialisation 
        fonctionnant en mode d'action courte SLiM.
        <br>Un kit MERG CANLED peut prendre en charge jusqu'&#224; 255 actions enseign&#233;es</p>

       </div>

      <h2><a name="namingspec" id="namingspec">Sp&#233;cification de l'Appellation des Actions</a></h2>
      <div>
      <p>Un capteur est d&#233;fini par deux
      actions : Celle qui le met Actif, et celle qui le met
      INACTIF. 
      <br>Si celles-ci sont mises en correspondance avec les trames ON et OFF avec le
      m&#234;me num&#233;ro d'identification de l'action, respectivement, uniquement le num&#233;ro d'identification de l'action
      doit &#234;tre pr&#233;cis&#233;:<br>
      <code>MS18</code> 
      Le nombre est d&#233;cimal.</p>

      <p>Pour accro&#238;tre la polyvalence, il est possible d'utiliser diff&#233;remment
      les num&#233;ros d'identification des actions pour la transition ACTIVE (par d&#233;faut, une trame ON) 
      et la transition INACTIVE (par d&#233;faut, une trame OFF):<br>
      <code>MS18;21</code></p>

      <p>Le codage ON et OFF du CBUS MERG n'est pas enti&#232;rement coh&#233;rent
      avec le mod&#232;le d'action, 
      <br>il peut &#234;tre utile pour relier les
      Passage ACTIF ou INACTIF d'un capteur JMRIJ &#224; un &#233;tat OFF ou ON
      respectivement sur une trame CBUS MERG. 
      <br>Caract&#232;res "+" et "-" en t&#234;te
      peut le faire. Par exemple,<br>
      <code>MS-18;+21</code><br>
      d&#233;finit un capteur qui devient ACTIF lorsqu'une trame OFF avec ID
       num&#233;ro 18 est reçue,
      <br>et devient INACTIVE lorsqu'une trame ON
      avec le num&#233;ro d'identification 21 est reçu.</p>

      <p>Les num&#233;ros d'action MERG du CBUS (g&#233;n&#233;ralement) contiennent un num&#233;ro de N&#156;ud dans
      leurs octets les plus importants. 
      <br>Vous pouvez sp&#233;cifier le num&#233;ro de N&#156;ud
      soit en utilisant un nombre complet de 5 chiffres d&#233;cimaux pour le num&#233;ro de l'action
      lui-m&#234;me, pr&#233;c&#233;d&#233; du num&#233;ro de N&#156;ud:<br>
      <code>MS200018</code><br>
      ou en utilisant les lettres "N" et "E" pour pr&#233;ciser les
      parts:<br>
      <code>MSN2E18</code><br><</p>

      <p>Vous pouvez masquer une partie du paquet CBUS MERG, ainsi toute valeur dans
      la partie masqu&#233;e correspondra toujours, en utilisant la lettre de format "M
      .<br>
      <code>MS200018M07</code><br>
      "M" indique le d&#233;but d'un masque hexad&#233;cimal qui sera
      appliqu&#233;, o&#249; 1 bit dans le masque sera z&#233;ro bit dans le
      valeur r&#233;sultante.
      
      <br>Dans l'exemple ci-dessus, "18" &#224; "1F" sera
      match. 
      <br>Ceci est particuli&#232;rement utile pour la mise en correspondance, par exemple CBUS MERG
      les actions courtes, o&#249; certaines parties du paquet comprennent le num&#233;ro du N&#156;ud
      qui doit (g&#233;n&#233;ralement) &#234;tre ignor&#233;.</p>
      
      </div>

    <h2><a name="hex" id="hex">Envoi de cha&#238;nes hexad&#233;cimales</a></h2>
     <div>
      
      <p>La num&#233;rotation hexad&#233;cimale est bas&#233;e sur la puissance de 16, en utilisant 0-9, puis A-F.</p>
      
      <p>Les modules CBUS MERG communiquent par des messages &#224; format fixe : Un octet d'informations 
      sur la commande et la longueur, suivies &#233;ventuellement d'octets de donn&#233;es suppl&#233;mentaires.</p>

      <p>Dans sa forme la plus simple, ceci est utilis&#233;
      pour envoyer des "actions" identifiables. Les actions se pr&#233;sentent &#224; leur tour sous la forme de deux
      types : "ON" et "OFF", avec deux formes, courte ( SLiM ), et longue ( FLiM ).</p>
      
      <p> Elles sont en fait envoy&#233;es &#224; travers un r&#233;seau CBUS MERG sous la forme d'un Opscode, l'information de commande.</p>
      
      <p>Il y a 255 codes Ops, la longueur de la cha&#238;ne de donn&#233;es suivant le code Ops change selon le code Ops utilis&#233;.</p>
      
      <p>Il existe plusieurs Opscodes pour les actions, la commande et la programmation des dispositifs DCC, couplage DCC, 
      la programmation des N&#156;uds avec des variables de N&#156;ud, la programmation des N&#156;uds avec des actions, les informations d'horloge et de temp&#233;rature rapides, les donn&#233;es de lecteur RfID, et bien d'autres encore.</p>
      
      <p>Quatre d'entre eux sont les codes d'op&#233;ration communs pour les actions :</p>
      
      <table border="1">
      <tr>
      <th>Ops Code Name &#233;v&#233;nements
      <br>( MERG console log ) </th>
      <th>Decimal
      <br>Opscode</th>
      <th>Hexadecimal
      <br>Opscode</th>
      <th></th>
      </tr>
      <tr>
      <td>ASON</td>
      <td>152</td>
      <td>98</td>
      <td>Action Courte On</td>
      </tr>
      <tr>
      <td>ASOF</td>
      <td>153</td>
      <td>99</td>
      <td>Action Courte Off</td>
      </tr>
      <tr>
      <td>ACON</td>
      <td>144</td>
      <td>90</td>
      <td>Action Longue On</td>
      </tr>
      <tr>
      <td>ACOF</td>
      <td>145</td>
      <td>91</td>
      <td>Action Longue Off</td>
      </tr>      
      </table>
      
     <p>Il est possible de connecter un capteur &#224; des trames CAN  en sp&#233;cifiant leur contenu de donn&#233;es sous forme de cha&#238;ne hexad&#233;cimale, 
     indiqu&#233; par "X".</p>
      
      <p>Cela permet &#224; un capteur ou &#224; un aiguillage d'ignorer toute signification intrins&#232;que pour les actions "ON" et "OFF", et 
      lui permet de r&#233;pondre ou d'&#233;mettre toute trame sur le r&#233;seau.</p>
      
      
      <p>Ces codes d'action particuliers utilisent une cha&#238;ne hexad&#233;cimale de 4 chiffres, divis&#233;e entre Haut puis Bas :</p>
      
      <img src="images/web/merg-add-turnout-hex-620x147.png" align= "right" 
      alt="merg cbus add new turnout hexadecimal hex" width="620" height="147">
      
      <table border="1">
      <tr>
      <th>Entered as Hex</th>
      <th>Ops Code</th>
      <th>Remaining Hex</th>
      <th>Node Decimal</th>
      <th>Event Decimal</th>
      </tr>
      <tr>
      <td><code>X9900000013</code></td>
      <td>ASOF</td>
      <td><code>00 00 00 13</code></td>
      <td>0</td>
      <td>19</td>
      </tr>
      <tr>
      <td><code>X980000002D</code></td>
      <td>ASON</td>
      <td><code>00 00 00 2D</code></td>
      <td>0</td>
      <td>45</td>
      </tr>
      <tr>
      <td><code>X980000BD2A</code></td>
      <td>ASON</td>
      <td><code>00 00 BD 2A</code></td>
      <td>0</td>
      <td>48426</td>
      </tr>      
      <tr>
      <td><code>X990000FFFF</code></td>
      <td>ASOF</td>
      <td><code>00 00 FF FF</code></td>
      <td>0</td>
      <td>65535</td>
      </tr>
      <tr>
      <td><code>X9100130013</code></td>
      <td>ACOF</td>
      <td><code>00 14 00 13</code></td>
      <td>20</td>
      <td>19</td>
      </tr>
      <tr>
      <td><code>X90002D002E</code></td>
      <td>ACON</td>
      <td><code>00 2D 00 2E</code></td>
      <td>45</td>
      <td>46</td>
      </tr>
      <tr>
      <td><code>X90BD2BBD2A</code></td>
      <td>ACON</td>
      <td><code>BD 2B BD 2A</code></td>
      <td>48427</td>
      <td>48426</td>
      </tr>      
      <tr>
      <td><code>X91FFFFFFFE</code></td>
      <td>ACOF</td>
      <td><code>FF FF FF FE</code></td>
      <td>65535</td>
      <td>65534</td>
      </tr>
      </table>
      <p>Assurez-vous d'utiliser le bon code Op&#233;ration, par exemple si vous incluez des Nodes pour une adresse FLIM, 
      utilisez ACON au lieu de ASON.</p>
      
      <p>Capteurs, aiguillages et feux stock&#233;s sous forme d'Actions de r&#233;ponse hexagonale en utilisant les 
      les OPC de r&#233;ponse ne seront pas reconnus car ils sont traduits en standard sur les Actions on et off 
      juste avant la v&#233;rification de la concordance du message interne (capteur ou voyant).
      <br>
      En dehors de ces Codes sp&#233;cifiques, les Aiguillages, les Lumi&#232;resou les Capteurs peuvent stocker n'importe quelle combinaison hexad&#233;cimale, 
      ils ont besoin d'un c&#244;t&#233; "ON" et d'un c&#244;t&#233; "OFF" s&#233;par&#233;s par un " ;".
      </p>
      
      <p>Les trames CAN peuvent envoyer des code Op&#233;rations CBUS MERG sous la forme de code hexad&#233;cimal dont vous avez besoin.
      <br>
      par exemple, pour installer un capteur afin d'envoyer (arr&#234;t d'urgence du DCC/mise sous tension de la voie) des codes d'op&#233;ration sur 
      le CBUS du MERG, 
      <br> vous pourriez utiliser une adresse mat&#233;rielle de <code>X0A;X05</code>
      </p>

      <table border="1">
      <tr>
      <th>Entr&#233;e comme Hex</th>
      <th>Vu dans JMRI MERG CONSOLE</th>
      <th>Vue dans CBUS SERVER</th>
      <th>Ops Code</th>
      </tr>
      <tr>
      <td><code>X0A</code></td>
      <td><code>[x[7f]0A]</code></td>
      <td><code>S0FE0N0A;</code></td>
      <td>(RESTP) Demande d'arr&#234;t d'urgence de TOUS les trains
      <br>A MERG CANCMD confirme la demande avec un ESTOP 06 Opscode.</td>
      </tr> 
      <tr>
      <td><code>X05</code></td>
      <td><code>[x[7f]05]</code></td>
      <td><code>S0FE0N05;</code></td>
      <td>(TON) Suivi de la mise sous tension, normalement diffus&#233; &#224; partir d'un poste de commande</td>
      </tr> 
      </table>

      <p>
      Tous ces messages Opscode sont envoy&#233;s avec la trame d'action CAN standard, 
      Toutefois, le protocole permet &#233;galement d'acc&#233;der &#224; des trames CAN &#233;tendues.
      <Ces trames permettent le d&#233;marrage des modules (mises &#224; jour du micrologiciel), 
      alors que les utilisations futures de cette technologie pourraient &#233;galement &#234;tre pour la diffusion en continu de m&#233;dias locaux (par exemple, le transfert de 
      des images de trains ou des fichiers sonores entre les modules. )
      <br>Les images &#233;tendues n'interf&#232;rent pas avec les images standard, 
      Les modules peuvent donc &#234;tre cibl&#233;s pour le chargement des bateaux par num&#233;ro de module, 
      sans affecter les messages du r&#233;seau.</p>
      
      <p>Les trames CAN &#233;tendues (qui ne sont pas des messages CBUS) peuvent &#234;tre surveill&#233;es dans le 
      <a href="../../../../package/jmri/jmrix/can/cbus/swing/console/CbusConsoleFrame.shtml"
        >Console BUS</a>,
        et sont filtr&#233;s de tous les autres objets JMRI (capteurs, aiguillages, etc.).
      
      <p>M&#234;me si les mises &#224; jour du micrologiciel des modules ne sont pas actuellement disponibles au sein de JMRI, 
      Une assistance compl&#232;te est disponible via un logiciel tiers ( FCU - FLiM Configuration Utility ), 
      disponible gratuitement en t&#233;l&#233;chargement pour les membres du MERG.
      </p>
      
      <img src="images/web/merg-cbus-server-400x256.png"
      width="400" height="256" alt="merg cbus server" align="right">
      
      
      <p>Pour le d&#233;veloppement de syst&#232;mes avanc&#233;s et la preuve par paquets, vous pouvez pr&#233;f&#233;rer consulter le 
      paquet complet pour diverses applications, par exemple CBUS MERG SERVER.</p>
      
        <p>The <a href="../../../../package/jmri/jmrix/can/cbus/swing/console/CbusConsoleFrame.shtml"
        >JMRI CBUS MERG Console Tool</a> peut &#234;tre tr&#232;s utile pour voir ce qui est envoy&#233; 
        &#224; travers le r&#233;seau par les adresses mat&#233;rielles que vous cr&#233;ez.
        <br>La console est conçue comme un outil pour aider les utilisateurs &#224; surveiller les paquets en utilisant des Actions courtes et longuess,
        et peut tenter d'embellir la sortie.      
      
        <p>Consultez le wiki du CBUS MERG et le guide des d&#233;veloppeurs pour plus d'informations et les sp&#233;cifications absolues.
      
      
     </div>
      
     <h2><a name="opc" id="opc">Codes d'op&#233;ration pris en charge par JMRI</a></h2>
      <div>
        <p>La majorit&#233; des Opscodes selon le guide des d&#233;veloppeurs CBUS 6b du MERG sont pris en charge sous une forme ou une autre.</p>

        <p>Tous les messages CBUS JMRI MERG sortants ont leur priorit&#233; OPC ajout&#233;e &#224; la section d'en-t&#234;te du message.</p>
        
        <p>Plusieurs fonctions de la JMRI utilisent le support de l'OPC dans : </p>
        
        <ul>
        <li>
        <a href="https://github.com/JMRI/JMRI/blob/master/java/src/jmri/jmrix/can/cbus/CbusOpCodes.java"
        >CbusOpCodes.java</a>
        <a href="https://jmri.org/JavaDoc/doc/jmri/jmrix/can/cbus/CbusOpCodes.html"
        >JavaDoc</a>
        </li>

        <li>
        <a href="https://github.com/JMRI/JMRI/blob/master/java/src/jmri/jmrix/can/cbus/CbusConstants.java"
        >CbusConstants.java</a>
        <a href="https://jmri.org/JavaDoc/doc/jmri/jmrix/can/cbus/CbusConstants.html"
        >JavaDoc</a>
        </li>
        
        <li><a href="https://github.com/JMRI/JMRI/blob/master/java/src/jmri/jmrix/can/cbus/CbusMessage.java"
        >CbusMessage.java</a>
        <a href="https://jmri.org/JavaDoc/doc/jmri/jmrix/can/cbus/CbusMessage.html"
        >JavaDoc</a>
        </li>
        
        <li><a href="https://github.com/JMRI/JMRI/blob/master/java/src/jmri/jmrix/can/cbus/CbusBundle.properties"
        >CbusBundle.properties</a> pour les traductions en anglais des OPC.
        </li>
        
        <li><a href="https://github.com/JMRI/JMRI/blob/master/java/src/jmri/jmrix/can/cbus/CbusProgrammer.java"
        >CbusProgrammer.java</a>
        <a href="https://jmri.org/JavaDoc/doc/jmri/jmrix/can/cbus/CbusProgrammer.html"
        >JavaDoc</a>
        Fonctions de programmation des N&#156;uds (les fonctions de l'outil de configuration des N&#156;uds doivent &#234;tre d&#233;plac&#233;es ici)
        </li>
        
        </ul>

       <h4>Opscodes utilis&#233;s dans les outils CBUS de JMRI MERG</h4>
       
       <p>Il y a une liste des Codes pris en charge pour chaque page de support de l'outil CBUS du JMRI MERG .</p>
        
       <ul>
       <li><a href="../../../../package/jmri/jmrix/can/cbus/swing/actiontable/EventTablePane.shtml#opc"
        >Tableau des Actions</a> - Principalement les OPC d'Actions</li>
       <li><a href="../../../../package/jmri/jmrix/can/cbus/swing/nodeconfig/NodeConfigToolPane.shtml#opc"
        >Node Config</a> - Node Management OPCs</li>
       <li><a href="../../../../package/jmri/jmrix/can/cbus/swing/cbusslotmonitor/CbusSlotMonitorPane.shtml#opc"
        >Moniteur de poste de commandement</a> -Moniteur de poste de commandement OPCs</li>
        <li><a href="../../../../package/jmri/jmrix/can/cbus/swing/console/CbusConsoleFrame.shtml#opc"
        >Console</a> - Tous les OPC</li>
        <li><a href="../../../../package/jmri/jmrix/can/cbus/swing/simulator/SimulatorPane.shtml#opc"
        >Simulateur</a> - La plupart des OPC</li>
        <li><a href="../../../../package/jmri/jmrix/can/cbus/swing/actionrequestmonitor/CbusEventRequestTablePane.shtml#opc"
        >Event Request Monitor</a> - Mainly action OPCs</li>

       </ul>        
        
        <h4>Capteur, participation et &#233;clairage OPCs</h4>
      
        <p>
        <a href="https://github.com/JMRI/JMRI/blob/master/java/src/jmri/jmrix/can/cbus/CbusSensor.java"
        >CbusSensor.java</a> 
        <a href="https://github.com/JMRI/JMRI/blob/master/java/src/jmri/jmrix/can/cbus/CbusSensorManager.java"
        >CbusSensorManager.java</a></p>
      
        <p>
        <a href="https://github.com/JMRI/JMRI/blob/master/java/src/jmri/jmrix/can/cbus/CbusTurnout.java"
        >CbusTurnout.java</a> 
        <a href="https://github.com/JMRI/JMRI/blob/master/java/src/jmri/jmrix/can/cbus/CbusTurnoutManager.java"
        >CbusTurnoutManager.java</a></p>
      
        <p>
        <a href="https://github.com/JMRI/JMRI/blob/master/java/src/jmri/jmrix/can/cbus/CbusLight.java"
        >CbusLight.java</a> 
        <a href="https://github.com/JMRI/JMRI/blob/master/java/src/jmri/jmrix/can/cbus/CbusLightManager.java"
        >CbusLightManager.java</a>
        </p>

        <p>La flexibilit&#233; de la forme hexad&#233;cimale pour la cr&#233;ation de capteurs, d'aiguillages et de feux 
        permet d'envoyer ou de recevoir tout Code en tant qu'entr&#233;e.</p>
        
        <p>Lorsque l'adresse est utilis&#233;e sous forme abr&#233;g&#233;e, par exemple "+N123E456" : </p>
      
        <ul>
        <li>ASON/ASOF Envoy&#233; lorsque le statut a chang&#233;, num&#233;ro de N&#156;ud = 0</li>
        <li>ACON/ACOF Envoy&#233; lorsque le statut a chang&#233;, num&#233;ro de N&#156;ud > 0</li>
        </ul>
        
        <ul>
        <li>ASON/ASOF Constant listener</li>
        <li>ACON/ACOF Constant listener</li>
        <li>ARON/AROF Constant listener</li>
        <li>ARSON/ARSOF Constant listener</li>
        </ul>      
        
        <p>Cela n'inclut pas actuellement l'&#233;v&#233;nement de donn&#233;es &#233;tendues desactions des Codes.</p>
        
      <h4>Rapport OPCs</h4>
        <p>
        <a href="https://github.com/JMRI/JMRI/blob/master/java/src/jmri/jmrix/can/cbus/CbusReporter.java"
        >CbusReporter.java</a>
      
        <a href="https://github.com/JMRI/JMRI/blob/master/java/src/jmri/jmrix/can/cbus/CbusReporterManager.java"
        >CbusReporterManager.java</a>
        </p>
        <p>Les messages envoy&#233;s et reçus par JMRI sont trait&#233;s de la m&#234;me mani&#232;re par les rapports CBUS du MERG.
        <ul>
        <li>DDES - Constant Listener</li>
        <li>DDRS - Constant Listener</li>
        <li>ACDAT - Constant Listener</li>
        <li>ARDAT - Constant Listener</li>
        </ul>        
        
        
      <h4>Command Station OPCs</h4>
       
        <p>
        <a href="https://github.com/JMRI/JMRI/blob/master/java/src/jmri/jmrix/can/cbus/CbusCommandStation.java"
        >CbusCommandStation.java</a>
        </p>
        
        <ul>
        <li>RDCC3 - Message envoy&#233;</li>
        <li>KLOC - Message envoy&#233;</li>
        <li>DKEEP - Message envoy&#233;</li>
        <li>DSPD - Message envoy&#233;</li>
        <li>DFUN - Message envoy&#233;</li>
        <li>STMOD - Message envoy&#233;</li>
        </ul>
        
        
        <p>
        <a href="https://github.com/JMRI/JMRI/blob/master/java/src/jmri/jmrix/can/cbus/CbusDccOpsModeProgrammer.java"
        >CbusDccOpsModeProgrammer.java</a>
        </p>
        <ul>
        <li>WCVOA - Message envoy&#233;</li>
        </ul>
        <p>
        <a href="https://github.com/JMRI/JMRI/blob/master/java/src/jmri/jmrix/can/cbus/CbusDccProgrammer.java"
        >CbusDccProgrammer.java</a>
        </p>
        <ul>
        <li>WCVS - Message envoy&#233;</li>
        <li>QCVS - Message envoy&#233;</li>
        </ul>
        
        <p>Reçu par JMRI en &#233;tat de programmation interne</p>
        <ul>
        <li>SSTAT</li>
        <li>PCVS</li>
        </ul>
        
        <p>
        <a href="https://github.com/JMRI/JMRI/blob/master/java/src/jmri/jmrix/can/cbus/CbusPowerManager.java"
        >CbusPowerManager.java</a>
        </p>

        <ul>
        <li>RTON - Message envoy&#233;</li>
        <li>RTOF - Message envoy&#233;</li>
        </ul>
        <p>Reçu par JMRI</p>
        <ul>
        <li>TON - Constant Listener</li>
        <li>TOF - Constant Listener</li>
        <li>ARST - Constant Listener</li>
        </ul>
        

        
        <p>
        <a href="https://github.com/JMRI/JMRI/blob/master/java/src/jmri/jmrix/can/cbus/CbusThrottle.java"
        >CbusThrottle.java</a>
        <a href="https://github.com/JMRI/JMRI/blob/master/java/src/jmri/jmrix/can/cbus/CbusThrottleManager.java"
        >CbusThrottleManager.java</a>
        </p>
        <p>Messages envoy&#233;s par JMRI</p>
        <ul>
        <li>RLOC - Envoy&#233; par JMRI</li>
        </ul>
        
        <p>Ecouteurs des messages envoy&#233;s par JMRI</p>
        <ul>
        <li>ESTOP - Constant Listener</li>
        <li>RESTP - Constant Listener</li>
        <li>KLOC - Constant Listener</li>
        </ul>
        <p>Ecouteurs des messages reçus par JMRI</p>
        <ul>
        <li>PLOC - Constant Listener</li>
        <li>ERR - Constant Listener + Erreurs traduites &#224; partir des codes d'erreur</li>
        <li>DSPD - Constant Listener</li>
        <li>DFUN - Constant Listener</li>
        <li>DFNON - Constant Listener</li>
        <li>DFNOF - Constant Listener</li>
        <li>ESTOP - Constant Listener</li>
        <li>RESTP - Constant Listener</li>
        </ul>
        
       </div>
       
      
     <h2>JMRI Aide</h2>
      <div>
      <p><a href="index.shtml">Page Principale d'Assistance JMRI CBUS MERGe</a>.</p>
      
      <p><a href="../scripting.shtml">Script JMRI</a> pour les trames CAN avec CanExample.py</p>
      
      <p><a href="index.shtml#thirdparty">Liens tiers du CBUS MERG</a> Voir le lien pour le guide des d&#233;veloppeurs du CBUS MERG</p>
      </div>
      
      <!--#include virtual="/Footer.shtml" -->
    </div><!-- closes #mainContent-->
  </div><!-- closes #mBody-->
</body>
</html>

        
