<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01//EN" "http://www.w3.org/TR/html4/strict.dtd">
<!-- Updated by Herv&#233; Blorec le 2013/09/25-->
<html lang="fr">
<head>
  <title>
 	JMRI: Consisting Tool
  </title>
  <meta name="author" content="Paul Bender">
  <meta name="keywords"
        content="hardware layout java model railroad JMRI CMRI decoderpro panelpro tools loconet lenz nce easydcc dcc nmra">

<!-- Style -->
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<link rel="stylesheet" type="text/css" href="/css/default.css" media="screen">
<link rel="stylesheet" type="text/css" href="/css/print.css" media="print">
<link rel="icon" href="/images/jmri.ico" type="image/png">
<link rel="home" title="Home" href="/">
<!-- /Style -->
</head>

<body>
<!--#include virtual="/Header" -->
<div id="mBody">
	<!--#include virtual="Sidebar" -->
	<div id="mainContent">
		<!-- Page Body -->

<h1>JMRI: Outil Couplage</h1>

<h2>Renseignements g&#233;n&#233;raux</h2>
	<p>
	Il y a trois types de couplage utilis&#233;s sur les syst&#232;mes DCC:
	</p>
		<ol>
		<li><p><i>basique</i> ou <i>adresse principale de couplage</i>. Dans ce
		type de couplage, &#224; chaque locomotive est attribu&#233;e la m&#234;me adresse sur
		la voie de programmation, ou sur la voie principale avec la programmation OpsMode
		(Si support&#233; par la centrale de commande et le d&#233;codeur). Vous pouvez
		soit utiliser une adresse longue (CV17 et CV18 et) ou courte (CV1) pour
		une adresse principale de couplage.</p>
		</li>
		<li>
		<p> Une Centrale de Commande &#224; Couplage Assist&#233; (CSAC). Une centrale de commande 
		&#224; couplage assist&#233;  est construite en utilisant une fonction de votre
		centrale de commande.</p>

		<p> Une centrale de commande &#224; couplage assist&#233; se trouve dans les noms commerciaux
		r&#233;pertori&#233;s dans le tableau ci-dessous. Le tableau indique &#233;galement les
		limites connues impos&#233;es par chaque fabricant.
		<table>
		<tr>
		<td>Fabricant</td>
		<td>Nom commercial</td>
		<td>Remarques sur l'utilisation</td>
		</tr>
		<tr>
			<td>Digitrax</td>
			<td>Couplage Universel</td>
			<td>Limit&#233; au nombre de slots pris en charge par le syst&#232;me.
			Permet que n'importe quelle adresse doit &#234;tre utilis&#233;e.</td>
		</tr>
		<tr>
			<td>Lenz</td>
			<td>Double Traction</td>
			<td>Limit&#233; &#224; 2 locomotives. Permet l'utilisation de n'importe quelle adresse sauf
			00.</td>
		</tr>
		<tr>
			<td>NCE</td>
			<td>Old Style couplage</td>
			<td>Limit&#233;  &#224; 8 locomotives. Permet n'importe quelle adresse sauf
			00.</td>
		</tr>
		<tr>
			<td>EasyDCC</td>
			<td>Couplage Standard</td>
			<td>Limit&#233; &#224; 8 locomotives. Permet  l'utilisation de n'importe quelle adresse sauf
			00.</td>
		</tr>
		</table>

		<p>
		Le trait commun partag&#233; par toutes les versions de CSAC est
		qu'une commande s&#233;par&#233;e de vitesse et d direction est envoy&#233;e
		&#224; la voie pour chaque Locomotive qui est dans la couplage.</p>
		</li>
		
		<li>
		<p>
		Un <i>D&#233;codeur Couplage Assist&#233;</i> (CAD), qui est &#233;galement
 		souvent r&#233;f&#233;renc&#233; comme un <i>Couplage Avanc&#233;</i>.
		</p>
		<p>
		Le NMRA a mis de c&#244;t&#233; le CV19 comme un lieu d&#233;di&#233; aux adresses de couplage.

		</p>
		<p>
		Si CV19 contient une valeur autre que 0, la locomotive
		r&#233;agira  aux instructions de vitesse et de direction contenues &#224; l'
		adresse dans CV19. Sinon, elle  r&#233;pondra &#224; la vitesse et et commande de direction 
		envoy&#233;es sur l'adresse courte ou longue habituelle.
		</p>
		<p>
		Comme l'adresse de couplage est un CV unique, elle est limit&#233;e
		&#224; la gamme de 1 &#224; 127. Si vous ajoutez 128 &#224; l'
		adresse de couplage, la locomotive sera ex&#233;cut&#233;e en arri&#232;re (par rapport 
		au sens normal de d&#233;placement) dans les couplage.
		</p>
		<p>
		Pour la plupart des d&#233;codeurs, ce type de couplage peut se faire par
		op&#233;rations de programmation de la m&#234;me mani&#232;re que le Couplage basique
		peut &#234;tre constitu&#233;. Nous le disons plus ici parce que certains d&#233;codeurs
		bloc &#233;crit &#224; toute adresse de CV en utilisant le mode des op&#233;rations
		programmation.
		</p>
		<p>
		Le NMRA a &#233;galement mis de c&#244;t&#233; une commande sp&#233;ciale pour mettre en place un
		D&#233;codeur &#224; Couplage Assist&#233; sur la voie principale. Cette commande
		devrait &#234;tre accept&#233;e par tous les d&#233;codeurs qui supportent le D&#233;codeur &#224;
		Couplage Assist&#233;.
		</p>
		<p>
		L'avantage de DCA, comparativement aux CSAC est que seulement
		une commande de  vitesse et de direction est envoy&#233;e &#224; l'ensemble 
		du couplage.
		</p>
		<p>
		Par d&#233;faut, les locomotives dans un DCA ignore les commandes de fonction
		envoy&#233;es &#224; l'adresse couplage. Vous pouvez configurer certains d&#233;codeurs
		afin qu'ils r&#233;pondent aux commandes de la fonction d&#233;livr&#233;e &#224;
		l'adresse de couplage ainsi (par CVS 21 et 22). Si
		pris en charge par le d&#233;codeur, les valeurs appropri&#233;es peuvent &#233;galement
		&#234;tre configur&#233;es par DecoderPro en utilisant l'onglet Couplage
		dans le programmateur complet.
		</p>
		<p>
		Une note finale, le Couplage Avanc&#233; fonctionner en 28 crans de vitesse
		(Toujours). Vous pouvez avoir besoin de vous assurer que votre r&#233;gulateur envoie bien
		28 crans de vitesse &#224; l'adresse pour &#233;viter le clignotement 
		des feux.
		</p>
		</li>
		</ol>

	<h3>Support Couplage dans JMRI.</h3>
	<p>
		JMRI fournit un support pour les couplages utilisant l'outil couplage,
		qui est accessible via le menu outils de toute 
		application JMRI.
		( Il y a aussi un 
		<a href="../../../package/jmri/jmrix/nce/consist/NceConsistEditFrame.shtml">outil couplage NCE-sp&#233;cifiques </a>
		qui fonctionne un peu diff&#233;remment de l'outil d&#233;crit ici ).
	</p>
	<p>
		L'outil Couplage fournit  un outil visuel permettant de manipuler les
		D&#233;codeur &#224; Couplage Assist&#233;e et, sur certaines centrales de commande,
		Centrale de Commande &#224; Couplage Assist&#233;e.
	</p>
	<p>
		La sauvegarde de l'outil de couplage est un gestionnaire de couplage. Le gestionnaire de couplage
		est responsable du maintien de l'information sur les couplages
		existants et pour communiquer les informations n&#233;cessaires
 		entre l'outil couplage et la centrale de commande.
	</p>

	<b>Gestionnaires de Couplage disponibles</b>
		<ul>
		<li>
			<p>
				Le <i>Gestionnaire G&#233;n&#233;rique de Couplage</i> est utilis&#233; sur n'importe quel syst&#232;me
				qui n'a pas son propre gestionnaire couplage, mais supporte la 
				programmation en mode exploitation. Ce gestionnaire est seulement
				en mesure de manipuler le D&#233;codeur Couplage Assist&#233;.
			</p>
			<p>
				Le <i>Gestionnaire G&#233;n&#233;rique de Couplage contourne toutes les routines que la
				centrale de commande doit d&#233;finir  pour l'adresse couplage.</i> 
				L'importance de cela est que si votre centrale de commande fournit un
				m&#233;thode pour faire fonctionner un couplage en s&#233;lectionnant une locomotive par
				son adresse, &#231;a ne fonctionnera pas. Vous aurez besoin d'utiliser l'identifiant de
 				l'adresse courte  que vous avez s&#233;lectionn&#233;e pour le ID couplage
				pour contr&#244;ler la vitesse et la direction du couplage.
			</p>
		</li>
		<li>
			<p>
				Le <i>Gestionnaire de Couplage XPressNet</i> utilise le support fournit
				par les syst&#232;mes Bas&#233;s XPressNet pour manipuler les couplages. Ce
				gestionnaire de couplage est capable de construire une "Double Traction" Lenz
				en plus des Couplage Avanc&#233;.
			</p>
			<p>
				Puisque ce gestionnaire utilise les instructions de cr&#233;ation de 
				couplage fournies par le protocole XPressNet, le dispositif 
				Lenz de <i>Couplage Intelligent</i> fonctionne avec les couplages cr&#233;&#233;s
				par l'outil. Sur les syst&#232;mes Lenz, <i>Couplage Intelligent</i>
				renvoie &#224; la capacit&#233; d'&#234;tre en mesure d'ex&#233;cuter un couplage &#224; partir de <i>toutes</i>
				les adresses de locomotive coupl&#233;es ou depuis les adresse 
				de couplage.
			</p>
			<p>
				Le Gestionnaire de Couplage XPressNet est capable de lire les
				informations de couplage de la centrale de commande, tant pour le Couplage Avanc&#233;e  que
				pour les Doubles Tractions Lenz .
			</p>
		</li>
		<li>
			<p>
				Le <i>Gestionnaire de Couplage EasyDCC </i> utilise le support fournit 
				par le syst&#232;me EasyDCC CVP pour manipuler des couplage. Ce gestionnaire de
				couplage est capable de construire un "Couplage Standard" EasyDCC 
				en plus du Couplage Avanc&#233;.
			</p>
			<p>
				CVP ne fournit pas une m&#233;thode pour construire des Couplages Avanc&#233;es
				En cons&#233;quence, les couplage avanc&#233;s sont cr&#233;&#233;s en contournant la
				centrale de commande. Contrairement au Gestionnaire G&#233;n&#233;rique de Couplage, le 
				Gestionnaire de Couplage EasyDCC  cr&#233;e ces couplage en &#233;mettant un
				paquets  de Commande de couplage  sur  la voie. Cela permet l'inclusion de
				locomotives qui ne permettent pas l'&#233;criture en utilisant CV19 en
				mode de programmation Ops. Comme avec le Gestionnaire G&#233;n&#233;rique de Couplage, 
				vous devez utiliser l'adresse courte s&#233;lectionn&#233;e comme Adresse de couplage pour 
				contr&#244;ler le couplage.
			<p>
 				Pour le Couplage Standard EasyDCC, il y a un couple de restrictions 
				impos&#233;es par le Protocole EasyDCC. Premi&#232;rement, comme avec les couplage cr&#233;&#233;s 
				directement par la centrale de commande , ces couplage sont limit&#233;s &#224; 8
				adresses. Deuxi&#232;mement, contrairement au couplage cr&#233;&#233; par la centrale de commande 
				directement,  CVP limite les adresses des couplages standard &#224; des adresse
				entre 1 et 255.
			</p>
			<p>
				Le Gestionnaire de Couplage EasyDCC lira les Informations Standards de Couplage 
				dans la gamme autoris&#233;e (1-255) de la m&#233;moire de la centrale de commande.
				Puisque la centrale de commande  est contourn&#233;e pour cr&#233;er des
				Couplages Avanc&#233;s, ceux-ci ne peuvent &#234;tre lues &#224; partir de la centrale de commande.
		</li>
		</ul>

	<a name="tool"></a>
	<h2> Utilisation de l'Outil couplage </h2>
	<p>
	Lorsque vous ouvrez l'outil couplage, vous verrez un &#233;cran semblable au suivant:
	</p>
	<img src="images/ConsistTool.jpg" alt="Blank Consit Tool">
	<p>
	sur la rang&#233;e sup&#233;rieure sont utilis&#233;s pour choisir entre un Couplage Avanc&#233; 
	( D&#233;codeur Assist&#233; )  et une Centrale de Commande à Couplage Assisté. 
	Si les Centrales de Commande  &#224; Couplage Assist&#233; ne sont pas
	prises en charge par l'outil de votre syst&#232;me, ces s&#233;lections seront
	gris&#233;es.
	</p>
	<p>
	La case &#224; c&#244;t&#233; de l'&#233;tiquette  <b>Couplage:</b> est utilis&#233;e pour sp&#233;cifier 
	l'ID  du couplage. Pour les D&#233;codeur &#224; Couplage Assist&#233;, ce devrait &#234;tre l'
	adresse courte  qui doit &#234;tre utilis&#233;e pour identifier les couplage. Pour les Centrale de 
	Commande &#224; Couplage Assist&#233;, , cette valeur peut &#234;tre automatiquement
	rempli avec l'adresse Locomotive de t&#234;te quand vous essayez de l'ajouter
	dans le couplage.
	</p>
	<p>
	L'ajout d'une ID typique pour un d D&#233;codeur &#224; Couplage Assist&#233; devrait ressembler
	&#224; ce qui suit:
	</p>
	<img src="images/ConsistTool-IDAdded.jpg" alt="Consist Tool-ID Added">
	<p>
	La deuxi&#232;me ligne de l'outil couplage est utilis&#233; pour ajouter des Locomotives.
	Une Locomotive peut &#234;tre ajout&#233;e soit en entrant son num&#233;ro dans le
	case &#224; c&#244;t&#233; de la <b> nouvelle Locomotive</b> ou en s&#233;lectionnant son num&#233;ro &#224;
	partir de la liste d&#233;roulante.
 	</p>
	<img src="images/ConsistTool-LeadLoco.jpg" alt="Lead Locomotive Selected">
	<p>
	Cliquer sur le bouton <b>ajouter</b> va ajouter une locomotive au
	couplage, et elle appara&#238;tra dans la liste ci-dessous &#224; la deuxi&#232;me ligne.
	</p>
	<img src="images/ConsistTool-LeadLocoAdded.jpg" alt="Lead Locomotive Added to Consist ">
	<p>
	Cliquer sur le bouton <b>r&#233;initialiser</b> effacera l'information pour
	cette locomotive.
	</p>
	<p>
	La case <b>Direction Normale</b> est utilis&#233;e pour si
	une Locomotive circule en avant ou en inverse quand le 
	couplage est  en avant.
	</p>
	<p>
	Vous remarquerez &#224; partir des captures d'&#233;cran pr&#233;c&#233;dentes que cette case est
	gris&#233;e jusqu'&#224; ce qu'une Locomotive de t&#234;te soit choisie. Avec les 
	Locomotives ult&#233;rieures, vous pouvez cocher cette case pour indiquer la
	direction de la locomotive par rapport &#224; la Locomotive de t&#234;te.
	</p>
	<img src="images/ConsistTool-SecondLoco.jpg" alt="Second LocoMotive Selected - Direction Reversed">
	<p>
 	Apr&#232;s l'ajout de la seconde Locomotive au couplage, avec le
	sens inverse, vous devriez voir quelque chose comme ce qui suit:
	</p>
	<img src="images/ConsistTool-SecondLocoAdded.jpg" alt="Second Locomotive Added">
	<p>
	Si vous faites une erreur, et ajouter une seconde Locomotive au
	couplage avec la mauvaise direction, vous pouvez changer sa direction
	simplement en cliquant sur la case &#224; cocher dans la colonne Direction Normale.
	</p>
	<img src="images/ConsistTool-SecondLocoDirChange.jpg" alt="Second Locomotive-Direction Change">
	<p>
	La direction de la Locomotive de t&#234;te ne peut pas &#234;tre chang&#233;e une fois
	ajout&#233;e.
	</p>
	<p>
	Pour supprimer une Locomotive individuelle du couplage, vous pouvez
	s&#233;lectionner le bouton <b>Eff</b> dans la colonne la plus &#224; droite de la
	ligne appropri&#233;e du tableau d'adresses.
	</p>
	<p>
	Pour supprimer un couplage entier, vous pouvez utiliser la commande <b>Supprimer</b>
	au bas de l'&#233;cran.
	</p>
	<p>
	Le bouton r&#233;gulateur au bas de l'&#233;cran peut &#234;tre utilis&#233; pour
	mettre en place un r&#233;gulateur JMRI pour cette adresse.
	</p>
	<p>
	Pour ajouter un nouveau couplage, vous pouvez s&#233;lectionner l'entr&#233;e vide dans la 
	liste d&#233;roulante &#224; c&#244;t&#233; de l'actuel ID de couplage .
	</p>
	<img src="images/ConsistTool-NewConsist.jpg" alt="Select new Consist">
	<p>
	Pour rappeler un existantes couplage, vous pouvez s&#233;lectionner l'entr&#233;e 
	appropri&#233;e de la bo&#238;te d&#233;roulante &#224; c&#244;t&#233; de l'actuel ID de couplage 
	</p>
	<img src="images/ConsistTool-SelectConsist.jpg" alt="Select &#224; Consist">

<!--#include virtual="/Footer" -->
    </div><!-- closes #mainContent-->
  </div> <!-- closes #mBody-->
</body>
</html>
