<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01//EN" "http://www.w3.org/TR/html4/strict.dtd">
<!-- Updated by Herv&#233; Blorec le 2013/09/25-->
<html lang="fr">
<head>
  <title>
 	JMRI: Consisting Tool
  </title>
  <meta content="Paul Bender" name="Author">
  <meta name="keywords"
        content="hardware layout java model railroad JMRI CMRI decoderpro panelpro tools loconet lenz nce easydcc dcc nmra">

<!-- Style -->
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<link rel="stylesheet" type="text/css" href="/css/default.css" media="screen">
<link rel="stylesheet" type="text/css" href="/css/print.css" media="print">
<link rel="icon" href="/images/jmri.ico" type="image/png">
<link rel="home" title="Home" href="/">
<!-- /Style -->
</head>

<body>
<!--#include virtual="/Header.SHTML" -->
<!--#include virtual="Sidebar" -->
<div id="mainContent">
<H1> JMRI: Outil Couplage </H1>

<h2>Renseignements g&#233;n&#233;raux</H2>
	<p>
	Il y a trois types de couplage utilis&#233;s sur les syst&#232;mes DCC:
	</P>
		<ol>
		<li><p <i>basique</i> ou <i>adresse principale de couplage</i>. Dans ce
		type de couplage, &#224; chaque locomotive est attribu&#233;e la m&#234;me adresse sur
		la voie de programmation, ou sur la voie principale avec la programmation OpsMode
		(Si support&#233; par la centrale de commande et le d&#233;codeur). Vous pouvez
		soit utiliser une adresse longue (CV17 et CV18 et) ou courte (CV1) pour
		une adresse principale de couplage.</p>
		</Li>
		<li>
		<p> Une Centrale de Commande &#224; Couplage Assist&#233; (CSAC). Une centrale de commande 
		&#224; couplage assist&#233;  est construite en utilisant une fonction de votre
		centrale de commande.</p>

		<p> Une centrale de commande &#224; couplage assist&#233; se trouve dans les noms commerciaux
		r&#233;pertori&#233;s dans le tableau ci-dessous. Le tableau indique &#233;galement les
		limites connues impos&#233;es par chaque fabricant.
		<table>couplage
		<tr>
		<td>Fabricant</td>
		<td>Nom commercial</td>
		<td>Remarques sur l'utilisation</td>
		</Tr>
		<tr>
			<td>Digitrax</td>
			<td>Couplage Universel</td>
			<td>Limit&#233; au nombre de slots pris en charge par le syst&#232;me.
			Permet que n'importe quelle adresse doit &#234;tre utilis&#233;e.</Td>
		</Tr>
		<tr>
			<td>Lenz</td>
			<td>Double Traction</td>
			<td>Limit&#233; &#224; 2 locomotives. Permet l'utilisation de n'importe quelle adresse sauf
			00.</Td>
		</Tr>
		<tr>
			<td>NCE</td>
			<td>Old Style couplage</td>
			<td>Limit&#233;  &#224; 8 locomotives. Permet n'importe quelle adresse sauf
			00.</Td>
		</Tr>
		<tr>
			<td>EasyDCC</td>
			<td>Couplage Standard</td>
			<td>Limit&#233; &#224; 8 locomotives. Permet  l'utilisation de n'importe quelle adresse sauf
			00.</Td>
		<tr>
		</Table>

		<p>
		Le trait commun partag&#233; par toutes les versions de CSAC est
		qu'une commande s&#233;par&#233;e de vitesse et d direction est envoy&#233;e
		&#224; la voie pour chaque Locomotive qui est dans la couplage.
		</P>
		</Li>
		
		<li>
		<p>
		Un <i>D&#233;codeur Couplage Assist&#233;</i> (CAD), qui est &#233;galement
 		souvent r&#233;f&#233;renc&#233; comme un <i>Couplage Avanc&#233;</i>.
		</P>
		<p>
		Le NMRA a mis de c&#244;t&#233; le CV19 comme un lieu d&#233;di&#233; aux adresses de couplage.

		</P>
		<p>
		Si CV19 contient une valeur autre que 0, la locomotive
		r&#233;agira  aux instructions de vitesse et de direction contenues &#224; l'
		adresse dans CV19. Sinon, elle  r&#233;pondra &#224; la vitesse et et commande de direction 
		envoy&#233;es sur l'adresse courte ou longue habituelle.
		</P>
		<p>
		Comme l'adresse de couplage est un CV unique, elle est limit&#233;e
		&#224; la gamme de 1 &#224; 127. Si vous ajoutez 128 &#224; l'
		adresse de couplage, la locomotive sera ex&#233;cut&#233;e en arri&#232;re (par rapport 
		au sens normal de d&#233;placement) dans les couplage.
		</P>
		<p>
		Pour la plupart des d&#233;codeurs, ce type de couplage peut se faire par
		op&#233;rations de programmation de la m&#234;me mani&#232;re que le Couplage basique
		peut &#234;tre constitu&#233;. Nous le disons plus ici parce que certains d&#233;codeurs
		bloc &#233;crit &#224; toute adresse de CV en utilisant le mode des op&#233;rations
		programmation.
		</P>
		<p>
		Le NMRA a &#233;galement mis de c&#244;t&#233; une commande sp&#233;ciale pour mettre en place un
		D&#233;codeur &#224; Couplage Assist&#233; sur la voie principale. Cette commande
		devrait &#234;tre accept&#233;e par tous les d&#233;codeurs qui supportent le D&#233;codeur &#224;
		Couplage Assist&#233;.
		</P>
		<p>
		L'avantage de DCA, comparativement aux CSAC est que seulement
		une commande de  vitesse et de direction est envoy&#233;e &#224; l'ensemble 
		du couplage.
		</p>
		<p>
		Par d&#233;faut, les locomotives dans un DCA ignore les commandes de fonction
		envoy&#233;es &#224; l'adresse couplage. Vous pouvez configurer certains d&#233;codeurs
		afin qu'ils r&#233;pondent aux commandes de la fonction d&#233;livr&#233;e &#224;
		l'adresse de couplage ainsi (par CVS 21 et 22). Si
		pris en charge par le d&#233;codeur, les valeurs appropri&#233;es peuvent &#233;galement
		&#234;tre configur&#233;es par DecoderPro en utilisant l'onglet Couplage
		dans le programmateur complet.
		</P>
		<p>
		Une note finale, le Couplage Avanc&#233; fonctionner en 28 crans de vitesse
		(Toujours). Vous pouvez avoir besoin de vous assurer que votre r&#233;gulateur envoie bien
		28 crans de vitesse &#224; l'adresse pour &#233;viter le clignotement 
		des feux.
		</P>
		</Li>
		</ol>

	<h3>Support Couplage dans JMRI.</H3>
	<p>
		JMRI fournit un support pour les couplages utilisant l'outil couplage,
		qui est accessible via le menu outils de toute 
		application JMRI.
		( Il y a aussi un 
		<a  href="../../../package/jmri/jmrix/nce/consist/NceConsistEditFrame.shtml">outil couplage NCE-sp&#233;cifiques </a> 
		qui fonctionne un peu diff&#233;remment de l'outil d&#233;crit ici ).
	</P>
	<p>
		L'outil Couplage fournit  un outil visuel permettant de manipuler les
		D&#233;codeur &#224; Couplage Assist&#233;e et, sur certaines centrales de commande,
		Centrale de Commande &#224; Couplage Assist&#233;e.
	</P>
	<p>
		La sauvegarde de l'outil de couplage est un gestionnaire de couplage. Le gestionnaire de couplage
		est responsable du maintien de l'information sur les couplages
		existants et pour communiquer les informations n&#233;cessaires
 		entre l'outil couplage et la centrale de commande.
	</P>

	<h4>Gestionnaires de Couplage disponibles</h4>
		<ul>
		<li>
		      Les <i>Gestionnaires G&#233;n&#233;riques de Couplage </i> sont utilis&#233;s sur tout syst&#232;me 
		      qui n'a pas son propre gestionnaire de couplage, mais qui supporte soit la 
		      programmation en mode ops, soit l'envoi de paquets DCC bruts.

                    <br>
                      Il y a deux gestionnaires g&#233;n&#233;riques de couplage ,  l'un utilise la 
                      programmation en mode ops pour modifier la CV19, et 
                      l'autre envoie un paquet DCC sp&#233;cial pour modifier le CV19. La version 
                      utilis&#233;e d&#233;pend de l'assistance fournie par le syst&#232;me associ&#233; 
                      et ne peut &#234;tre s&#233;lectionn&#233;e par l'utilisateur..

                   <br>
                       Les Gestionnaires de Couplages G&#233;n&#233;riques ne peuvent 
                       manipuler que les D&#233;codeur de Couplages Assist&#233;s.
r.

		   <br>
		      <i>Le Gestionnaire de Couplage G&#233;n&#233;rique contourne toutes les routines
		       dont dispose la centrale pour d&#233;finir l'adresse de composition. </i> Il est 
		       important de noter que si vocentrale vous fournit une 
		       m&#233;thode pour ex&#233;cuter un couplage en s&#233;lectionnant une locomotive par 
		       son adresse, cela ne fonctionnera pas. Vous devrez utiliser 
		       l'identifiant d'adresse courte que vous avez s&#233;lectionn&#233; pour l'ID 
		       de groupe pour contr&#244;ler la vitesse et la direction du groupe.


		</li>
		<li>
		  Le <i>Le Gestionnaire de Couplage XPressNet</i>  utilise le support 
		  fourni par les syst&#232;mes Bas&#233;s sur XPressNet pour manipuler les Couplages..  Ce 
		      gestionnaire de couplage est capable de construire un "Double Header" de Lenz 
		      en plus des Couplages avanc&#233;s.
		   <br>
		      Comme ce gestionnaire de couplage utilise les instructions de cr&#233;ation 
		      de couplage fournies par le protocole XPressNet, la Fonction 
		      <i>Smart Consisting</i> de Lenz Fonctionne avec les Couplages cr&#233;&#233;es 
		      par l'outil. Sur les syst&#232;mes Lenz, <i>Smart Consisting</i> signifie 
		      que l'on peut ex&#233;cuter un groupe de traction &#224; partir de <i>n'importe 
		      quelle</i> adresse de locomotive ou de l'adresse de groupe de traction.
		   <br>
		      Le gestionnaire de couplage XPressNet est capable de lire les
		      informations de couplage de la centrale, tant pour les Couplages avanc&#233;s 
		      et Double Header Lenz.
		</li>
		<li>
		  Le <i>Gestionnaire de Couplage EasyDCC</i> utilise le support fourni 
		      par le syst&#232;me EasyDCC du CVP pour manipuler les couplages.  Ce 
		      gestionnaire de Ccouplage est capable de construire des "Couplages Standards" EasyDCC . 
		      en plus des Couplages Avanc&#233;s.
		   <br>
		      Le CVP ne fournit pas de m&#233;thode pour construire des Couplages Avanc&#233;s.  
		      Par cons&#233;quent, les Couplages Avanc&#233;es sont cr&#233;&#233;es en contournant la
		      centrale. Contrairement au gestionnaire du couplage g&#233;n&#233;rique, le 
		      Gestionnaire de Couplage EasyDCC les cr&#233;e en envoyant un paquet 
		      de couplage &#224; la voie.  Cela permet d'inclure des locomotives 
		      qui ne permettent pas d'&#233;crire des CV19 en utilisant la 
		      programmation en mode exploitation.  Cela permet d'inclure 
		      Les locomotives qui ne permettent pas d'&#233;crire le CV19 en utilisant 
		      programmation en mode d'exploitation.  Comme pour le Gestionnaire 
		      de Couplage Generique, vous devez utiliser l'adresse courte choisie 
		      adresse de couplage pour contr&#244;ler le couplage
		   <br>
		      Pour les "Couplages Standards" EasyDCC , il existe quelques restrictions
		      impos&#233;e par le protocole EasyDCC. Tout d'abord, comme pour le couplage 
		      cr&#233;&#233; directement avec le poste de commande, les couplages sont 
		      limit&#233;s &#224; 8 adresses.   Deuxi&#232;mement, contrairement aux couplages 
		      cr&#233;&#233;s directement sur la centrale
		      , le CVP limite l'adresse de couplage standard aux adresses 
		      entre 1 et 255.
		   <br>
		      Le gestionnaire de couplage EasyDCC lira les informations de 
		      Couplage Standard ou couplage dans la plage autoris&#233;e (1-255) 
		      de la m&#233;moire dde la centrale..  Comme la centrale est contourn&#233;e pour cr&#233;er
		      Les Couplages Avanc&#233;s, ils ne peuvent pas &#234;tre lus depuis la centrale.
		</li>
                <li>
		      Le <i>gestionnaire de couplage interne</i> est un couplage sp&#233;ciale 
                      associ&#233; au syst&#232;me interne de JMRI.  Il 
                      fonctionne comme les <i>Gestionnaires de Couplages G&#233;n&#233;rique</i>, mais 
                      il s'agit d'une option s&#233;lectionnable par l'utilisateur, de sorte que 
                      les utilisateurs peuvent choisir de contourner un gestionnaire de 
                      couplage sp&#233;cifique au syst&#232;me..
                </li>
		</ul>

	<h4>S&#233;lection d'un  gestionnaire de couplage</h4>

        <p>
        Pour s&#233;lectionner le  gestionnaire de couplage utilis&#233;, nous devons d'abord ouvrir l'onglet des valeurs par d&#233;faut dans les pr&#233;f&#233;rences. 
        </p>

	<img src="images/Preferences-ConsistManagerSelection-Annotated.png" alt="Fen&#234;tre des pr&#233;f&#233;rences utilisateur annot&#233;es" />

        <p>
        Une fois que les pr&#233;f&#233;rences sont charg&#233;es, les choix pour le  gestionnaire 
        de couplage seront s&#233;lectionnables dans la colonne "Couplage".
		(&#224; l'int&#233;rieur de la bo&#238;te marqu&#233;e 1 dans la figure ci-dessus).  Nous 
		voyons ici deux choix, l'un pour une connexion LocoNet, &#233;tiquet&#233; A
		et une pour la connexion interne, intitul&#233;e B.<br>
		Si vous disposez d'un plus grand nombre de connexions au syst&#232;me, 
		d'autres options peuvent &#233;galement &#234;tre disponibles.
        </p>


        <p>
        Si vous choisissez l'option A, vous choisissez alors d'utiliser le gestionnaire de couplage 
        associ&#233; au syst&#232;me.  Il s'agira soit d'un gestionnaire de couplage 
        sp&#233;cifique au syst&#232;me, soit l'un des gestionnaires du couplage g&#233;n&#233;rique, selon
        sur le support du syst&#232;me.
        </p>
        
        <p>
        Si vous choisissez l'option B, alors le <i> gestionnaire du couplage interne</i> 
        est utilis&#233;.  Dans ce cas, si une s&#233;lection est faite dans la colonne "Centrale" (dans la case 2 de la figure)
        alors le couplage sera cr&#233;&#233; sur le syst&#232;me avec la centrale s&#233;lectionn&#233;e.
        Cette s&#233;lection entra&#238;nera la cr&#233;ation de couplage &#224; l'aide d'un 
        paquet DCC sp&#233;cial pour la cr&#233;ation de couplages.
        </p>

        <p>
        Si vous choisissez l'option B et qu'il n'y a pas de s&#233;lection pour le poste de commandement,
        Le couplage sera cr&#233;&#233; sur le syst&#232;me avec un programmeur en mode op&#233;ratoire 
        s&#233;lectionn&#233; dans la colonne 3.  Cette s&#233;lection entra&#238;nera la cr&#233;ation de couples
        en utilisant le mode de programmation des op&#233;rations.  Notez que si le syst&#232;me interne 
        est s&#233;lectionn&#233; dans ce cas, aucun couplage ne sera cr&#233;&#233;.
        </p>

	<h4>Couplage et Inventaires JMRI</h4>

        <p>
        Les utilisateurs de JMRI cr&#233;ent parfois des couplages avanc&#233;s en utilisant le programmeur pour 
        fixer la valeur de CV19.  &#192; partir de la version 4.17.3 de  JMRI, les 
        couplages  JMRI fournissent certains outils permettant de synchroniser les 
        couplages avanc&#233;s cr&#233;&#233;s par la programmation 
        </p>

        <h5>Importation depuis l'Inventairee</h5>

        <p>
        Les utilisateurs peuvent importer les couplages cr&#233;&#233;es avec le programmeur dans le 
        Gestionnaire de couplage en s&#233;lectionnant le <i>Scan Inventaire pour Couplages</i> 
        dans le menu <i>Fichier</i> du contr&#244;le de couplage.
        </p>

	    <img src="images/ConsistTool-ScanForConsists.png" alt="L'option Scan For Consists est un choix dans le menu fichier de la fen&#234;tre de contr&#244;le du couplage" />

        <p>
        Une fois l'analyse termin&#233;e, tout couplage d&#233;couvert sera ajout&#233; &#224; la
        liste des couplages &#224; la disposition &#224; la Commande Couplage.  Veuillez noter que 
        cet outil n'&#233;crit pas le couplage dans le syst&#232;me DCC.
        </p>

        <h5>Synchronisation de l'Inventaire</h5>
        <p>
        Les utilisateurs peuvent choisir de faire figurer les mises &#224; jour des informations de couplage JMRI dans leur Inventaire
        lors de la cr&#233;ation et du retrait de locomotives des Couplages Avanc&#233;s.  Cette 
        option est activ&#233;e en cochant la case <i>Mettre &#224; jour le CV19 dans la liste lors de la
        modification des couplages avanc&#233;es</i> dans la section <i>Commande de couplage</i> 
         des pr&#233;f&#233;rences de JMRI.
        </p>

	    <img src="images/ConsistControl-Preferences.png" alt="Pr&#233;f&#233;rences pour le contr&#244;le du couplage" />

        <p>
        Le choix de cette option peut avoir une incidence sur les performances lors de la modification de l'inventaire
        en raison de la lecture et de l'&#233;criture du fichier roster.  Cette option est
        d&#233;sactiv&#233;e par d&#233;faut.
        </p>

	<a name="tool" id="tool">
	</a><h2>Utilisation de l'outil de couplage</h2>
	<p>
	Vous trouvez cet outil
	<ul>
		<li>dans DecoderPro : dans le menu Actions</li>
		<li>dans PanelPro : dans le menu Outils</li>
	</ul>

	<p> Lorsque vous ouvrez l'outil de couplage pour la premi&#232;re fois, vous verrez un &#233;cran similaire &#224; celui qui suit :
	</p>

	<img src="images/ConsistTool.png" alt="Outil de couplage vierge"
		 height="251" width="725"/>
	<p>
	Les boutons radio de la rang&#233;e sup&#233;rieure permettent de choisir entre une version avanc&#233;e (ou
	   D&#233;codeur assist&#233;) couplage et une centrale avec Couplage Assist&#233;. Si le couplage assist&#233; de la centrale n'est pas
	   support&#233;es par l'outil pour votre syst&#232;me, ces s&#233;lections seront 
	   gris&#233;.
	</p>
	<p>
	   La case situ&#233;e &#224; c&#244;t&#233; de l'&#233;tiquette <b>Couplage:</b> vous permet de saisir l'ID
		du couplage.  Pour <i>Decodeur &#224; Couplages Assist&#233;s</i>, ce doit &#234;tre l'
	   adresse courte qui doit &#234;tre utilis&#233;e pour identifier le couplage.  Pour  
	    le Couplage assist&#233; par la centrale, cette valeur peut &#234;tre automatiquement 
	   compl&#233;t&#233;e par l'adresse de la locomotive de t&#234;te lorsque vous essayez de l'ajouter 
	   au couplage.
		<br>
		Pour pr&#233;ciser comment vous souhaitez utiliser une adresse de 1 &#224; 127
		(sauf 3) qui peuvent &#234;tre courts ou longs, utilisez la liste d&#233;roulante
		&#224; c&#244;t&#233; du champ de texte du couplage pour s&#233;lectionner votre choix :
	</p>
		<img src="images/ConsistTool-AddressType.png" alt="Outil de couplage - ID ajout&#233;"
			 height="74" width="235"/>
	<p>
	   La d&#233;finition d'un identifiant type pour un d&#233;codeur &#224; couplage assist&#233; devrait maintenant ressembler &#224;
	   ceci :
	</p>
	<img src="images/ConsistTool-IDAdded.png" alt="Outil de couplage - ID ajout&#233;"
		 height="75" width="726"/>
	<p>
	La deuxi&#232;me ligne de l'outil de couplage est utilis&#233;e pour ajouter des locomotives
		&#224; votre couplage.
	   Une locomotive peut &#234;tre ajout&#233;e soit en entrant son num&#233;ro dans le 
	   case &#224; c&#244;t&#233; de <b>Nouvelle locomotive</b> :
	</p>
	   <img src="images/ConsistTool-LeadLoco.png" alt="Saisir l'adresse de la locomotive de t&#234;te"
			height="60" width="722"/>
	<p>soit en s&#233;lectionnant son num&#233;ro dans le menu d&#233;roulant de l'inventaire :
	</p>
		<img src="images/ConsistTool-PickLoco.png" alt="Select Lead Locomotive"
			 height="77" width="725"/>
	<p>
	  En cliquant sur le bouton <b>Add</b>, la locomotive sera ajout&#233;e &#224; la
	  Couplage, et il appara&#238;tra dans la liste sous la deuxi&#232;me ligne :
	</p>
	  <img src="images/ConsistTool-LeadLocoAdded.png" alt="Ajout d'une locomotive de t&#234;te au couplage".
		   height="72" width="723"/>
	<p>
	  En cliquant sur le bouton <b>R&#233;initialiser</b>, les informations de la ligne d'entr&#233;e Nouvelle Loco seront effac&#233;es.
	</p>
	<p>
	   <img src="images/ConsistTool-Reverse1.png" alt="Case &#224; cocher direction normale (ou invers&#233;e)"
		height="125" width="457" align="right">
	   La case &#224; cocher <b>Direction Normal</b> permet &#224; l'utilisateur de pr&#233;ciser si
	   la nouvelle locomotive circule en marche avant ou en marche arri&#232;re lorsque
	   Le couplage va de l'avant.
	<br>
	   Vous pouvez remarquer, d'apr&#232;s les captures d'&#233;cran pr&#233;c&#233;dentes, que cette case est 
	   gris&#233; jusqu'&#224; ce qu'une locomotive de t&#234;te soit s&#233;lectionn&#233;e.  Lors de l'ajout de
	   locomotives suivantes, vous pouvez (d&#233;)cocher cette case pour indiquer
	   la direction de chaque nouvelle locomotive par rapport &#224; la locomotive de t&#234;te.
	<br>
	   Apr&#232;s avoir ajout&#233; une deuxi&#232;me locomotive au couplage, avec 
	   la direction invers&#233;e, vous devriez voir quelque chose comme ce qui suit :
	</p>
	   <img src="images/ConsistTool-SecondLocoAdded.png" alt="Deuxi&#232;me locomotive ajout&#233;e"
			height="251" width="726"/>
	<p>
	   Si vous avez fait une erreur, et ajoutez une deuxi&#232;me locomotive au
	   Couplage avec la mauvaise direction , vous pouvez changer sa direction
	   en cliquant simplement sur la case &#224; cocher dans la colonne Direction normale.
	<br>
	   La direction de la premi&#232;re locomotive (de t&#234;te) ne peut &#234;tre modifi&#233;e une fois
	   ajout&#233;.
	</p>
	<p>
	   Pour supprimer une locomotive individuelle du couplage, vous pouvez
	   s&#233;lectionnez le bouton <b>Supprimer</b> dans la colonne la plus 
	   &#224; droite de la ligne appropri&#233;e du tableau des adresses.
	</p>
	<p>
	   Pour supprimer un couplage entier, vous pouvez utiliser la fonction <b>Supprimer</b>.
	   au bas de l'&#233;cran.
	</p>
	<p>
	   Le bouton "R&#233;gulateur" en bas de l'&#233;cran peut &#234;tre utilis&#233; pour
	   mettre en place un R&#233;gulateur JMRI pour cette adresse de couplage.
	</p>
	<p>
	   Pour ajouter un nouveau couplage, s&#233;lectionnez la premi&#232;re entr&#233;e vide
	   &#224; c&#244;t&#233; de l'identifiant du couplage en cours :
	</p>
	<img src="images/ConsistTool-NewConsist.png" alt="S&#233;lectionner le nouveau couplage"
		 height="82" width="364"/>
	<p>
	   Pour rappeler un couplage existant en vue d'une v&#233;rification, s&#233;lectionnez le
	   dans la liste d&#233;roulante &#224; c&#244;t&#233; de l'identifiant du couplagee actuel :
	</p>
	<img src="images/ConsistTool-SelectConsist.png" alt="S&#233;lectionner un couplage"
		 height="83" width="353"/>

	<!--#include virtual="/Footer.shtml" -->
    </div><!-- closes #mainContent-->
  </div> <!-- closes #mBody-->
</body>
</html>

   
