<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01//FR"
"http://www.w3.org/TR/html4/strict.dtd">

<html lang="fr">
<head>
  <meta name="generator" content=
  "HTML Tidy for Mac OS X (vers 31 October 2006 - Apple Inc. build 15.17), see www.w3.org">

  <title>JMRI Hardware Support - DCC++</title>
  <meta name="author" content="Mark Underwood">
  <meta name="keywords" content=
  "DCC++ java model railroad JMRI install">
  <!-- Style -->
  <meta http-equiv="Content-Type" content=
  "text/html; charset=iso-8859-1">
  <link rel="stylesheet" type="text/css" href="/css/default.css"
  media="screen">
  <link rel="stylesheet" type="text/css" href="/css/print.css"
  media="print">
  <link rel="icon" href="/images/jmri.ico" type="image/png">
  <link rel="home" title="Home" href="/">
  <!-- /Style -->
</head>

<body>
  <!--#include virtual="/Header.shtml" -->
  <div id="mBody">
    <!--#include virtual="Sidebar.shtml" -->
    <div id="mainContent">

      <h1>Support mat&#233;riel : DCC++</h1>

      <ul class="snav">
        <!-- TOC -->

        <li><a href="#hardware">Mat&#233;riel</a></li>

        <li><a href="#Limitations">Limitations</a></li>

        <li><a href="#connecting">Connexion</a><</li>
        <li><a href="#tools">Outils JMRI</a></li>

        <li><a href="#documentation">Documentation</a></li>
      </ul>

      <a name="overview" id="overview"></a><h2>Aper&#231;u</h2>

      <p>DCC++ est un logiciel libre bas&#233; sur Arduino <a href=
      "#documentation">Do-it-Yourself</a> Centrale DCC .</p>

      <p>
      Note : DCC++ est un projet distinct du JMRI.  
      Si vous avez 
      des questions sur la construction d'un syst&#232;me DCC++, son fonctionnement,
      etc, vous devriez obtenir de l'aide par  
      <a href="https://www.trainboard.com/highball/index.php?threads/dcc-update-project-2020.130071/">le fil de discussion DCC++ TrainBoard</a>
      et le 
      <a href="https://www.trainboard.com/highball/index.php?threads/dcc-2020-update-project-documentation.130401/">le fil de discussion DCC++ Documentation TrainBoard</a>.
      Il y a aussi des informations sur le 
      <a href="https://github.com/DCC-EX">DCC++ D&#233;p&#244;t GitHub</a>
      et
      <a href="https://dcc-ex.github.io/">documentation associ&#233;e</a>.
      Il y avait aussi un ancien
      <a href="https://sites.google.com/site/dccppsite/home">Site web du DCC++</a>
      et le 
      <a href="https://www.trainboard.com/highball/index.php?forums/dcc.177/">DCC++ Trainboard discussion</a>.
Il y a aussi des pleins informations et d'exemple sur le site 
      <a href="https://www.locoduino.org">Locoduino</a> pour les francophones

      Les groupes de discussion du JMRI ne peuvent fournir qu'un nombre limit&#233;
      d'aide sur DCC++ lui-m&#234;me.  
      </p>

      <p>Caract&#233;ristiques : </p>

      <ul>
        <li>Enti&#232;rement conforme aux normes NMRA DCC</li>

        <li> Adressage des locomotives sur 2 et 4 octets</li>

        <li>Contr&#244;le simultan&#233; de plusieurs locomotives</li>

        <li>128 crans de la vitesse</li>

        <li>Contr&#244;le de toutes les fonctions de la cabine F0-F28</li>

        <li>Activer/d&#233;sactiver toutes les adresses de fonctions accessoires
        0-2048</li>

        <li>Programmation sur la voie de la programmation</li>

        <li style="list-style : none">
          <ul>
            <li>Ecriture de la variable de configuration bytes</li>

            <li>D&#233;finir/Effacer  variable de configuration sp&#233;cifique bits</li>

            <li>Lecture des octets de la variable de configuration</li>
          </ul>
        </li>

        <li>Programmation sur la voie principale en exploitaion</li>

        <li style="list-style : none">
          <ul>
            <li>Ecriture de la variable de configuration bytes</li>

            <li>D&#233;finir/Effacer variable de configuration sp&#233;cifique bits</li>
          </ul>
        </li>

        <li>Contr&#244;ler les aiguillages et les capteurs du DCC</li>

        <li>Acc&#232;s direct et contr&#244;le des broches Arduino IO pour
        fonctions accessoires et capteurs</li>
      </ul>


      <a name="hardware"></a>
      <h2>Mat&#233;riel support&#233;</h2>

      <h3>Centrale</h3>

      <p>Actuellement, les stations de base DCC++ peuvent &#234;tre construites soit &#224; partir des
       modules Arduino Uno ou Arduino Mega.  JMRI devrait soutenir
      soit via une plate-forme USB ou une connexion r&#233;seau.

      <h3>Interfaces informatiques</h3>
      
      Actuellement, quatre interfaces sont
      soutenu :

      <ul>
        <li>S&#233;rie/USB : Connexion directe &#224; Arduino via un  c&#226;ble USB
       </li>

        <li>Simulateur : Centrale simul&#233;e pour le  fonctionnement et essais hors ligne
       .</li>

        <li>R&#233;seau : Connexion TCP/IP de JMRI &#224; une centralee
        avec un shield Ethernet ou WiFi.</li>

        <li>DCC++ sur TCP : connexion r&#233;seau &#224; distance &#224; un r&#233;seau local
        Instance JMRI connect&#233;e &#224; une centrale</li>
      </ul>

      <h4>Simulateur</h4>

      <p>Pour utiliser le simulateur, il suffit de choisir cette option dans les
      Pr&#233;f&#233;rences JMRI. Notez que certaines fonctionnalit&#233;s ne fonctionnent pas dans le
      Simulateur. Par exemple, le simulateur ne prend pas (encore) en charge
      l'attribution, le stockage et la m&#233;morisation des capteurs et des affectations des aiguillages. L'interface du simulateur est suffisamment fonctionnelle pour
      garder JMRI "heureux" tout en travaillant sur des projets hors ligne tels que
      l'Exploitation ou la Conception de Panneaul et Logix, mais n'est pas destin&#233; &#224;
      &#234;tre un v&#233;ritable &#233;mulateur de centrale.</p>

      <h4>DCC++ Sur TCP</h4>

      <p>Pour le DCC++ Over TCP, un ordinateur h&#244;te doit &#234;tre connect&#233;
      &#224; la centrale via une connexion s&#233;rie ou r&#233;seau (ou un
      simulateur). Cet ordinateur h&#244;te ex&#233;cute ensuite le DCC++ sur le Serveur TCP
      . Un ordinateur distant (ou plusieurs ordinateurs distants) peut
      utilisez ensuite l'interface DCC++ Over TCP (Server) pour
      acc&#232;s et contr&#244;le de la centrale.</p>

      <a name="Limitations"></a>
      <h2>Limitations</h2>

      <div class="list">
        <dl>
          <dt class="left">JMRI</dt>

          <dd class="first">
            <p>JMRI supporte actuellement l'interface Centrale V1.1
            . Certaines commandes de la V1.0 peuvent ne pas fonctionner.</p>
          </dd>
        </dl>
      </div><a name="connecting"></a>

      <h2>Connexion</h2>

      <h3>Configuration d'un Arduino pour une utilisation en tant que Centrale DCC
    </h3>


     <p>Pour utiliser un Arduino comme centrale, vous devez
      d'abord assembler l'appareil et t&#233;l&#233;charger le  firmware de la Centrale . Veuillez suivre les instructions des <a href=
      "#documentation">vid&#233;os d'instruction li&#233;es ci-dessous sous
      Autres informations</a>.</p>

      <h3>Connexion &#224; une station de base DCC++ via USB</h3>

      <ol>
        <li>Pour connecter votre ordinateur &#224; une station de base DCC++, d'abord
        installer les pilotes appropri&#233;s.</li>

        <li style="list-style : none">
          <ul>
            <li>Pour la station de base DCC++ avec JMRI, vous aurez peut-&#234;tre besoin
            pour installer un pilote de p&#233;riph&#233;rique sur votre ordinateur. Veuillez consulter le site
            se r&#233;f&#233;rer &#224; la <a href=
            "https://www.arduino.cc/en/Guide/HomePage">Arduino:
            Pages de d&#233;marrage</a> pour les instructions.

              <ul>
                <li><a href=
                "https://www.arduino.cc/en/Guide/Windows">Windows</a>
                (Voir <strong>&#233;tape 4</strong>)</li>

                <li>Mac : Aucun pilote ne devrait &#234;tre requis</li>

                <li><a href=
                "http://playground.arduino.cc/Learning/Linux">Linux</a></li>
              </ul>page<br>
            </li>
          </ul>

          <p><strong>Note:</strong> Si vous avez d&#233;j&#224; install&#233;
          le logiciel Arduino IDE, les pilotes de p&#233;riph&#233;riques doivent
          &#234;tre d&#233;j&#224; install&#233;.</p>

          <p>Lorsque les pilotes de p&#233;riph&#233;riques sont install&#233;s, connectez 
         la station de base Arduino &#224; votre ordinateur en utilisant un standard
          C&#226;ble USB  standard.</p>
        </li>

        <li>Une fois les pilotes install&#233;s, vous &#234;tes pr&#234;t &#224;
        configurer JMRI. Lancez un des programmes bas&#233;s sur JMRI, puis
        aller dans le panneau des pr&#233;f&#233;rences. Celui-ci s'ouvre automatiquement
        la premi&#232;re fois qu'un programme est ex&#233;cut&#233;, ou vous pouvez le s&#233;lectionner dans la
        Menu "Modifier".</li>

        <li>S&#233;lectionnez "DCC++" dans la bo&#238;te de s&#233;lection sup&#233;rieure ("
        Fabricant syst&#232;me").</li>

        <li>S&#233;lectionner "DCC++ Serial Port" dans la deuxi&#232;me s&#233;lection
        case ("Connexion  syst&#232;me")</li>

        <li>S&#233;lectionnez le port USB/S&#233;rie appropri&#233; &#224; partir de la troisi&#232;me
        bo&#238;te de s&#233;lection (" Port S&#233;rie")</li>

        <li>Cliquez sur "Sauvegarder". On vous demandera si vous pouvez le faire pour le
        pour arr&#234;ter, cliquez sur "Oui".</li>

        <li>Red&#233;marrer le programme. Vous devriez &#234;tre op&#233;rationnel. </li>
      </ol>

      <h3>Connexion &#224; un syst&#232;me DCC++ &#224; l'aide du r&#233;seau</h3>

      <ol>
        <li>Connectez d'abord la centrale DCC++ &#224; un r&#233;seau c&#226;bl&#233; ou WiFi
        et enregistrer l'adresse IP et le num&#233;ro de port. Il peut &#234;tre n&#233;cessaire
         de connecter temporairement l'Arduino &#224; un ordinateur h&#244;te
        et utilisez le Moniteur S&#233;rie Arduino  pour obtenir cette
        information.</li>

        <li>Vous &#234;tes maintenant pr&#234;t &#224; configurer JMRI. D&#233;marrez l'un des
        programmes bas&#233;s sur JMRI puis allez dans le panneau des pr&#233;f&#233;rences. Celui-ci
        s'ouvre automatiquement la premi&#232;re fois qu'un programme JMRI est ex&#233;cut&#233;,
        ou vous pouvez le s&#233;lectionner dans le menu "Modifier" (dans le
        Menu d'application sur OS X).</li>

        <li>S&#233;lectionnez "DCC++" dans la bo&#238;te de s&#233;lection sup&#233;rieure ("
        Fabricant syst&#232;me").</li>

        <li>S&#233;lectionnez "DCC++ Ethernet" dans la deuxi&#232;me case de s&#233;lection
        ("Connexion au syst&#232;me").</li>

        <li>Entrer l'adresse IP et le num&#233;ro de port de la centrale DCC
        .</li>

        <li>Cliquez sur "Sauvegarder". On vous demandera si vous voulez le faire pour le
        pour arr&#234;ter, cliquez sur "Oui".</li>

        <li>Red&#233;marrer le programme. Vous devriez &#234;tre op&#233;rationnel. </li>
      </ol>

      <h3>Connexion &#224; un syst&#232;me DCC++ &#224; l'aide de DCC++ sur TCP</h3>

      <ol>
        <li>Connectez d'abord la centrale DCC++ &#224; l'ordinateur h&#244;te
         via l'interface s&#233;rie ou r&#233;seau comme d&#233;crit
        ci-dessus.</li>

        <li>Sur l'ordinateur h&#244;te, s&#233;lectionnez "Load DCC++ Over TCP Server".
        dans le menu DCC++. V&#233;rifiez les param&#232;tres, puis appuyez sur le
        Bouton "D&#233;marrer le serveur". Si vous voulez que le serveur d&#233;marre
        automatiquement lors du lancement de JMRI, cliquez sur le
        case &#224; cocher fournie.</li>

        <li>L'ordinateur h&#244;te doit fonctionner avec le serveur DCC
        actif avant le lancement de l'ordinateur client.</li>

        <li>Lancez JMRI sur l'ordinateur client
        .</li>

        <li>Dans les pr&#233;f&#233;rences de connexion, s&#233;lectionnez DCC++ comme
        Fabricant du syst&#232;me.</li>

        <li>S&#233;lectionnez "DCC++ Server" comme connexion au syst&#232;me
        Type.</li>

        <li>Entrer le nom du r&#233;seau ou l'adresse IP de l'h&#244;te
        et v&#233;rifier que le num&#233;ro de port est le m&#234;me que sur
        l'ordinateur h&#244;te.</li>

        <li>Sauvegardez vos pr&#233;f&#233;rences et red&#233;marrez.</li>
      </ol>

      <p>Une fois que les instances h&#244;te et client de  JMRI sont
      configur&#233;, vous pouvez utiliser le JMRI du client de la m&#234;me mani&#232;re que si
      il &#233;tait directement connect&#233; &#224; la station de base. Le client
      L'instance JMRI peut se trouver sur le m&#234;me ordinateur, dans la m&#234;me maison,
      ou &#224; l'autre bout du pays de l'h&#244;te.</p>

      <h3>Connexion au simulateur DCC++</h3>



      <ol>
        <li>D&#233;marrez un des programmes bas&#233;s sur l'IRMJ, puis allez &#224; la page
        panneau de pr&#233;f&#233;rences. Celui-ci s'ouvre automatiquement la premi&#232;re fois
        un programme est ex&#233;cut&#233;, ou vous pouvez le s&#233;lectionner dans le menu "Modifier".
        menu.</li>

        <li>S&#233;lectionnez "DCC++ Simulator" dans la case de s&#233;lection sup&#233;rieure.
        Aucune &#233;tape de configuration suppl&#233;mentaire n'est n&#233;cessaire pour utiliser
        le simulateur DCC++.</li>

        <li>Cliquez sur "Sauvegarder". On vous demandera si vous pouvez le faire pour le
        pour arr&#234;ter, cliquez sur "Oui".</li>

        <li>Red&#233;marrer le programme. Vous devriez &#234;tre op&#233;rationnel. </li>
      </ol><a name="tools"></a>

      <h2>JMRI DCC++ Tools</h2><img src="images/DCCppMenu416.png"
      width="138" height="70" align="right">

      <p>Le menu DCC++ contient 5 outils:</p>

      <ul>
        <li>DCC++ Traffic Monitor</li>

        <li>Envoyer la commande DCC++</li>

        <li>M&#232;tre de courant de piste</li>

        <li>Configurer les capteurs et les aiguillages</li>

        <li>Charger DCC++ sur le serveur TCP</li>
      </ul><img src="images/DCCppGeneratePack.png" width="117"
      height="47"> <img src="images/DCCppTrackCurrent.png" width=
      "89" height="43"> <img src="images/DCCppConfigTO.png" width=
      "186" height="101"> <img src="images/DCCppOverTCPIP.png"
      width="219" height="47"> <a name="documentation"></a>

      <h2>Documentation</h2>

      <h3>Aide JMRI </h3>

      <p>Une documentation suppl&#233;mentaire sera fournie sur d'autres pages
      li&#233; ici:</p>
      <ul>
          <li><a href="Sensors.shtml">Configuration des Capteurs</a></li>
          <li><a href="Turnouts.shtml">Configuration des Aiguillages et des sSorties</a></li>
      </ul>

      <h3>Info tierce partie</h3>Pour plus d'informations sur la fa&#231;on de
      construire et programmer une Centrale DCC++, se r&#233;f&#233;rer &#224; la
      suivant :

      <ul>
        <li>DCC++ <a href="https://github.com/DccPlusPlus">GitHub
        D&#233;p&#244;t</a></li>

        <li><a href=
        "https://www.youtube.com/channel/UCJmvQx-fe0OMAIH-_g-_rZw/feed">
        Cha&#238;ne YouTube</a></li>

        <li><a href=
        "http://www.trainboard.com/highball/index.php?threads/introducing-dcc-a-complete-open-source-dcc-station-and-interface.84800/">
        Trainboard.com Discussion</a></li>

        <li><a href="http://www.arduino.cc">Projet Arduino
        Site</a></li> 
<li><a href="https://www.locoduino.org/">Site Locoduino</a>pour les francophones</li>
        <li><a href="http://www.sparkfun.com">Sparkfun</a> - un des
        de nombreux endroits pour acqu&#233;rir du mat&#233;riel</li>
      </ul>


      <!--#include virtual="/Footer.shtml" -->
    </div><!-- closes #mainContent-->
  </div><!-- closes #mBody-->
</body>
</html>

	<ul><li>&#201;criture des octets variables de configuration</LI>
		<li>D&#233;finir/Effacer la configuration sp&#233;cifiques des octets variables</li>
		<li>Lire des octets variables de configuration</LI>
	</ul>
	<li>Programmation sur la Voie Principale</li>
	<li style="list-style: none">
          <ul>
	<ul><li>&#201;criture des octets variables de configuration</LI>
		<li>D&#233;finir/Effacer la configuration sp&#233;cifiques des octets variables</li>
	</ul>
	<li>Commande des Aiguillages de Capteurs DCC</li>
	<li>Acc&#232;s et commandes directement par les bornes E/S de l'Arduino pour les fonctions et les capteurs</li>
</ul>

<p><strong><em>NOTE:</em>La prise en charge DCC++ est cass&#233;e dans les versions JMRI 4.1.6 et 4.2.x .S'il vous plait utilisez JMRI 4.3.1 ou des versions plus r&#233;centes avec DCC++<</strong></p><a name="hardware"></a>

<a name="hardware"></a><h2>Mat&#233;riel pris en charge</h2>

<h3>Centrales</h3>
<p>
	Actuellement les Centrales DCC++ de base peuvent &#234;tre construites soit depuis une plateforme Arduino Uno 
	ou une Arduino M&#233;ga. JMRI devrait prendre en charge la plateforme soit via un USB ou une connexion R&#233;seau.

<h3>Interfaces Informatiques</H3>

	Actuellement quatre interfaces sont accept&#233;es:
	<ul>
		<li>S&#233;rie/USB: Connexion directe &#224; un Arduino via un c&#226;ble USB</li>
		<li>Simulateur: Centrale simul&#233;e pour une exploitation hors-ligne ou des tests</li>
		<li>R&#233;seau: connexion TCP/IP depuis JMRI &#224; une centrale avec un Shield Ethernet ou WiFi</li>
		<li>DCC++ Over TCP :Connexion r&#233;seau &#224; distance &#224; une instance JMRI locale connect&#233;e &#224; une Centrale de Commande</li>
	</ul>

<h4>Simulateur</h4>

<p>Pour utiliser le simulateur, choisir simplement cette option dans les Pr&#233;f&#233;rences JMRI. Notez que quelques fonctions ne travailleront
 pas dans ce mode. Par exemple, le Simulateur ne prands pas ( pour le moment) en charge les affectations, le stockage et le rappel des affectations des 
Capteurs et des Aiguillages. L'interface Simulateur est assez fonctionnelle pour garder JMRI disponible pour travailler 
sur des projets hors-ligne tels que l'Exploitation ou la d&#233;signation des Panneaux ou des Logix, mais n'est pas suffisant 
pour &#234;tre un &#233;mulateur de centrale &#224; part enti&#232;re. 

<h4>DCC++ Over TCP</h4>
<p>Pour le DCC++ Over TCP, un ordinateur h&#244;te doit &#234;tre connect&#233; &#224; la centrale
&#224; travers une connexion S&#233;rie ou R&#233;seau ( ou un simulateur ). Cet ordinateur h&#244;te ex&#233;cute le serveur
DCC++ Over TCP. Un ordinateur distant ( ou plusieurs ) peut alors utliser 
l'interface DCC++ Over TCP pour acc&#233;der &#224; distance et contr&#244;ler la centrale.

<a name="Limitations"><h2>Limitations</h2></a>
<div class="list">
    <dl>
    	<dt class="left">JMRI</dt>
		<dd class="first">
			<p>Actuellement JMRI prends en charge la version V1.1 de l'Interface Centrale. Quelques commandes de V1.0 peuvent ne pas fonctionner.</p>
		</dd>	
	</dl>
</div>

<a name="connecting"></a><h2>Connexion</h2>
<h3>Configurer un Arduino pour l'utiliser comme Centrale DCC++</h3>
<p>Dans le but d'utiliser un Arduino comme Centrale, premi&#232;rement vous devez assembler les &#233;quipements et 
	t&#233;l&#233;charger le le logiciel Centrale. S'il vous plait suivez les <a href="#documentation">Des vid&#233;os p&#233;dagogiques ci-dessous sous Autres infos</a>.</p>

<h3>Connexion &#224; une Centrale DCC++  via USB</h3>
<ol>
	<li>Pour connecter votre ordinateur &#224; une centrale DCC++, premi&#232;rement installer les pilotes appropri&#233;s</li>
	<ul>
	<li>Pour la Centrale DCC++ avec JMRI, vous pouver avoir besoin d'installer un &#233;quipement pilote 
	sur votre ordinateur. S'il vous plait r&#233;f&#233;rez-vous aux pages  
	 <a href="https://www.arduino.cc/en/Guide/HomePage">D&#233;marrage d'Arduino </a>
	pour les instructions.
	<ul>
		<li><a href="https://www.arduino.cc/en/Guide/Windows">Windows</a> (Voir <strong>Point 4</strong>)</li>
		<li>Mac: pas besoin de drivers</li>
		<li><a href="http://playground.arduino.cc/Learning/Linux">Linux</a></li>
	</ul>
	page
	<br />
</UL>

	<p><strong>Note:</strong> Si vous avez d&#233;j&#224; install&#233; le logiciel Arduino IDE, les pilotes de p&#233;riph&#233;rique doivent d&#233;j&#224; 
	&#234;tre install&#233;s. </ P>

	<p> Quand les pilotes de p&#233;riph&#233;riques sont install&#233;s, connectez la Centrale Arduino
	&#224; votre ordinateur en utilisant un c&#226;ble standard USB.</p>	
	
	<li>Une fois que les pilotes sont install&#233;s, vous &#234;tes pr&#234;t &#224; configurer 
	JMRI. D&#233;marrez un des programmes JMRI, puis allez au 
	panneau des Pr&#233;f&#233;rences. Celui-ci s'ouvre automatiquement lors d'un premier d&#233;marrage 
	du programme, ou vous pouvez le s&#233;lectionner dans le menu "&#201;dition".</li>

	<li>S&#233;lectionnez "DCC++" dans la fen&#234;tre de s&#233;lection en haut( "Fabricant Syst&#232;me" ).</li>
	<li>S&#233;lectionnez "DCC++ Serial Port" dans la seconde fen&#234;tre ( "Connexion syst&#232;me" )</li>
	<li>S&#233;lectionn&#233; le port USB/Serial appropri&#233; dans la troisi&#232;me fen&#234;tre  ("Serial Port") </li>

	<li>Cliquez "Enregistrer". Il vous sera demand&#233; si c'est OK pour quitter le 
	programme, cliquez"Oui.</li>

	<li>Red&#233;marrez le programme, Vous devez &#234;tre op&#233;rationnel. </Li>
</ol>

<h3>Connexion &#224; un DCC++ &#224; l'aide du R&#233;seau</h3>
<ol>
	<li>Premi&#232;rement, connectez la Centrale DCC++ &#224; un r&#233;seau c&#226;bl&#233; ou WiFi et
		enregistrez l'adresse IP et le num&#233;ro du Port. Vous pouvez avoir besoin de 
		connecter l'Arduino &#224; un ordinateur temporairement et utiliser le Moniteur 
		Serie Arduino pour obtenir cette information.</li>
	<li>Maintenant vous &#234;tes pr&#234;t &#224; configurer JMRI.

		D&#233;marrez un des programmes JMRI, puis allez au panneau des Pr&#233;f&#233;rences. Celui-ci s'ouvre 
		automatiquement lors d'un premier d&#233;marrage du programme, ou vous pouvez le s&#233;lectionner 
		dans le menu "&#201;dition" ( depuis le menu Application sur OS X ). </li>
	<li>S&#233;lectionnez "DCC++" dans la fen&#234;tre de s&#233;lection en haut( "Fabricant Syst&#232;me" ).</li>
	
	<li>S&#233;lectionnez "DCC++ Ethernet" dans la seconde fen&#234;tre ( "Connexion syst&#232;me" )</li>
	
	<li>Entrez l'adresse IP et le num&#233;ro du Port de la Centrale DCC++</li>

	<li>Cliquez "Enregistrer". Il vous sera demand&#233; si c'est OK pour quitter le 
	programme, cliquez"Oui.</li>

	<li>Red&#233;marrez le programme, Vous devez &#234;tre op&#233;rationnel. </Li>
</ol>

<h3>Connexion &#224; un DCC++ &#224; l'aide de Over TCP</h3>

<ol>
	<li>Premi&#232;rement, connectez la Centrale DCC++ &#224; un ordinateur h&#244;te via le
		l(interface S&#233;rie ou le R&#233;seau somme d&#233;crit pr&#233;c&#233;demment</li>
		
	<li>Sur l'ordinateur h&#244;te s&#233;lectionnez "DCC++ Over TCP Server" depuis le menu DCC++.
		V&#233;rifiez les r&#233;glages, puis pressez sur le bouton "Start Server". Si vous voulez que 
		le serveur d&#233;marre automatiquementquand JMRI est lanc&#233;, cochez la
		case propos&#233;e.</li>
		
	<li>L'ordinateur H&#244;te doit &#234;tre ex&#233;cut&#233; avec le serveur DCC++ actif avant 
		le lancement de l'ordinateur Client</li>
		
	<li>sur l'ordinateur client, lancer JMRI </li>
	
	<li>Dans les Pr&#233;f&#233;rences connexion, s&#233;lectionnez DCC++ comme le "Fabricant Syst&#232;me"</li>
	
	<li>S&#233;lectionnez "DCC++ Over TCP" dans la seconde fen&#234;tre "Connexion syst&#232;me" </li>
	
	<li>Entrez le nom r&#233;seau ou l'adresse IP de l'ordinateur h&#244;te et v&#233;rifiez
		que le num&#233;ro du port est le m&#234;me sur sur l'ordinateur h&#244;te</li>
		
	<li>Enregistrez vos Pr&#233;f&#233;rences er red&#233;marrez</li>
</ol>

<P> Une fois que les instances h&#244;te et client de JMRI sont configur&#233;es, vous pouvez utilisez
	le client JMRI tout comme s'il &#233;tait directement connect&#233; &#224; la 
	centrale.L'instance client JMRI peut &#234;te sur le m&#234;me ordinateur, Dans la m&#234;me maison, ou &#224; travers le pays de l'h&#244;te. </P>

<h3>Connexion au Simulateur DCC++</h3>
<ol>
		<li>D&#233;marrez un des programmes JMRI, puis allez au panneau des P&#233;f&#233;rences.
		Celui-ci s'ouvre automatiquement lors d'un premier d&#233;marrage du programme, ou vous pouvez le s&#233;lectionner 
		dans le menu "&#201;dition".</li>

		<li>S&#233;lectionnez "DCC++ Simulator" dans la fen&#234;tre de s&#233;lection du haut. Il n'y a pas 
		d'&#233;tapes suppl&#233;mentaires de configuration pour utiliser le Simulateur DCC++.</li>

		<li>Cliquez sur "Enregistrer", il vous sera demand&#233; si vous voulez quittez le programme,
		cliquez "Oui".</li>
		
		<li>Red&#233;marrez le programme, Vous devez &#234;tre op&#233;rationnel.</li>
</ol>

<a name="tools"></a><h2>Outils JMRI DCC++</h2>
<img src="images/DCCppMenu416.png" width="138" height="70" align="right">
<p>Le menu DCC++ contient 5 outils:
<ul>
<li>Moniteur de trafic DCC++
<li>Envoi Commande DCC++
<li>Mesure Courant Voie
<li>Configurer les Capteurs et Aiguillages
<li>Charger DCC++ over TCP Server
/ul><img src="images/DCCppGeneratePack.png" width="117"
      height="47">  <img src="images/DCCppTrackCurrent.png" width=
      "89" height="43">  <img src="images/DCCppConfigTO.png" width=
      "186" height="101">  <img src="images/DCCppOverTCPIP.png"
      width="219" height="47">  <a name="documentation"></a>


<a name="documentation"></a><h2>Documentation</h2>
<h3>Aide JMRI </h3>
<p>Des informations suppl&#233;mentaires peuvent tre trouv&#233;es sur les pages suivantes:

<h3>Autres Sources d'Information</h3>
Pour des informations suppl&#233;mentaires pour savoir comment construire et programmer une Centrale DCC++, se r&#233;f&#233;rer aux documents suivants:
<ul>
    <li> <a href="https://github.com/DccPlusPlus">R&#233;pertoire GitHub</a> DCC++</li>
    <li><a href="https://www.youtube.com/channel/UCJmvQx-fe0OMAIH-_g-_rZw/feed">
    YouTube </a></li>
    <li><a
    href="http://www.trainboard.com/highball/index.php?threads/introducing-dcc-a-complete-open-source-dcc-station-and-interface.84800/">Trainboard.com
    Discussion</a></li>
    <li><a href="http://www.arduino.cc">Site du Projet Arduino</a></li>
    <li><a href="http://www.sparkfun.com">Sparkfun</a> - Un des nombreux endroits o&#249; obtenir le logiciel</li>
</ul>

<!--#include virtual="/Footer" -->
 </div><!-- closes #mainContent-->
</div> <!-- closes #mBody-->
</body>
</html>
