<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01//EN" "http://www.w3.org/TR/html4/strict.dtd">
<html lang="fr">
<head>
<!-- Copyright ($Author: bhoffman351 $) 2009 -->
<!-- $Id: UserInterface.shtml 19355 2011-12-10 16:52:00Z bhoffman351 $ -->
<!-- UpDated  by Blorec Herv&#233; bzh56420@yahoo.fr 2013-11-13--> 
<title>JMRI: WiFi Throttle</title>

<!-- Style -->
<META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=iso-8859-1">
<LINK REL="stylesheet" TYPE="text/css" HREF="/css/default.css"
	MEDIA="screen">
<LINK REL="stylesheet" TYPE="text/css" HREF="/css/print.css"
	MEDIA="print">
<LINK REL="icon" HREF="/images/jmri.ico" TYPE="image/png">
<LINK REL="home" TITLE="Home" HREF="/">
<!-- /Style -->
</HEAD>

<BODY>
<!--#include virtual="/Header" -->
  <div class="nomenu" id="mBody">
    <div id="mainContent">

<h1> 
JMRI: R&#233;gulateur WiFi
</h1>

<a href="http://withrottle.com"> 
   <img height="250" width="150" src="images/WiT150x250.png" align="right">
</a>
Cette fen&#234;tre commande la connexion entre les manettes WiFi,
par exemple un IPhone, IPod Touch, ou t&#233;l&#233;phone Android, et JMRI.


<p>
Il peut &#234;tre configur&#233; pour d&#233;marrer automatiquement avec le
"<a href="../../../apps/TabbedPreferences.shtml#Startup"> D&#233;marrage </a>" dans la section
"<a href="../../../apps/TabbedPreferences.shtml"> JMRI Pr&#233;f&#233;rences </a>"
section Pr&#233;f&#233;rences JMRI sous la rubrique «Actions».

<p>
<a href="../../../apps/TabbedPreferences.shtml#WiThrottle"> Les Pr&#233;f&#233;rences </a>
pour les manettes WiFi peuvent &#234;tre trouv&#233;es dans les Pr&#233;f&#233;rences JMRI
sous la rubrique R&#233;gulateurWi.

<p>
Cet utilitaire diffuse ses informations de connexion  &#224; travers le
r&#233;seau local afin qu'il puisse &#234;tre capt&#233; par un dispositif &#224; la recherche du
 service. Ceci &#233;limine d'avoir &#224; entrer vos informations de connexion
dans l'appareil. Si l'ordinateur ex&#233;cutant JMRI est prot&#233;g&#233; par un
logiciel pare-feu , vous pouvez avoir besoin de d&#233;sactiver le pare-feu pour permettre aux
R&#233;gulateurs WiFi de se connecter.

<p>
Lorsque vous utilisez un r&#233;gulateur WiFi, si l'ordinateur passe en mode veille, la
commande sera perdu. Il peut &#234;tre n&#233;cessaire d'ajuster les pr&#233;f&#233;rences du syst&#232;me pour
emp&#234;cher l'ordinateur de se mettre en veille quand il est inactif.

<P>
Pour utiliser votre IPhone ou IPod Touch avec JMRI comme un r&#233;gulateur, vous
ex&#233;cuter 
l'application <a href="http://withrottle.com">WiThrottle</a> sur l'iPphone ou l'iPod Touch. L'application est disponible librement pour t&#233;l&#233;chargement sur l'iTunes store



<P>
 <a href="EngineDriverAndroidThrottle.shtml">
   <img height="200" width="120" src="images/EngineDriverScreen.png" align="right">


</a>
Pour utiliser votre t&#233;l&#233;phone Android avec JMRI comme un r&#233;gulateur, vous
ex&#233;cuter le programme
<a href="EngineDriverAndroidThrottle.shtml"> Engine Driver</a>
 sur le t&#233;l&#233;phone Android.

<p>
Le protocole est d&#233;crit sur une
<a href="Protocol.shtml"> page separ&#233;e</a>.
Pour en savoir plus sur JMRI en r&#233;seau voir la 
<a href="../../../../html/doc/Technical/Networking.shtml"> page technique sur le r&#233;seau local</a>.

<p>
<h3>
&#201;tiquettes Fonctions
</h3>

Les &#201;tiquettes Fonctions peuvent &#234;tre personnalis&#233;es pour chaque Liste &#224; travers JMRI .
Ces &#201;tiquettes peuvent &#234;tre affich&#233;es &#224; la place des des g&#233;n&#233;riques F1, F2...sur l'&#233;cran de l'&#233;quipement mobile.
Les &#201;tiquettes peuvent &#234;tre ajout&#233;es quand une nouvelle entr&#233;e Liste est cr&#233;&#233;es,
ou par l'&#233;dition d'une fiche existante sous l'onglet &#201;tiquettes Fonctions.
Pour entrer des &#233;tiquettes de fonction, le format du programmateur doit &#234;tre soit "Avanc&#233;" soit "Personnalis&#233;".

<p>
<h3>
Itin&#233;raires et Aiguillages

</h3>
L'application peut commander tous les aiguillages (et itin&#233;raires) que JMRI commande. S'is sont disponibless dans le tableau aiguillage (ou itin&#233;raire) de JMRI,
ils sont automatiquement disponibles dans les r&#233;gulateurs WiFi. 
S'il n'y a pas d'aiguillages (ou itin&#233;raires dans le tableau(x) alors l'&#233;cran de commande pour eux n'apparaitra pas dans l'application.
Par d&#233;faut,il peut faire tout ceci.
Toutefois, si JMRI n'est pas capable de les commander, les r&#233;gulateurs ne seront pas capables de le faire.

<p>
En suppl&#233;ment, vous pouvez limiter quels aiguillages apparaissent.
Dans JMRI avec la fen&#234;tre Withrottle active, il y a un menu Withrottle.
Il y a un &#233;l&#233;ment appel&#233; "Filtre de Commandes"
qui vous permet de dire quels aiguillages afficher sur l'&#233;cran ou le cacher.
<p>
<h3>Couplage Avanc&#233;</h3>

Il ya maintenant deux options pour manipule le Couplage Assist&#233; (ou D&#233;codeur Assist&#233;) Compos&#233;e.
Cela peut &#234;tre choisi parmi le <a href="../../../apps/TabbedPreferences.shtml#WiThrottle"> WiThrottle</a> partie des pr&#233;f&#233;rences JMRI.

<p>

La valeur par d&#233;faut est <b>Format NMRA</b>. Cela va construire une couplage en utilisant les commandes de couplages NMRA.
Il n'utilise pas de techniques sp&#233;cifiques pour le syst&#232;me DCC connect&#233;.
Cela permet aux manettes WiFi de travailler dans un syst&#232;me DCC de mani&#232;re ind&#233;pendante.
Ces couplage peuvent mieux fonctionnerr pour la construction et la commande avec p&#233;riph&#233;riques WiFi.

<p>
La deuxi&#232;me option est <b>DCC Sp&#233;cifique &#224; la Marque</b> qui construira le couplage d'une mani&#232;re o&#249; ils vont fonctionner comme s'ils &#233;taient construits en utilisant un R&#233;gulateur du fabricant de DCC.
ceux-ci suivront les caract&#233;ristiques sp&#233;cifiques au fabricant pour la construction et la commande des couplages.
Ces couplages devraient mieux fontionner lors qu'ils sont construits avec un dispositif WiFi, mais command&#233;s par un r&#233;gulateur du fabricant de votre syst&#232;me DCC.
<p>
Ceci est la page d'aide help/en/package/jmri/jmrit/withrottle/UserInterface
<!--#include virtual="/Footer" -->
</body>
</html>
