<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01//EN" "http://www.w3.org/TR/html4/strict.dtd">
<!-- translated by Herv&#233; Blorec le 2013-10-17-->
<html lang="fr">
<head>
 <title>
      JMRI: Consist Tool
 </title>
    <meta name="author" content="Bob Jacobsen">
    <meta name="keywords" content="JMRI help Consist Tool">

<!-- Style -->
  <meta http-equiv=Content-Type content="text/html; charset=iso-8859-1">
  <link rel="stylesheet" type="text/css" href="/css/default.css" media="screen">
  <link rel="stylesheet" type="text/css" href="/css/print.css" media="print">
  <link rel="icon" href="/images/jmri.ico" type="image/png">
  <link rel="home" title="Home" href="/">
<!-- /Style -->
</head>

<body>
<!--#include virtual="/Header" -->
  <div class="nomenu" id="mBody">
    <div id="mainContent">

<h1> Outil de Couplage</h1>

<h2> Utilisation de l'Outil de Couplage</h2>
<p>
Lorsque vous ouvrez l'outil de couplage, vous verrez un &#233;cran semblable au suivant:
</p><img src=images/ConsistTool.jpg alt="Blank ConsistTool"><p>
Les boutons de la rang&#233;e sup&#233;rieure sont utilis&#233;s pour choisir entre un Couplage Avanc&#233; (ou
D&#233;codeur Assist&#233;) se composent et une Centrale d
&#224; Couplage Assist&#233;. Si les Centrales &#224; Couplages Assist&#233;s ne sont pas
prises en charge par l'outil de votre syst&#232;me, ces s&#233;lections seront
gris&#233;es.
</p>
<p>
La case &#224; c&#244;t&#233; de l'&#233;tiquette de <b>Couplage:</b> est utilis&#233; pour sp&#233;cifier l' ID du
couplage. Pour les D&#233;codeur &#224; Couplage Assist&#233;, cela devrait &#234;tre l'
adresse courte utilis&#233;e pour identifier le couplage. Pour  une Centrale &#224; Couplage Assist&#233;, cette valeur peut &#234;tre automatiquement
rempli avec l'adresse de la locomotive de t&#234;te quand vous essayez de l'ajouter
au couplage.
</p>
<p>
L'ajout d'un ID typique pour un D&#233;codeur &#224; Couplage Assist&#233;  devrait ressembler
&#224; ce qui suit:
</p>
<img src=images/ConsistTool-IDAdded.jpg alt="Consist Tool-ID Added">
<p>
La deuxi&#232;me ligne de l'outil couplage est utilis&#233; pour ajouter des locomotives.
Une locomotive peut &#234;tre ajout&#233;e soit en entrant son num&#233;ro dans la
case &#224; c&#244;t&#233; de la <b>Nouvelle Locomotive</b> ou en s&#233;lectionnant son num&#233;ro
partir de la liste d&#233;roulante.
</p>
<img src=images/ConsistTool-LeadLoco.jpg alt=" Lead Locomotive Selected">
<p>
Cliquer sur le bouton <b>Ajouter</b> va ajouter une locomotive au couplage
et elle appara&#238;tra dans la liste sous la deuxi&#232;me ligne.
</p>
<img src=images/ConsistTool-LeadLocoAdded.jpg alt="Lead Locomotive Added to Consist">
<p>
Cliquer sur le bouton <b>R&#233;initialiser</b> effacera l'information pour
cette locomotive.
</p>
<p>
La case Direction <b>Normal</b> est utilis&#233;e pour d&#233;terminer si
la locomotive roule en marche avant ou arri&#232;re lorsque le
couplage se d&#233;place vers l'avant.
</p>
<p>
Vous remarquerez peut-&#234;tre &#224; partir des captures d'&#233;cran pr&#233;c&#233;dente que cette case est
gris&#233; jusqu'&#224; ce qu'une locomotive de t&#234;te soit s&#233;lectionn&#233;e. Avec les
locomotives ult&#233;rieures, vous pouvez cocher cette case pour indiquer la
direction de la locomotive par rapport &#224; la locomotive de t&#234;te

</p>
<img src=images/ConsistTool-SecondLoco.jpg alt="Second LocoMotive Selected - Direction Reversed">
<p>
Apr&#232;s l'ajout de la seconde locomotive au couplage, avec le
sens inverse, vous devriez voir quelque chose comme ce qui suit:
</p>
<img src=images/ConsistTool-SecondLocoAdded.jpg alt= "Second Locomotive added">
<p>

Si vous faites une erreur, et ajoutez une seconde locomotive au
couplage  avec la mauvaise direction, vous pouvez changer sa direction
simplement en cliquant sur la case dans la colonne de direction normale.
</p>
<img src=images/ConsistTool-SecondLocoDirChange.jpg alt="Second Locomotive-Direction Change">
<p>
La direction de la locomotive de t&#234;te ne peut pas &#234;tre chang&#233; une fois
ajout&#233;e.
</p>
<p>
Pour supprimer une locomotive individuelle du couplage, vous pouvez
s&#233;lectionner le bouton <b>Del</b> dans la colonne la plus &#224; droite de la
igne appropri&#233;e de la table d'adresses.
</p>
<p>
Pour supprimer un couplage entier, vous pouvez utiliser le bouton <b>Supprimer</b> au bas de l'&#233;cran.
</p>
<p>

Le bouton r&#233;gulateur au bas de l'&#233;cran peut &#234;tre utilis&#233; pour
mettre en place un r&#233;gulateur JMRI pour cette adresse.
</p>
<p>
Pour ajouter un nouveau couplage, vous pouvez s&#233;lectionner l'entr&#233;e vide dans le menu d&#233;roulant
&#224; c&#244;t&#233;  de l'actuel ID du couplage.
</p>
<img src=images/ConsistTool-NewConsist.jpg alt="Select Nouveau Consist">
<p>
Pour rappeler un couplage existant, vous pouvez s&#233;lectionner l'entr&#233;e appropri&#233;e
de la bo&#238;te d&#233;roulante &#224; c&#244;t&#233; de l'ID du couplage actuel.
</p>
<img src=images/ConsistTool-SelectConsist.jpg alt="Select une Consist">
<p>
Pour plus d'informations sur le couplage et sur l'outil de couplage JMRI  s'il vous pla&#238;t
voir la 
<a href="../../../../html/tools/consisttool/ConsistTool.shtml#tool"> page couplage</a> principale.
<p>La page d'aide package\JMRI\jmrit\consisttool</p>

<!--#include virtual="/Footer" -->
    </div>
  </div>
</body>
</html>

