

<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//FR"
"http://www.w3.org/TR/html4/loose.dtd">

<html lang="fr">
<head>
  <meta name="generator" content=
  "HTML Tidy for Mac OS X (vers 31 October 2006 - Apple Inc. build 15.17), see www.w3.org">
  <!-- Copyright Bob Jacobsen 2008 -->

  <title>JMRI: DecoderPro User Guide - Advanced Decoder
  Definitions</title>
  <!-- Style -->
  <meta http-equiv="Content-Type" content=
  "text/html; charset=iso-8859-1">
  <link rel="stylesheet" type="text/css" href="/css/default.css"
  media="screen">
  <link rel="stylesheet" type="text/css" href="/css/print.css"
  media="print">
  <link rel="icon" href="/images/jmri.ico" type="image/png">
  <link rel="home" title="Home" href="/">
  <!-- /Style -->
</head>

<body>
  <!--#include virtual="/Header.shtml" -->
  <div id="mBody">
    <!--#include virtual="Sidebar.shtml" -->
    <div id="mainContent">

      <h1>MRI : Guide de l'utilisateur de DecoderPro</h1>

      <h2>Définitions avancées des décodeurs</h2>

      <p>Cette page fournit des informations sur les fonctionnalités avancées 
      des fichiers de définition du décodeur pour le  Programmeur DecoderPro Symbolic.</p><a name="html_formatting" id=
      "html_formatting"></a>

      <h3>Formatage sur la page</h3>Vous pouvez faire un formatage limité
      sur l'écran en utilisant des balises de formatage HTML.

      <p>Vous pouvez intégrer du HTML dans le texte du volet, mais il doit être inclus dans les balises  &lt;html&gt;...&lt;/html&gt;.</p>
  
          <p>Cela est rendu un peu délicat par le chevauchement entre les "balises faisant partie de la structure XML du fichier décodeur" et les "balises HTML
      inclus dans le fichier du décodeur". Toutes les balises HTML doivent
      être cités, avec leurs caractères &lt; et &gt;  remplacés par
      les &amp;lt; et &amp;gt; les chaînes de caractères et tout double-note intégré étant remplacés par &amp;quot;.</p>


      <p>Par exemple:</p>
      <pre style="font-family : monospace ;">
   &lt;label label="&amp;lt;html&amp;gt;&amp;lt;strong&amp;gt;JMRI 3.7.2 ou une version ultérieure est nécessaire pour utiliser cette définition.&amp;lt;/strong&amp;gt;&amp;lt;/html&amp;gt;"/&gt;
</pre>Après la lecture du XML, le contenu de cette étiquette sera
affiché à partir du texte de l'attribut "label", qui est :
      <pre style="font-family : monospace ;">
     &lt;html&gt;&lt;strong&gt;Pour utiliser cette définition, il est nécessaire de disposer de JMRI 3.7.2 ou d'une version plus récente.&lt;/strong&gt;&lt;/html&gt;
</pre>et apparaîtra à l'écran comme

      <p> <strong>JMRI 3.7.2 ou supérieur est nécessaire pour utiliser cette
      definition.</strong></p>

      <p>Pour plus d'exemples, voir <a href=
      "https://github.com/JMRI/JMRI/blob/master/xml/decoders/esu/v4readMePane.xml"
      target="_blank">xml/decoders/esu/v4readMePane.xml</a>.</p>

      <p>Il ne prend en charge que le HTML5, donc si quelque chose ne
      s'affiche comme vous l'attendez, voyez si une approche utilisant du HTML plus simple fonctionnera.</p>


      <a name="id" id="id"></a>
      <h3>Identification</h3>
      Lorsque la fonction "Lire le type de décodeur" est utilisée pour déterminer le
      fichier de définition du décodeur, plusieurs informations
      sont lues à partir du décodeur et utilisées pour tenter une correspondance
      avec une famille et  un modèle :

      <dl>
        <dt>Fabricant:</dt>

        <dd>Valeur numérique de CV8, qui est ensuite mise en correspondance avec un
        nom en utilisant les entrées du fichier xml/decoderIndex.xml
        file.</dd>

        <dt>Code de version:</dt>

        <dd>Valeur numérique de CV7, qui est ensuite mise en correspondance avec
        le(s) nom(s) de modèle(s) utilisant les ID de version basse et haute
        sur les éléments du modèle dans toutes les définitions de décodeur pour
        le fabricant spécifique. Il s'agit d'un processus complexe qui
        ne se passe pas toujours bien en raison de valeurs doubles, etc.

        <dt>Code d'identification du produit:</dt>

        <dd>
        A l'origine, une valeur numérique lue à partir d'un
         ou des CV spécifiques au fabricant; cela ne fonctionne que pour
        certains fabricants. Le processus de lecture est traité dans le
        code (le <a href=
        "/JavaDoc/doc/jmri/jmrit/decoderdefn/IdentifyDecoder.html" target="_blank">
        jmri.jmrit.decoderdefn.IdentifyDecoder</a> classe) et 
        à mettre à jour chaque fois qu'un fabricant commence à fournir
        dans un ou plusieurs nouveaux CV. Lorsque le code produit est
        présent, il devrait briser toute dégénérescence entre
        le chevauchement des valeurs CV7 au sein d'une famille de décodeurs.
        Par exemple :
        <pre style="font-family : monospace ;">
  &lt;decoder&gt;
    &lt;family name="My Decoder Family" mfg="NMRA"> ;
      &lt;model model="Model A" lowVersionID="16" highVersionID="23" productID="400" /&gt;
      &lt;;/model&gt;
      &lt;model model="Model B" lowVersionID="21" highVersionID="27" productID="401" /&gt;
      color=;/model&gt;;model model="401" /&gt;;model model="401" /&gt;
    &lt;/family&gt;
    &#8230 ;
  &lt;/decoder&gt;</pre>

        <p>Certains d&#233;codeurs peuvent avoir plusieurs ID de produits stock&#233;s possibles pour
        des d&#233;codeurs identiques. Dans ce cas, plusieurs d&#233;codeurs s&#233;par&#233;s par des virgules
        peuvent &#234;tre sp&#233;cifi&#233;es dans le champ "Product ID" et une correspondance avec une valeur quelconque de la liste 
        identifiera le d&#233;codeur de mani&#232;re unique. Par exemple, la s&#233;rie ESUseries utilise les CV RailCom&reg ; Product ID, 
        mais le Product ID est mis &#224 ; jour pour diff&#233;rents lots de production du m&#234;me mod&#232;le:</p>
        <pre style="font-family : monospace ;">
  &lt;decoder&gt;
    &lt;family name="ESU LokSound V4.0" mfg="Electronic Solutions Ulm GmbH" lowVersionID="255" highVersionID="255"} ;
      &lt;model model="LokSound V4.0" numOuts="92" numFns="40" extFnsESU="yes" productID="33554493,33554503,33554538"} ;
      &lt;/model&gt;
      &lt;model model="LokSound V4.0 M4" numOuts="92" numFns="40" extFnsESU="yes" productID="33554500,33554536"} ;
      &lt;/model&gt;
    &lt;/family&gt;
    &#8230 ;
  &lt;/decoder&gt;</pre>


      <a name="idwarn" id="idwarn"></a>
          <p><strong>WAvertissement:</strong> Ne pas utiliser plusieurs Product IDs stock&#233;s 
          possibles pour des d&#233;codeurs similaires qui n&#233;cessitent 
          une <a href="#conditionnel">expansion conditionnelle </a> diff&#233;rente.
          Cela ne fonctionnera pas, pour les raisons expliqu&#233;es <a href="#prodidwarn">dans une section ci-dessous</a>.
          Dans ce cas, chaque ID de produit doit se voir attribuer un nom de mod&#232;le diff&#233;rent, comme dans le premier exemple ci-dessus.

          <p>Le support est &#233;galement ajout&#233; pour trouver cette valeur en utilisant
          le <a href=
          "../../mat&#233;riel/loconet/Addressage.shtml#SVs" target="_blank"> protocole LocoNet SV2
         </a> un certain temps pendant la diffusion de la version 4.1 de JMRI
          s&#233;rie. Voir les notes de publication pour plus d'informations sur la s&#233;rie
          progr&#232;s.</p>

          <p>Puisque le code du produit fonctionne avec l'inclusion/exclusion
          d&#233;crites ci-dessous, vous pouvez &#233;galement l'utiliser dans les cas suivants
          o&#249; il n'y a pas de CV ou de CV qui le contiennent. Dans ce cas,
          aucune identification automatique n'est effectu&#233;e, mais la valeur du productID
          du mod&#232;le s&#233;lectionn&#233; par l'utilisateur est utilis&#233; lors de la
          le traitement et l'extension de la d&#233;finition du d&#233;codeur.
          Des valeurs alphanum&#233;riques productID sont parfois utilis&#233;es &#224; cette fin
          afin d'&#233;viter les conflits avec les chiffres de
          CVs.</p>
        </dd>
      </dl>
        <p>Quand un mod&#232;le de d&#233;codeur est s&#233;lectionn&#233;,
        soit manuellement, soit &#224; la suite du processus d'identification,
        les noms de famille et de mod&#232;le sont stock&#233;s dans l'entr&#233;e de la liste en cours de cr&#233;ation
        et sont utilis&#233;s pour relier &#224; l'avenir une entr&#233;e de la liste &#224; une d&#233;finition du d&#233;codeur.

        <p>Il est important de noter que le code du fabricant, de la version ou
        Les ID de produits ne sont pas enregistr&#233;s dans l'entr&#233;e du fichier, car les valeurs ne sont pas
        d&#233;termin&#233; de mani&#232;re fiable dans certains cas
        (par exemple, s&#233;lection manuelle, mise &#224; jour du micrologiciel par un logiciel fourni par le fabricant,
        informations d'identification mises &#224; jour par le vendeur).
        Cela a des implications pour le moment o&#249; la d&#233;finition du d&#233;codeur est &#233;largie pour la programmation
        (<a href="#conditional">D&#233;finitions des d&#233;codeurs conditionnels</a>)
        ou mis &#224; jour
        (<a href="#update">Mises &#224; jour et migration</a>).</p>

        <h4>D&#233;codeurs du domaine public et du bricolage</h4>

        <span class="since">Depuis <a href="/releasenotes/jmri4.11.5.shtml" target="_blank">JMRI 4.11.5</a></span>

        <p> La fonction "Lire le type de d&#233;codeur" est disponible pour les d&#233;codeurs du domaine public et les d&#233;codeurs de bricolage.</p>

        <p>Trois identificateurs sont utilis&#233;s pour identifier le d&#233;codeur:</p>

            <dl>
                <dt>Fabricant:</dt>

                <dd>Valeur num&#233;rique <b>CV8 = 13</b> selon la norme NMRA S-9.2.2.
                fichier.</dd>

                <dt>Code de version:</dt>

                <dd>La valeur num&#233;rique de <b>CV7</b> o&#249; la version du logiciel est stock&#233;e.</dd>

                <dt>Code d'identification du produit:</dt>

                <dd>Valeur num&#233;rique stock&#233;e dans <b>CV47</b>, <b>CV48</b>, <b>CV49</b> et <b>CV50</b> 
                selon le fichier de la norme S-9.2.2 de l'ARNM et r&#233;serv&#233; &#224; l'usage du fabricant.

                    <p>L'ID du produit est calcul&#233; &#224; l'aide de la formule suivante:</p>

                    <ul>
                        <li>ID du produit = (((CV47 * 256) + CV48) * 256 + CV49) * 256 + CV50</li>
                    </ul>

                    <p>Les CV individuels ont la signification suivante:</p>

                    <ul>
                        <li>CV47 - code pays, par exemple CV47 = 1 pour la R&#233;publique tch&#232;que</li>
                        <li>CV48 - code du d&#233;veloppeur ou du groupe de d&#233;veloppeurs, tel que CV48 = 1 pour dccdoma.cz</li>


                        <li>CV49 - troisi&#232;me ProductID pour identification ult&#233;rieure</li>
                        <li>CV50 - quatri&#232;me ProductID pour une identification plus pouss&#233;e</li>
                    </ul>
                </dd>
            </dl>

        <p>Le fichier xml de d&#233;finition du d&#233;codeur correspondant a un &#233;l&#233;ment rempli de type &lt;family&gt;. Exemple:</p>
    
       <pre style="font-family : monospace ;">
  &lt;decoder&gt;
    &lt;family name="dccdoma.cz" mfg="Public-domain and DIY" &gt;
      &lt;model model="UNI16ARD-NAV" lowVersionID="41" productID="16843010" &#8230 ; /&gt;
    &lt;/family&gt;
    &#8230 ;
  &lt;/decoder&gt;</pre>

        <p>Les attributs individuels de cet &#233;l&#233;ment doivent &#234;tre remplis comme suit:</p>
        <ul>
            <li><b>mfg="Public-domain and DIY"</b> qui correspond &#224; CV8</li>
            <li><b>lowVersionID="nn" highVersionID="mm"</b> qui correspond &#224; CV7</li>
            <li><b>productID="nnnnnn"</b> qui correspond aux CV47, CV48, CV49 et CV50</li>.
        </ul>

        <p>Le nom du fichier xml avec la d&#233;finition du d&#233;codeur doit avoir la structure suivante:</p>

        <pre style="font-family : monospace ;"><b>Public_Domain</b>_<b>family-name</b>_<b>model-model</b>.xml</pre>

        <p>o&#249; chaque partie d'un nom de fichier a la signification suivante:</p>
        <ul>
            <li><b>Public_Domain</b> qui correspond &#224; l'attribut &lt;family mfg="Public-domain and DIY" &gt;</li>
            <li><b>family-name</b> qui correspond &#224; l'attribut &lt;family name="developer" &gt;</li>
            <li><b>model-model</b> qui correspond &#224; l'attribut &lt;model model="decoder name" &gt;</li>
        </ul>

        <p>Exemple de fichier de d&#233;codage de d&#233;finition pour le d&#233;codeur de signal <i>UNI16ARD-NAV.xml</i> 
            du groupe de d&#233;veloppeurs <i>dccdoma.cz</i> qui sont originaires de <i>la R&#233;publique tch&#232;que</i> 
            <a href="../../../../../xml/d&#233;codeurs/Domaine_Public_dccdoma_UNI16ARD_NAV.xml">Public_Domain_dccdoma_UNI16ARD_NAV.xml</a>.</p> 
        
        <p>Pour le nouveau <i>code pays</i> et le nouveau <i>code d&#233;veloppeur</i>, veuillez 
        contacter Groups.io jmriusers <a href="https://groups.io/g/jmriusers">https://groups.io/g/jmriusers</a>.</p>
        
      <a name="pane_considerations" id="pane_considerations"></a>
      <h3>Consid&#233;rations sur les volets</h3>Les volets du programmateur sont utilis&#233;s pour
      diviser et organiser les variables du d&#233;codeur en noms de cat&#233;gories pratiques
      .

      <ul>
        <li>JMRI fournit un ensemble standard de volets, d&#233;fini par
        &lt;pane&gt; inclus dans l'&#233;l&#233;ment &lt;programmer&gt;
        de chacun des fichiers standard de Programmer (Basic,
        Comprehensive, Advanced, etc.) dans le fichier xml/programmeurs/
        .</li>

        <li>Les fichiers de d&#233;finition du d&#233;codeur peuvent contenir des volets personnalis&#233;s pour
        des d&#233;codeurs particuliers ou des familles de d&#233;codeurs, d&#233;finis par
        &lt;pane&gt; &#233;l&#233;ments inclus dans le
        &lt;decoder-config&gt; &#233;l&#233;ment du fichier d&#233;codeur ( haut niveau )
        file.</li>

        <li>Les noms des volets sont sp&#233;cifi&#233;s par un &#233;l&#233;ment de type &lt;name&gt; en
        haut de chaque &#233;l&#233;ment &lt;pane&gt;.</li>
      </ul><a name="pane_replacement" id="pane_replacement"></a>

      <h4>Remplacement des volets</h4>Des volets personnalis&#233;es sont g&#233;n&#233;ralement ajout&#233;es &#224;
      pour l'une des raisons suivantes :

      <ol type="A">
        <li>Les &#233;l&#233;ments &#224; montrer ne font partie d'aucun des
        les cat&#233;gories d&#233;finies par les noms standard des volets.

          <ul>
            <li>Dans ce cas, le  &lt;name&gt;de l'&#233;l&#233;ment volet doit
            &#234;tre diff&#233;rent de tout nom standard existant.</li>

            <li>Le nouveau volet personnalis&#233; sera ajout&#233; &#224; la fin de la
            pane liste des volets.</li>
          </ul>
        </li>

        <li>La cat&#233;gorie de panneau standard applicable n'a pas la
        une mise en page correcte ou un nombre de variables correct.

          <ul>
            <li>Dans ce cas, le &lt;name&gt;de l'&#233;l&#233;ment volet doit
            correspondent exactement &#224; la norme existante de &lte;name&gt;
            &#233;l&#233;ment volet.</li>

            <li>Le nouveau volet personnalis&#233;
            <strong><em>remplacera</em></strong> l'actuel
            volet standard du m&#234;me nom.</li>
          </ul>
        </li>
      </ol>

      <h4>Volets vides</h4>Les volets vides sont d&#233;finis comme ceuxs qui n'ont pas 
      d'&#233;l&#233;ments variables actifs &#224; afficher pour le d&#233;codeur s&#233;lectionn&#233;.
      Ils peuvent encore contenir du contenu textuel. <un nom=
      "pane_visibility" id="pane_visibility"></a> <a name=
      "visibilit&#233;" id="visibilit&#233;"></a>

      <h4>Visibilit&#233; des volets</h4>La visibilit&#233; des volets est r&#233;gie par un
      un ensemble de r&#232;gles complexes 

      <ul>
        <li>Ind&#233;pendamment de toutes les autres r&#232;gles, un volet ne montrera pas
        en cas d'&#233;chec <a href="#pane_include">"inclure" ou
        "exclure" les attributs</a> dans son &#233;l&#233;ment &lt;pane&gt; .</li>

        <li>La visibilit&#233; du volet vide est contr&#244;l&#233;e par les &#233;l&#233;ments suivants, en
        ordre de priorit&#233; croissant :

          <ul>
            <li>Les Pr&#233;f&#233;rences-&gt;Liste-&gt;Programmeur-&gt;Afficher
            Param&#233;trage des onglets vides.</li>

            <li>Si pr&#233;sent, un attribut showEmptyPanes dans le
            fichier XML du programmeur actuel.</li>



            <li>Si pr&#233;sent, un attribut showEmptyPanes dans le fichier XML
           de d&#233;finition sp&#233;cifique du d&#233;codeur .</li>
          </ul>
        </li>

        <li>S'il s'agit d'un volet vide sp&#233;cifique (tel que d&#233;fini dans 
        Panneaux Vides ci-dessus) il d&#233;pend &#233;galement du type de panneau :

          <ul>
            <li>Si le volet vide est un volet standard (tel que d&#233;fini dans
            <a href="#pane_considerations">Consid&#233;rations sur les panneaux</a>
            ci-dessus), il n'appara&#238;tra que si showEmptyPanes est dans
            force. <em>Cependant, son contenu habituel sera remplac&#233;
            par un message g&#233;n&#233;rique expliquant que le volet est inutilis&#233;
            puisque le contenu est inapplicable ou figure sur
            un autre volet.</em></li>

            <li>Si le volet vide est un volet de remplacement (tel que d&#233;fini
            dans le point B de <a href="#pane_replacement">Volet
            Remplacement</a> ci-dessus), il n'appara&#238;tra que si
            showEmptyPanes est en vigueur.</li>

            <li>Si le volet vide est un volet personnalis&#233; (tel que d&#233;fini dans
            item A of <a href="#pane_replacement">Volet
            Remplacement</a> ci-dessus), il appara&#238;tra toujours,
            ind&#233;pendamment du fait que showEmptyPanes soit en
            vigueur.</li>
          </ul>
        </li>
      </ul><a name="pane_best_practice" id=
      "pane_best_practice"></a>

      <h4>Bonne Pratique</h4>Les utilisateurs avanc&#233;s peuvent choisir de cacher le vide
      mais l'option Afficher les onglets vides est activ&#233;e par d&#233;faut, donc 
      les utilisateurs d&#233;butants doivent savoir pourquoi les volets sont vides ou o&#249; 
      trouver les &#233;l&#233;ments qui ne figurent pas dans les volets pr&#233;vus.

      <p>La meilleure pratique recommand&#233;e est:</p>

      <ul>
        <li>Dans la mesure du possible, les articles doivent utiliser la norme existante des volets
        .</li>

        <li> Lorsqu'un volet standard existant particulier ne convient pas
        en termes de nombre d'articles ou de mise en page :

          <ul>
            <li>Cr&#233;er un <a href="#pane_replacement">panneau de remplacement</a> avec 
            le m&#234;me nom que le panneau standard existant.</li>

            <li>Pour des exemples, voir les volets "Avanc&#233;" et "Son" de
            la d&#233;finition du d&#233;codeur <a href=
            "https://github.com/JMRI/JMRI/blob/master/xml/decoders/ESU_LokSoundV4_0.xml"
            target="_blank">ESU_LokSoundV4_0</a> .</li>
          </ul>
        </li>

        <li> Lorsqu'un volet standard existant ne convient pas en termes
        de concept :

          <ul>
            <li>Cr&#233;er un ou plusieurs nouveaux <a href=
            "#pane_replacement">panneaux personnalis&#233;s</a> avec des
            noms descriptifs.</li>

            <li>Cr&#233;er des informations uniquement (pas d'affichage de variables
            &#233;l&#233;ments, juste du texte) <a href=
            "#pane_replacement">volets de remplacement</a> avec les m&#234;mes noms que 
            les volets standards existant non utilis&#233;s.Utilisez ces panneaux 
            pour expliquer pourquoi chaque volet est inutilis&#233; et/ou o&#249;
            trouver les informations qu'un utilisateur peut raisonnablement esp&#233;rer
            trouver sur ce volet. Utilisez le <a href="#html_formatting">formatage HTML
            </a> pour am&#233;liorer l'affichage de ces
            volets explicatifs.</li>

            <li>Pour des exemples, voir les volets "Lumi&#232;res" et "Niveaux sonores
            de la definition du d&#233;codeur <a href=
            "https://github.com/JMRI/JMRI/blob/master/xml/decoders/ESU_LokSoundV4_0.xml"
            target="_blank">ESU_LokSoundV4_0</a>.</li>
          </ul>
        </li>

        <li>Information seulement <a href="#pane_replacement">Volets personnalis&#233;s</a> will <em>always</em> be displayed.</li>
      </ul>

      <p>Dans certains cas, par exemple un d&#233;codeur non-locomotive pour les servos
      o&#249; aucune des volets du d&#233;codeur de locomotive n'a de sens, de sorte que 
      la d&#233;finition du d&#233;codeur contient beaucoup de volets personnalis&#233;s, c'est une
      simplification pour mettre un attribut showEmptyPanes="no" dans l'&#233;l&#233;ment de la d&#233;finition XML
      &lt;decoder-config&gt; et juste
      cacher tous ces volets vides par d&#233;faut. <a name="frag_include"
      id="frag_include"></a></p>

      <h3>Insertion des fragments de fichier f</h3>Parties communes du d&#233;codeur
      Les d&#233;finitions peuvent &#234;tre plac&#233;es dans des "fragments de fichiers ", qui peuvent
      ensuite &#234;tre inclus dans de multiples fichiers de d&#233;finition de d&#233;codeurs. Ce qui
      facilite la maintenance et la mise &#224; jour de ces
      d&#233;finitions, par exemple pour les traduire dans d'autres langues.

      <p>Par convention, nous mettons ces fichiers de fragments dans
      sous-r&#233;pertoires:</p>

      <dl>
        <dt>xml/d&#233;codeurs/nmra</dt>

        <dd>Les d&#233;finitions NMRA pour les CV, utilis&#233;es par de nombreux d&#233;codeurs
        types</dd>

        <dt>xml/d&#233;codeurs/(mfg)</dt>

        <dd> Variables sp&#233;cifiques aux fabricants, par exemple
        xml/decoders/esu</dd>
      </dl>Le format d'une inclusion est :
      <pre style="font-family : monospace ;">
     &lt;xi:include href="http://jmri.org/xml/decoders/nmra/shortAndLongAddress.xml"/&gt;
</pre>Le programme recherche d'abord ces fichiers dans le
r&#233;pertoire des pr&#233;f&#233;rences, puis dans le r&#233;pertoire des programmes
doit &#234;tre pr&#233;sent, par exemple vous avez besoin d'un r&#233;pertoire xml qui contient un
r&#233;pertoire des d&#233;codeurs dans votre r&#233;pertoire de pr&#233;f&#233;rences pour le fragment
&#224; trouver.

      <p>Utiliser un fichier existant comme exemple pour les &#233;l&#233;ments sup&#233;rieurs
      &amp; format n&#233;cessaire.</p>

    <a name="update" id="update"></a>
      <h3>Mises &#224; jour et migration</h3>
      Parfois, nous rempla&#231;ons une d&#233;finition ded&#233;codeur
       par une meilleure. L'ancienne est en usage,  mais nous avons d&#233;cid&#233; 
       de faire passer ces utilisateurs &#224; la nouvelle. Il existe des attributs 
       de niveau-mod&#232;le qui peuvent &#234;tre ajout&#233;s &#224; l'ancienne (et non &#224; l
      nouvelle) d&#233;finition pour faciliter cela :
      <pre style="font-family : monospace ;">
    &lt;model show="no" model="A4X" replacementModel="A4X" replacementFamily="Jan 2012"> ;
      </pre>
Lorsque l'utilisateur s&#233;lectionne "Mettre &#224; jour les d&#233;finitions du d&#233;codeur" dans le
menu Debogage dans la fen&#234;tre PanelPro ou le menu Action dans DecoderPro, tous
leurs entr&#233;es existantes dans l'inventaire qui utilisent une d&#233;finition de d&#233;codeur avec
replacementModel et/ou replacementFamily d&#233;finis seront mis &#224; jour
seront mis &#224; jour et remplac&#233;s par la d&#233;finition du d&#233;codeur de remplacement sp&#233;cifi&#233;. Cela permet
aux gens de continuent &#224; utiliser leur ancienne et confortable d&#233;finition de d&#233;codeur 
l'ancien dossier reste dans JMRI) jusqu'&#224; ce qu'ils d&#233;cident de passer &#224; un
nouveau.
<p>Notez qu'une mise &#224; jour d&#233;finie de cette mani&#232;re est inconditionnelle ; si les attributs de la famille et du mod&#232;le correspondent
&#224; une entr&#233;e de l'inventaire, elle sera mise &#224; jour en fonction de la nouvelle famille/mod&#232;le.
Les mises &#224; jour conditionnelles automatis&#233;es bas&#233;es sur la versionID ou la productID ne sont pas possibles
car ces valeurs sont <a href="#id">non stock&#233;es</a> dans l'entr&#233;e de l'inventaire.
Un processus de mise &#224; jour interactif est d&#233;sormais disponible dans ces cas
et utilise une syntaxe sp&#233;ciale :
<span class="since">Depuis <a href="/releasenotes/jmri4.9.5.shtml" target="_blank">JMRI 4.9.5</a></span>
</p>
      <pre style="font-family : monospace ;">
    &lt;model show="no" model="DP2X" numOuts="2" numFns="2" replacementFamily="query:Jan 2000&#124;June 2007&#124;Jan 2012"} ;
      </pre>
<p>Un champ de remplacement commen&#231;ant par la cha&#238;ne &quot;query:&quot;,
    &#233;ventuellement (de pr&#233;f&#233;rence) suivi d'une barre verticale &quot;&#124;&quot; liste s&#233;par&#233;e des remplacements possibles,
    d&#233;clenche des dialogues interactifs avec l'utilisateur, contenant des explications et des conseils suppl&#233;mentaires pour l'utilisateur.
    Cliquez sur
      <a href="/help/en/html/apps/DecoderPro/images/UpdDecDef1.png" target="_blank">ici</a>
    et
      <a href="/help/en/html/apps/DecoderPro/images/UpdDecDef2.png" target="_blank">ici</a>
    pour des exemples typiques de ces dialogues.
    Les d&#233;finitions manquantes des d&#233;codeurs seront &#233;galement d&#233;tect&#233;es. Cliquez sur
      <a href="/help/en/html/apps/DecoderPro/images/UpdDecDef3.png" target="_blank">ici</a> et
      <a href="/help/en/html/apps/DecoderPro/images/UpdDecDef4.png" target="_blank">ici</a>
    pour plus d'exemples.
      </p>
      <p> L'attribut "show" de l'&#233;l&#233;ment de mod&#232;le permet de s'assurer que les nouveaux
      utilisateurs commencent avec la nouvelle d&#233;finition. Ses valeurs possibles
      sont:</p>

      <ul>
        <li> "oui" (par d&#233;faut) - le comportement traditionnel, toujours montrer
        ce mod&#232;le et la famille qu'il contient</li>

        <li> "non" - ne jamais montrer ce mod&#232;le, m&#234;me s'il correspond &#224; une
        s&#233;lection possible. Utilis&#233; pour les (anciennes) d&#233;finitions qui
        ont &#233;t&#233; remplac&#233;es par de nouvelles.

        <li> "peut-&#234;tre" - &#224; n'afficher que si elle correspond &#224; une (possible)
        identification automatique.</li>
      </ul>Cr&#233;er une d&#233;finition enti&#232;rement nouvelle pour un
      mod&#232;le :

      <ol>
        <li>D&#233;cidez o&#249; vous voulez que le nouveau mod&#232;le soit d&#233;fini. Il doit
        avoir soit un nouveau nom de mod&#232;le, soit un nouveau nom de famille (nouveau dossier)
        ou les deux.</li>

        <li>Cr&#233;ez votre d&#233;finition.</li>

        <li>Ajouter "replacementModel" et "replacementFamily
        attribue &#224; l'ancienne d&#233;finition.</li>

        <li>G&#233;n&#233;ralement, placer l'attribut "show" dans l'ancien
        d&#233;finition &#224; "non". La seule exception &#224; cette r&#232;gle est lorsque certains
        utilisateurs voudront s&#233;lectionner l'ancienne d&#233;finition encore pour un
        nouveau d&#233;codeur, peut-&#234;tre parce que l'identification automatique peut
        distinguer les utilisations de l'ancienne d&#233;finition de la nouvelle. (par exemple
        vous divisez l'ancienne d&#233;finition en deux parties parce qu'une 
        nouvelle version de la locomotive existe)</li>
      </ol>

      <a name="capability" id="capability"></a><h3>Capacit&#233;s de programmation</h3>
      Certains d&#233;codeurs peuvent faire plus
      d'op&#233;rations de programmation, par exemple en contournant les limitations
      de Programmation des CV dans la Centrale. Les &#233;l&#233;ments "Capability"
      sont utilis&#233;s pour en informer DecoderPro.

      <h4>Acc&#232;s aux adresses CV &#233;lev&#233;es</h4>
      Certaines Centrales
      ne peueuvent acc&#233;der qu'au CV 256 ou CV512. Les fabricants de certains d&#233;codeurs
       ont int&#233;gr&#233; des m&#233;canismes permettant de contourner ce probl&#232;me. 
      Par exemple, certains d&#233;codeurs ESU peuvent utiliser des &#233;critures sur divers CV pour
      acc&#233;der &#224; des CV &#224; haute adresse. Pour indiquer &#224; DecoderPro qu'un d&#233;codeur
      peut le faire, utiliser un &#233;l&#233;ment comme :
      <pre style="font-family : monospace ;">
    &lt;capability&gt;
        &lt;name&gt;High Access via Double Index&lt;/name&gt;
        &lt;parameter name="Max Regular CV address"&gt;256&lt;/parameter&gt;
        &lt;parameter name="High Address CV"&gt;96&lt;/parameter&gt;
        &lt;parameter name="Low Address CV"&gt;97&lt;/parameter&gt;
        &lt;parameter name="Access Register CV"&gt;99&lt;/parameter&gt;
        &lt;parameter name="Modulo"&gt;100&lt;/parameter&gt;
    &lt;/capability&gt;
</pre>

      <p>Les param&#232;tres doivent appara&#238;tre dans l'ordre indiqu&#233;. Ils
      mean:</p>

      <ul>
        <li> "Adresse CV ordinaire maximale" - adresses CV &#233;gales ou inf&#233;rieures
        ce n'est pas ce m&#233;canisme qui est utilis&#233;. (Le m&#233;canisme ne sera pas utilis&#233;
        si le poste de commandement peut directement lire/&#233;crire le CV &#233;tant
        mais m&#234;me si ce n'est pas le cas, ce m&#233;canisme ne sera pas
        utilis&#233; en dessous de cette valeur)</li>

        <li> "High Address CV" - La partie haute (voir Modulo) du
        L'adresse du CV est inscrite ici au d&#233;but de la
        op&#233;ration</li>

        <li> "CV &#224; faible adresse" - La partie basse (voir Modulo) du CV
        L'adresse est &#233;crite ici comme la 2&#232;me partie de l
        operation.</li>

        <li> "Access Register CV" - apr&#232;s les valeurs d'adresse sont
        set, c'est le CV qui est lu ou &#233;crit pour lire ou set
        le CV r&#233;el souhait&#233;.</li>

        <li> "Modulo" - valeur utilis&#233;e pour diviser l'adresse r&#233;elle du CV
        entre les CV &#224; haute et basse adresse.</li>
      </ul>

      <p> Par exemple, pour &#233;crire 21 &#224; CV 614 avec les valeurs indiqu&#233;es,
      DecoderPro va:</p>

      <ul>
        <li>Ecrire 6 =(614/100) au CV 96 pour l'adresse haute
        part</li>

        <li>Ecriture 14 = (614 mod 100) au CV 97 pour l'adresse basse
        part</li>

        <li>Ecrivez 21 &#224; CV 99 pour faire le CV r&#233;el write</li>
      </ul>

      <p>Pour un exemple de positionnement de cette capacit&#233;
      dans le fichier, etc., voir l'&#233;l&#233;ment <a href=
      "https://github.com/JMRI/JMRI/blob/master/xml/decoders/ESU_LokSoundV4_0.xml"
      target="_blank">xml/decoders/ESU_LokSoundV4_0.xml</a>
      fichier.</p>

      <p><a name="zimocapability" id="zimocapability"></a> Autre
      L'approche utilis&#233;e par Zimo, par exemple, consiste &#224; fournir un moyen de mettre en page le
      l'acc&#232;s. Par exemple, pour &#233;crire 21 &#224; CV614 avec l'un d'entre eux,
      vous devez:</p>

      <ul>
        <li>Ecrire 60 =(614/100)*10 au CV 7 pour l'adresse &#233;lev&#233;e
        part</li>

        <li>Ecrivez 21 dans le CV 14 (614 mod 100) pour faire le CV r&#233;el
        write</li>
      </ul>Cet &#233;l&#233;ment de capacit&#233; fera cela :
      <pre style="font-family : monospace ;">
        &lt;capability&gt;
            &lt;name&gt;High Access via Partial Index&lt;/name&gt;
            &lt;parameter name="Max Regular CV address"&gt;100&lt;/parameter&gt;
            &lt;parameter name="High Address CV"&gt;7&lt;/parameter&gt;
            &lt;parameter name="High Address Multiplier"&gt;10&lt;/parameter&gt;
            &lt;parameter name="Modulo"&gt;100&lt;/parameter&gt;
        &lt;/capacit&#233;&gt;
</pre>Note qu'il a une valeur de "nom" diff&#233;rente. C'est ce que
s&#233;lectionne les diff&#233;rents algorithmes n&#233;cessaires ici.

      <p>Les param&#232;tres doivent appara&#238;tre dans l'ordre indiqu&#233;. Ils
      signifient:</p>

      <ul>
        <li> "Max Regular CV address"  - Les adresses de CV &#233;gales ou i
        nf&#233;rieures n'utilisent pas son m&#233;canisme (Le m&#233;canisme ne sera pas utilis&#233;
        si la centrale peut directement lire/&#233;crire le CV  CV demand&#233;, 
        mais m&#234;me s'il ne le peut pas, ce m&#233;canisme ne sera pas
        utilis&#233; en dessous de cette valeur)</li>

        <li> "High Address CV" - La partie haute (voir Modulo) de
        l'adresse du CV est inscrite ici au d&#233;but de l'op&#233;ration</li>

         <li> "Low Address CV" - La partie basse (voir Modulo) de 
         l'adresse du CV est &#233;crite ici comme la 2&#232;me partie de 
         l'op&#233;ration.</li>
         
         <li>"Access Register CV" - apr&#232;s que les valeurs d'adresse 
         aient &#233;t&#233; d&#233;finies, c'est le CV qui est lu ou &#233;crit pour 
         lire ou d&#233;finir le CV r&#233;el souhait&#233;.</li>

        <li> "Modulo" - valeur utilis&#233;e pour diviser l'adresse r&#233;elle du CV
        entre les CV &#224; adresse haute et basse.</li>
      </ul>
      
      <p> Par exemple, pour &#233;crire 21 dans CV 614 avec les valeurs indiqu&#233;es,
      DecoderPro va:</p>

      <ul>
        <li>Ecrire 6 =(614/100) au CV 96 pour la partie haute de l'adresse 
        </li>

        <li>Ecrire 14 = (614 mod 100) au CV 97 pour la partie basse de l'adresse </li>

        <li>Ecrire 21 dans CV 99 pour faire &#233;crire le CV r&#233;el </li>
      </ul>
	<p>Pour un exemple de l'endroit o&#249; placer cet &#233;l&#233;ment de capacit&#233; dans le fichier, etc., voir le <a href=
      "https://github.com/JMRI/JMRI/blob/master/xml/decoders/ESU_LokSoundV4_0.xml"
      target="_blank">xml/decoders/ESU_LokSoundV4_0.xml</a>
      fichier.</p>

      < <p><a name="zimocapability" id="zimocapability"></a> Une 
      autre approche, utilis&#233;e par exemple par Zimo, consiste &#224; 
      fournir un moyen de paginer l'acc&#232;s.  Par exemple, pour 
      &#233;crire 21 &#224; CV614 avec l'un d'entre eux,, vous devez:</p>

      <ul>
        <li>Ecrire 260 =(614/100)*10+200 &#224; CV 7 pour la partie haute 
        de l'adresse. "200" est un indicateur pour utiliser ce mode.</li>

        <li>Ecrire 21 dans le CV 14 (614 mod 100) pour faire le CV r&#233;el
        </li>
<li>R&#233;e&#233;crire 0 dans CV 7 pour r&#233;iitialiser l'indexation</li>
         </ul>Cet &#233;l&#233;ment de capacit&#233; fera cela :
      <pre style="font-family : monospace ;">
        &lt;capability&gt;
            &lt;name&gt;High Access via Partial Index avec Reset&lt;/name&gt;
            &lt;parameter name="Max Regular CV address"&gt;100&lt;/parameter&gt;
            &lt;parameter name="Adresse CV haute"&gt;7&lt;/param&#232;tre&gt;
            &lt;parameter name="High Address Multiplier"&gt;10&lt;/parameter&gt;
            &lt;parameter name="Modulo"&gt;100&lt;/parameter&gt;
            &lt;parameter name="Indicator"&gt;200&lt;/parameter&gt;
        &lt;/capacit&#233;&gt;
</pre>

      <p>Les param&#232;tres doivent appara&#238;tre dans l'ordre indiqu&#233;. Ils
      mean:</p>

      <ul>
        <li>"Max Regular CV address" Les adresses de CV &#233;gales ou inf&#233;rieures &#224; la sienne 
        n'utilisent pas ce m&#233;canisme.si la central peut directement lire/&#233;crire le CV demand&#233;, 
        mais m&#234;me s'il ne le peut pas, ce m&#233;canisme ne sera pas
        utilis&#233; en dessous de cette valeur)</li>

        <li> "High Address CV" - La partie haute (voir Modulo) de
        l'adresse du CV est inscrite ici au d&#233;but de l'op&#233;ration</li>

        <li> "High Address Multiplier" - Ceci multiplie la partie haute de 
        l'adresse du CV avant qu'elle ne soit stock&#233;e dans le CV de l'adresse 
        principale. Par exemple, en mettant un 10 ici, on peut stocker 
        la partie "haute adresse" dans le "10 i&#232;me digit" de l'Adresse Haute
        CV.</li>

        <li> "Modulo" - valeur utilis&#233;e pour diviser l'adresse r&#233;elle 
        du CV entre les CV &#224; adresse haute et basse .</li>

        <li> "Indicator" - valeur ajout&#233;e &#224; la valeur stock&#233;e
        dans l'adresse haute du CV pour indiquer au d&#233;codeur d'utiliser ce mode.</li>
      </ul>

      <a id="accessoryops" name="accessoryops"></a>
      <h4>Accessory Decoder Ops Mode</h4>
      Certains d&#233;codeurs accessoires n&#233;cessitent des paquets de programmation 
      sp&#233;ciaux pour configurer leurs CV &#224; partir du signal de la voie DCC.
      La capacit&#233; de faire cela est &#233;crite :
      <pre style="font-family : monospace ;">
        &lt;capability&gt;
            &lt;name&gt;Ops Mode Accessory Programming&lt;/name&gt;
            &lt;parameter name="Address Type"&gt;decoder&lt;/parameter&gt;
            &lt;nom du param&#232;tre="Delay"&gt;200&lt;/param&#232;tre&gt;
        &lt;/capacit&#233;&gt;
</pre>Le param&#232;tre "Address Type" est facultatif :
      <ul>
          <li>Si elle est "d&#233;coder" ou omise, l'adresse actuelle est interpr&#233;t&#233;e comme une adresse de d&#233;codeur accessoire de 9 bits.</li>
          <li>Si elle est "accessory" ou "output", l'adresse actuelle est interpr&#233;t&#233;e comme une adresse de sortie accessoire de 11 bits.</li>
          <li>Si c'est un "signal", l'adresse actuelle est interpr&#233;t&#233;e comme une adresse de d&#233;codeur de signal de 11 bits.</li>
          <li>
              Si elle est "altsignal", l'adresse actuelle est interpr&#233;t&#233;e comme une adresse de d&#233;codeur de signal de 11 bits,
              en utilisant une autre interpr&#233;tation de
              <a href="https://www.nmra.org/sites/default/files/s-9.2.1_2012_07.pdf"
                target="_blank">NMRA standard 9.2.1</a>).
           </li>
          <li>
              S'il s'agit d'un "h&#233;ritage", l'adresse actuelle est interpr&#233;t&#233;e comme une adresse sur 9 bits (comme pour le "d&#233;codeur")
              mais un paquet de programmation "h&#233;rit&#233;e" (selon l'annexe A de
              <a href="https://www.nmra.org/sites/default/files/s-9.2.1_2012_07.pdf"
                target="_blank">NMRA standard 9.2.1</a>)
           est envoy&#233;.
          </li>
      </ul>
      Le param&#232;tre "Retard" est facultatif et sp&#233;cifie un retard minimum (en millisecondes)
      entre des &#233;critures successives. Certains d&#233;codeurs manqueront des commandes si le d&#233;lai est trop court.
      Si ce param&#232;tre est omis, le d&#233;lai par d&#233;faut est de 500 millisecondes.
       <p>
        Notez que cela ne fonctionne que pour les &#233;critures en mode ops; 
        ces paquets DCC NMRA particuliers ne fonctionnent ni en mode 
        lecture, ni en mode service (voie de programmation).
      </p>

      Notez un &#233;l&#233;ment :
      <pre style="font-family : monospace ;">
        &lt;variable &#8230 ; item="Short Address" &#8230;> ;
            &#8230 ;
        &lt;/variable&gt;</pre>
      ou :
      <pre style="font-family : monospace ;">
        &lt;variable &#8230 ; item="Long Address" &#8230;> ;
            &#8230 ;
        &lt;/variable&gt;</pre>
      est n&#233;cessaire pour que le programmeur en Mode Ops ait une adresse &#224; utiliser.
      Les deux formulaires fonctionnent de mani&#232;re identique.
      Le param&#232;tre "Address Type" est le seul moyen de sp&#233;cifier si l'adresse est sur 9 ou 11 bits.
      <p>Pour un exemple de travail, voir le
      <a href=
      "https://github.com/JMRI/JMRI/blob/master/xml/decoders/ESU_SwitchPilot.xml"
      target="_blank">xml/decoders/ESU_SwitchPilot.xml</a> fichier.
      Dans le cas de cet exemple de d&#233;codeur, l'adresse est stock&#233;e dans les CV 1 et 9 selon
      <a href=
      "http://www.nmra.org/sites/default/files/standards/sandrp/pdf/s-9.2.2_decoder_cvs_2012.07.pdf"
            target="_blank">
      Norme NMRA 9.2.2</a>.
      </p>

      <a id="opsdelayed" name="opsdelayed"></a>
      <h4>Programmation retard&#233;e en Mode Ops</h4>
       <p>
      La plupart des d&#233;codeurs de locomotives acceptent des paquets de programmation sp&#233;ciaux
      pour configurer leurs CV &#224; partir du signal de voie DCC (Programmation sur la voie principale).
      </p>
      Toutefois, ces paquets prennent du temps &#224; traiter et si des paquets ult&#233;rieurs sont envoy&#233;s
      trop t&#244;t, on peut les manquer.
      La possibilit&#233; d'ajouter un d&#233;lai apr&#232;s la programmation de chaque CV est &#233;crite :
      <pre style="font-family : monospace ;">
        &lt;capability&gt;
            &lt;name&gt;Ops Mode Delayed Programming&lt;/name&gt;
            &lt;parameter name="Delay"&gt;500&lt;/parameter&gt;
        &lt;/capacit&#233;&gt;
</pre>Le param&#232;tre "Delay" sp&#233;cifie
      un d&#233;lai minimum (en millisecondes) entre les &#233;critures successives.
      Certains d&#233;codeurs manquent des commandes si le d&#233;lai est trop court.
      Si ce param&#232;tre est omis, le d&#233;lai par d&#233;faut est de 500 millisecondes.


       <p>
        Notez que cela ne fonctionne que pour les &#233;critures en mode ops; 
        ces paquets DCC NMRA particuliers ne fonctionnent ni en mode 
        lecture, ni en mode service (voie de programmation)..
      </p>
       <p>
        Il convient &#233;galement de noter que cette capacit&#233; particuli&#232;re ne 
        fonctionne que pour les d&#233;codeurs multifonctions. Les d&#233;codeurs 
        accessoires doivent utiliser le
        <a href="#accessoryops">Mode d'exploitation du d&#233;codeur d'accessoires</a>
        qui poss&#232;de son propre param&#232;tre "d&#233;lai".
      </p>

      <a name="indexedcap" id="indexedcap"></a>
      <h4>Acc&#232;s au CV index&#233;</h4>
      Pour acc&#233;der aux CV index&#233;s, il suffit d'inclure cet
      &#233;l&#233;ment de capacit&#233; :
      <pre style="font-family : monospace ;">
        &lt;capability&gt;
            &lt;name&gt;Indexed CV access&lt;/name&gt;
            &lt;parameter name="PI"&gt;31&lt;/parameter&gt;
            &lt;parameter name="SI"&gt;32&lt;/parameter&gt;
            &lt;parameter name="cvFirst"&gt;false&lt;/parameter&gt;
            &lt;parameter name="skipDupIndexWrite"&gt;true&lt;/parameter&gt;
        &lt;/capacit&#233;&gt;
</pre>
      <p>Si cvFirst est vrai, le format est CV.PI ou CV.PI.SI tel qu'utilis&#233;
        par QSI. Si elle est fausse, le format est PI.CV ou PI.SI.CV tel qu'utilis&#233; par
        ESU.
        
      <p>Les num&#233;ros de CV PI et/ou SI peuvent &#233;galement &#234;tre d&#233;finis en utilisant une syntaxe "nn=nn" lors de la sp&#233;cification
        PI et/ou SI.  Par exemple, en utilisant une fausse syntaxe cvFirst, "101=12.80" met CV101 &#224; 12 avant
        l'acc&#232;s au CV 80, quelle que soit la valeur PI configur&#233;e dans la capacit&#233;.

      <p>Si skipDupIndexWrite est vrai, certaines &#233;critures dans le PI et le SI
        les CV peuvent &#234;tre ignor&#233;s si l'utilisateur choisit de le faire. Cela permet d'acc&#233;l&#233;rer l'acc&#232;s.
        Certains d&#233;codeurs exigent que les CV soient &#233;crits pour chaque op&#233;ration, 
        dans ce cas, il faut le mettre sur false. La valeur par d&#233;faut est true.
      
      <p>Si ce param&#232;tre et les capacit&#233;s d'"acc&#232;s aux CV &#233;lev&#233;s" sont
      pr&#233;sent, celui-ci doit &#234;tre list&#233; en deuxi&#232;me position.</p>

      <p>Pour un exemple de positionnement, etc.
      <a href=
      "https://github.com/JMRI/JMRI/blob/master/xml/decoders/ESU_LokSoundV4_0.xml"
      target="_blank">xml/decoders/ESU_LokSoundV4_0.xml</a> fichier.
      </p>

        <a id="tcsaccess" name="tcsaccess"></a>
      <h4>Acc&#232;s au d&#233;codeur TCS WOW</h4>Les d&#233;codeurs TCS WOW utilisent
      plusieurs m&#233;thodes uniques (pour le moins) d'acc&#232;s au CV. JMRI
      les accueille par le biais d'un &#233;l&#233;ment de capacit&#233; sp&#233;ciale :
      <pre style="font-family : monospace ;">
        &lt;capability&gt;
            &lt;name&gt;TCS 4 CV access&lt;/name&gt;
        &lt;/capability&gt;
</pre>Cela fournit deux formats de CV personnalis&#233;s :

      <ul>
        <li>T2CV.11.12 &#233;crit 11 au premier index CV (201), 12 au
        2&#232;me index CV (202), puis fait l'&#233;criture/la lecture/confirmation 
        sur les CV 203 et 204</li>

        <li>T3CV.11.12.13 &#233;crit 11 au premier index CV (201),
        les donn&#233;es au 2&#232;me index CV (202), puis &#233;crit 12 au CV203
        et 13 &#224; CV204.</li>
      </ul>Pour des exemples d'utilisation, voir voir la d&#233;finition 
      du d&#233;codeur WOW du TCS..

      <a name="splitval" id="splitval"></a>
      <h3>Variables fractionn&#233;es - r&#233;parties sur plusieurs CV</h3>

      <span class="since">Depuis <a href="jmri4.15.5.shtml">JMRI 4.15.5</a></span>

      <p>Certains d&#233;codeurs utilisent des variables r&#233;parties sur plusieurs CV, contigus ou non.</p>

      <p>Un certain nombre de types sont pr&#233;vus pour faire face &#224; cette situation:</p>
      <ul>
          <li>
              A <a href="/JavaDoc/doc/jmri/jmrit/symbolicprog/SplitVariableValue.html" target="_blank">splitVal</a>
              type. Il s'agit d'une valeur num&#233;rique stock&#233;e dans plusieurs CV (test&#233;s jusqu'&#224; 8 CV).
              <ul>
                  <li>
                      Pour des exemples, voir <a href= "#splitvalExemple">splitVal exemple</a> ci-dessous et ceci
                      <a href= "https://github.com/JMRI/JMRI/blob/master/xml/decoders/esu/v4decoderInfoCVs.xml" target="_blank">
						  fichier de fragments de d&#233;codeur</a>.
                  </li>
                  <li>
                      Pour plus de d&#233;tails sur les attributs requis/optionnels et les fonctionnalit&#233;s avanc&#233;es, voir 
                      cette <a href="/JavaDoc/doc/jmri/jmrit/symbolicprog/SplitVariableValue.html" target="_blank">Page JavaDoc</a>.
                  </li>.
              </ul>
          </li>
          <li>
              A <a href="/JavaDoc/doc/jmri/jmrit/symbolicprog/SplitHexVariableValue.html" target="_blank">splitHexVal</a>
              type. C'est comme
              <a href="/JavaDoc/doc/jmri/jmrit/symbolicprog/SplitVariableValue.html" target="_blank">splitVal</a>
              mais avec le nombre saisi et affich&#233; en hexad&#233;cimal. Un attribut facultatif "case=" peut &#234;tre utilis&#233; pour forcer
              le num&#233;ro &#224; afficher en "majuscules" ou "minuscules".
              <ul>
                  <li>
                      Pour des exemples, voir
                      <a href= "https://github.com/JMRI/JMRI/blob/master/xml/decoders/esu/v4decoderInfoCVs.xml" target="_blank">fichier 
                      de fragments de d&#233;codeur</a>.
                  </li>

                  <li>
                      Pour plus de d&#233;tails, voir cette <a href="/JavaDoc/doc/jmri/jmrit/symbolicprog/SplitHexVariableValue.html" target="_blank">Page JavaDoc</a>.
                  </li>.
              </ul>
          </li>
          <li>
              Un type <a href="/JavaDoc/doc/jmri/jmrit/symbolicprog/SplitDateTimeVariableValue.html" target="_blank">splitDateTimeValue</a>
              C'est comme
              <a href="/JavaDoc/doc/jmri/jmrit/symbolicprog/SplitVariableValue.html" target="_blank">splitVal</a>
              mais le nombre affich&#233; repr&#233;sente une valeur de date et/ou d'heure.
              <ul>
                  <li>
                      Pour des exemples, voir
                      <a href= "https://github.com/JMRI/JMRI/blob/master/xml/decoders/esu/v4decoderInfoCVs.xml" target="_blank"> fragments de fichier de d&#233;codeur</a>.
                  </li>
                  <li>
                      Pour plus de d&#233;tails sur les attributs requis/optionnels et les fonctionnalit&#233;s avanc&#233;es, voir cette <a href="/JavaDoc/doc/jmri/jmrit/symbolicprog/SplitDateTimeVariableValue.html" target="_blank">page JavaDoc</a>.
                  </li>.
              </ul>
          </li>
          <li>
              Un type <a href="/JavaDoc/doc/jmri/jmrit/symbolicprog/SplitTextVariableValue.html" target="_blank">splitTextVal</a>
              type. C'est comme
              <a href="/JavaDoc/doc/jmri/jmrit/symbolicprog/SplitVariableValue.html" target="_blank">splitVal</a>
              mais permet la saisie, le stockage (dans les CV) et l'affichage de cha&#238;nes de texte.
              Le nombre de CV attribu&#233;s par l'utilisateur dans la d&#233;finition r&#233;git la longueur maximale de la cha&#238;ne.
              <ul>
                  <li>
                      Pour des exemples, voir
                      <a href= "https://github.com/JMRI/JMRI/blob/master/xml/decoders/esu/v4projectInfoCVs.xml" target="_blank">fragments de fichier de d&#233;codage</a>.
                  </li>
                  <li>
                      Pour plus de d&#233;tails sur les attributs requis/optionnels et les fonctions avanc&#233;es, voir
                      <a href="/JavaDoc/doc/jmri/jmrit/symbolicprog/SplitTextVariableValue.html" target="_blank">Page JavaDoc</a>.
                  </li>.
              </ul>
          </li>
      </ul>

      La technique originale consistant &#224; sp&#233;cifier un "CV" et un "CV &#233;lev&#233;" n'est pas appropri&#233;e
      dans les cas o&#249; un nombre beaucoup plus important de CV est n&#233;cessaire. .D'autres m&#233;thodes plus 
      concises de sp&#233;cification de CV multiples (contigus ou non) dans le param&#232;tre de 
      variable "CV" sont d&#233;sormais disponibles :
      <ul>
          <li>
              Les m&#233;thodes disponibles (avec des exemples de cha&#238;nes de caract&#232;res) sont d&#233;taill&#233;es sous
              <a href="/JavaDoc/doc/jmri/util/CvUtil.html#expandCvList-java.lang.string-" target="_blank">expandCvList</a>
              &#224; ce sujet
              <a href="/JavaDoc/doc/jmri/util/CvUtil.html#expandCvList-java.lang.string-" target="_blank">JavaDoc page</a>.
          </li>.
          <li>
              Par exemple, cette
              <a href= "https://github.com/JMRI/JMRI/blob/master/xml/decoders/esu/v4projectInfoCVs.xml" target="_blank">fragments de fichier de d&#233;codeur</a>
              a <a href="/JavaDoc/doc/jmri/jmrit/symbolicprog/SplitTextVariableValue.html" target="_blank">splitTextVal</a>
              n&#233;cessitant 28 CV.
          </li>
          <li>
              On trouvera d'autres exemples dans ce
              <a href= "https://github.com/JMRI/JMRI/blob/master/xml/decoders/esu/v4decoderInfoCVs.xml" target="_blank">fragments de fichier de d&#233;codeur</a>.
          </li>
          <li>
              L'exemple suivant indique la Date de production de RailCom&reg; selon la
              <a href="http://www.nmra.org/sites/default/files/s-9.3.2_2012_12_10.pdf">
              Norme NMRA 9.3.2</a> :
          </li>
      </ul>
      
      <pre style="font-family : monospace ;">
    &lt;variable CV="0.255.269:4" readOnly="yes" item="PDate"} ;
        &lt;splitDateTimeVal display="dateOnly" base="2000-01-01T00:00:00"/&gt;
        &lt;label&gt;Production Date&lt;/label&gt;
    &lt;/variable&gt;
      </pre>


      <a name="splitvalExemple" id="splitvalExemple"></a>
      <h4>splitVal exemple - adresses "longues" sur 2 CVs</h4>

      <p>Certains d&#233;codeurs, principalement des d&#233;codeurs accessoires, utilisent des 
      adresses "longues" r&#233;parties sur 2 CV, contigus ou non..</p>

      <p>CV1 et CV9 sont normalis&#233;s par le NMRA pour 
      l'adresse primaire des d&#233;codeurs accessoires, voir la <a href=
      "http://www.nmra.org/sites/default/files/standards/sandrp/pdf/s-9.2.2_decoder_cvs_2012.07.pdf">
      Norme NMRA 9.2.2</a>.</p>

      <p>Les adresses longues sont accessibles via le type "splitVal", comme dans
      l'exemple suivant:</p>
      <pre style="font-family : monospace ;">
    &lt;variable CV="1" item="Short Address" default="1" minOut="1"&gt;
        &lt;splitVal highCV="9" upperMask="XXXXXVVV"/&gt;
        &lt;label&gt;Accessory Address&lt;/label&gt;
    &lt;/variable&gt;
</pre>

      <p>Le "CV" d&#233;clar&#233; est le LSB (octet le moins significatif)
      alors que le "highCV" est le MSB (Most Significant Byte).</p>


   <p>splitVal a en fait deux param&#232;tres, un "facteur" et une
      " Offsetse ":</p>

      <ul>
        <li>Valeur &#224; mettre dans les CV = ((valeur dans le champ de texte) -
        Compensation)/Facteur</li>

        <li>Valeur &#224; mettre dans le champ de texte = ((valeur dans les CV) * Facteur)
        + Offset</li>
      </ul>
      <pre style="font-family : monospace ;">
    &lt;splitVal highCV="9" factor="4" offset="-3"/&gt;
</pre>

      <p>Pour un exemple, voir le fichier <a href=
      "https://github.com/JMRI/JMRI/blob/master/xml/decoders/SPROG_DCC_Servo6.xml"
      target="_blank">xml/decoders/SPROG_DCC_Servo6.xml</a>
      f.</p>

      
      <a name="conditional" id="conditional"></a>
      <h3>D&#233;finitions des d&#233;codeurs conditionnels</h3>Pour r&#233;duire le nombre
      des fichiers de d&#233;finition de d&#233;codeur n&#233;cessaires, chaque fichier peut contenir
      les d&#233;finitions de plusieurs mod&#232;les de d&#233;codeurs. JMRI fournit des moyens
      d'adapter la d&#233;finition &#224; des mod&#232;les sp&#233;cifiques, tant au moment o&#249; le fichier 
      est initialement d&#233;velopp&#233; pour &#234;tre utilis&#233;, que plus tard pendant que le 
      programme travaille sur la d&#233;finition. Ces mesures sont particuli&#232;rement 
      utiles lorsqu'on utilise un  fragment de fichier commun qui pourrait &#234;tre
      inclus par de multiples fichiers de d&#233;finition de d&#233;codeur (d&#233;finissant des
      familles diff&#233;rentes mais similaires) <a name="var_include" id=
      "var_include"></a>

       <h4>Inclure/Exclure pendant l'extension de la variable</h4>L'extension et 
       l'utilisation de l'&#233;l&#233;ment variable peuvent &#234;tre conditionn&#233;es par le 
       type de d&#233;codeur en utilisant les attributs "inclure" et "exclure
      sur les &#233;l&#233;ments ; variables&gt; ,,variable&gt;,
      sur &lt;enumChoice&gt; et sur &lt;enumChoiceGroup&gt; .

      <p>Une d&#233;finition de variable ne sera pas &#233;tendue et utilis&#233;e:</p>

      <ul>
        <li>Si un attribut d'exclusion est pr&#233;sent, ni l'ID produit du 
        d&#233;codeur, ni le nom du mod&#232;le, ni nom de famille n'est trouv&#233;
        dans la liste d'exclusion.</li>

        <li>Si un attribut include est pr&#233;sent, au moins un des
        num&#233;ro d'identification du produit, le nom du mod&#232;le ou le nom de famille du d&#233;codeur est trouv&#233;
        dans la liste d'inclusion.</li>
      </ul>Ces deux conditions doivent &#234;tre remplies, et il est possible
      d'utiliser &#224; la fois l'inclusion et l'exclusion sur le m&#234;me &#233;l&#233;ment, 
      mais il est habituel de n'en utiliser qu'un seul.

      <p>Exemple:</p>
      <pre style="font-family : monospace ;">
      &lt;variable label="My Variable" CV="72" include="ModelA,400" ;
        &lt;decVal/&gt;
      &lt;/variable&gt;
</pre>

      <p>La variable ci-dessus n'appara&#238;tra que lors de l'expansion de la
      d&#233;finition du d&#233;codeur pour le mod&#232;le A ou l'ID de produit 400.</p>

      <p> Vous pouvez &#233;galement mettre des attributs d'inclusion et d'exclusion sur
      les choix individuels dans une variable de type &#233;num&#233;ration. Cela peut
      &#234;tre utilis&#233; pour, par exemple, n'inclure que des options d'&#233;clairage sp&#233;cifiques dans
      certaines familles de d&#233;codeurs.</p>

      <p>Les Attributs sur un &#233;l&#233;ment &lt;variables&gt; agiront sur tous les &#233;l&#233;ments 
      &lt;variable&gt; &#224; l'int&#233;rieur de celui-ci, ainsi que tout attribut 
      d'inclusion ou d'exclusion sur ces variables individuelles.</p>
      
      <p> Vous pouvez &#233;galement utiliser le m&#233;canisme d'inclusion
      pour sp&#233;cifier la valeur par d&#233;faut d'une variable.
      <p>Exemple:</p>
      <pre style="font-family : monospace ;">
      &lt;variable label="My Variable" CV="72" default="3"&gt;
        &lt;defaultItem default="12" include="815"/&gt;  
        &lt;decVal/&gt;
      &lt;/variable&gt;
</pre>
      <p>Ceci d&#233;finira la valeur par d&#233;faut (initiale)
      du CV &#224; 12 si le "815" correspond, 
      et utiliser autrement le d&#233;faut de 3.
      Vous pouvez avoir autant d'&#233;l&#233;ments defaultItem
      selon les besoins ; le premier qui correspond est utilis&#233;.</p>
      
      <a name="pane_include" id="pane_include"></a>

      <h4>Inclure/Exclure pendant la cr&#233;ation du volet</h4>La cr&#233;ation 
      d'un volet ou d'une partie de volet peut &#234;tre conditionn&#233;e par le 
      type de d&#233;codeur en utilisant les attributs "include" et "exclude" 
      sur les &#233;l&#233;ments&lt;pane&gt; and;group&gt; ..

      <p>Un volet ne sera pas cr&#233;&#233;:</p>

      <ul>
        <li>Si un attribut d'exclusion est pr&#233;sent, au moins l' ID produit du 
        d&#233;codeur ou nom du mod&#232;le, ou nom de famille n'est trouv&#233;
        dans la liste d'exclusion.</li>
        <li>Si un attribut include est pr&#233;sent, au moins l' ID produit du 
        d&#233;codeur ou nom du mod&#232;le, ou nom de famille est trouv&#233;
        dans la liste d'exclusion.</li>
      </ul>Ces deux conditions doivent &#234;tre remplies, et il est possible
      d'utiliser &#224; la fois l'inclusion et l'exclusion sur le m&#234;me &#233;l&#233;ment, mais c'est
      plus habituel de n'en utiliser qu'un.

      <p>Exemple:</p>
      <pre style="font-family : monospace ;">
      &lt;pane label="My Pane" include="ModelA,400"> ;
        ...
      &lt;/pane&gt;
</pre>

      <p> "Mon volet" ne sera cr&#233;&#233; que lors de de l'extension de la 
      d&#233;finition du d&#233;codeur pour le mod&#232;le A ou l'ID de produit 400.</p>

      <p>Vous pouvez aussi cr&#233;er un &#233;l&#233;ment de type &lt;group&gt; avec include
      et exclure des attributs. Les &#233;l&#233;ments &#224; l'int&#233;rieur du &lt;group&gt;
      ne seront cr&#233;&#233;s que si les conditions du &lt;group&gt; sont remplies.
      Cela peut &#234;tre utilis&#233; pour, par exemple, afficher des &#233;tiquettes de texte sp&#233;cifiques uniquement
      pour certains mod&#232;les de d&#233;codeurs.</p>




      <p>Exemple:</p>
      <pre style="font-family : monospace ;">
      &lt;group include="ModelA,400"> ;
        &lt;label&gt;
          &lt;text&gt;Ces d&#233;codeurs sont tr&#232;s vieux.&lt;/text&gt;
        &lt;/label&gt;
        &lt;label&gt;
          &lt;text&gt;Certaines fonctionnalit&#233;s sont indisponibles.&lt;/text&gt;
        &lt;/label&gt;
      &lt;/group&gt;
</pre>

      <p>Le texte ne sera cr&#233;&#233; que lors de l'extension de la 
      d&#233;finition du d&#233;codeur pour le mod&#232;le A ou l'ID de produit 400.</p>

      <a name="prodidwarn" id="prodidwarn"></a>
      <h4>Avertissement concernant l'utilisation de l'identification du produit dans Include/Exclude</h4>
      Il convient de faire preuve de prudence lorsqu'on tente de faire correspondre des attributs d'inclusion 
      ou d'exclusion avec l'ID du produit.. L'ID du produit ne correspond &#224; aucune valeur lue dans le
      d&#233;codeur pendant l'<a href="#id">identification</a>
      mais par rapport &#224; l'attribut productID sp&#233;cifi&#233; dans la d&#233;finition du d&#233;codeur.
      Cela peut &#234;tre particuli&#232;rement probl&#233;matique si l'attribut productID a plusieurs valeurs.
        Par exemple, l'attribut
        <pre style="font-family : monospace ;">
  color=;decoder&gt;
    &lt;family name="My Big Family" mfg="NMRA"> ;
      &lt;model model="My Model" productID="400,401" /&gt;
      &lt;/model&gt;
    &lt;/family&gt;
    &#8230 ;
  &lt;/decoder&gt;
  &lt;pane label="My 400 Pane" include="400"} ;
    &#8230 ;
  &lt;/pane&gt;
  &lt;pane label="My 401 Pane" include="401"} ;
    &#8230 ;
  &lt;/pane&gt;</pre>

      Les deux volets seront toujours cr&#233;&#233;s.
      Si les d&#233;finitions doivent diff&#233;rer entre les ID de produits, vous devrez cr&#233;er deux
      mod&#232;les
      <a href="#id">le premier exemple sous Identification</a>.

      <a name="qualify" id="qualify"></a>
      <h4>Qualification des variables</h4>

      <h5>Variables qualificatives</h5>Un &#233;l&#233;ment "qualifiant" sur 
      un &#233;l&#233;ment de variable vous permet d'activer ou de d&#233;sactiver la variable
      en fonction de la valeur actuelle d'une autre variable. Cela peut
      &#234;tre utile si, par exemple, le d&#233;codeur dispose d'un CV "mode" qui
      d&#233;termine la signification des autres CV.

      <p>Si une variable est qualifi&#233;e d'inactive, elle n'appara&#238;t dans 
      aucun volet et n'est ni lue ni &#233;crite dans le d&#233;codeur et n'est 
      ni lu ni &#233;crit sur le d&#233;codeurlorsque vous effectuez des op&#233;rations 
      de lecture ou d'&#233;criture de type "Tout" ou "Modifications seulement".
      La valeur est enregistr&#233;e dans le fichier et sera recharg&#233;e lorsque
      l'entr&#233;e de l'inventaire est r&#233;ouverte plus tard.</p>

      <p>Dans l'exemple suivant, un CV est interpr&#233;t&#233; comme deux
      deux variables diff&#233;rentes  selon que le d&#233;codeur est r&#233;gl&#233; ou non
      pour un adressage court ou long.</p>
      <pre style="font-family : monospace ;">
  &lt;variable label="Variable for Short Address" CV="11"&gt;
    &lt;qualifier&gt;
      &lt;variableref&gt;Address Format&lt;/variableref&gt;
      &lt;relation&gt;eq&lt;/relation&gt;
      &lt;value&gt;0&lt;/valeur&gt;
    &lt;/qualifier&gt;
    &lt;decVal/&gt;
  &lt;/variable&gt;
  &lt;variable label="Variable for Long Address" CV="11" ;
    &lt;/qualifier&gt;
      &lt;variableref&gt;Address Format&lt;/variableref&gt;
      &lt;relation&gt;eq&lt;/relation&gt;
      &lt;value&gt;1&lt;/value&gt;
    &lt;/qualifier&gt;
    &lt;decVal/&gt;
  &lt;/variable&gt;
</pre> Les autres op&#233;rateurs disponibles sont "gt", "ge", "ne", "lt",
"le" et "exists". L'op&#233;rateur "exists" v&#233;rifie si une
variable est d&#233;finie ou non ; une valeur de "1" signifie 
qu'elle l'est, et une valeur de "0" qu'elle est signifie 
que ce n'est pas le cas.

      <p>Si plusieurs &#233;l&#233;ments qualificatifs sont pr&#233;sents, tous doivent &#234;tre
      true pour que la variable soit active et affich&#233;e.</p><a name=
      "panes" id="panes"></a>

      <h5>Volets qualifiants</h5>Un &#233;l&#233;ment "qualifiant" sur un volet
      vous permet d'activer ou de d&#233;sactiver le volet en fonction de
      la valeur actuelle d'une variable.

      <p>Si un volet est qualifi&#233; d'inactif, son contenu n'est plus 
      affich&#233;. Cela inclut les &#233;tiquettes ou autres d&#233;corations
      sur le volet, en plus des variables qu'il contient.
      En fonction des autres options, le volet peut soit s'afficher comme
      vide, ou ne pas se montrer du tout. Les variables qu'il contient sont toujours
      actives, cependant, et un "Lire toutes les feuilles" ou "Ecrire toutes les feuilles".
      les &#233;crira encore. Si vous avez des d&#233;finitions de variables qui se 
      chevauchent, examinez attentivement si c'est ce que vous voulez. 
      Vous pourriez avoir besoin de qualifier les diff&#233;rentes variables 
      de chevauchement.</p>

      <p> L'exemple suivant permet d'activer l'un des deux volets selon
      sur le fait que le d&#233;codeur est actuellement r&#233;gl&#233; pour l'adressage court ou long.</p>
      <pre style="font-family: monospace;">
  &lt;pane name="Short Only"&gt;
    &lt;qualifier&gt;
      &lt;variableref&gt;Address Format&lt;/variableref&gt;
      &lt;relation&gt;eq&lt;/relation&gt;
      &lt;value&gt;0&lt;/value&gt;
    &lt;/qualifier&gt;
    &lt;column&gt;&lt;row&gt;
      &lt;label label="Short Only Pane"/&gt;
    &lt;/row&gt;&lt;/column&gt;
  &lt;/pane&gt;
  &lt;pane name="Long Only"&gt;
    &lt;qualifier&gt;
      &lt;variableref&gt;Address Format&lt;/variableref&gt;
      &lt;relation&gt;eq&lt;/relation&gt;
      &lt;value&gt;1&lt;/value&gt;
    &lt;/qualifier&gt;
    &lt;column&gt;&lt;row&gt;
      &lt;label label="Long Only Pane"/&gt;
    &lt;/row&gt;&lt;/column&gt;
  &lt;/pane&gt;
</pre> Les autres op&#233;rateurs disponibles comprennent "gt", "ge", "ne", "lt" et
"le".

      <p>Si plusieurs &#233;l&#233;ments qualificatifs sont pr&#233;sents, tous doivent &#234;tre
      true  pour que le volet soit actif et affich&#233;. <un nom=
      "labels" id="labels"></a></p>

      <h5>Elements qualificatifs sur les panneaux</h5>Un &#233;l&#233;ment "qualificatif" sur
      un &#233;l&#233;ment  "label", "soundlabel", "row", "column", "grid" ou 
      "griditem"  vous permet d'activer ou de d&#233;sactiver
      l'affichage de cet &#233;l&#233;ment sur un panneau sp&#233;cifique.

      <p> L'exemple suivant affiche un avertissement si un &#233;l&#233;ment
      variable version-number a une valeur trop faible:</p>
      <pre style="font-family : monospace ;">
    &lt;label label="Num&#233;ro de version trop bas !"> ;
      &lt;qualifier&gt;
        &lt;variableref&gt;Num&#233;ro de version&lt;/variableref&gt;
        &lt;relation&gt;lt&lt;/relation&gt;
        &lt;value&gt;3&lt;/value&gt;
      &lt;/qualifier&gt;
    &lt;/label&gt;
</pre>

      <p>Vous pouvez utiliser le m&#234;me qualificatif pour plusieurs &#233;l&#233;ments en
      en incluant les &#233;l&#233;ments dans un &#233;l&#233;ment "groupe" et en ajoutant le
      qualificatif de l'&#233;l&#233;ment "groupe":</p>
      <pre style="font-family : monospace ;">
    &lt;group&gt;
      &lt;qualifier&gt;
        &lt;variableref&gt;Version Number&lt;/variableref&gt;
        &lt;relation&gt;lt&lt;/relation&gt;
        &lt;value&gt;3&lt;/value&gt;
      &lt;/qualifier&gt;
      &lt;label label="Version number too low !"/&gt;
      &lt;label label=" "/&gt;
      &lt;label label="Please update."/&gt;
    &lt;/group&gt;
</pre>

      <p>Une fois que vous avez lu le num&#233;ro de version (variable ou CV) du
       d&#233;codeur, l'&#233;tiquette (ou les &#233;tiquettes) affichera si cette version
      est trop faible. Notez qu'initialement, avant que les valeurs soient
      lue &#224; partir du d&#233;codeur, cet affichage d&#233;pendra de la
      valeur par d&#233;faut du fichier, ce qui pourrait induire en erreur l'utilisateur
      user.</p>
      <h3>Utilisation des transformations XSL</h3>
      <p>
          Il est possible de g&#233;n&#233;rer des parties complexes et r&#233;p&#233;t&#233;es du d&#233;codeur XML en utilisant des feuilles de style XSL.
          Pour plus d'informations, veuillez consulter<a href="TransformDecoder.shtml">Utiliser la transformation XSLT pour les d&#233;codeurs complexes</a>.
      </p>
      <!--#include virtual="/Footer.shtml" -->
    </div><!-- closes #mainContent-->
  </div><!-- closes #mBody-->
</body>
</html>

    
