<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01//EN"
"http://www.w3.org/TR/html4/strict.dtd">
<html lang="fr">
<head>
<meta name="generator" content=
"HTML Tidy for Mac OS X (vers 31 October 2006 - Apple Inc. build 15.17), see www.w3.org">
<!-- Copyright Bob Jacobsen 2008 -->
<!--Updated et Translated by Herv&#233; Blorec le 2013-08-30 -->
<title>JMRI: DecoderPro User Guide - Creating A Custom Decoder
File</title>
<!-- Style -->
<meta http-equiv="Content-Type" content=
"text/html; charset=us-ascii">
<link rel="stylesheet" type="text/css" href="/css/default.css"
media="screen">
<link rel="stylesheet" type="text/css" href="/css/print.css" media=
"print">
<link rel="icon" href="/images/jmri.ico" type="image/png">
<link rel="home" title="Home" href="/"><!-- /Style -->
</head>
<body>
<!--#include virtual="/Header" -->
<div id="mBody"><!--#include virtual="Sidebar" -->
<div id="mainContent">
<h1>Guide Utilisateur DecoderPro-Cr&eacute;ation d'un fichier
d&eacute;codeur personnalis&eacute;</h1>
<p>Cette page fournit un peu d'information sur la m&eacute;thode de
travail des fichiers de configurations pour le Programmateur
Symbolique DecoderPro.</p>
<p>Dans ce guide utilisateur, nous allons cheminer &aacute; travers
le processus de cr&eacute;ation d'un fichier pour un nouveau
d&eacute;codeur. Vous pourrez tirer b&eacute;n&eacute;fice de la
lecture des autres sections de ce guide utilisateur DecoderPro pour
obtenir des informations de fond, sp&eacute;cialement sur
l'introduction XML et la section sur ce que contiennent les fichier
de configurations.</p>
<p>La meilleur m&eacute;thode pour cr&eacute;er un fichier de
configuration est de modifier un existant. Dans cette section nous
allons utiliser cette m&eacute;thode.</p>
<dl>
<dt class="left">Faites une copie d'un fichier existant.</dt>
<dd class="first">
<p>Bien que vous puissiez appeler votre fichier comme bon vous
semble, il travaillera mieux si vous utilisez les m&ecirc;mes
conventions que les fichiers fourni. C'est <tt>"manufacturer
name"_"decoder family".xml</tt>, par exemple:
<tt>Digitrax_1x2.xml</tt>et <tt>Atlas_DualMode.xml</tt></p>
<p>Pour les fichiers fourniss&eacute;, nous utilisons la m&ecirc;me
casse, etc, que celles que les fabricants de d&eacute;codeurs
utilisent dans leurs documentations.</p>
<p>Ce nouveau fichier prendra place dans le sous-r&eacute;pertoire
<tt>decoders</tt> dans le r&eacute;pertoire <tt>JMRI</tt>
preferences ainsi le programme pourra le trouver. Le
fichier<tt>DecoderProConfig2.xml</tt> se trouve dans le
r&eacute;pertoire preferences, ainsi vous pouvez chercher ici pour
localiser le fichier. (Voir la <a href=
"Files.shtml#location"><em>page de configuration des
fichiers</em></a> pour plus de d&eacute;tails sur ce
r&eacute;pertoire et ce qu'il contient.</p>
<p>Si vous modifiez une d&eacute;finition de d&eacute;codeur, il
vaut mieux commencer avec la version la plus r&eacute;cente, qui
peut &ecirc;tre trouv&eacute;e ici sur le site web de JMRI &aacute;
<a href=
"http://jmri.org/xml/decoders/">http://jmri.org/xml/decoders/</a>.
De cette fa&ccedil;on il ne sera pas difficile de fusionner vos
changements avec ceux qui pourrait avoir &eacute;t&eacute; fait
entre temps. SVP Ne reformater pas plus que n&eacute;cessaire. Si
vous changez les donn&eacute;es techniques dans les 5 ou 10 lignes
du haut, ou reformater le contenu, il sera tr&egrave;s difficile de
savoir ce qui a &eacute;t&eacute; chang&eacute; et ce qui ne l'a
pas &eacute;t&eacute; .</p>
</dd>
<dt class="left">&Eacute;diter le nouveau fichier</dt>
<dd>
<p>Ouvrez le nouveau fichier avec votre &eacute;diteur de texte
favori.</p>
</dd>
<dt class="left">Contenu du fichier: En t&ecirc;te XML</dt>
<dd>
<p>Vous verrez quelque chose comme ceci en haut du fichier( les
exemples viennent d'un fichier <a href=
"../../../../../xml/decoders/Digitrax_1x2.xml">Digitrax_1x2.xml</a>):</p>
<p class="example">&lt;?xml version="1.0"?&gt;<br>
&nbsp;&nbsp;&nbsp;&nbsp;&lt;!DOCTYPE decoder-config SYSTEM
"decoder-config.dtd"&gt;<br>
&nbsp;&nbsp;&nbsp;&nbsp;&lt;!-- $Id$ --&gt;<br>
&nbsp;&nbsp;&nbsp;&nbsp;&lt;decoder-config&gt;<br></p>
<p>N'oubliez pas ces lignes; elles d&eacute;crivent le format du
fichier.</p>
</dd>
<dt class="left">Contenu du fichier: Auteur</dt>
<dd>
<p>L'&eacute;l&eacute;ment suivant d&eacute;crit l'auteur et la
version de ce fichier de d&eacute;codeur:</p>
<p class="example">&lt;version
author="jake@physics.berkeley.edu"<br>
&nbsp;&nbsp;&nbsp;&nbsp;version="1" lastUpdated="20011201"/&gt;</p>
<p>Ces attributs ne sont lus que par les gens, pas par le
programme, ainsi leur format exact n'est pas critique. Mais nous
vous encourageons &aacute; ins&eacute;rer votre adresse courriel
dans les fichiers que vous cr&eacute;ez ou modifiez; ainsi celui
qui a une question &aacute; poser sait o&ugrave; vous contacter. La
version et les derniers attributs mis &aacute; jour fournissent un
moyen de d&eacute;crire les diff&eacute;rentes versions d'une
d&eacute;finition de d&eacute;codeur. Pour un nouveau fichier,
commencer &aacute; num&eacute;roter &aacute; "1" et si vous
modifiez un fichier existant incr&eacute;menter l'attribut version
au num&eacute;ro suivant.</p>
</dd>
<dt class="left">Contenu du fichier: Decoder Family and Model</dt>
<dd>Les lignes suivantes identifient la "famille" de
d&eacute;codeurs que ce fichier d&eacute;crit:
<p class="example">&lt;decoder&gt;<br>
&nbsp;&nbsp;&nbsp;&nbsp;&lt;family name="Digitrax 1x2"
mfg="Digitrax"<br>
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;lowVersionID="240"
highVersionID="242"<br>
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;comment="Digitrax
DH142, etc" &gt;<br>
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&lt;model
model="DH142" numOuts="4" numFns="2"/&gt;<br>
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&lt;model
model="DN142" numOuts="4" numFns="2"/&gt;<br>
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&lt;model
model="DH083" numOuts="5" numFns="2"/&gt;<br>
&nbsp;&nbsp;&nbsp;&nbsp;&lt;/family&gt;</p>
<p>L'espacement n'est pas important, mais il est utilis&eacute;
pour indent&eacute; le fichier et le rendre plus lisible. XML
utilise "&eacute;l&eacute;ments" et "attributs" pour porter les
informations. les choses &lt;model&gt; sont des
&eacute;l&eacute;ments; les attributs comme numOuts sont
fix&eacute;s &aacute; des valeurs sp&eacute;cifiques &aacute;
l'int&eacute;rieur des &eacute;l&eacute;ments. Dans les lignes 2
&aacute; 4 ci-dessus</p>
<p class="example">&lt;family name="Digitrax 1x2"
mfg="Digitrax"<br>
&nbsp;&nbsp;&nbsp;&nbsp;lowVersionID="240" highVersionID="242"<br>
&nbsp;&nbsp;&nbsp;&nbsp;comment="Digitrax DH142, etc" &gt;</p>
<p>L'&eacute;l&eacute;ment est "family", avec les attributs "name",
"mfg", "lowVersionID", "highVersionID", et "comment". Un attribut
est une valeur donn&eacute;e avec le signe &eacute;gal et la valeur
entre guillemets ( les guillemets sont obligatoires). L'ordre des
attributs n'est pas important, et vous pouvez cassez la lignes et
la reprendre si cela rend le fichier plus facile &aacute; lire.
Notez que tous les attributs doivent &ecirc;tre entre crochets et
apr&egrave;s le nom de l'&eacute;l&eacute;ment.</p>
<p>Dans cet &eacute;l&eacute;ment, changer les attributs pour
correspondre au nouveau d&eacute;codeur:</p>
<ul>
<li><dfn>name</dfn> - le nom de la famille de d&eacute;codeur.
C'est mieux si vous utilisez le m&ecirc;me nom ici que celui que
vous avez utilis&eacute; pour le nom de fichier.</li>
<li><dfn>mfg</dfn> - le fabricant du d&eacute;codeur. C'est mieux
si vous utilisez le m&ecirc;me nom de fabricant ici que celui que
vous avez utilis&eacute; pour le nom de fichier.</li>
<li><dfn>lowVersionID</dfn>, <dfn>highVersionID</dfn> - Le
fabricant peut charger un num&eacute;ro de version dans le CV 7 du
d&eacute;codeur. Tous les fabricants ne le font pas, Mais si un est
disponible, le programmateur peut v&eacute;rifier si ce fichier est
utilis&eacute; avec le type de d&eacute;codeur attendu. Si une
valeur est valide, d&eacute;finissez l'attribut LowVersionID, par
exemple.
<p class="example">&nbsp;&nbsp;&nbsp;&nbsp;lowVersionID="123"</p>
Si le type de d&eacute;codeur peut avoir plus d'une rang&eacute;e
de num&eacute;ro,par exemple parce que le fabricant a fait
plusieurs mise &aacute; jour, d&eacute;finissez les deux attributs.
Si vous ne connaissez pas le num&eacute;ro de version, ne
d&eacute;finissez pas un de ces attributs.</li>
<li><dfn>comment</dfn> - Ceci est optionnel. Vous pouvez inclure
votre nom, ou autre info au sujet du changement dans le
fichier.</li>
</ul>
<p>Les lignes suivantes:</p>
<p class="example">&nbsp;&nbsp;&nbsp;&nbsp;&lt;model model="DH142"
numOuts="4" numFns="2"/&gt;<br>
&nbsp;&nbsp;&nbsp;&nbsp;&lt;model model="DN142" numOuts="4"
numFns="2"/&gt;<br>
&nbsp;&nbsp;&nbsp;&nbsp;&lt;model model="DH083" numOuts="5"
numFns="2"/&gt;</p>
vous permettent de lister un nombre de mod&egrave;le de
d&eacute;codeurs diff&eacute;rents qui peuvent utiliser ce fichier.
Pour un simple d&eacute;codeur, enlever tout sauf un et donnez lui
le nom du mod&egrave;le de d&eacute;codeur. Le numOuts et numFns
sont d&eacute;crit plus tard, mais pour le moment vous pouvez les
effacer, laissant quelque chose comme:
<p class="example">&nbsp;&nbsp;&nbsp;&nbsp;&lt;model model="DH142"
/&gt;</p>
</dd>
<dt class="left">File contents: Programming Modes</dt>
<dt>File contents: Programming Modes</dt>
<dd>
<p>L'&eacute;l&eacute;ment suivant d&eacute;finit quel mode de
programmation est comprit par le d&eacute;codeur :</p>
<p class="example">le&gt; &lt;programming direct="byteOnly" paged=
"yes"<br>
&nbsp;&nbsp;&nbsp;&nbsp;register= "yes" ops=
"yes"&gt;&lt;/programming&gt;</p>
<p>Pagin&eacute;d, registerer et ops peuvent &ecirc;tre
r&eacute;gler soit &aacute; "yes" ou &aacute; "no". Direct peut
&ecirc;tre fix&eacute; &aacute; "no", "bitOnly", "byteOnly", ou
"yes". Le programmateur utilise ces informations pour
s&eacute;lectionner le mode de programmation &aacute; utiliser pour
travailler avec le d&eacute;codeur.</p>
</dd>
<dd><a name="variable" id="variable"></a></dd>
<dt class="left">File contents: Variable names</dt>
<dd>
<p>La partie suivante du fichier consiste en un jeu
d'&eacute;l&eacute;ments "variable" d&eacute;finissant des
variables sp&eacute;cifiques, imbriqu&eacute;es dans un
&eacute;l&eacute;ment "variables"(notez le"s") Un exemple:</p>
<p class="example">&lt;variables&gt;<br>
&nbsp;&nbsp;&lt;variable label="Short Address" CV="1" item="Primary
Address" default="03"&gt;<br>
&nbsp;&nbsp;&nbsp;&nbsp;&lt;decVal min="1" max="127"/&gt;<br>
&nbsp;&nbsp;&lt;/variable&gt;<br>
<br>
&nbsp;&nbsp;(followed by more &lt;variable&gt; entries)<br>
<br>
&nbsp;&nbsp;(Insert new ones at the end)<br>
&lt;/variables&gt;</p>
<p>Chaque variable repr&eacute;sente une chose &aacute; configurer.
Elle peut repr&eacute;senter un CV simple, exemple une adresse, ou
plusieurs bits qui doivent &ecirc;tre configurer pour
contr&ocirc;ler une fonction particuli&egrave;re. Si plusieurs de
celles-ci ne sont pas appropri&eacute;es pour votre
d&eacute;codeur, vous pouvez les supprimer. Soyez s&ucirc;r
d'enlever l'&eacute;l&eacute;ment entier de la &lt;variable&gt;
pour correspondre &aacute; la &lt;/variable&gt;. Vous pouvez aussi
les r&eacute;arranger si vous pr&eacute;f&eacute;rez un ordre
diff&eacute;rent.</p>
<p>Les attributs incluent:</p>
<ul>
<li><dfn>label</dfn> - Le nom pour cette variable. C'est
g&eacute;n&eacute;ralement comme cela que les fabricants appellent
cet &eacute;l&eacute;ment, m&ecirc;me si d'a&agrave;utres
fabricants ou le NMRA utilisent un nom diff&eacute;rent pour les
m&ecirc;mes choses.</li>
<li><dfn>item</dfn> - Un nom alternatif "standard". Voir la
<a href="Programmer.shtml#id">discussion sur la page des
d&eacute;finitions des programmateurs</a> pour plus de
d&eacute;tails sur ceux-ci. G&eacute;n&eacute;ralement, regarder le
programmateur Complet pour trouver quelque chose de similaire, et
utilisez le "name" attribu&eacute;.</li>
<li><dfn>CV</dfn> - Quel CV contient l'information de configuration
pour cette variable.</li>
<li><dfn>mask</dfn> - Un mod&egrave;le&agrave; comme "XXXVVVXX" qui
contr&ocirc;le quels bits dans le CV met la variable up . Chaque
"V" est un bit qui est inclut , et "X" sont des bits qui ne sont
pas inclus. Il est mieux d'avoir huit caract&egrave;res,comme cela
nous savons o&ugrave; nous allons. Si la variable est un Byte
complet, cette attribut peut &ecirc;tre omit .</li>
<li><dfn>default</dfn> - la valeur par d&eacute;faut pour cette
varable. C'est utilis&eacute; pour un nouveau d&eacute;codeur, ou
quand vous voulez remettre le d&eacute;codeur &aacute; ses
r&eacute;glages d'usine</li>
<li><dfn>comment</dfn> - Utilis&eacute; pour ce que vous
voulez.</li>
</ul>
<p>(Il y en a un peu plus,que nous allons quitter pour la section
avanc&eacute;e ci-dessous)</p>
</dd>
<dt class="left">File contents: Creating new Variable names</dt>
<dd>
<p>Vous pouvez aussi d&eacute;finir de nouvelles variables. Un bon
point de d&eacute;part est de copier une d&eacute;finition
similaire, changer son nom pour une nouvelle valeur et
&eacute;diter son contenu.</p>
<p>Pour d&eacute;finir comment la nouvelle variable est
affich&eacute;e et &eacute;dit&eacute;e, vous ajoutez
l'&eacute;l&eacute;ment au sein de l'&eacute;l&eacute;ment
"variable". Il y a plusieurs formes possibles:</p>
<ul>
<li>Pour une valeur d&eacute;cimalee, vous incluez un
&eacute;l&eacute;ment decVal comme l'exemple ci-dessus. Les deux
attributs possibles sont min et max, qui d&eacute;finissent la
fourchette de valeurs acceptables. Si vous les omettez les valeurs
entre 0 et 255 seront permises.</li>
<li>Si vous pr&eacute;f&eacute;rez entrer et afficher des valeurs
en hexad&eacute;cimal, utilisez l'&eacute;l&eacute;ment
"hexVal".c'est le m&ecirc;me que l'&eacute;l&eacute;ment "decVal"
dont nous avons d&eacute;j&aacute; discut&eacute; mais en
hexa.</li>
<li>
<p>Si votre d&eacute;codeur supporte les adresses longues, vous
pouvez ajouter un &eacute;l&eacute;ment 'longAddress'. C'est peut
&ecirc;tre plus simple de copier depuis un autre fichier, ou depuis
cet exemple:</p>
<p class="example">&lt;variable name="Long Address" CV="17"&gt;<br>
&nbsp;&nbsp;&nbsp;&nbsp;&lt;longAddressVal/&gt;<br>
&lt;/variable&gt;</p>
</li>
<li>
<p>Si votre d&eacute;codeur le supporte, vous pouvez entrer un
&eacute;l&eacute;ment "speedTableVal" pour la table de vitesse. Le
seul attribut est "entries","min", "max" et"mfx" (quand vrai active
le style M&auml;rklin mfx&reg; de la table de vitesse. Exemple:</p>
<p class="example">&lt;variable name="Speed Table" CV="67"&gt;<br>
&nbsp;&nbsp;&nbsp;&nbsp;&lt;speedTableVal/&gt;<br>
&lt;/variable&gt;</p>
Checking for syntax errors</li>
<li>Quelques options de d&eacute;codeur sont mieux
repr&eacute;senter par "choisir un choix".Elles sont
repr&eacute;sent&eacute;es par un &eacute;l&eacute;ment
enumVariable. Exemple:
<p class="example">&lt;variable name="F6 during DC operation"
CV="13" mask="XXVXXXXX"&gt;<br>
&nbsp;&nbsp;&nbsp;&nbsp;&lt;enumVal&gt;<br>
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&lt;enumChoice
choice="Off"/&gt;<br>
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&lt;enumChoice
choice="On"/&gt;<br>
&nbsp;&nbsp;&nbsp;&nbsp;&lt;/enumVal&gt;<br>
&lt;/variable&gt;</p>
<p>Chaque &eacute;l&eacute;ment enumChoice d&eacute;crit une
possibilit&eacute;. Il peut y en avoir autant que
d&eacute;sir&eacute;. pour le choix d'un bit, vous utilisez deux
&eacute;l&eacute;ments enumChoice comme dans l'exemple. Pour un
choix de 4 bits, comme les codes FX dans les d&eacute;codeurs
Digitrax, vous pouvez utiliser jusqu'&aacute; 16
&eacute;l&eacute;ments enumChoice. Ils sont affich&eacute;s dans
l'ordre o&ugrave; ils ont &eacute;t&eacute; entr&eacute;s dans le
fichier, et sont aussi num&eacute;rot&eacute;s dans cet ordre. Si
le premier est choisi, un 0 est entr&eacute; dans les bits CV;
choisir le second stocke 1; etc.</p>
<p>Si vous avez besoin de sp&eacute;cifier un nombre
sp&eacute;cifique pour une option enum, ajoutez un attribut
"value":</p>
<p class="example">&nbsp;&nbsp;&nbsp;&nbsp;&lt;enumChoice
choice="Blue" value="32"/&gt;</p>
</li>
</ul>
</dd>
<dt class="left">Checking for syntax errors</dt>
<dd>
<p>A ce point, vous avez cr&eacute;&eacute; un nouveau fichier de
configuration!</p>
<p>Vous pouvez v&eacute;rifier la syntaxe en s&eacute;lectionnant
l'&eacute;l&eacute;ment"Check XML file" dans le menu
"D&eacute;bug". Il ouvre un dialogue de s&eacute;lection de
fichier; s&eacute;lectionnez votre fichier et cliquez "open". Si
tout est bon, vous obtenez une boite de dialogue qui dit "OK". Si
non , vous obtiendrez un message d'erreur compl&egrave;tement
incompr&eacute;hensible. La seule partie utilisable de ce message
est le num&eacute;ro de la ligne; ouvrez un &eacute;diteur &aacute;
cette ligne et essayer de trouver le probl&egrave;me de
syntaxe.</p>
</dd>
<dt class="left">Add the file to the index</dt>
<dd>
<p>Tout ce qui reste est d'entrer votre nouveau fichier dans
l'index. Cet index est utilis&eacute; pour acc&eacute;l&eacute;rer
le d&eacute;marrage, quand la liste des d&eacute;codeurs
disponibles est construite .</p>
<p>S&eacute;lectionner l'&eacute;l&eacute;ment "Create decoder
index" depuis le menu "D&eacute;bug"</p>
</dd>
</dl>
<p>F&eacute;licitations! Vous avez fini. Ensuite, ouvrez
l'application programmateur et essayez la.</p>
<!--#include virtual="/Footer" --></div>
</div>
</body>
</html>
