<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01//EN"
"http://www.w3.org/TR/html4/strict.dtd">

<html lang="fr">
<head>
<!-- Copyright Bob Jacobsen 2008 -->
<!-- Translated by Herv&#233. BLOREC <bzh56420@yahoo.fr> on 2016-06-24 -->
<title>JMRI: DecoderPro User Guide - Configuration Files</title>

<!-- Style -->
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<link rel="stylesheet" type="text/css" href="/css/default.css" media="screen">
<link rel="stylesheet" type="text/css" href="/css/print.css" media="print">
<link rel="icon" href="/images/jmri.ico" TYPE="image/png">
<link rel="home" title="Home" href="/">
<!-- /Style -->
</head>

<body>
<!--#include virtual="/Header" -->
<div id="mBody">
    <!--#include virtual="Sidebar" -->
    <div id="mainContent">
        <!-- Page Body -->

<h1>JMRI: Guide Utilisateur DecoderPro</h1>

<h2>Fichiers de Configuration</h2>

<p>Cette section tente de r&#233;pondre &#224; la question de savoir ce que contiennent les fichiers de configuration et 
o&#249; sont-ils localis&#233;s?
</p>

<dl>
	<dt class="left"><a name="location"></a>Localisation des Fichiers de Configuration</dt>
	<dd class="first">
	Il y a deux endroits o&#249; les fichiers de configuration peuvent &#234;tre trouv&#233;s:
		<ol>
		<li>Les versions initialement distribu&#233;es des Fichiers de Configuration de JMRI sont dans un 
		r&#233;pertoire "xml" dans la paquet de l'application JMRI et ses sous-r&#233;pertoires. Notez que ce que 
		vous modidifirez ici sera perdu lors d'une actualisation de JMRI vers une version plus r&#233;cente.<br>
		L'application JMRI est install&#233; dans votre dossier Programmes par d&#233;faut.

			<li> Le r&#233;pertoire utilisateur JMRI Preferences et ses sous r&#233;pertoires a aussi son 
			importance.
			JMRI regarde d'abord ici pour tous les fichiers dont il a besoin.<br>
			Vous popurrez mettre les versions des fichiers
			modifi&#233;es localement et elles ne seront pas &#233;cras&#233;es lors d'une actualisation de JMRI.
			Les fichiers que le programme &#233;crit pour contenir localement
			les informations, exemple: les fichiers des entr&#233;es Inventaire et Panneaux sont aussi &#233;crit 
			ici.
			<br>
			L'emplacement par d&#233;faut des Preferences utilisateur, il d&#233;pend du syst&#232;me 
			d'exploitation.
			Normalement, il est localis&#233;:
				<ul>
				<li> sur une machine Linux, chercher un r&#233;pertoire .jmri dans votre 
				r&#233;pertoire home.
				</li>
				<li> Sur un Mac OS X, les Preferences sont stock&#233;es desn un 
				dossier "JMRI" dans le dossier /User/me/Libairy/Preferences/.
				<li> Sur Windows, il peut &#234;tre dans des endroits d&#233;pendant 
				de la version de windows que vous utilisez et si vous avez 
				de multiples utilisateurs configur&#233;s. Commencez par regarder 
				dans "Documents" ou "Users Documents" ou "Users and Documents". 
				Recherchez un dossier appel&#233; "JMRI".
				</li>
				</ul>		
			
			<p> La m&#233;thode la plus facile pour le trouver est de d&#233;marrer un programme JMRI, 
			ex: DecoderPro ou PanelPro et de s&#233;lectionner "Emplacements.." dans le menu "Aide".
			Un petit cadeau pour les utilisateurs de Windows: si vous allez dans le menu D&#233;marrer,
			dans la section JMRI, vous pouvez s&#233;lectionner "Preferences" pour le voir ouvrir
			le repertoire pour vous.
			<p>Vous pouvez d&#233;finir ou changerl'emplacement des scripts et les fichiers utilisateurs dans le
			panneau	<a href="../../../package/apps/TabbedPreferences.shtml#FileLocations">
			Preferences... -&gt; File Locations</a> . Notez que le changement de "User Files Location"
			changera aussi l'emplacement par d&#233;faut pour Panels, Rosters, etc.
			</li>
			</ol>
		</dd>

		<dt class="left">Types de fichiers de Configuration</dt>
		<dd>
		&#192; l'int&#233;rieur de votre dossier Preferences JMRI il y a un nombre de types de fichiers
		de configuration utilis&#233; par DecoderPro:
			<ul>
			<li> Decoder definitions - Stock&#233; dans le sous-r&#233;pertoire <strong>decoder</strong> un 
			pour tous les d&#233;codereurs personnalis&#233;s; d&#233;finit comment est configur&#233;e une 
			famille sp&#233;cifique de d&#233;codeurs.
			<li> Locomotive configurations - Stock&#233; dans le sous-r&#233;pertoire <strong>roster</strong>, un 
			pour chaque locomotive; ceux-ci enregistrent la configuration sp&#233;cifique de chaque locomotive 
			dans votre Inventaire.
			<li> Programmer definitions- Stock&#233; dans le sous- r&#233;pertoire <strong>Programmer
			</strong> quand vous avez utilis&#233; au moins un programmateur; ceux-ci d&#233;finissent 
			les formats pour les feuilles de programmations vari&#233;es qui sont disponibles dans DecoderPro
			<li>Le Dossier DecoderPro, contient vos profils.
			</ul>
		</dd>

		<dt class="left">Fichiers de Configuration G&#233;n&#233;rale</dt>
		<dd>
		Il y a beaucoup plus de fichiers de configuration JMRI, quelques'uns partag&#233;s par des applications, qui 
		se trouvent dans r&#233;pertoire Preferences utilisateur: 
			<ul>
			<li><tt>roster.xml</tt> - un index de vos Locomotives
			<li><tt>decoderIndex.xml</tt> - un index des fichiers de d&#233;finitions de d&#233;codeurs 
			disponibles. Il contient aussi les informations sur quel mod&#232;le de d&#233;codeur sp&#233;cifique 
			qui utilise quel fichier, comment les identifier, et quelles options ils mettent en &#339;uvre.
			<li><tt>names.xml</tt> - non utilis&#233; durant les op&#233;rations normales, c'est une liste de 
			noms standards de variables pour &#234;tre utilis&#233;s dans un programmateur de d&#233;finitions .
			</ul>
		</dd>
</dl>			

Plus d'information au sujet des Fichiers de Configuration JMRI <a href="../../setup/Files.shtml">Fichiers de Configuration 
JMRI</a>

		<!--#include virtual="/Footer" -->
		</div>
	</div>
</body>
</html>
