<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01//EN"
"http://www.w3.org/TR/html4/strict.dtd">

<html lang="fr">
<head>
<!-- Copyright Bob Jacobsen 2008 -->
<!-- Translated by Herv&#233. BLOREC <bzh56420@yahoo.fr> on 2016-06-27 -->
<title>JMRI: DecoderPro User Guide - How DecoderPro Identifies Decoders</title>

<!-- Style -->
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<link rel="stylesheet" type="text/css" href="/css/default.css" media="screen">
<link rel="stylesheet" type="text/css" href="/css/print.css" media="print">
<link rel="icon" href="/images/jmri.ico" TYPE="image/png">
<link rel="home" title="Home" href="/">
<!-- /Style -->
</head>

<body>
<!--#include virtual="/Header" -->
<div id="mBody">
    <!--#include virtual="Sidebar" -->
    <div id="mainContent">
        <!-- Page Body -->

<h1>JMRI: Guide Utilisateur DecoderPro</h1>
<h2>Comment DecoderPro Identifie Les D&#233;codeurs</h2>

<p>
Afin de bien programmer un d&#233;codeur, DecoderPro doit &#234;tre en mesure 
de trouver une "d&#233;finition" pour le d&#233;codeur. Ces d&#233;finitions pr&#233;cises des CVs sont 
comprises par le d&#233;codeur, ce qu'elles signifient, quelles valeurs sont valides, etc.

<p>
DecoderPro permet &#224; un utilisateur de choisir quel d&#233;codeur mod&#232;le il a install&#233;,
Dans ce cas, il peut automatiquement trouver la bonne d&#233;finition. Mais il peut
&#233;galement fournir une fonction "Ident", qui tente de localiser la bonne d&#233;finition
sur la base des informations qu'il lit sur le d&#233;codeur.

<p>
Ident commence par lire le code du fabricant depuis le CV8. La NMRA a d&#233;fini 
un ensemble de valeurs uniques pour ce CV. Depuis (presque) tous les d&#233;codeurs 
fournissent bien cette information, vous pouvez utiliser DecoderPro pour affiner le 
bas de la liste des d&#233;finitions possibles pour seulement ceux d'un fabricant particulier.

<p>
Ensuite, DecoderPro lit la valeur du CV 7. La NMRA l'a d&#233;fini comme 
le num&#233;ro de "version" . Malheureusement, tous les fabricants n'utilisent pas ce num&#233;ro
d'une mani&#232;re qu'il puisse fournir les informations n&#233;cessaires. Il y a deux cas o&#249; 
cela peut mal fonctionner:</p>
<ol>
	<li>Trop de d&#233;codeurs avec le m&#234;me num&#233;ro de version.
	<p>
	Si de nombreux types de d&#233;codeurs ont le m&#234;me num&#233;ro de version, et si
	les versions diff&#232;rent assez peu, le num&#233;ro de version ne fournit pas assez
	d'informations pour choisir une d&#233;finition sp&#233;cifique.
	<p>
	Par exemple, si le num&#233;ro de version 3 peut &#234;tre trouv&#233;s dans deux d&#233;codeur, un &#224; faible 
	co&#251;t avec quelques CVs , et un d&#233;codeur haut de gamme avec beaucoup de CVs, rechercher un 3 en CV 7 ne
	fourni pas suffisamment d'informations.
	<p>
	Ce probl&#232;me se produit plus souvent quand un mod&#232;le particulier peut avoir une gamme de num&#233;ros de version
	en CV 7, et ceux d'une plage qui se chevauchent d'un mod&#232;le &#224; l'autre.</p></li>

	<li> Pas assez d'informations disponibles sur ce qu'un num&#233;ro de version signifie:
	<p>
	Ceci est particuli&#232;rement un probl&#232;me lorsque le num&#233;ro de version change, car de nouvelles 
	fonctionnalit&#233;s ont &#233;t&#233; ajout&#233;es, mais le num&#233;ro de mod&#232;le du d&#233;codeur reste le 		
	m&#234;me.
	Par exemple, consid&#233;rez la confusion qui est caus&#233;e par un fabricant qui ajoute la BEMF* &#224; leur XYZ123 	
	sans l'appeler comme un nouveau mod&#232;le. Maintenant, nous constatons que certains d&#233;codeurs XYZ123 ont la BEMF, 
	et d'autres pas. En outre, nous constatons qu'il y a deux num&#233;ros de version: 23 et 51, et n'avons aucune 
	information officielle sur ce que sont les diff&#233;rences. Il est tr&#232;s difficile de d&#233;m&#234;ler tout cela, 
	et les clients sont tr&#232;s frustr&#233;s.</li>
</ol>

<p>
En plus d'utiliser le num&#233;ro de version dans CV 7, DecoderPro peut chercher des valeurs dans d'autres CV 
sp&#233;cifiques au fabricant pour identifier le d&#233;codeur. Cela peut &#234;tre tr&#232;s puissant, car les fabricants 
peuvent utiliser leurs CVs pour donner autant d'informations disponibles au choix.
<p>
Malheureusement, les m&#234;me fabricants qui utilisent des CVs suppl&#233;mentaires pour les informations d'identification 
donnent rarement le sens des valeurs dans les CV accessibles au public.
Nous devons ensuite d&#233;duire ce que signifie 103 dans un CV particulier, et nous pouvons souvent nous tromper.

<p>
Il est important de noter qu'il y a des bonnes raisons commerciales pour que les fabricants aient
fait cela avec les informations d'identification &#224; ce jour. Par exemple:</p>
	<ul>
	<li>Les fabricants utilisent souvent le m&#234;me processeur et le m&#234;me logiciel dans les mod&#232;les de 
	d&#233;codeur multiples, il serait trop co&#251;teux de changer la puce pour avoir un code d'identification unique pour 
	chaque mod&#232;le sp&#233;cifique.  
	<p>
	Mais nous n'avons pas besoin d'une &#233;tiquette unique pour chaque mod&#232;le. Nous avons seulement besoin 
	d'identifier les CVs qui sont pr&#233;sents et ce qu'ils veulent dire; deux d&#233;codeurs qui ex&#233;cutent le 
	m&#234;me logiciel auront les m&#234;mes CV pr&#233;sents. (Nous consid&#233;rons comme un cas particulier le nombre de 
	sorties qui sont physiquement disponibles, etc).</p></li>

	<li>Les fabricants sont concern&#233;s par le fait que les utilisateurs et les revendeurs puissent utiliser les 
	informations d'identification afin d'identifier les versions "obsol&#232;te", et d'insister sur les mises &#224; jour 
	gratuites pour la version la plus r&#233;cente. Ce serait un &#233;norme fardeau &#233;conomique pour le fabricant, en 
	particulier &#233;tant donn&#233; que la plupart des demandes peuvent &#234;tre motiv&#233;es par un d&#233;sir d'avoir 
	les "plus r&#233;centes" plut&#244;t que de la n&#233;cessit&#233; de voir un bug sp&#233;cifique r&#233;solu.
	<p>
	Il est important de noter, cependant, que nous n'avons pas besoin d'&#234;tre en mesure d'identifier la version 
	sp&#233;cifique du firmware en soi, nous voulons seulement identifier les CVs programmables n&#233;cessaires. Des 
		changements internes ne doivent pas avoir pour effet de modifier l'information d'identification.</p></li>
	</ul>

<h3>Recommendations</h3>
Que doit faire un fabricant responsable?

<p>
En r&#232;gle g&#233;n&#233;rale:
	<ul>
	<li> Avoir un plan sur la fa&#231;on d'identifier l'ensemble des fonctionnalit&#233;s et des CV d'un d&#233;codeur, et de
	communiquer ce plan aux utilisateurs. Il serait peut-&#234;tre quelque chose de la forme "vous pouvez regarder dans CV 7 et
	CV 150 pour identifier les caract&#233;ristiques d'un d&#233;codeur". Pour faire face &#224; l'histoire des d&#233;codeurs
	pass&#233;, etc, il faudra peut-&#234;tre plus &#234;tre plus compliqu&#233;: " CV 7, CV 150 et CV 188 correspondent &#224;
	des valeurs possibles sur cette page web". Nous allons trouver un moyen de faire face &#224; tout ce qui peut &#234;tre
	d&#233;crit en termes de valeurs de CV.

	<li>Comme de nouveaux types de d&#233;codeurs sont produits, assurez - vous de publier les informations sp&#233;cifiques
	n&#233;cessaires pour identifier le d&#233;codeur. Cela pourrait &#234;tre aussi simple que de mettre les valeurs
	d'identification sur une page web pour le d&#233;codeur. (Puisque les valeurs peuvent changer, les mettre dans un manuel
	d'utilisation est limit&#233;e)
	</ul>

Au-del&#224; de ce qui suit:

	<ul>
	<li> le plus pour le client viendrait qu'un mod&#232;le <em> sp&#233;cifique </em>
	pourrait &#234;tre identifi&#233;. Un CV suppl&#233;mentaire pour ce faire serait id&#233;al, mais toute autre 
	m&#233;thode consistant &#224; r&#233;duire un d&#233;codeur &#224; un mod&#232;le 2XYZ123AB serait id&#233;al.

	<li>
	Si vous envisagez de s&#233;parer la "mise &#224; jour logiciel" des "fonctionnalit&#233;s", pensez &#224; utiliser des 
	CVs distincts pour cela, et peut-&#234;tre m&#234;me de ne pas rendre l'information  de la "mise &#224; jour logiciel" 
	disponible aux utilisateurs.</li>

	<li>
	Un moyen facile de g&#233;rer les vieux d&#233;codeurs lors du passage &#224; une nouvelle version est d'identifier une 
	valeur sp&#233;cifique de CV 7 qui n'a pas &#233;t&#233; utilis&#233;e, et la d&#233;finir comme un drapeau indiquant que 
	d'autres CVs devraient &#234;tre consult&#233;s pour plus d'informations.</li>

	<li>
	Lorsque de nouvelles fonctions sont ajout&#233;es &#224; un d&#233;codeur, envisager de l'appeler un nouveau 
	mod&#232;le. Ayant de nombreuses versions diff&#233;rentes du d&#233;codeur XYZ123, certaines avec la BEMF, avec ou sans 
	certaines options d'&#233;clairages, sp&#233;ciaux, parfois sans, etc, ou avec, perd le client et les gens qui essaient 
	d'aider les clients avec un logiciel comme DecoderPro. Et pourquoi ne pas accorder de cr&#233;dit pour les nouvelles 
	fonctionnalit&#233;s aux personnes qui vous les aurons demander pour le nouveau mod&#232;le?</li>
	</ul>

	<p>*BEMF: compensation de charge</p>

		<!--#include virtual="/Footer" -->
		</div>
	</div>
</body>
</html>
