<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01//EN"
"http://www.w3.org/TR/html4/strict.dtd">
<html lang="fr">
<head>
<meta name="generator" content=
"HTML Tidy for Mac OS X (vers 31 October 2006 - Apple Inc. build 15.17), see www.w3.org">
<!-- Copyright Bob Jacobsen 2008 -->
<!-- UpDated by Blorec Herv&#233;  2013-08-31-->
<title>JMRI: Cr&eacute;er un Programmateur
Personnalis&eacute;</title>
<!-- Style -->
<meta http-equiv="content-type" content=
"text/html; charset=us-ascii">
<link rel="stylesheet" type="text/css" href="/css/default.css"
media="screen">
<link rel="stylesheet" type="text/css" href="/css/print.css" media=
"print">
<link rel="icon" href="/images/jmri.ico" type="image/png">
<link rel="home" title="Home" href="/"><!-- /Style -->
</head>
<body>
<!--#include virtual="/Header" -->
<div id="mBody"><!--#include virtual="Sidebar" -->
<div id="mainContent">
<h1>Guide Utilisateur DecoderPro - Cr&eacute;er un Programmateur
Personnalis&eacute;</h1>
<p>Comment puis-je cr&eacute;er mon propre programmateur
personnalis&eacute;?</p>
<p>La r&eacute;ponse commence par la cr&eacute;ation d'un fichier
xml dans le sous-r&eacute;pertoire "programmers" de la distribution
JMRI. Le contenu du fichier est d&eacute;crit ci-dessous.</p>
<dl>
<dt class="left">Sp&eacute;cifier les &eacute;l&eacute;ments
&agrave; afficher</dt>
<dd class="first">
<p>L'&eacute;l&eacute;ment de base d'un volet de programmation est
un "affichage". Cela signifie que le programmateur ne
pr&eacute;sente qu'une seule variable. Les attributs sont:</p>
<ul>
<li><dfn>name</dfn> - (N&eacute;cessaire) C'est le "nom standard"
de la variable qui sera pr&eacute;sent&eacute;.</li>
<li><dfn>label</dfn> - S'il est pr&eacute;sent, il va &ecirc;tre
utilis&eacute; pour marquer la variable sur le volet au lieu du nom
ou du nom standard de la variable.</li>
<li><dfn>Layout</dfn> - O&ugrave; trouver l'&eacute;tiquette en ce
qui concerne le domaine &eacute;ditable, par exemple, la z&ocirc;ne
de texte. Les valeurs possibles sont "gauche", "au-dessus", "en
dessous", "droit", par d&eacute;faut "droit".</li>
<li><dfn>format</dfn> -
<p>Comment la variable devra &ecirc;tre pr&eacute;sent&eacute;e.
Les variables num&eacute;riques peuvent &ecirc;tre
pr&eacute;sent&eacute;es comme</p>
<ul>
<li>un champ de texte &eacute;ditable, qui est la valeur par
d&eacute;faut si rien n'est sp&eacute;cifi&eacute;</li>
<li><dfn>hslider</dfn> - un curseur horizontal</li>
<li><dfn>vslider</dfn> - un curseur vertical</li>
</ul>
<p>Enum variables peuvent &ecirc;tre pr&eacute;sent&eacute;es
comme</p>
<ul>
<li>une z&ocirc;ne de s&eacute;lection, qui est la valeur par
d&eacute;faut si rien n'est sp&eacute;cifi&eacute;</li>
<li><dfn>radiobuttons</dfn> - Chaque valeur possible est
pr&eacute;sent&eacute;e comme un bouton individuel</li>
<li><dfn>checkbox</dfn> - Une liste avec seulement deux
&eacute;tats peut &eacute;galement &ecirc;tre
pr&eacute;sent&eacute;e comme une case &agrave; cocher</li>
<li><dfn>offradiobutton</dfn> - Un seul bouton qui donne le choix 0
pour la variable lorsqu'il est s&eacute;lectionn&eacute;</li>
<li><dfn>onradiobutton</dfn> - Un seul bouton qui donne le choix 1
pour la variable lorsqu'il est s&eacute;lectionn&eacute;</li>
</ul>
<p>Ces deux derniers peuvent &ecirc;tre utiles pour indiquer
quelles parties d'une configuration sont actives, voir le volet
"Speed Table" de Comprehensive.xml comme exemple.</p>
</li>
<li><dfn>tooltip</dfn> - Vous permet de sp&eacute;cifier une
info-bulle qui sera pr&eacute;sent&eacute;e lorsque le curseur sera
&agrave; gauche sur la variable. S'il n'est pas pr&eacute;sent,
l'info-bulle d&eacute;fini dans le fichier d&eacute;codeur est
utilis&eacute;. (Note: Ce n'est pas encore compl&egrave;tement
impl&eacute;ment&eacute;, mais vous devez les inclure dans vos
d&eacute;finitions de programmateur car ils travailleront
bient&ocirc;t)</li>
</ul>
<a name="display" id="display"></a>
<p>Quel nom &agrave; afficher est command&eacute; par le volet de
l'attribut "nameFmt et l'attribut 'label' sur chaque
&eacute;l&eacute;ment d'affichage (variable)</p>
<p>Les choix sont:</p>
<ul>
<li>Si une &eacute;tiquette est sp&eacute;cifi&eacute;e, elle sera
utilis&eacute;e. Utilisez une &eacute;tiquette si vous souhaitez un
contr&ocirc;le absolu sur qu'une variable doit &ecirc;tre
appel&eacute;e, quel que soit le fichier d&eacute;codeur qui
l'appelle, et que vous n'aimez pas le nom standard.</li>
<li>Le volet attribut nameFmt est "&eacute;l&eacute;ment ", auquel
cas le nom de l'&eacute;l&eacute;ment sera utilis&eacute;
ind&eacute;pendamment de ce que le fichier d&eacute;codeur appelle
la variable. Utilisez ceci si vous voulez un aspect uniforme pour
le volet pour tous les d&eacute;codeurs. Mais soyez conscient que
certains noms standard sont vraiment tellement
g&eacute;n&eacute;rique qu'ils sont inutiles.</li>
<li>Si le volet attribut nnameFmt est autoris&eacute; par
d&eacute;faut, ou contient "mfg", le nom du fichier de
d&eacute;finition de d&eacute;codeur sera utilis&eacute;. Il s'agit
de la forme normale, car il permet au fabricant d'indiquer en
d&eacute;tail ce qu'une variable d&eacute;finit.</li>
</ul>
</dd>
<dt class="left">Formatage</dt>
<dd>
<p>Chaque volet du programmateur se compose de lignes et/ou des
colonnes (imbriqu&eacute;es) . Les colonnes exposent les variables
de haut en bas. Les rang&eacute;es exposent les variables de gauche
&agrave; droite. Vous pouvez les imbriquer pour obtenir des effets
diff&eacute;rents; pour un exemple, voir le volet "Speed Table" du
dossier Comprehensive.xml. Il a deux colonnes, la gauche de chacune
utilise une ligne pour mettre des curseurs de gauche &agrave;
droite .</p>
</dd>
<dt class="left">&Eacute;l&eacute;ments sp&eacute;ciaux</dt>
<dd>Il y a un certain nombre d'&eacute;l&eacute;ments que vous
pouvez utiliser pour obtenir le programmateur format&eacute;
exactement comme vous le souhaitez:
<ul>
<li><dfn>label</dfn> - Ajouter du texte au volet.</li>
<li><dfn>separator</dfn> - Ajouter une ligne de s&eacute;paration
&agrave; un volet. S'il est inclus dans une colonne, ce sera une
ligne de s&eacute;paration horizontale. S'il est inclus dans une
ligne, ce sera une ligne verticale.</li>
<li><dfn>cvtable</dfn> - Ins&eacute;rer un tableau des valeurs de
CV sur le volet. Pour obtenir le droit d'espacement, etc, vous
devriez probablement ne pas combiner cela avec d'autres variables
sur le m&ecirc;me volet.</li>
<li><dfn>fnmapping</dfn> -Afficher une grille fonction de Mapping
.Cela n&eacute;cessite des variables avec des noms
sp&eacute;cifiques, qui sont d&eacute;crites sur une <a href=
"FnMapping.shtml">page s&eacute;par&eacute;e</a></li>
<li><dfn>dccaddress</dfn> - Afficher une variable combin&eacute;e
pour l'adresse DCC. Il s'agit d'une case &agrave; cocher qui permet
de s&eacute;lectionner l'utilisation de l'adresse courte par
rapport &agrave; une longue, et un champ de texte simple pour
entrer l'adresse. Selon la fa&ccedil;on dont la case est
activ&eacute;e, le champ de texte permet de configurer l'adresse
courte dans CV 1 ou adresse longue dans CV 17/18.</li>
</ul>
</dd>
<dt class="left">Installation de votre nouveau programmateur</dt>
<dd>
<p>Tous les fichiers .xml dans le sous-r&eacute;pertoire
"programmers" appara&icirc;tront dans la bo&icirc;te de
s&eacute;lection lorsque vous cr&eacute;erez un nouveau
programmateur dans DecoderPro. Pour utiliser votre nouveau fichier,
il suffit de mettre dans le sous-r&eacute;pertoire "programmers" du
r&eacute;pertoire "prefs" et de le s&eacute;lectionnez. Vous n'avez
pas &agrave; red&eacute;marrer le programme, la liste est refaite
&agrave; chaque fois que vous ouvrez une nouvelle fen&ecirc;tre
programmateur.</p>
<p>Il ya une option pour pr&eacute;senter/masquer les voletsdepuis
le fichier d&eacute;codeur. Si vous &eacute;crivez un programmateur
t&egrave;s basique, vous pouvez les cacher.</p>
</dd>
</dl>
<a name="id" id="id"></a>
<h3>Comment les variables dans un fichier d&eacute;codeur
correspondent avec le fichier programmateur</h3>
Chaque fichier d&eacute;codeur d&eacute;finit <a href=
"CreateDecoder.shtml#variable">les variables</a> qui
d&eacute;crivent des contr&ocirc;les sp&eacute;cifiques dans le
d&eacute;codeur. Le fichier programmateur d&eacute;crit ensuite
comment les placer sur ces panneaux, de telle sorte que
l'utilisateur puisse les trouver et les manipuler
<p>Chaque &eacute;l&eacute;ment "affichage" dans le fichier
programmer d&eacute;finit une chose &agrave; montrer. Mais laquel?
C'est contr&ocirc;l&eacute; par l'attribut "name" de
l'&eacute;l&eacute;ment "display" . DecoderPro ne prend que "name "
et regarde &agrave; travers la d&eacute;finition d&eacute;codeur
pour un &eacute;l&eacute;ment "variable" qui a soit le m&ecirc;me
"&eacute;l&eacute;ment" ou le m&ecirc;me attribut "label".</p>
<p>Cela a des effets tr&egrave;s int&eacute;ressants:</p>
<ol>
<li>Le "nom" dans l'&eacute;l&eacute;ment "display" est
effectivement un "nom standard", qui peut &ecirc;tre utilis&eacute;
dans les fichiers de d&eacute;finition d&eacute;codeur provenant de
diff&eacute;rents constructeurs. Comme il est distinct du "label"
sur la variable d&eacute;codeur, il est possible d'avoir un fichier
programmateur g&eacute;n&eacute;rique qui fonctionne pour de
nombreux types de d&eacute;codeurs diff&eacute;rents, tout en
affichant les noms des variables sp&eacute;cifiques. Pour en savoir
plus, s'il vous pla&icirc;t <a href="#display">voir ci-dessus</a>
.</li>
<li>Il vous permet d'utiliser des noms tr&egrave;s
g&eacute;n&eacute;riques pour contr&ocirc;ler o&ugrave; vont des
choses un peu diff&eacute;rentes. Par exemple, diff&eacute;rents
d&eacute;codeurs sonores donnent diff&eacute;rents contr&ocirc;les.
On pourrait avoir "pompe &agrave; air", tandis qu'un autre n'a pas
du tout ceci, et a au lieu "Crissement de frein". Nous ne voulons
pas avoir les fichiers programmateur contenant des milliards
d'&eacute;l&eacute;ments "display" &agrave; ma&icirc;triser avec
toutes les options possibles. Au lieu de cela, nous utilisons des
&eacute;l&eacute;ments avec des noms plus g&eacute;n&eacute;riques,
comme "Option 1 Sound", pour le nom d'affichage.<br>
La d&eacute;finition d&eacute;codeur dispose alors d'un "label" de
"Airpump" ou que ce soit, et un "&eacute;l&eacute;ment" de
"l'option 1 Sound". Tout correspond correctement, et Airpump"
appara&icirc;t sur l'&eacute;cran de l'ordinateur.</li>
</ol>
<!--#include virtual="/Footer" --></div>
</div>
</body>
</html>
