<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
		"http://www.w3.org/TR/html4/loose.dtd">

<html lang="fr">
<head>
<!-- Updated by Blorec Herv&#233; le 2017-01-16-->
 <title>JMRI Hardware Support - CTI Acela System</title>

<!-- Style -->
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<link rel="stylesheet" type="text/css" href="/css/default.css" media="screen">
<link rel="stylesheet" type="text/css" href="/css/print.css" media="print">
<link rel="icon" href="/images/jmri.ico" type="image/png">
<link rel="home" title="Home" href="/">
<!-- /Style -->
</head>

<body>
<!--#include virtual="/Header" -->
<div id="mBody">
	<!--#include virtual="../SidebarUp" -->
	<div id="mainContent">
		<!-- Page Body -->

<h1>Structure Mat&#233;riel: Syst&#232;me CTI Acela</h1>
<ul class="snav"><!-- TOC -->
	<li><a href="#hardware">Mat&#233;riel</a></li>
	<li><a href="#limitations">Limitations</a></li>
	<li><a href="#connecting">Connexion</a></li>
	<li><a href="#tools">Outils</a></li>
	<li><a href="#documentation">Documentation</a></li>
</ul>

<a name="hardware"></a><h2>Mat&#233;riel pris en charge</h2>
<h3>Modules CTI</h3>

Comme d&#233;crit dans le documentation Acela sur le
<a href="http://www.cti-electronics.com/app_sw.htm"> site web CTI Acela</a>, plusieurs modules sont disponibles
<ul>
		<li> Un module CTI Acela (actuellement seulement existant avec une interface s&#233;rie) qui effectue la plupart de la gestion du r&#233;seau CTI de bas niveau.
		<li> Un module CTI SmartCAB  qui, lorsqu'il est utilis&#233; sur un r&#233;seau ferroviaire non DCC, commandes les trains dans un syst&#232;me traditionnel de CAB. Le module CTI SmartCAB n'est pas pris en charge par JMRI.
		<li> Un module CTI TrainBrain (4 relais de sortie et 4 circuits d'entr&#233;e).
		<li> Un module CTI Dash-8 (8 relais de sortie, pas de circuits d'entr&#233;e).
		<li> Un module CTI Watchman (gardien)(8 circuits d'entr&#233;e, pas de circuits de sortie).
		<li>Un module CTI SignalMan (16 circuits de sortie, pas de circuits d'entr&#233;e).
		<li> Un module CTI SwitchMan (16 circuits de sortie, pas de circuits d'entr&#233;e).
		<li> Un module CTI YardMaster (16 circuits de sortie, pas de circuits d'entr&#233;e).
		<li> Un module CTI Sentry (pas de circuits de sortie, 16 circuits d'entr&#233;e).
</ul>

<a name="limitations"></a><h2>Limitations</h2>

<ul>
		<li>Un r&#233;seau CTI est g&#233;n&#233;ralement reli&#233; &#224; un ordinateur via un CTI vers une interface s&#233;rie ( ou CTI-->USB). Dans cette configuration, tous les CTI du r&#233;seau doivent &#234;tre g&#233;r&#233;s par l'ordinateur. CTI offre &#233;galement un module Acela (actuellement r&#233;alis&#233; avec une interface s&#233;rie) qui effectue la plupart de la gestion du r&#233;seau CTI de bas niveau. JMRI prend uniquement en charge l'interface CTI Acela (il ne supporte pas la s&#233;rie directe - ni l'interface USB).
		<li>Un r&#233;seau CTI  peut &#234;tre utilis&#233; soit sur un r&#233;seau non DCC ou un  DCC. Lorsqu'il est utilis&#233; sur un r&#233;seau non DCC, CTI utilise des modules SmartCAB pour contr&#234;ler les trains dans un syst&#232;me traditionnel de CAB. JMRI PREND EN CHARGE le syst&#232;me CTI que lorsqu'il est utilis&#233; sur un r&#233;seau DCC et ne supporte pas les modules SmartCAB.
		<li>Les modules CTI capteur d'entr&#233;e (Train Brain, Watchman, Sentry)supportent cinq diff&#233;rents types de capteurs d'entr&#233;e: infrarouge, d&#233;tection de courant, &#224; bouton-poussoir, interrupteurs Reed magn&#233;tique, et des cellules photo&#233;lectriques. JMRI prend d&#233;sormais en charge l'ensemble de ces capteurs.
		<li>Les modules CTI capteur d'entr&#233;e prennent en charge la configuration unique de chaque capteur (invers&#233;, anti rebond, seuil). JMRI vous permet maintenant de <a href="../../../package/jmri/jmrix/acela/nodeconfig/NodeConfigFrame.shtml">configurer</a> ceci .
</ul>

<a name="connecting"></a><h2>Connexion</h2> 
<h3>Cr&#233;ation de N&#339;uds</h3>
<p>
Si le mat&#233;riel est connect&#233;, les n&#339;uds (modules CTI) sont trouv&#233;s automatiquement au d&#233;marrage. Les n&#339;uds peuvent aussi &#234;tre
d&#233;finis manuellement avec l'outil 
<a href="../../../package/jmri/jmrix/acela/nodeconfig/NodeConfigFrame.shtml">Configurer N&#339;uds</a>
De toute fa&#231;on, n'oubliez pas de les enregistrer avec
le bouton "Enregistrer" dans la
<a href="../../../package/apps/AppConfigPanel.shtml">fen&#234;tre Pr&#233;f&#233;rences</a>
( dans "&#201;dition" du menu principal )

<h3>C&#226;blage</h3>
<p> 
Chaque module est dot&#233; de deux prises t&#233;l&#233;phoniques quatre fils. L'une &#233;tiquett&#233;e avec un cercle rouge et l'autre marqu&#233; par un cercle vert. Pour compl&#233;ter le cycle, vous devez vous connecter en ligne droite &#224; travers quatre fils de la prise VERTE d'un module &#224; la prise ROUGE du module suivant. Le dernier c&#226;ble doit relier la prise VERTE dans le dernier module de retour sur la prise ROUGE dans le premier module.
<p>
Le module CTI Acela a les m&#234;me jacks VERT et ROUGE ainsi qu'un troisi&#232;me jack JAUNE. Le module CTI Acela doit &#234;tre plac&#233; quelque part dans la boucle tout comme n'importe quel autre module CTI.
<p>
Pour le module Acela CTI un c&#226;ble sp&#233;cial quatre fils doit &#234;tre connect&#233; de la prise JAUNE au port s&#233;rie de l'ordinateur de contr&#234;le (ou un convertisseur s&#233;rie vers USB).
<p>
Une fois sous tension et d&#233;marrer, si les voyants rouges sur chaque module ne sont pas
clignotants alors la boucle est cass&#233;e (soit aucune alimentation sur un ou plusieurs modules ou un
c&#226;ble est d&#233;fectueux ou les c&#226;bles encha&#234;n&#233;s sont mal connect&#233;s ou un c&#226;ble est en vrac).
<p>
Pour &#234;tre complet, sur l'alimentation, chaque module CTI a une LED rouge allum&#233;e
<p>
Une fois que le r&#233;seau Acela est d&#233;marr&#233;, la diode rouge sur chaque module flash quand un paquet
passe (de sorte que vous voyez au fond que tous les n&#339;uds clignotent rapidement - presque en synchronisation).
<p>
Le module Acela lui-m&#234;me est diff&#233;rent en ce qu'une
LED verte clignote toujours pour indiquer qu'il est correct (que la boucle est boucl&#233;e ou non).
 
<a name="tools"></a><h2>Outils JMRI Acela </h2>
<ul>
<li>Les Entr&#233;es et Sorties peuvent &#234;tre configur&#233;es avec le 
<a href="../../../package/jmri/jmrix/acela/serialmon/SerialMonFrame.shtml">Moniteur Acela </a></li>
<li>Les Entr&#233;es et Sorties peuvent &#234;tre configur&#233;es avec
<a href="../../../package/jmri/jmrix/acela/packetgen/SerialPacketGenFrame.shtml">Envoyer Paquets Acela</a></li>
<li>Les Entr&#233;es et Sorties peuvent &#234;tre configur&#233;es avec l'outil  
<a href="../../../package/jmri/jmrix/acela/nodeconfig/NodeConfigFrame.shtml">Configurer N&#339;uds</a></li>
</ul>

<a name="documentation"></a><h2>Documentation</h2>
<h3>Aide JMRI</h3>
<p>La d&#233;signation des entr&#233;es et sorties des modules CTI Acela est d&#233;crites dans une 
<a href="Names.shtml">page s&#233;par&#233;e</a>.

<h3>Autre info</h3>
Plus d'informations sur le mat&#233;riel Acela peut &#234;tre consult&#233;e sur le
<a href="http://www.cti-electronics.com/app_sw.htm">site  web CTI</a>.

<!--#include virtual="/Footer" -->
 </div><!-- closes #mainContent-->
</div> <!-- closes #mBody-->
</body>
</html>
