<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01//EN"
"http://www.w3.org/TR/html4/strict.dtd">
<html lang="fr">
<head>
<meta name="generator" content=
"HTML Tidy for Mac OS X (vers 31 October 2006 - Apple Inc. build 15.17), see www.w3.org">
<!-- UpDated by Blorec Herv&#233;  2013-09-10-->
<title>JMRI: CTI Acela System Names</title>
<!-- Style -->
<meta http-equiv="Content-Type" content=
"text/html; charset=us-ascii">
<link rel="stylesheet" type="text/css" href="/css/default.css"
media="screen">
<link rel="stylesheet" type="text/css" href="/css/print.css" media=
"print">
<link rel="icon" href="/images/jmri.ico" type="image/png">
<link rel="home" title="Home" href="/"><!-- /Style -->
</head>
<body>
<!--#include virtual="/Header" -->
<div class="nomenu" id="mBody">
<div id="mainContent">
<h1>JMRI: Noms syst&egrave;me Acela CTI</h1>
Les entr&eacute;es individuelles (capteurs) et sorties (aiguillages
et feux) dans JMRI sont accessibles via des noms. Pour plus
d'informations sur le sch&eacute;ma de d&eacute;signation
g&eacute;n&eacute;rale, s'il vous pla&icirc;t voir les <a href=
"../../doc/Technical/Names.shtml">pages de d&eacute;signation</a>
dans la <a href="../../doc/Technical/index.shtml">documentation
technique</a>.
<p>Pour les syst&egrave;mes Acela CTI, tous les noms commencent par
une lettre syst&egrave;me "A". Apr&egrave;s cela, il y a une
<a href="../../doc/Technical/Names.shtml#type">lettre type</a>,
puis une adresse absolue.</p>
<p>L'adresse absolue est &agrave; quatre chiffres ("10", "324",
"4"). Voir les sections sur les entr&eacute;es et les sorties
ci-dessous pour les significations sp&eacute;cifiques de ces
diff&eacute;rents formats.</p>
<p>Par exemple, la premi&egrave;re broche entr&eacute;e du capteur
Acela sur le deuxi&egrave;me module Watchman serait nomm&eacute;
AS8 ou AS08. Le cinqui&egrave;me aiguillage sur le troisi&egrave;me
module Dash-8 serait AT17.</p>
<h3>Num&eacute;rotation des Modules</h3>
Parce que le syst&egrave;me CTI Acela utilise des adresses absolues
il n'est pas vraiment un concept de num&eacute;ro de noeud (ou
module).
<p>Avant de pouvoir acc&eacute;der &agrave; une entr&eacute;e ou
une sortie sur un module CTI Acela (noeud JMRI ) dans JMRI, vous
avez &agrave; la d&eacute;finir pour le programmer. Si le
mat&eacute;riel est connect&eacute;, les noeuds (modules CTI) se
trouvent automatiquement au d&eacute;marrage. Les noeuds peuvent
&eacute;galement &ecirc;tre d&eacute;finis manuellement avec
l'outil <a href=
"../../../package/jmri/jmrix/acela/nodeconfig/NodeConfigFrame.shtml">
configurer les noeuds</a> Quoi qu'il en soit, n'oubliez pas de les
enregistrer avec le bouton "Enregistrer" sur la <a href=
"../../../package/apps/TabbedPreferences.shtml">fen&ecirc;tre
Pr&eacute;f&eacute;rences</a> (sous Modifier dans le menu
principal).</p>
<h2>Entr&eacute;es</h2>
Bien que le r&eacute;seau CTI Acela utilise des adresses absolue,
il a un espace d'adressage s&eacute;par&eacute; pour toutes les
entr&eacute;es et un espace d'adressage s&eacute;par&eacute; pour
toutes le sorties.
<p>En ce qui concerne les entr&eacute;es concern&eacute;es, JMRI
supporte les <a href="../../tools/Sensors.shtml">Capteurs</a> CTI
.</p>
<h3>Capteurs</h3>
Comme d&eacute;crit dans la documentation Acela sur le <a href=
"http://www.cti-electronics.com/app_sw.htm">site web CTI</a> , les
capteurs sont adress&eacute;s &agrave; partir de 0.
<p>Chaque module CTI peut contenir z&eacute;ro (Dash-8, le
signaleur, SwitchMan, chef de triage), quatre (Train-Brain), huit
(gardien), ou seize (Sentry) capteurs en fonction du type du
module.</p>
<p>Les adresses sont attribu&eacute;es, &agrave; partir de
z&eacute;ro, du premier module sur le c&ocirc;t&eacute; rouge du
module CTI Acela.</p>
<p>A titre d'exemple, supposons que nous disposons d'un
r&eacute;seau CTI Acela comprenant: un module Acela, un module de
gestion intelligent, un module de gardien, et un module de chef de
triage.</p>
<p>Le module de gestion intelligent prend en charge quatre capteurs
de fa&ccedil;on &agrave; ce que les capteurs soit aux entr&eacute;e
absolue adresses de 0 &agrave; 3 inclus. Le module Watchman prend
en charge huit capteurs de fa&ccedil;on &agrave; ce que les
capteurs soient &agrave; l'entr&eacute;e absolue adresses 4
&agrave; 11 ans inclus. Le module Yardmaster prend en charger
z&eacute;ro capteurs afin qu'il n'utilise aucune des adresses
d'entr&eacute;e absolue.</p>
<p>Les capteurs peuvent &ecirc;tre configur&eacute;s avec l'outil
<a href=
"../../../package/jmri/jmrix/acela/nodeconfig/NodeConfigFrame.shtml">
configurer les noeuds</a> . Si vous configurez vos capteurs,
n'oubliez pas de les enregistrer avec le bouton "Enregistrer" sur
la <a href=
"../../../package/apps/TabbedPreferences.shtml">fen&ecirc;tre
Pr&eacute;f&eacute;rences</a> (sous Modifier dans le menu
principal).</p>
<h3>Sorties</h3>
Bien que le r&eacute;seau CTI Acela utilise des adresses absolues,
elle a un espace d'adressage s&eacute;par&eacute; pour toutes les
entr&eacute;es et un espace d'adressage s&eacute;par&eacute; pour
toutes les sorties.
<p>Dans la mesure o&ugrave; les sorties Acela CTI sont
concern&eacute;es,elle sont support&eacute;es par <a href=
"../../tools/Turnouts.shtml">Aiguillages</a>, ou <a href=
"../../tools/Lights.shtml">Lumi&egrave;res</a> JMRI</p>
<h3>Aiguillages</h3>
Comme d&eacute;crit dans la documentation Acela sur le <a href=
"http://www.cti-electronics.com/app_sw.htm">site web CTI</a>, les
aiguillages ou les feux sont abord&eacute;s &agrave; partir de 0.
<p>Chaque module CTI peut contenir z&eacute;ro, quatre, huit ou
seize sorties en fonction du type du module.</p>
<p>Les adresses sont attribu&eacute;es, &agrave; partir de
z&eacute;ro, du premier module sur le c&ocirc;t&eacute; rouge du
module CTI Acela.</p>
<p>A titre d'exemple, supposons que nous disposons d'un
r&eacute;seau CTI Acela comprenant: un module Acela, un module de
gestion intelligent, un module de gardien, et un module de chef de
triage.</p>
<p>Le module de formation prend en charge quatre sorties du
gestionnaire de sorte que ses sorties sont aux adresses absolues de
0 &agrave; 3 inclus. Le module ne prend en charge aucune sortie sur
le Watchman de sorte qu'il n'utilise aucune des adresses de sortie
absolue. Le chef de triage supporte seize sorties ses
r&eacute;sultats sont sur les sortie d'adresses absolue de 4
&agrave; 19 inclusivement.</p>
<p>Chacune de ces sorties peuvent &ecirc;tre un aiguillage ou une
lumi&egrave;re. Mais une sortie donn&eacute;e ne peut &ecirc;tre
qu'une lumi&egrave;re ou qu'un aiguillage - pas les deux.</p>
<p>L'aiguillage peut &ecirc;tre configur&eacute; avec l'outil
<a href=
"../../../package/jmri/jmrix/acela/nodeconfig/NodeConfigFrame.shtml">
configurer les noeuds</a> . Si vous configurez votre aiguillage
(sorties), n'oubliez pas de l'enregistrer avec le bouton
"Enregistrer" sur les <a href=
"../../../package/apps/TabbedPreferences.shtml">Fen&ecirc;tre
Pr&eacute;f&eacute;rences</a> (sous Modifier dans le menu
principal).</p>
<h3>Lumi&egrave;res</h3>
Comme d&eacute;crit dans la documentation sur le <a href=
"http://www.cti-electronics.com/app_sw.htm">site web CTI</a>, les
aiguillages ou les feux sont abord&eacute;es &agrave; partir de 0.
<p>Chaque module CTI peut contenir z&eacute;ro, quatre, huit ou
seize sorties selon le type de module.</p>
<p>A titre d'exemple, supposons que nous disposons d'un
r&eacute;seau CTI Acela comprenant: un module Acela, un module de
gestion intelligent, un module de gardien, et un module chef de
triage module.</p>
<p>Le module de formation prend en charge quatre sorties du
gestionnaire de sorte que ses sorties sont aux adresses absolues de
0 &agrave; 3 inclus. Le module ne prend en charge aucune sortie sur
le Watchman de sorte qu'il n'utilise aucune des adresses de sortie
absolue. Le chef de triage supporte seize sorties ses
r&eacute;sultats sont sur les sortie d'adresses absolue de 4
&agrave; 19 inclusivement.</p>
<p>Chacune de ces sorties peut &ecirc;tre un aiguillage ou une
lumi&egrave;re. Mais une sortie donn&eacute;e ne peut &ecirc;tre
qu'une lumi&egrave;re ou qu'un aiguillage - pas les deux.</p>
<p>Les feux peuvent &ecirc;tre configur&eacute;s avec l'outil
<a href=
"../../../package/jmri/jmrix/acela/nodeconfig/NodeConfigFrame.shtml">
configurer les noeuds</a> . Si vous configurez vos lumi&egrave;res
(sorties), n'oubliez pas de les enregistrer avec le Bouton
"Enregistrer" sur la <a href=
"../../../package/apps/TabbedPreferences.shtml">fen&ecirc;tre
Pr&eacute;f&eacute;rences</a> (sous Modifier dans le menu
principal).</p>
<h3>Limitations</h3>
<ul>
<li>CTI prend en charge un grand espace d'adressage pour les
entr&eacute;es et les sorties. JMRI limite actuellement cela
&agrave; 1024 entr&eacute;es et 1024 sorties (&eacute;quivalent
&agrave; 64 modules Sentry et 64 modules chef de triage). JMRI a
actuellement ceci cod&eacute; en dur - mais c'est juste une
question de priorit&eacute;s &agrave; d&eacute;signer.</li>
</ul>
<h2>Plus d'informations</h2>
Plus d'informations sur le mat&eacute;riel Acela peut &ecirc;tre
consult&eacute;e sur le <a href=
"http://www.cti-electronics.com/app_sw.htm">site web CTI</a>. 
<!--#include virtual="/Footer" --></div>
</div>
</body>
</html>
