<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<!-- Updated by Herv&#233; Blorec bzh56420@yahoo.fr 2013-11-04-->

<html lang="fr">
<head>
  <meta name="generator" content=
  "HTML Tidy for Mac OS X (vers 31 October 2006 - Apple Inc. build 15.17), see www.w3.org">

  <title>Operations</title>
  <meta name="author" content="Dan Boudreau">
  <meta name="keywords" content=
  "JMRI Help Operations Setup Settings Cars Engines Locomotives Trains itin&eacute;raires Locations Schedules">
  <!-- Style -->
  <meta http-equiv="Content-Type" content=
  "text/html; charset=us-ascii">
  <link rel="stylesheet" type="text/css" href="/css/default.css"
  media="screen">
  <link rel="stylesheet" type="text/css" href="/css/print.css"
  media="print">
  <link rel="icon" href="/images/jmri.ico" type="image/png">
  <link rel="home" title="Home" href="/">
  <!-- /Style -->
</head>

<body>
  <!--#include virtual="/Header" -->
  <div class="nomenu" id="mBody">
    <div id="mainContent">

      <h2>Exploitations JMRI</h2>Le programme d'Exploitations vous
      permet de cr&eacute;er des manifestes de train
      g&eacute;n&eacute;r&eacute;s par ordinateur pour vos chemins
      de fer. Un <a href="#PrintingManifests">manifeste du
      train</a> d&eacute;taille le travail qu'une &eacute;quipe
      doit r&eacute;aliser durant un session d'exploitation. Le
      manifeste fournit une liste des wagons &agrave; collecter et
      d&eacute;poser et montre o&ugrave; se trouvent les wagons et
      o&ugrave; ils devraient &ecirc;tre &eacute;ventuellement
      plac&eacute;s sur la voie. Le programme vous permet d'entrer
      une liste de wagons et locomotives, de d&eacute;finir des
      emplacements (gares) sur le r&eacute;seau, et des
      itin&eacute;raires pour la circulation des trains. La liste
      des wagons inclut des informations sur le wagon, y compris le
      nom de ligne, le num&eacute;ro, le type de wagon, couleur,
      longueur, poids, date de Asssemblage, et le
      propri&eacute;taire. Les trains sont affect&eacute;s &agrave;
      des itin&eacute;raires qui d&eacute;finissent les lieux ou
      gare o&ugrave; les wagons peuvent &ecirc;tre ramass&eacute;s
      ou d&eacute;pos&eacute;s. Ces caract&eacute;ristiques
      incluent la possibilit&eacute; de contr&ocirc;ler quels types
      de wagons, les noms de lignes et les wagons charg&eacute;s
      qu'un emplacement ou unembranchement industriel peut
      utiliser, la longueur de voie disponible pour un lieu, et la
      longueur maximale du train entre deux emplacements sur
      l'itin&eacute;raire du train.

      <p>Les Emplacements peuvent avoir des voies d'embranchements,
      de triage, de coulisse et d'inter&eacute;change. Les
      embranchements sont utilis&eacute;s pour desservir les
      industries, et peuvent &eacute;ventuellement avoir des
      <a href="#Schedules">Horaires</a> personnalis&eacute;s qui
      leur sont assign&eacute;s. Les trains peuvent &ecirc;tre
      configur&eacute;s pour requ&eacute;rir un fourgon de queue ou
      un wagon avec un dispositif clignotant
      d'extr&eacute;mit&eacute; arri&egrave;re (FRED). Le programme
      g&eacute;n&egrave;re un manifeste pour chaque train et des
      listes de man&oelig;uvres pour tout emplacement. Une <a href=
      "#SwitchList">liste de man&oelig;uvres</a> pour un
      emplacement montre le travail de tous les trains qui se
      rendront &agrave; cet endroit. Le programme peut
      &eacute;galement placer des ic&ocirc;nes repr&eacute;sentant
      des trains sur un panneau JMRI. L'ic&ocirc;ne peut &ecirc;tre
      renseign&eacute;e pour se d&eacute;placer dans le panneau
      avec le train d'un endroit &agrave; un autre.</p>

      <p>Le programme d'Exploitation est inclus dans la suite
      d'outils DecoderPro/JMRI et peut &ecirc;tre trouv&eacute;
      sous la rubrique du menu principal "Outils-&gt;
      Exploitation".</p>

      <p><img src="images/MainMenuDecoderPro.png"></p>

      <h3>Table des mati&egrave;res</h3>

      <ul>
        <li><a href="#newUserAdvice">Nouveaux Conseils
        d'Utilisation</a></li>

        <li><a href="#demo">Fichiers de D&eacute;monstration
        Exploitations</a></li>

        <li><a href="#QuickStartHelp">Aide D&eacute;marrage
        Rapide</a></li>

        <li>
          <a href="#Settings">Param&egrave;tres</a>

          <ul>
            <li><a href="#Backup">Sauvegarde</a></li>

            <li><a href="#Restore">Restaurer</a></li>

            <li><a href="#ResetDatabase">R&eacute;initialiser la
            Base de Donn&eacute;es</a></li>

            <li><a href="#SettingsOptions">Options</a></li>
          </ul>
        </li>

        <li><a href="#PrintOptions">Manifeste Options
        d'Impression</a></li>

        <li><a href="#BuildReportDetails">Options Rapport
        d'Asssemblage</a></li>

        <li>
          <a href="#Locations">Emplacements</a>

          <ul>
            <li><a href="#Yards">Triages</a></li>

            <li>
              <a href="#Sidings">Embranchements</a>

              <ul>
                <li><a href="#Schedules">Horaires</a></li>

                <li><a href="#SchedulesAndLoads">Horaires et
                Charges</a></li>

                <li><a href=
                "#ShowSchedulesByCarTypeAndLoad">Montrer les
                Horaires par Type de Wagon et de Charge</a></li>
              </ul>
            </li>

            <li>
              <a href="#Interchange">Voies de
              Classification/&Eacute;changes</a>

              <ul>
                <li><a href="#CreateClassificationYard">Comment
                Cr&eacute;er un Faisceau de Triage</a></li>
              </ul>
            </li>

            <li>
              <a href="#Staging">Voies en Coulisse</a>

              <ul>
                <li><a href="#StagingAndCarLoads">Coulisse et
                Charges de Wagons</a></li>

                <li><a href="#BlockingCarsFromStaging">Bloc de
                Wagons depuis la Coulisse</a></li>

                <li><a href="#LoopingTrainsThroughStaging">Looping
                trains &agrave; travers la Coulisse</a></li>
              </ul>
            </li>

            <li><a href="#ChangeTrackType">Modifier le Type de
            Voie</a></li>

            <li><a href="#Polls">Voies Mutualis&eacute;es</a></li>

            <li><a href="#ModifyLocationsByCarType">Modifier
            Emplacements et Voies par Type de Wagons</a></li>
          </ul>
        </li>

        <li>
          <a href="#Cars">Wagonss</a>

          <ul>
            <li><a href="#ImportingCars">Importation de Wagons
            &agrave; partir d'un Fichier</a></li>

            <li><a href="#CarsEdit">Ajout de Wagons &agrave; votre
            Liste</a></li>

            <li><a href="#CarLoad">Charges Wagons</a></li>

            <li><a href="#Kernel">Noyau, ou Groupe de
            Wagons</a></li>

            <li><a href="#EditCarAttributes">Modifier les Attributs
            de Wagon</a></li>

            <li><a href="#EditCarLoads">Modifier Charges de
            Wagon</a></li>

            <li><a href="#CarsSet">D&eacute;finir Wagons</a></li>
          </ul>
        </li>

        <li>
          <a href="#Locomotives">Locomotives</a>

          <ul>
            <li><a href="#ImportLocomotives">Importation de
            Locomotives</a></li>

            <li>
              <a href="#LocomotivesAdd">Ajout de Locomotives
              &agrave; votre Liste</a>

              <ul>
                <li><a href="#LocomotiveModels">Mod&egrave;les de
                locomotives</a></li>
              </ul>
            </li>

            <li><a href="#LocomotivesSet">D&eacute;finir
            Locomotive</a></li>

            <li><a href="#SynchronizeWithNCEConsists">Synchroniser
            avec Couplage NCE</a></li>
          </ul>
        </li>

        <li>
          <a href="#Routes">Itin&eacute;raires</a>

          <ul>
            <li><a href="#EditRoute">Modifier
            l'Itin&eacute;raire</a></li>

            <li><a href="#PassengerTrainRoute">Itin&eacute;raire
            Train Passagers</a></li>

            <li><a href="#RouteFeatures">Caract&eacute;ristiques
            Itin&eacute;raire</a></li>

            <li><a href="#SetTrainIconCoordinates">D&eacute;finir
            Coordonn&eacute;es Ic&ocirc;ne du Train</a></li>
          </ul>
        </li>

        <li>
          <a href="#Trains">Trains</a>

          <ul>
            <li><a href="#TrainReset">R&eacute;initialiser
            Train</a></li>

            <li><a href="#TrainBuildOptions">Options d'Assemblage
            du Train</a></li>

            <li><a href="#TrainManifestOptions">Options du
            Manifeste du Train</a></li>

            <li><a href="#TrainScripts">Scripts</a></li>

            <li><a href="#TrainShowCarTypesServiced">Voir les Types
            de Wagons desservis</a></li>

            <li><a href="#ModifyTrainsByCarType">Modifier Trains
            par Type de Wagon</a></li>

            <li><a href="#SwitcherService">Utilisation du
            Switcher</a></li>

            <li><a href="#BuildingTrains">Assemblage des
            Trains</a></li>

            <li><a href="#Timetable">Horaire</a></li>

            <li><a href=
            "#TroubleShootingBuildingTrains">Probl&egrave;mes
            d'Assemblage Trains Comment r&eacute;parer</a></li>

            <li><a href="#ReadingBuildReport">Lecture du Rapport
            d'Assemblage</a></li>

            <li><a href="#PrintingManifests">Impression des
            Manifestes</a></li>

            <li><a href="#SwitchList">Changer les Listes</a></li>

            <li><a href="#TrainMove">Mouvement des Trains</a></li>

            <li><a href="#TerminateTrain">Terminer Train</a></li>

            <li><a href="#SaveBuilds">Sauvegarder
            Assemblagess</a></li>

            <li><a href="#BuildingMultipleTrainsSession">Assemblage
            de Plusieurs Trains pour une Session</a></li>
          </ul>
        </li>

        <li><a href="#OperationWindows">Fen&ecirc;tre
        Exploitation</a></li>
      </ul><a name="newUserAdvice" id="newUserAdvice"></a>

      <h3>Nouvel avis &agrave; l'utilisateur</h3>
      <a name="demo" id="demo"></a>

      <h3>Fichiers D&eacute;mo exploitation</h3>Si vous n'avez
      jamais utilis&eacute; un programme informatique pour
      g&eacute;n&eacute;rer des manifestes et des listes de
      man&oelig;uvres, nous vous recommandons de
      t&eacute;l&eacute;chargez et utilisez les <a href=
      "#demo">Fichiers de d&eacute;monstration</a> fournis. S'il
      vous pla&icirc;t lire les <a href=
      "#BuildReportDetails">Rapports d'Assemblage</a> pour les
      trains de d&eacute;monstration en mode tr&egrave;s
      d&eacute;taill&eacute;, m&ecirc;me si ils sont des fichiers
      d&eacute;mo. Vous drevez apporter des modifications ao
      programme de d&eacute;mo et voir quels sont les
      r&eacute;sultats. Ceci est votre chance d'exp&eacute;rimenter
      avec le programme avant d'entrer vos propres donn&eacute;es.
      Vous pouvez imprimer et sauvegarder un manifestevde train de
      d&eacute;monstration et de asssembler rapport pour avoir une
      r&eacute;f&eacute;rence ult&eacute;rieurement.

      <p>Apr&egrave;s avoir jou&eacute; avec les fichiers de
      d&eacute;monstration, vous pouvez <a href=
      "#ResetDatabase">r&eacute;initialiser la base de
      donn&eacute;es</a> et commencer &agrave; entrer vos propres
      donn&eacute;es. Nous recommandons fortement que vous obteniez
      vos trains &agrave; assembler &agrave; votre go&ucirc;t sans
      l'utilisation de voies en coulisse, voie de
      classification/&eacute;change, et en particulier les horaires
      et les charges personnalis&eacute;s. Nous constatons que les
      utilisateurs qui tentent d'utiliser les fonctions
      avanc&eacute;es avant de comprendre comment fonctionne le
      programme, ont tendance &agrave; avoir besoin de beaucoup
      d'aide pour obtenir le mouvement du wagon, quils
      d&eacute;sirent. Donc, commencez petit et obtenez vos trains
      &agrave; assembler correctement, lire les rapports
      d'assemblage dans le Mode tr&egrave;s d&eacute;taill&eacute;
      pour vos trains, m&ecirc;me s'ils s'assemblent &agrave; votre
      go&ucirc;t. Vous devez obtenir de la comp&eacute;tence avec
      les rapports de d'assemblage avant de commencer &agrave;
      utiliser les fonctionnalit&eacute;s les plus avanc&eacute;es
      du programme. Une fois que vous obtenez vos trains
      assembl&eacute;s correctement, vous pouvez ajouter les voies
      en coulisse si vous avez con&ccedil;u une coulisse sur votre
      r&eacute;seau. Les trois autres fonctions avanc&eacute;es
      sont compl&egrave;tement optionnels et ne sont pas
      n&eacute;cessaires pour la majorit&eacute; des utilisateurs.
      Le type de voie suivant &agrave; exp&eacute;rimenter pourrait
      &ecirc;tre les voies classification/&eacute;change. Une fois
      que vous obtenez de bons r&eacute;sultats avec les voies
      classification/&eacute;change, vous pouvez alors introduire
      des horaires pour vos embranchements et des charges
      personnalis&eacute;es pour vos wagons. Si vous d&eacute;cidez
      d'utiliser les horaires, la premi&egrave;re chose &agrave;
      comprendre, c'est que vous n'avez pas besoin des horaires
      pour l'ensemble de vos embranchements. Encore une fois
      commencer petit et avec seulement une paire d'embranchements
      et de voir quels sont les r&eacute;sultats. L'Ajout de
      planifications ne peut pas augmenter le mouvement du wagon,
      et dans la plupart des cas, permettra de r&eacute;duire le
      mouvement du wagon! Donc, notre conseil est d'apprendre
      &agrave; marcher avant d'essayer de courir.</p>

      <a name="QuickStartHelp" id="QuickStartHelp"></a>
      <h3>Aide d&eacute;marrage rapide</h3>Dans le menu de niveau
      sup&eacute;rieur pour JMRI trouvez le menu "Outils-&gt;
      Exploitation". Il existe six &eacute;l&eacute;ments dans ce
      menu. Nous vous recommandons de commencer avec <a href=
      "#Settings">Param&egrave;tres</a> et de suivre votre chemin
      jusqu'&agrave; <a href="#Trains">Trains</a> . Saisir et
      Requ&eacute;rir des locomotives pour vos trains est
      compl&egrave;tement optionnel, et les locomotives ne sont pas
      n&eacute;cessaires pour que le programme fonctionne
      correctement. Donc, si vous voulez assigner manuellement vos
      locomotives &agrave; vos trains, pas la peine d'entrer les
      donn&eacute;es de la locomotive dans le programme. Nous
      recommandons &eacute;galement que lors de la
      d&eacute;finition de vos emplacements que vous utilisez pour
      la premi&egrave;re fois les voies de Triage et
      d'Embranchements et essayer Les voies en coulisses et les
      voies de classification/change lorsque vous &ecirc;tes plus
      &agrave; l'aise avec le fonctionnement de votre programme.

      <p>Si ceci est votre premi&egrave;re exp&eacute;rience de
      l'utilisation d'un programme de transfert de wagons
      g&eacute;n&eacute;r&eacute; par ordinateure, il est
      pr&eacute;f&eacute;rable de commencer par un petit travail et
      progressivement de cheminer &agrave; travers les
      diff&eacute;rentes options et fonctionnalit&eacute;s
      disponibles. Commencez par entrer seulement trois ou quatre
      lieux <a href="#Locations"></a> avec chaque emplacement ayant
      seulement deux ou trois voies. Gardez les choses simples et
      ne modifiez pas les lieux et les voies par d&eacute;faut en
      les rendant contraignantes en ce qui concerne le type de
      wagons ou locomotives qui assureront la desserte de ce lieu
      et voies par des trains venant de n'importe quelle direction.
      Ne changez pas les param&egrave;tres par d&eacute;faut
      jusqu'&agrave; ce vous puissiez r&eacute;ussir &agrave;
      asssembler des trains &agrave; votre go&ucirc;t.</p>

      <p>Maintenant, entrez quelques wagons <a href=
      "#CarsEdit"></a> dans la base de donn&eacute;es Exploitation
      , ne vous emb&ecirc;tez pas &agrave; entrer les locomotives
      pour l'instant. Soyez s&ucirc;r de placer les wagons sur une
      voie en utilisant <a href="#CarsEdit">&Eacute;dition
      Wagon</a> ou la fen&ecirc;tre <a href=
      "#CarsSet">ld&eacute;finir Wagon</a> . Le programme
      fonctionne mieux si vous gardez au moins 50% de vos voies
      vides, alors ne placez pas trop de wagons sur les voies
      jusqu'&agrave; ce que vous compreniez comment le programme
      construit les trains.</p>

      <p>Maintenant, cr&eacute;ez un simple trajet <a href=
      "#Routes"></a> que votre premier train va suivre. Entrez
      chacun de vos lieux sur l'itin&eacute;raire, et les garder
      simples en entrant seulement une fois chacun de vos lieux
      dans l'itin&eacute;raire. Pour l'instant ne pas modifier
      l'itin&eacute;raire en aucune fa&ccedil;on, utiliser juste le
      bouton "Ajouter Lieu ".</p>

      <p>Maintenant vous &ecirc;tes pr&ecirc;t &agrave;
      cr&eacute;er votre premier <a href="#Trains">train</a> .
      Soyez s&ucirc;r de choisir l'itin&eacute;raire que vous avez
      cr&eacute;&eacute; pour votre premier train. Laissez toutes
      les cases &agrave; cocher vides ce qui signifie que le train
      peut utiliser tous les wagons et types de locomotives.
      Laissez les "Options" pour les locomotives et la zone caboose
      pour le moment. Enregistrer le train, fermez la fen&ecirc;tre
      et revenir &agrave; la fen&ecirc;tre Trains. Appuyez sur le
      bouton <a href="#BuildingTrains">Assembler</a> pour le train.
      Il devrait se asssembler. Maintenant presser la touche
      "Imprimer" ou le bouton "Aper&ccedil;u" va produire un
      manifeste pour votre train. A l'examen du manifeste vous
      devriez voir que le le train fournit tous les types de
      wagons. Si vous examinez la fen&ecirc;tre <a href=
      "#Cars">Wagons</a> , vous pouvez voir quels wagons sont
      d&eacute;sormais affect&eacute;s &agrave; votre train.</p>

      <p>Maintenant, essayez de limiter les types de wagon que le
      train va fournir en modifiant certaines cases de types de
      wagons dans la fen&ecirc;tre <a href="#Trains">&Eacute;dition
      Train</a> . Utilisez le bouton <a href=
      "#TrainReset">r&eacute;init</a> train pour lib&eacute;rer les
      wagons qui ont &eacute;t&eacute; affect&eacute;s &agrave; la
      formation afin que vous puissiez l'assembler &agrave; nouveau
      sans bouger le train. Avec les nouveaux types restreints de
      wagons en place, vous pouvez voir que le train ne prendra et
      d&eacute;posera que les types de wagons qui ont
      &eacute;t&eacute; s&eacute;lectionn&eacute;s dans la
      fen&ecirc;tre &Eacute;dition Train</p>

      <p>Maintenant, essayez de restreindre vos <a href=
      "#Yards">voies</a> pour seulement certains types de wagons en
      modifiant les types de wagons fournis par une voie.
      Maintenant, quand vous construisez le train, le train liste
      seulement les wagons pour les voies qui sont pr&ecirc;tes
      &agrave; les accepter.</p>

      <p>Appuyez sur le bouton <a href=
      "#TrainMove">D&eacute;placer</a> situ&eacute; dans la
      fen&ecirc;tre <a href="#Trains">Trains</a> et vous verrez que
      le train va passer d'un emplacement &agrave; l'autre dans
      l'itin&eacute;raire. Vous verrez aussi que la fen&ecirc;tre
      <a href="#Cars">Wagons</a> sera mise &agrave; jour pour
      montrer les wagons fournis par le train en marche vers leur
      nouvel emplacement quand les trains se d&eacute;placent d'un
      endroit &agrave; un autre.</p>

      <p>Maintenant, entrez certaines <a href=
      "#Locomotives">locomotives</a> dans la base de donn&eacute;es
      de l'exploitation, et modifier les exigences du train pour
      n&eacute;cessiter une locomotive. Placer une partie de vos
      locomotives sur une voie situ&eacute;e au d&eacute;part de
      l'itin&eacute;raire. Notez que si vous voulez que deux ou
      plusieurs locomotives tractent votre train, les locomotives
      doivent &ecirc;tre dans un <a href=
      "#LocomotivesAdd">Couplage</a> . Le dernier emplacement de
      votre itin&eacute;raire doit avoir une voie qui assurera la
      r&eacute;ception du <a href="#LocomotiveModels">Type</a> de
      la locomotive ou l'assemblage &eacute;chouera.</p>

      <p>Si vous voulez un fourgon de queue ou une wagon avec Fred
      pour votre train, tout d'abord configurer certains de vos
      wagons en fourgon de queue en s&eacute;lectionnant le fourgon
      de queue ou la <a href="#CabooseFredHazardous">case FRED</a>
      dans la fen&ecirc;tre Edition Wagon . Maintenant changer le
      bouton radio Requ&ecirc;te Optionnelle pour le train d'un
      Caboose ou Fred. Soyez s&ucirc;r que le dernier emplacement
      sur votre itin&eacute;raire des trains a une voie qui
      acceptera la wagon fourgon de queue ou le train ne
      s'assemblera pas correctement.</p>

      <p>Si vous continuez &agrave; asssembler votre premier train
      et en le d&eacute;pla&ccedil;ant, &eacute;ventuellement tous
      vos wagons finissent &agrave; la derni&egrave;re position
      dans votre itin&eacute;raire! Cr&eacute;er une autre voie qui
      est l'inverse du premier train. Allez &agrave; <a href=
      "#Routes">Itin&eacute;raires</a> et sous le menu "Outils"
      s&eacute;lectionner "Copier Itin&eacute;raire". Choisissez
      votre itin&eacute;raire initial, cochez la case "Inverser",
      entrez un nom pour cet itin&eacute;raire, puis le bouton
      "Copier". Maintenant, cr&eacute;ez un deuxi&egrave;me train
      qui utilise cette voie pour envoyer les wagons dans la
      direction oppos&eacute;e &agrave; votre premier train.</p>

      <p>Vous devriez maintenant &ecirc;tre sur la bonne voie en ce
      qui concerne les Exploitationns JMRI . L'aide est
      &eacute;galement disponible sur <a href=
      "https://groups.io/g/jmriusers">la liste
      jmriusers</a></p><a name="BritishRailways" id=
      "BritishRailways"></a>

      <h3>Chemin de Fer Britannique</h3>Le programme supporte un
      autre jeu de la terminologie ferroviaire pour nos
      Mod&eacute;listes Britanniques. Pour utiliser la terminologie
      britannique, modifier l'affichage JMRI avec la Locale
      anglaise (Royaume-Uni). Avec la terminologie britannique, les
      trains voyages Haut/Bas et Est/Ouest, et certains noms de
      chemins de fer britanniques et types de wagons sont fournis
      pour vous aider &agrave; d&eacute;marrer. <a name="Settings"
      id="Settings"></a>

      <h2>R&eacute;glages</h2>La fen&ecirc;tre Param&egrave;tres
      contient les param&egrave;tres g&eacute;n&eacute;raux pour le
      programme Exploitation . S&eacute;lectionnez dans la
      fen&ecirc;tre principale JMRI "Outils-&gt; Exploitation&gt;
      Param&egrave;tres" pour ouvrir la fen&ecirc;tre
      Param&egrave;tres. La fen&ecirc;tre de r&eacute;glage a des
      champs et des boutons pour vous permettre d'entrer votre nom
      de chemins de fer, les directions de voyage de votre train, ,
      l'&eacute;chelle que vous utilisez, les commandes de
      l'imprimante et l'ic&ocirc;ne, et le capacit&eacute; de
      cr&eacute;er des sauvegardes et restaurer les fichiers pour
      l'exploitation.

      <p><img src="images/Settings.png"></p>

      <h3>Nom de la Compagnie</h3>Entrez votre nom dans le champ en
      face du "Nom de la Compagnie". Ce nom appara&icirc;tra sur
      votre manifeste. Vous pouvez aussi avoir un autre Nom de
      Compagnie pour tous les trains dans votre liste, voir Options
      de <a href="#TrainOptions">Train</a> pour plus de
      d&eacute;tails.

      <h3>Direction du Train</h3>Si votre chemin de fer
      repr&eacute;sente les trains voyageant vers le nord et le sud
      s&eacute;lectionner la boite "Nord/Sud", si vos train
      voyagent de l'est et l'ouest s&eacute;lectionner la boite
      "Est/Ouest". Vous devez s&eacute;lectionner au moins une
      direction, et pouvez, si souhait&eacute; s&eacute;lectionner
      les deux. <a name="Scale" id="Scale"></a>

      <h3>&Eacute;chelle</h3>Ensuite, s&eacute;lectionnez
      l'&eacute;chelle &agrave; laquelle vous mod&eacute;lisez.
      Ceci est utile lorsque vous entrez la longueur des wagons et
      des voies. Vous pouvez entrer le nombre de pouces
      r&eacute;els et le programme va le convertir &agrave;
      l'&eacute;chelle en pieds. Ajouter un guillemet &agrave; la
      Longueur en entrant pouces r&eacute;els. Le programme saura
      aussi automatiquement attribuer le poids NMRA
      appropri&eacute; pour un wagon bas&eacute; sur
      l'&eacute;chelle et la longueur. <a name="MaximumTrainLength"
      id="MaximumTrainLength"></a>

      <h3>Longueur maximale des trains</h3>Maintenant, entrez la
      valeur par d&eacute;faut "Longueur Maximale des Trains" que
      vous d&eacute;sirez pour vos trains. Ce champ indique la
      longueur maximale par d&eacute;faut du train entre les
      villes. Plus tard, vous pouvez remplacer cette longueur si
      vous souhaitez par une plus courte entre deux emplacements.
      Un train de 1000 pieds peut transporter environ 20 wagons, et
      est bien s&ucirc;r d&eacute;pendant de la longueur des wagons
      affect&eacute;s au train.

      <h3>Nombre maximal des locomotives</h3>Maintenant
      d&eacute;finir le nombre maximal de locomotives que vous
      voulez que le programme affectee &agrave; un train. Si vous
      ne voulez pas que le programme attribut de locomotive, mettre
      cette valeur &agrave; 0.

      <h3>Man&oelig;uvre et Temps de Voyage</h3>Le programme lors
      de la g&eacute;n&eacute;ration des listes pour les
      man&oelig;uvres &agrave; divers endroits sur votre chemin de
      fer, permettra d'estimer l'heure d'arriv&eacute;e des trains
      bas&eacute;e sur votre heure de d&eacute;part du train et le
      temps de man&oelig;uvre et de voyage. Entrez le nombre moyen
      de minutes qu'il faut pour d&eacute;poser ou collecter un
      wagon sur votre r&eacute;seau. Ensuite, entrez la
      quantit&eacute; moyenne de temps en minutes qu'il faut pour
      voyager d'un endroit &agrave; l'autre. Plus tard, lorsque
      vous cr&eacute;ez un itin&eacute;raire <a href=
      "#Edititin%C3%A9raire"></a> vous serez en mesure d'augmenter
      ou de diminuer le temps de d&eacute;placement du train entre
      les deux emplacements.

      <h3>Types de Wagons</h3>Le programme comporte deux ensembles
      de types de wagons &agrave; utiliser pour vous. Descriptif:
      fournit des noms de type comme "Boxcar" et "Tankcar", et AAR
      :fournit des typex des noms comme "XM" et "T" pour wagons
      couverts et wagons-citernes, respectivement.
      S&eacute;lectionnez celui que vous pr&eacute;f&eacute;rez.

      <h3>Ann&eacute;e Optionnelle de la
      mod&eacute;lisation</h3>Vous pouvez &eacute;ventuellement
      entrer l'ann&eacute;e que vous voulez imprimer sur votre
      manifeste train.

      <h3>Ajouter Menu Exploitation au Menu
      Principal</h3>Lorsqu'elle est s&eacute;lectionn&eacute;e,
      ajoute le menu Exploitation &agrave; la barre de menu
      principal. Le menu d'exploitation appara&icirc;tra la
      prochaine fois que vous red&eacute;marrez JMRI.

      <h3>Fermer sur Sauvegarder</h3>Lorsqu'elle est
      s&eacute;lectionn&eacute;e, les fen&ecirc;tres se ferment
      lorsque le bouton "Sauvegarder" est enfonc&eacute;.

      <h3>Sauvegarde Auto</h3>Lorsqu'elle est
      s&eacute;lectionn&eacute;e, le programme enregistre
      automatiquement les fichiers de fonctionnement apr&egrave;s
      avoir &eacute;t&eacute; chang&eacute;. Quand un changement
      survient le programme apr&egrave;s 1 &agrave; 2 minutes
      sauvegarde automatiquement les fichiers Exploitation.

      <h3>Backup automatique</h3>Une fois
      s&eacute;lectionn&eacute;, le programme va cr&eacute;er un
      ensemble de sauvegarde des fichiers Exploitationchaque fois
      que le programme est d&eacute;marr&eacute;. Voir <a href=
      "#BackupRestore">Sauvegarde et Restauration</a> pour plus
      d'informations.

      <h3>Options du Panneau (Ic&ocirc;nes Train)</h3>Si vous
      voulez que le programme d'Exploitation place une ic&ocirc;ne
      repr&eacute;sentant le train sur un panneau, saisissez le nom
      du panneau (PAS le chemin du nom de fichier panneau !), sinon
      laissez le nom en blanc pour d&eacute;sactiver. Chargez le
      panneau en utilisant le menu principal "Panneau de
      configuration-&gt; Charger Panneaux ..." ou utiliser d'autres
      options de chargement du panneau disponible en JMRI.

      <p>La case "Activer Ic&ocirc;ne Train en X &amp; Y"
      lorsqu'elle est s&eacute;lectionn&eacute;e vous permet de
      d'apprendre au programme Exploitation o&ugrave; placer
      l'ic&ocirc;ne du train sur votre panneau et de
      transf&eacute;rer votre train de lieu en lieu.
      D&eacute;cocher cette fonction apr&egrave;s avoir
      renseign&eacute; le programme vise &agrave; pr&eacute;venir
      la modification acciembranchementelle de l'ic&ocirc;ne de
      position du train sur votre panneau. Si vous souhaitez
      &eacute;galement que le num&eacute;ro de la locomotive de
      t&ecirc;te apparaisse dans le cadre de votre texte de
      l'ic&ocirc;ne train, choisissez la boite "Ajouter
      Num&eacute;ro de Locomotive ". Vous pouvez
      s&eacute;lectionner la couleur de fond de votre ic&ocirc;ne
      du Train selon la direction du train. S&eacute;lectionnez la
      couleur souhait&eacute;e pour chaque direction en utilisant
      les menus d&eacute;roulants. Une <a href=
      "#SwitcherService">Loco de Man&oelig;uvre</a> est un train
      avec un seul emplacement dans son itin&eacute;raire</p>

      <p><img src="images/PanelWithMarkers.png"></p>

      <h3>Sauvegarder</h3>Lorsque vous avez termin&eacute; avec la
      fen&ecirc;tre des param&egrave;tres, appuyez sur le bouton
      Enregistrer pour enregistrer le r&eacute;glage dans un
      fichier appel&eacute; "Operations.xml". Vous pouvez trouver
      ce fichier dans votre r&eacute;pertoire JMRI dans un dossier
      appel&eacute; "operations". Le programme va &eacute;galement
      cr&eacute;er un fichier de sauvegarde chaque fois que vous
      appuyez sur le bouton Enregistrer.

      <h3><a name="BackupRestore" id="BackupRestore"></a>
      Sauvegarde</h3>

      <p>Des copies des fichiers d'exploitation peuvent &ecirc;tre
      faits pour fournir des sauvegardes &agrave; la fois pour la
      r&eacute;cup&eacute;ration d'erreur et pour l'archivage. Les
      fichiers de donn&eacute;es utilis&eacute;s pour
      l'exploitation est un ensemble de six dossiers, et ils sont
      appel&eacute;s comme un "jeu de sauvegarde". Le programme
      comporte deux endroits qu'il utilise pour stocker ces jeux de
      sauvegarde, nomm&eacute;s l'"Enregistrement de sauvegarde
      automatique " et l'"Enregistrement de sauvegarde
      r&eacute;guli&egrave;re". Ceux-ci sont stock&eacute;s dans le
      r&eacute;pertoire JMRI"operations" dans votre
      r&eacute;pertoire comme "autobackups" et "sauvegardes". le
      but des sauvegardes automatiques est de faire une copie des
      fichiers "en lieu s&ucirc;r" avant que des changements soient
      apport&eacute;s aux fichiers principaux d'Exploitations. De
      cette fa&ccedil;on, si quelque chose est foir&eacute;, il y
      aune copie de la derni&egrave;re adresse connue de bonnes
      donn&eacute;es qui peuvent facilement &ecirc;tre
      restaur&eacute;es pour r&eacute;parer les
      d&eacute;g&acirc;ts. En fonctionnement normal, une sauvegarde
      automatique est effectu&eacute;e chaque fois que le programme
      d&eacute;marre (si le param&egrave;tre "Sauvegarde
      automatique" est coch&eacute;e sur la page
      Param&egrave;tres), et juste avant une Restauration,
      R&eacute;initialisation de la Base de donn&eacute;es, ou
      qu'un chargement de fichiers de d&eacute;monstration est
      fait.</p>

      <p>Tous les jeux de sauvegarde ont un nom par d&eacute;faut
      bas&eacute; sur la date &agrave; laquelle la sauvegarde a
      &eacute;t&eacute; effectu&eacute;e, ainsi qu'une
      s&eacute;quence de nombre, mais ce nom peut &ecirc;tre
      chang&eacute; en quelque chose que l'utilisateur souhaite
      pour des sauvegardes r&eacute;guli&egrave;res. il est
      recommand&eacute; que les noms des jeux de sauvegardes
      effectu&eacute;es &agrave; des fins d'archivage donner un nom
      significatif, surtout si vous g&eacute;rez des donn&eacute;es
      pour plus d'un chemin de fer. Par exemple, si aujourd'hui est
      Ao&ucirc;t 29, 2012, le programme va cr&eacute;er un
      r&eacute;pertoire de sauvegarde appel&eacute;
      "2012_08_29_00".</p><a name="Restore" id="Restore"></a>

      <h3>Restaurer</h3>

      <p>Notez que la restauration d'un jeu de sauvegarde
      &eacute;crase les fichiers d'exploitation en cours, donc une
      Sauvegarde automatique est effectu&eacute;e juste avant la
      restauration copie les fichiers, "juste au cas
      o&ugrave;".</p>

      <p>les jeux de sauvegarde surpeuvent &ecirc;tre
      restaur&eacute;s &agrave; partir soit de l'enregistement
      automatique ou l'enregistement ordinaire en utilisant le
      Bouton "Restaurer" sur la page Param&egrave;tres. Sinon,
      l'option "Restaurer" sur le menu Outils de la page
      Param&egrave;tres d'Exploitation vous permet de naviguer vers
      n'importe quel r&eacute;pertoire, et doit &ecirc;tre
      utilis&eacute; pour restaurer un jeu de sauvegarde
      archiv&eacute;e.</p><img src="images/RestoreDialog.png">

      <p>La date et l'heure &agrave; laquelle le jeu de sauvegarde
      a &eacute;t&eacute; fait sont affich&eacute;es avec le nom
      mis pour aider &agrave; distinguer le jeu de sauvegarde
      correcte.</p>

      <p>Vous devez quitter et red&eacute;marrer JMRI pour achever
      la restauration des fichiers d'exploitation.</p><a name=
      "ResetDatabase" id="ResetDatabase"></a>

      <h3>R&eacute;initialisation base de donn&eacute;es</h3>

      <p>Pour r&eacute;initialiser les donn&eacute;es de
      fonctionnement et supprimer tous les fichiers d'exploitation,
      utilisez l'option "R&eacute;initialiser Base de
      Donn&eacute;es" sur le Menu Outils de la page
      Param&egrave;tres d'Exploitation. Une copie de sauvegarde
      automatique des fichiers d'exploitation courants sera faite
      avant la suppression des fichiers principaux. Les
      r&eacute;sultats seront que les param&egrave;tres, les
      wagons, locomotives, les lieux, et les fichiers de trains
      seront purg&eacute;s. Notez qu'apr&egrave;s cela soit fait et
      red&eacute;marre JMRI, l'&eacute;l&eacute;ment de menu
      "Exploitation" dans le menu principal ne sera plus visible,
      car il n'y a pas de fichiers d'exploitation &agrave; charger.
      Si vous voulez de nouveau utiliser la fonctionnalit&eacute;
      de l'Exploitation, vous pouvez charger les fichiers de
      d&eacute;monstration ou de restaurer une sauvegarde
      pr&eacute;c&eacute;embranchemente. Pour ce faire, ouvrez la
      page Param&egrave;tres d'exploitation en s&eacute;lectionnant
      l'option "Param&egrave;tres" dans le menu Outils- &gt;
      Op&eacute;rations de la page principale. De l&agrave;, vous
      pouvez faire soit une restauration ou une chargement des
      fichiers de d&eacute;monstration de la mani&egrave;re
      habituelle.</p>Il n'y a pas de fichiers d'exploitation
      &agrave; charger. Si vous voulez de nouveau utiliser la
      fonctionnalit&eacute; de l'exploitation, vous pouvez charger
      les fichiers de d&eacute;monstration ou de restaurer une
      sauvegarde pr&eacute;c&eacute;embranchemente. Pour ce faire,
      ouvrez la page Param&egrave;tres d'exploitation en
      s&eacute;lectionnant l'option "Param&egrave;tres" dans le
      menu Outils- &gt; Op&eacute;rations de la page principale. De
      l&agrave;, vous pouvez faire soit une restauration ou
      recharger des fichiers de d&eacute;monstration de la
      mani&egrave;re habituelle.

      <p><img src="images/SettingsOptions.png"></p>

      <h3>Options d'Assemblage</h3>Il y adeux options d'assemblage
      du train, normale et agressive. Il est recommand&eacute; que
      vous s&eacute;lectionnez l'option normale lorsque vous
      commencez &agrave; utiliser le programme. L'assemblage normal
      garantie que quand un wagon est livr&eacute; par un train
      qu'il y aura une longueur de voie disponible pour ce wagon.

      <p>L'assemblage agressif rend la longueur de voie du wagon
      disponible d&egrave;s qu'un wagon est pr&eacute;vu pour
      &ecirc;tre collect&eacute;. Donc il peut y avoir des cas
      o&ugrave; un train collecte un wagon pour quitter la voie,
      mais un autre train pr&eacute;vu plus tard arrive plus
      t&ocirc;t avec un wagon &agrave; livrer sur cette voie et
      l'autre wagon n'a pas encore &eacute;t&eacute;
      collect&eacute;. Cependant, le plus souvent ce ne sera pas le
      m&ecirc;me train qui effectuera la collecte et la livraison
      minimisant ainsi le nombre de conflits. L'assemblage agressif
      effectue aussi une d&eacute;termination par deux passes de
      mouvements pour les wagon. L'effet net est que les wagons
      sont plus d&eacute;plac&eacute;s dans un train donn&eacute;.
      Agressif tend &eacute;galement &agrave; livrer des wagons aux
      embranchements disponibles. Le plus petit embranchement,
      triage, ou inter&eacute;change tel qu'il est probable que le
      programme attribuera les wagons &agrave; cette voie.</p>

      <p>Notez qu'une fois que vous avez construit un train,
      l'option d'assemblage ne peut &ecirc;tre chang&eacute;e
      jusqu'&agrave; ce que tous les trains soient termin&eacute;s
      ou r&eacute;initialis&eacute;s.</p><a name=
      "AllowLocalCarMovements" id="AllowLocalCarMovements"></a>

      <h3>Service de Man&oelig;uvre</h3>Le prochain jeu d'options
      commandee les mouvements locaux de wagon. Normalement, il est
      pr&eacute;f&eacute;rable de ne pas permettre &agrave; un
      wagon de se d&eacute;placer d'un embranchement directement
      &agrave; un autre dans le m&ecirc;me lieu. Ce type de
      mouvement peut &ecirc;tre tr&egrave;s irr&eacute;aliste,
      image anim&eacute;e d'un wagon couvert d'une fabrique de
      chaussures directement &agrave; une fabrique automobile.
      Aussi le d&eacute;placement d'un wagon d'un voie de triage
      &agrave; l'autre peut voir vos op&eacute;rateurs demander
      quel genre de travail est g&eacute;n&eacute;r&eacute;! Mais
      si vous avez besoin de ces types de mouvements, cochez la
      case appropri&eacute;e. <a name=
      "TypeRoadLoadRestrictionsStaging" id=
      "TypeRoadLoadRestrictionsStaging"></a>

      <h3>Activer les Restrictions de Type, de Ligne et de Charge
      dans la Coulisse</h3>L'option suivante est la restriction des
      trains pour les voies de coulisse qui n' acceptent que le
      type, la ligne et les charges des trains du stock de
      mat&eacute;riel roulant. Lorsque le bouton "Activer
      Restriction du Type, de la Ligne et de la Charge dans la
      coulisse "est s&eacute;lectionn&eacute;, le programme ne
      d&eacute;livrera un train qu'&agrave; une voie de coulisse
      qui a les m&ecirc;mes restrictions. Ceci est utile lorsque
      vous voulez livrer des trains &agrave; une coulisse et que ce
      soit bas&eacute;s sur les restrictions du train roulant.
      Toutefois, si vous voulez que certains types de wagons, de
      charge de wagon, ou noms de ligne soient transport&eacute;s
      par un train, mais non livr&eacute;s &agrave; la coulisse,
      d&eacute;cochez cette option.

      <p>Si vous sp&eacute;cifiez un certain train ou une voie pour
      &ecirc;tre accept&eacute; par une voie en coulisse, cette
      option est ignor&eacute;e, et vous pouvez alors
      contr&ocirc;ler les types de wagons, les charges, et de la
      ligne qui doivent &ecirc;tre accept&eacute;es par la voie en
      coulisse.</p>

      <h3><a name="PromptDepartureTrack" id=
      "PromptDepartureTrack"></a> Invite pour voie de D&eacute;part
      de Coulisse</h3>Si vous souhaitez que le programme vous
      demandera de quelle voie un train doit partir de la coulisse
      lors de la Asssemblage du train, s&eacute;lectionnez cette
      option. Normalement pendant que la Asssemblage du train le
      programme s&eacute;lectionnera au moins la voie la plus
      r&eacute;cente utilis&eacute;e comme voie de D&eacute;part .
      Notez que le programme ne vous le demandera que s'il y adeux
      ou plusieurs trains disponibles dans la coulisse qui
      r&eacute;ponembranchement aux exigences du train.

      <a name=
      "MakeDepartureTrackAvailable" id=
      "MakeDepartureTrackAvailable"></a>
      <h4>Rendre des Voies de D&eacute;part Disponibles
      apr&egrave;s Assemblage du Train</h4>Lorsque cette option est
      s&eacute;lectionn&eacute;e, elle rend la voie de
      d&eacute;part dans la coulisse disponible pour les autres
      trains imm&eacute;diatement apr&egrave;s que le train au
      d&eacute;part ait &eacute;t&eacute; assembl&eacute;. Pour les
      trains qui retournent au m&ecirc;me endroit de la coulisse,
      cette l'option permet au train d'utiliser la m&ecirc;me voie,
      qu'il a quitt&eacute;e. Cette option n'est disponible que
      lorsque vous utilisez le mode <a href=
      "#BuildOptions">agressif</a> pour les trains &agrave;
      assembler. <a name="AllowCarsToReturnToStaging" id=
      "AllowCarsToReturnToStaging"></a>

      <h4>Permettre aux Wagons de Revenir &agrave; la Coulisse si
      N&eacute;cessaire</h4>Quand un train part et revient au
      m&ecirc;me emplacement de la coulisse, c'est
      consid&eacute;r&eacute; comme un tour par le programme. A son
      tour, il prend normalement les wagons &agrave; partir de la
      coulisse, les pr&eacute;sente sur le trac&eacute;, ramasse
      les wagons neufs et retourne &agrave; la coulisse avec ces
      wagons. Normalement, le programme ne permet pas aux
      m&ecirc;mes wagons d'aller et revenir &agrave; la coulisse.
      Toutefois, il peut &ecirc;tre souhaitable de permettre au
      train de transporter les wagons plut&ocirc;t que d'avoir le
      rapport du programme que les wagons dans la coulisse ne
      pouvaient pas &ecirc;tre livr&eacute;s &agrave; destination
      sur la coulisse. La s&eacute;lection de cette option permet
      un tour pour le transport des wagons vers et &agrave; partir
      du m&ecirc;me emplacement de la coulisse. Notez que lorsque
      cette option est s&eacute;lectionn&eacute;e, que le programme
      retournera seulement les wagons &agrave; la coulisse quand
      les destinations ne sont pas disponibles sur le
      r&eacute;seau.

      <p>Cette option est &eacute;galement disponible sur un train
      de base. Voir <a href="#TrainBuildOptions">Train Options
      d'Assemblage</a> . </p>

      <a name="PromptArrivalTrack" id="PromptArrivalTrack"></a>
      <h4>Demander la Voie d'Arriv&eacute;e de la Coulisse /h4&gt;
      Si vous souhaitez que le programme vous demande quelle voie
      le train devra utiliser &agrave; l'arriv&eacute;e de la
      coulisse, pendant l'assemblage, s&eacute;lectionnez cette
      option. Normalement, pendant l'assemblage du train le
      programme choisit la voie la moins r&eacute;cemment
      utilis&eacute;e pour d&eacute;terminer la voie
      d'Arriv&eacute;e. Notez que le programme ne vous demandera
      pas s'il y adeux ou plusieurs trains disponibles dans la
      coulisse qui r&eacute;ponembranchement aux exigences du
      train. <a name="CarRouting" id="CarRouting"></a></h4>

      <h3>Routage Wagon</h3>

      <p>Quand le routage du wagon est activ&eacute;, le programme
      va utiliser plusieurs trains pour amener ce wagon &agrave; sa
      destination finale. Il est recommand&eacute; que vous
      laissiez cette option activ&eacute;e. Avec le routage du
      wagon activ&eacute;, vous pouvez utiliser un <a href=
      "#Schedules">Horaire</a> pour livrer un wagon &agrave; un
      endroit pr&eacute;cis. L'algorithme de routage de wagon va
      rechercher l'itin&eacute;raire le plus efficace pour le
      voyage du wagon. L'algorithme va tenter d'utiliser des
      inter&eacute;changes et des triages pour d&eacute;placer le
      wagons. Si vous ne voulez pas le itin&eacute;raireur &agrave;
      utiliser les triages, vous pouvez
      d&eacute;s&eacute;lectionner l'option "Activer Routage Wagon
      via les Triages". Le Routage via la coulisse est
      d&eacute;sactiv&eacute; par d&eacute;faut. L'algorithme va
      essayer de trouver un itin&eacute;raire en utilisant un
      maximum de cinq trains pour terminer le d&eacute;placement du
      wagon. Notez que le programme ne donne jamais &agrave;
      essayer de itin&eacute;rairer un wagon. Si un wagon a
      &eacute;t&eacute; attribu&eacute; &agrave; une "Destination
      Finale", le programme vais essayer et itin&eacute;rairer le
      wagon apr&egrave;s chaque mouvement.</p>

      <a name="LoggingOptions" id="LoggingOptions"></a>
      <h3>Options de Rapport</h3>Si vous voulez que le programme
      Exploitation enregistre les mouvements de votre locomotive,
      wagon ou train dans un fichier, s&eacute;lectionnez les cases
      appropri&eacute;es. Le programme va cr&eacute;er une nouveau
      r&eacute;pertoire appel&eacute; "logger" dans le
      r&eacute;pertoire des Op&eacute;rations. Pour la session de
      chaque jour le programme va cr&eacute;er un nouveau fichier
      (.csv) en utilisant la date du jour.

      <a name="ManifestOptions" id="ManifestOptions"></a>
      <h3>Options</h3>Si vous voulez cr&eacute;er votre propre
      manifeste en utilisant des valeurs s&eacute;par&eacute;es par
      une virgule (.Csv), s&eacute;lectionnez cette option. Vous
      pouvez utiliser un programme comme Excel pour cr&eacute;er un
      manifeste &agrave; votre go&ucirc;t. Vous pouvez trouver les
      fichiers manifeste dans le r&eacute;pertoire des Operationss
      dans un r&eacute;pertoire appel&eacute; "csvManifests".
      Chaque ligne du fichier commence par un code &agrave; deux ou
      trois lettres, suivie de la description du code, et ensuite
      tous les param&egrave;tres associ&eacute;s avec le code.
      Voici une liste des codes actuels et leurs descriptions:

      <table>
        <tr>
          <td>Code</td>

          <td>Description</td>

          <td>Param&egrave;tres</td>
        </tr>

        <tr>
          <td>AH</td>

          <td>Ajouter Assistances</td>
        </tr>

        <tr>
          <td>AT</td>

          <td>Heure d'arriv&eacute;e</td>

          <td>Heure</td>
        </tr>

        <tr>
          <td>CC</td>

          <td>Changer Locos et Caboose</td>
        </tr>

        <tr>
          <td>CL</td>

          <td>Changer Locos</td>
        </tr>

        <tr>
          <td>DT</td>

          <td>Heure de d&eacute;part</td>

          <td>Heure</td>
        </tr>

        <tr>
          <td>DTR</td>

          <td>Heure de d&eacute;part Itin&eacute;raire</td>

          <td>Heure</td>
        </tr>

        <tr>
          <td>EDT</td>

          <td>Heure D&eacute;part Estim&eacute;e</td>

          <td>Heure</td>
        </tr>

        <tr>
          <td>LC</td>

          <td>Commentaire Lieu</td>

          <td>Commentaire</td>
        </tr>

        <tr>
          <td>LN</td>

          <td>Nom Lieu</td>

          <td>Nom</td>
        </tr>

        <tr>
          <td>LOGO</td>

          <td>Nom du chemin pour le logo</td>

          <td>URL</td>
        </tr>

        <tr>
          <td>NW</td>

          <td>Pas de travail</td>
        </tr>

        <tr>
          <td>PC</td>

          <td>Wagon ramass&eacute;</td>

          <td>Voir ci-dessous</td>
        </tr>

        <tr>
          <td>PL</td>

          <td>Loco ramass&eacute;e</td>

          <td>Voir ci-dessous</td>
        </tr>

        <tr>
          <td>PRNTR</td>

          <td>Nom Imprimante</td>

          <td>Nom</td>
        </tr>

        <tr>
          <td>RC</td>

          <td>Commentaire Itin&eacute;raire</td>

          <td>Commentaire</td>
        </tr>

        <tr>
          <td>RLC</td>

          <td>Commentaire Emplacement Itin&eacute;raire</td>

          <td>Commentaire</td>
        </tr>

        <tr>
          <td>HR</td>

          <td>Retirer Assistances</td>
        </tr>

        <tr>
          <td>RN</td>

          <td>Nom de la Compagnie</td>

          <td>Nom</td>
        </tr>

        <tr>
          <td>SC</td>

          <td>D&eacute;pose wagon</td>

          <td>Voir ci-dessous</td>
        </tr>

        <tr>
          <td>SL</td>

          <td>D&eacute;pose loco</td>

          <td>Voir ci-dessous</td>
        </tr>

        <tr>
          <td>TC</td>

          <td>Commentaire train</td>

          <td>Commentaire</td>
        </tr>

        <tr>
          <td>TD</td>

          <td>Train D&eacute;part</td>

          <td>Nom</td>
        </tr>

        <tr>
          <td>TL</td>

          <td>Longueur train</td>

          <td>Longueur, Vides, Nb de Wagons</td>
        </tr>

        <tr>
          <td>TM</td>

          <td>Description du Manifeste Train</td>

          <td>Description</td>
        </tr>

        <tr>
          <td>TN</td>

          <td>Nom train</td>

          <td>Nom</td>
        </tr>

        <tr>
          <td>TRUN</td>

          <td>Tronquer</td>
        </tr>

        <tr>
          <td>TT</td>

          <td>Train Termine</td>

          <td>Nom</td>
        </tr>

        <tr>
          <td>TW</td>

          <td>Poids train</td>

          <td>Poids</td>
        </tr>

        <tr>
          <td>VT</td>

          <td>valide</td>

          <td>Mois/jour/Ann&eacute;e Heure</td>
        </tr>
      </table>

      <p>Temps utilise le format Heure: Minute</p>

      <p>Les param&egrave;tres de wagon pour ramasser wagon (PC) et
      Livrer wagon (SC) sont: la ligne, le num&eacute;ro, le type,
      la longueur, charge, couleur, nom du lieu, nom de la voie,
      nom de la destination, le nom de la voie de destination, le
      nom du propri&eacute;taire, nom du noyau, commentaire wagon,
      commentaires ramassage, observations livraison, C, F, H,
      RFID. O&ugrave; C = Caboose, F = FRED, et H = dangereux</p>

      <p>Les param&egrave;tres loco pour ramasser Loco (PL) et
      livrer loco (SL) sont: la itin&eacute;raire, num&eacute;ro,
      mod&egrave;le, longueur, type, Puissance, nom du lieu, nom de
      la voie, nom de la destination , nom de la voie de
      destination, le nom du propri&eacute;taire, nom du couplage,
      le commentaire de wagon, RFID.</p>

      <p>Vous pouvez trouver quelques exemples de manifestes
      personnalis&eacute;s &agrave; <a href=
      "https://groups.io/g/jmriusers/files/Operations">https://groups.io/g/jmriusers/files/Operations</a>.</p>

      <p>Vous pouvez &eacute;galement cr&eacute;er des fichiers
      (.Csv) de listes de manoeuvrespersonnalis&eacute;es &agrave;
      l'aide de valeur s&eacute;par&eacute;es par des virgules.
      Vous pouvez trouver les fichiers de listes de manoeuvresdans
      le r&eacute;pertoire des op&eacute;rations dans un
      r&eacute;pertoire appel&eacute; "csvSwitchLists". Les listes
      de manoeuvrescsv utilisent les m&ecirc;mes codes et les
      descriptions que les manifestes CSV, plus le suivant:</p>

      <table>
        <tr>
          <td>Code</td>

          <td>Description</td>

          <td>Param&egrave;tres</td>
        </tr>

        <tr>
          <td>DL</td>

          <td>Nom du lieu de D&eacute;part</td>

          <td>Nom</td>
        </tr>

        <tr>
          <td>ETA</td>

          <td>Heure d'Arriv&eacute;e Attendue</td>

          <td>Temps</td>
        </tr>

        <tr>
          <td>ETE</td>

          <td>Temps de Trajet Estim&eacute;</td>

          <td>Temps</td>
        </tr>

        <tr>
          <td>NCPU</td>

          <td>Pas de Wagons &agrave; Collecter</td>
        </tr>

        <tr>
          <td>NCSO</td>

          <td>Pas de Wagons &agrave; D&eacute;poser</td>
        </tr>

        <tr>
          <td>TA</td>

          <td>Train Arrives</td>

          <td>Direction</td>
        </tr>

        <tr>
          <td>TDC</td>

          <td>Train change Direction, D&eacute;parts</td>

          <td>Direction</td>
        </tr>

        <tr>
          <td>TIR</td>

          <td>Train en itin&eacute;raire</td>
        </tr>

        <tr>
          <td>TDONE</td>

          <td>Train a d&eacute;j&agrave; d&eacute;sservi ce
          Lieu</td>
        </tr>

        <tr>
          <td>VN</td>

          <td>Visite Num&eacute;ro</td>

          <td>Nombre</td>
        </tr>
      </table>

      <p>Il y a deux autres options, "Activer les champs de valeur"
      et "Activer Champs Radio Frequency Iembranchementification
      (RFID)". Vous pouvez utiliser ces champs pour entrer la
      valeur ou le co&ucirc;t de votre mat&eacute;riel roulant et
      la RFID, si vous les utilisez pour le suivi de votre
      mat&eacute;riel roulant. Vous pouvez aussi renommer ces
      champs si vous le souhaitez et les utiliser &agrave; d'autres
      fins.</p><a name="PrintOptions" id="PrintOptions"></a>

      <h2>Options d'impression des Manifestes</h2>Vous pouvez
      modifier la fa&ccedil;on dont le programme imprime le
      manifeste du train et Les listes de manoeuvre par lieu.
      Depuis le menu "Exploitation-&gt; Param&egrave;tres-&gt;
      Outils" s&eacute;lectionnez "Options d'impression" pour
      ouvrir la fen&ecirc;tre d'options d'impression.

      <p><img src="images/PrintOptions.png"></p>

      <h3>Police Imprimante Manifeste</h3>Le programme supporte
      plusieurs types de polices pour l'impression.
      S&eacute;lectionnez la police d&eacute;sir&eacute;e et la
      taille en utilisant les menus d&eacute;roulants. H3&gt;
      Format de message Si vous souhaitez que votre manifeste et
      listes de manoeuvressoit imprim&eacute; dans un format
      tabulaire s&eacute;lectionner la case &agrave; cocher
      tabulaire . Seules les polices &eacute;quidistantes comme
      "Courier New" ou "mono-espace" sont affich&eacute;es dans la
      bo&icirc;te de s&eacute;lection police

      <h3>Couleur du texte pour les livraisons</h3>Vous pouvez
      s&eacute;lectionner la couleur du texte de votre manifeste
      lorsque l'op&eacute;ration est de livrer un wagon ou une
      locomotive. S&eacute;lectionnez la couleur souhait&eacute;e
      dans le menu d&eacute;roulant .

      <h3>Couleur du Texte Ramassage</h3>Vous pouvez
      s&eacute;lectionner la couleur du texte de votre manifeste
      lorsque l'op&eacute;ration est de ramasser une wagon ou
      locomotive. S&eacute;lectionnez la couleur souhait&eacute;e
      dans le menu d&eacute;roulant .

      <h3>Couleur du Texte pour Mouvement Local</h3>Vous pouvez
      s&eacute;lectionner la couleur du texte de votre manifeste
      lorsque l'op&eacute;ration est de d&eacute;placer une wagon
      d'une voie &agrave; une autre au m&ecirc;me endroit. Le wagon
      dans dans ce cas n'est pas ajout&eacute; au train.
      S&eacute;lectionnez la couleur souhait&eacute;e &agrave;
      partir du menu d&eacute;roulant.

      <h3>Format Liste de Manoeuvre &lt;/ h3&gt; Vous pouvez
      utiliser le m&ecirc;me format que votre manifeste pour vos
      listes de manoeuvres, ou vous pouvez personnaliser votre
      liste de manoeuvres &agrave; votre go&ucirc;t.
      D&eacute;cochez la "M&ecirc;me comme Manifeste" si vous
      voulez un format diff&eacute;rent pour vos listes de
      manoeuvre.</h3>Formats de Message Vous pouvez personnaliser
      les manifestes pour les ramassages, les livraisons, et pour
      votre mouvement local et les listes de de man&oelig;uvre en
      s&eacute;lectionnant le menu appropri&eacute; des menus
      d&eacute;roulants. Pour supprimer un attribut
      s&eacute;lectionner vide. Vous pouvez &eacute;galement
      modifier ou remplacer les pr&eacute;fixes "[] livraisons",
      "[] Collectes" et "[] Mouvement". Deux pr&eacute;fixes
      populaires sont "Spot" et "Pull" pour Livraisons et
      ramassages respectivement. Si vous souhaitez utiliser les
      option de couleur du texte, les pr&eacute;fixes de ,
      livraison, collecte et mouvement doivent &ecirc;tre uniques.
      <a name="ManifestComments" id="ManifestComments"></a>

      <h3>Options Manifestes</h3>Le programme vous permet de
      personnaliser votre manifeste de train &agrave; votre
      go&ucirc;t. Il y a huit cases optionnelles et leurs fonctions
      sont d&eacute;crites ci-dessous.

      <p>La case &agrave; cocher "Impression valide" provoque le
      programme pour imprimer le jour et l'heure o&ugrave; le train
      a &eacute;t&eacute; assembl&eacute;, ce qui n'est pas le
      m&ecirc;me que le jour o&ugrave; le manifeste a
      &eacute;t&eacute; imprim&eacute;. Le temps d'impression est
      toujours affich&eacute; en haut &agrave; droite du
      manifeste.</p>

      <p>Chaque itin&eacute;raire de l'emplacement et le train
      peuvent avoir un commentaire facultatif. Vous pouvez imprimer
      ces commentaires sur votre manifeste si les cases
      "Emplacement" et " Itin&eacute;raire" sont
      s&eacute;lectionn&eacute;s respectivement. Si vous voulez que
      le manifeste montre combien de wagons complets et vide sont
      dans le train, cochez la case "Charg&eacute;s et Vides". Vous
      pouvez &eacute;galement utiliser un format d'horloge de 12
      heures plut&ocirc;t que de 24 heures sur vos manifestes et
      les listes de manoeuvres. Le manifeste indique
      g&eacute;n&eacute;ralement l'heure d'arriv&eacute;e
      estim&eacute;e pour le train &agrave; chaque emplacement
      o&ugrave; le train doit &ecirc;tre manoeuvr&eacute;, la
      s&eacute;lection de l'"heure de d&eacute;part" change de case
      &agrave; cocher le format d' affichage de l'heure de
      d&eacute;part. Vous pouvez si vous le souhaitez, imprimer
      votre manifeste sans heures de d&eacute;part et
      d'arriv&eacute;e. Voir <a href=
      "#TrainManifestOptions">Options Manifeste Train</a> pour plus
      de d&eacute;tails .</p>

      <p>La s&eacute;lection de "Afficher Horaires" imprime l'
      <a href="#Timetable">horaire du train</a> que vous utilisez
      lors de l'assemblage de vos trains .</p>

      <p>L'option suivante est "Tronquer" et lorsqu'elle est
      s&eacute;lectionn&eacute; entra&icirc;ne le programme
      &agrave; r&eacute;duire la quantit&eacute; d'information
      imprim&eacute;e lors de la d&eacute;pose ou du ramassager
      d'un wagon &agrave; un endroit qui dispose &eacute;galement
      d'une liste de manoeuvre. L'id&eacute;e ici est que vous avez
      un endroit occup&eacute; par un op&eacute;rateur avec une
      liste de manoeuvres et il ou elle fera ramasser ou
      d&eacute;poser le wagon par le train. Puisque la liste de
      manoeuvres contient toutes les informations
      n&eacute;cessaires en ce qui concerne l'endroit o&ugrave; les
      wagons sont et finalement l&agrave; o&ugrave; ils doivent
      &ecirc;tre, le manifeste du train montre seulement quels
      wagons sont retir&eacute;s et ajout&eacute;s au train.</p>

      <p>Les derni&egrave;res options est "Trier par Voie ". Le
      programme lors de la cr&eacute;ation d'un manifeste de train
      r&eacute;pertorie normalement les wagons dans l'ordre
      o&ugrave; ils doivent &ecirc;tre plac&eacute;s dans le train
      pour le noyau appropri&eacute;. Si vous
      pr&eacute;f&eacute;rez avoir les wagons
      &eacute;num&eacute;r&eacute;s par le nom de la voie,
      s&eacute;lectionnez l'option " Trier par Voie" .</p>

      <h3>Apercu Manifeste</h3>Si vous souhaitez utiliser un
      &eacute;diteur de texte pour pr&eacute;visualiser vos
      manifestes et les listes de manoeuvres, s&eacute;lectionnez
      cette option. Cette option vous permet &eacute;galement
      d'effectuer des modifications manuelles sur vos manifestes
      avant de les imprimer.

      <h3>Ajouter le Logo</h3>Si vous voulez un logo dans le coin
      sup&eacute;rieur droit de votre manifeste et listes de
      man&oelig;uvre, appuyez sur le bouton "Ajouter Logo" et
      s&eacute;lectionnez un fichier avec l'image que vous
      souhaitez afficher. Vous pouvez &eacute;galement avoir un
      logo diff&eacute;rent pour chaque train dans votre liste,
      voir <a href="#TrainOptions">Options Train</a> pour plus de
      d&eacute;tails. <a name="MisplacedCarsComment" id=
      "MisplacedCarsComment"></a>

      <h3>Commentaire Wagons Mal Plac&eacute;s</h3>Le programme
      fournit un commentaire pour vos op&eacute;rateurs pour
      rechercher <a href="#CarsSet">les wagons
      &eacute;gar&eacute;s</a> . Vous pouvez modifier le
      commentaire &agrave; votre go&ucirc;t. <a name=
      "HazardousComment" id="HazardousComment"></a>

      <h3>Commentaire Dangereux</h3>Le programme va ajouter le
      "Commentaire Dangereux" pour les manifestes et les listes de
      manoeuvres quand un wagon a la case <a href=
      "#CabooseFredHazardous">dangereux</a>
      s&eacute;lectionn&eacute;e dans la fen&ecirc;tre "Edition
      Wagon" et le format de message "Dangereux" est
      s&eacute;lectionn&eacute; dans les options d'impression pour
      vos manifestes et listes de manoeuvres. Vous pouvez modifier
      le commentaire, si d&eacute;sir&eacute;, et appuyez sur
      "Enregistrer" pour garder la changement. <a name=
      "BuildReportDetails" id="BuildReportDetails"></a>

      <h3>asssembler Rapport D&eacute;taill&eacute;s</h3>Dans le
      menu "Exploitation-&gt; Param&egrave;tres-&gt; Outils",
      s&eacute;lectionnez "asssembler des Options de Rapport" pour
      ouvrir la fen&ecirc;tre des options du rapport d'assemblage.
      Vous pouvez ajuster la quantit&eacute; d'informations que le
      rapport d'assemblage montrera. S&eacute;lectionnez l'un des
      quatre niveaux en utilisant les boutons radio. Le programme
      lors de la g&eacute;n&eacute;ration des rapports enregistre
      des informations "Tr&egrave;s d&eacute;taill&eacute;es" sur
      le disque. Les boutons radio contr&ocirc;lent la
      quantit&eacute; de ces donn&eacute;es qui sont
      r&eacute;ellement imprim&eacute;es. Le bouton radio "Minimal"
      donne le moins d''information et le "Tr&egrave;s
      D&eacute;taill&eacute;" fournit le plus. Si vous &ecirc;tes
      seulement int&eacute;ress&eacute;s de savoir pourquoi un
      train ne sera pas assembl&eacute;, le r&eacute;glage
      "Minimal" peut vous offrir cette information. Le
      r&eacute;glage "Normal", qui montre les locomotives et les
      wagons qui sont exclus du train, et les locomotives et les
      wagons qui sont collect&eacute;s et livr&eacute;s. Le
      "D&eacute;tail" va en g&eacute;n&eacute;rer quelques pages en
      fonction de la taille de votre Compagnie. Il va montrer tous
      les wagons et les locomotives disponibles, et un peu la
      fa&ccedil;on dont le programme trouve les destinations pour
      les wagons et locomotives. Le bouton "Tr&egrave;s
      d&eacute;taill&eacute;" produit le plus de pages, et montrera
      pourquoi les wagons ne sont pas collect&eacute;s ou
      d&eacute;pos&eacute;s. Soyez s&ucirc;r et appuyez sur
      "Enregistrer" apr&egrave;s avoir chang&eacute; la
      s&eacute;lection du rapport d'assemblage.

      <p>Vous avez &eacute;galement la possibilit&eacute;
      d'utiliser un &eacute;diteur de texte pour afficher votre
      rapport d'assemblage. Un &eacute;diteur de texte peut rendre
      le d&eacute;pannage d'un probl&egrave;me beaucoup plus facile
      pour vous. Par exemple, disons que vous avez un wagone qui ne
      bouge pas. Utilisation de l'&eacute;diteur de trouver
      fonctionnalit&eacute;, vous pouvez consulter la rapport de
      build en utilisant le num&eacute;ro de la itin&eacute;raire
      de la wagon et de trouver rapidement pourquoi la wagon n'est
      pas capt&eacute; par le train. Un des trucs lorsque vous
      utilisez un &eacute;diteur de texte est d'augmenter le nombre
      de caract&egrave;res par ligne, en r&eacute;duisant la taille
      de la police sp&eacute;cifi&eacute;e dans la fen&ecirc;tre
      Options de rapport de build.</p>

      <p>Pour la plupart des utilisateurs, le r&eacute;glage
      "Tr&egrave;s D&eacute;taill&eacute;"est le plus
      appropri&eacute; lors de la lecture du rapport d'assemblage
      d'un train. Pour plus d'informations sur le contenu du
      rapport d'assemblage s'il vous pla&icirc;t voir <a href=
      "#TroubleShootingBuildingTrains">Comment R&eacute;soudre
      Probl&egrave;mes Assemblages Trains</a> . <a name="Locations"
      id="Locations"></a></p>

      <h2>Emplacements</h2>Les emplacements sont des endroits sur
      votre r&eacute;seau que les trains visitent pour ramasser ou
      d&eacute;poser les wagons et locomotives. Les emplacements
      peuvent &ecirc;tre des cit&eacute;s, villes, ou tout
      simplement des endroits o&ugrave; les trains ont besoin de
      manoeuvrer les wagons. S&eacute;lectionnez "Outils-&gt;
      Exploitation &gt; Emplacements" pour ajouter ou modifier les
      emplacements sur votre r&eacute;seau.

      <p><img src="images/Locations.png"></p>

      <p>La fen&ecirc;tre "Lieux" affiche tous les endroits
      o&ugrave; vos trains peuvent manoeuvrer. Pour chaque
      emplacement la fen&ecirc;tre affiche la longueur totale de
      toutes les voies &agrave; cet endroit, la valeur de la voie
      utilis&eacute;e par votre mat&eacute;riel roulant, la
      quantit&eacute; de mat&eacute;riel roulant, et le nombre de
      ramassages et d&eacute;poses de votre mat&eacute;riel roulant
      qui est pr&eacute;vu pourcet emplacement. Le bouton "chef de
      triage" produit une fen&ecirc;tre <a href=
      "#SwitchList">(Liste de manoeuvre)</a> qui vous permet de
      voir les ramassagess pr&eacute;vue et d&eacute;poses par
      train. Seuls les trains qui ont des manoeuvres &agrave;
      l'emplacement sont disponibles.</p>

      <p><img src="images/EditLocation.png"></p>

      <p>Dans la fen&ecirc;tre "Ajouter un emplacement", entrez le
      nom de l'emplacement dans la case en face du "Nom". Le nom de
      l'emplacement doit &ecirc;tre unique, le programme ne
      permettra pas deux endroits avec des noms
      iembranchementiques. Toutefois, si vous voulez plus d'un
      endroit &agrave; avoir le m&ecirc;me nom pour votre manifeste
      et listes de man&oelig;uvres, ajouter un tiret et un
      num&eacute;ro au nom de lieux. Pour Par exemple, "Boston-1"
      et "Boston-2" sera imprim&eacute; comme "Boston". Le
      programme va supprimer le trait d'union et le num&eacute;ro
      lors de l'impression du manifeste et de la liste de
      man&oelig;uvres .</p>

      <p>Appuyez maintenant sur le bouton "Ajouter Emplacement" au
      le bas de la fen&ecirc;tre. Les diff&eacute;rents champs qui
      &eacute;taient d&eacute;sactiv&eacute;s doivent apparaitre
      maintenant.</p>Chaque emplacement peut avoir plusieurs voies
      <a href="#Yards">de triages</a> , <a href=
      "#Sidings">d'embranchements</a> , <a href="#Interchange">de
      classements/&eacute;changes</a> <a href="#Staging">de
      coulisse</a> . Les Triages sont l&agrave; o&ugrave; les
      wagons et les locomotives sont plac&eacute;s pour le stockage
      temporaire. Un embranchement peut &ecirc;tre une voie
      industriel ou tout endroit o&ugrave; un wagon est
      charg&eacute; ou d&eacute;charg&eacute;. Une voie de
      classification/d'&eacute;change est utilis&eacute; pour
      &eacute;changer des wagons entre les trains, ou pour
      cr&eacute;er une gare de triage qui est utilis&eacute; pour
      assembler des trains. Les Voies en Coulisse
      repr&eacute;sentent des endroits &eacute;loign&eacute;s
      o&ugrave; les trains peuvent voyager &agrave; travers pour
      &ecirc;tre utilis&eacute; sur le r&eacute;seau.

      <p>Pour qu'un train puisse desservir un lieu, il doit y avoir
      au moins une voie &agrave; cet endroit. Voir ci-dessous
      comment ajouter des voie &agrave; votre emplacement.</p>

      <p>Les tableaux montrent la longueur des voies, la longueur
      de la voie qui est occup&eacute;e (utilis&eacute;e) par les
      wagons et les locomotives, la longueur de voie
      r&eacute;serv&eacute;e, le nombre total de wagons et de
      locomotives (mat&eacute;riel roulant) &agrave; chaque
      emplacement, le nombre de wagons et de locomotives qui seront
      collect&eacute;s par les trains, et le nombre de wagons et
      locomotives qui seront livr&eacute;s par les trains.Lorsque
      le programme assemble un train, la valeur
      r&eacute;serv&eacute;e indique la longueur de voie qui va
      &ecirc;tre consomm&eacute;e par d&eacute;pose. En mode
      agressif, la valeur r&eacute;serv&eacute;e indique
      &eacute;galement la longueur de la voie qui va &ecirc;tre
      lib&eacute;r&eacute; par les collectes. Par
      cons&eacute;quent, une valeur positive signifie que de la
      longueur de la voie va &ecirc;tre consomm&eacute;e par les
      d&eacute;poses, et un nombre n&eacute;gatif signifie que de
      la longueur de la voie va &ecirc;tre lib&eacute;r&eacute;e
      par les collectes.</p>

      <h3>Direction Desservie par ce Lieu</h3>Vous pouvez
      d&eacute;cider quelle direction sera desservie par le train
      desservant cet emplacement. Par exemple, si seul les trains
      &agrave; destination de l'est peuvent acc&eacute;der &agrave;
      l'emplacement, s&eacute;lectionner "Est" et d&eacute;cochez
      les autres directions. Cela peut &ecirc;tre utile si vous
      voulez que ce point soit un lieu de convergence pour un lieu
      donn&eacute;. Si un emplacement peut soutenir de multiples
      directions, s&eacute;lectionner alors celles qui sont
      appropri&eacute;es

      <h3>Emplacement et materiel roulant</h3>Vous pouvez
      contr&ocirc;ler le mat&eacute;riel roulant qu'un emplacement
      peut desservir. Poussez les boutons "Tout Effacer" pour
      d&eacute;s&eacute;lectionner tous les types, ou
      "S&eacute;lectionner tout" pour s&eacute;lectionner tous les
      types, puis cochez ou d&eacute;cochez le mat&eacute;riel
      roulant que vous souhaitez que l'emplacement desserve.
      Apr&egrave;s la configuration des voies pour un emplacement,
      vous pouvez utiliser la "S&eacute;lection automatique" pour
      avoir l'emplacement refl&egrave;tant le mat&eacute;riel
      roulant desservi par les voies diverses.

      <h3>Lieu Commentaire</h3>Vous pouvez entrer un commentaire
      facultatif pour votre emplacement. Si vous voulez que le
      commentaire soit imprim&eacute; sur vos manifestes vous devez
      s&eacute;lectionner l'option d'impression <a href=
      "#ManifestComments">commentaires emplacement</a> <a name=
      "Yards" id="Yards"></a>

      <h3>Triages</h3>Une triage est utilis&eacute;e pour stocker
      des wagons et des locomotives. L'&eacute;tat de charge d'un
      wagon ne change pas lorsqu'il est livr&eacute; &agrave; une
      voie de triage. Pour ajouter une triage, s&eacute;lectionnez
      le bouton radio "Triages" puis appuyez sur le bouton "Ajouter
      voie de triage".

      <p><img src="images/AddYard.png"></p>Maintenant, entrez le
      nom du triage avec la longueur de la voie en pieds ou dans
      l'&eacute;chelle r&eacute;elle en pouces. Ajouter un
      guillemet (") &agrave; la longueur lors de la saisie
      r&eacute;elle en pouces et le programme permet de convertir
      la longueur en pieds &agrave; l'&eacute;chelle. Ajouter cm si
      vous voulez convertir des centim&egrave;tres en
      m&egrave;tres. Appuyez sur le bouton "Ajouter Voie de triage
      " au bas de la fen&ecirc;tre et les champs
      d&eacute;sactiv&eacute; devraient maintenant
      appara&icirc;tre.

      <h3>Mat&eacute;riel Roulant Desservi</h3>Vous pouvez
      contr&ocirc;ler ce type de mat&eacute;riel roulant que le
      triage peut desservir. Remarquez que le mat&eacute;riel
      roulant du triage est limit&eacute; &agrave; celui que
      l'emplacement peut desservir. Si le mat&eacute;riel roulant
      que vous souhaitez n'appara&icirc;t pas pour un triage,
      v&eacute;rifiez que les types de mat&eacute;riel roulant pour
      l'emplacement soient correctement s&eacute;lectionn&eacute;s.
      Si le type de mat&eacute;riel roulant que vous voulez
      n'existe pas pour un emplacement, vous devrez cr&eacute;er le
      type en utilisant la fen&ecirc;tre "Wagons", voir <a href=
      "#Cars">wagons</a> ci-dessous. gare de triage

      <h3>Noms de Ligne Desservies</h3>Vous pouvez &eacute;galement
      restreindre les lignes qu'une cour peut desservir.
      S&eacute;lectionnez "Accepter Seul "si vous voulez asssembler
      une liste de noms de lignes que le triage accepte.
      S&eacute;lectionnez "Exclure" si vous voulez asssembler une
      liste de noms de ligne que vous voulez exclure du triage.

      <h3>Chargement desservi</h3>Vous pouvez &eacute;galement
      restreindre les wagons charg&eacute;s qu'un triage peut
      accepter. S&eacute;lectionnez "Accepter Seul" si vous voulez
      asssembler une liste de noms de chargement de wagon que le
      chantier accepte. S&eacute;lectionnez "Exclure" si vous
      voulez asssembler une liste de noms de chargement de wagon
      que vous voulez exclure du triage.

      <h3>Ordre de Ramassage de Wagons</h3>Il y atrois options pour
      collecter les wagons du triage. "Normal" utilise le compteur
      de mouvement des wagons pour d&eacute;terminer l'ordre dans
      lequel les wagons sont retir&eacute;s du triage, "FIFO"
      (Premier Entr&eacute;, Premier Sorti), et "LIFO" (Dernier
      Entr&eacute;, Premier Sorti). LIFO est utile si vous avez un
      simple triage ferm&eacute; que vous utilisez pour les wagons
      de service. Pour par exemple le stockage de wagons de charbon
      vides, il serait plus judicieux de tirer un wagon &agrave;
      charbon vide de l'avant de la ligne au lieu du milieu du
      Triage.

      <h3>Commentaire</h3>Vous pouvez entrer un commentaire
      facultatif pour le triage.

      <h3>Enregistrer Voie de Triage</h3>Appuyez sur la
      "Enregistrer Voie de Triage " pour enregistrer votre travail.
      Le programme va cr&eacute;er un fichier
      (OperationsLocationRoster.xml) dans votre r&eacute;pertoire
      JMRI dans un dossier appel&eacute; "operations". Le programme
      permettra &eacute;galement de cr&eacute;er un fichier de
      sauvegarde contenant les derniers r&eacute;glages pour
      l'ensemble de vos emplacements.

      <a name="Sidings" id="Sidings"></a>
      <h3>Embranchements</h3>Un Embranchement est utilis&eacute; au
      service d'une industrie. Pour ajouter un embranchement,
      appuyez sur le bouton Ajouter " Embranchement". Les
      branchements sont tr&egrave;s similaires aux <a href=
      "#Yards">Triages</a> , donc voir ci-dessus pour plus
      d'informations. Vous pouvez si vous le souhaitez planifier
      l'ordre dans lequelles les wagons seront livr&eacute;es
      &agrave; un embranchementn, ou demander des wagons avec
      certaines charges. Voir les <a href="#Schedules">Horaires</a>
      ci-dessous pour plus d'informations.

      <p>Quand une wagon est plac&eacute; &agrave; un embranchement
      l'&eacute;tat de charge du wagon est modifi&eacute;. Le
      programme fournit deux noms de charge pour toutes les wagons,
      le vide par d&eacute;faut ou "E", et le chargement par
      d&eacute;faut ou "L". Si une wagon a un de ces charges quand
      il arrive &agrave; un embranchement, le nom de charge va
      changer &agrave; l'autre, c'est &agrave; dire "E" devient "L"
      et "L" devient "E".</p>

      <a name="Schedules" id="Schedules"></a>
      <h3>Horaires</h3>Si vous souhaitez voir les wagons
      livr&eacute;s dans un ordre particulier, ou avec une charge
      sp&eacute;cifique pour la livraison ou l'exp&eacute;dition,
      le programme vous permet d' appliquer un Horaire &agrave; un
      embranchement. Ceci est une fonctionnalit&eacute; optionnelle
      et ne doit pas &ecirc;tre utilis&eacute; tant que vous
      n'&ecirc;tes pas devenu tr&egrave;s familier avec la
      fa&ccedil;on dont le programme g&eacute;n&egrave;re les
      manifestes et les listes de man&oelig;uvres. Un Horaire
      permet un contr&ocirc;le tr&egrave;s fin sur l'ordre dans
      lequel les types wagons seront livr&eacute;s &agrave; un
      embranchement. Vous pouvez &eacute;galement sp&eacute;cifier
      le nom de ligne pour le type de wagon livr&eacute;. Par
      exemple, si vous vouliez deux wagons SP pour &ecirc;tre
      livr&eacute;s suivie d'un wagon-citerne charg&eacute; de
      "p&eacute;trole", vous pouvez cr&eacute;er un Horaire qui va
      faire exactement cela. Pour cr&eacute;er un Horaire presser
      le bouton "Editer" &agrave; c&ocirc;t&eacute; de "l'Horaire
      optionnel" tirer vers le bas le menu sur la fen&ecirc;tre
      "Modifier Voie Embranchement". En appuyant sur la bouton
      "Editer" devrait cr&eacute;er la fen&ecirc;tre "Ajouter
      Horaire" .

      <p><img src="images/EditSchedule.png"></p>

      <p>Entrez un nom pour votre Horaire et appuyez sur le bouton
      "Ajouter Horaire" sur le bas de la fen&ecirc;tre.Des
      embranchements multiples peuvent utiliser le m&ecirc;me
      Horaire aussi longtemps que les embranchements utilisent les
      m&ecirc;me types de wagon et les m&ecirc;mes lignes.
      Maintenant ajouter votre premi&egrave;re livraison pour cet
      embranchement en choisissant un type de wagon dans la
      bo&icirc;te de menu dans le coin inf&eacute;rieur gauche de
      la fen&ecirc;tre et en appuyant sur le bouton "Ajouter un
      type de wagon". Un nouveau point devrait figurer dans votre
      Horaire contenant le type de wagon, un menu d&eacute;roulant
      pour les noms de ligne, et une num&eacute;rotation &agrave;
      partir de 1. Vous pouvez si vous le souhaitez
      sp&eacute;cifier une ligne particuli&egrave;re pour le type
      de wagon que vous avez entr&eacute;, ou laisser vide si vous
      ne vous souciez pas du nom de la ligne. Vous pouvez
      &eacute;galement sp&eacute;cifier la charge des wagon
      re&ccedil;ues et exp&eacute;di&eacute;es. Vous pouvez
      &eacute;galement contr&ocirc;ler si le wagon sera
      livr&eacute; au cours de la session. Choisissez parmi les
      "Horaires" du menu d&eacute;roulant les horaires des trains
      que vous voulez. Lorsqu'un horaire de train est
      s&eacute;lectionn&eacute;, un wagon ne sera livr&eacute; que
      lorsque l'horaire du trains est actif. Voir Trains-&gt;
      Outils-&gt; <a href="#Timetable">Horaire</a> pour
      s&eacute;lectionner les horaires des trains pour votre
      session.</p>

      <p>Si vous vouliez plus d'un type de wagon &agrave; livrer
      cons&eacute;cutivement, augmenter le compteur du nombre que
      vous souhaitez. Le nombre maximal est de 10 et le minimum est
      1. Dans le tableau ci-dessus, le programme sollicite deux
      Boxcars SP dans une rang&eacute;e, puis une wagon TankOil
      avec une charge de "L (Huile)". Apr&egrave;s que le wagon est
      livr&eacute;e TankOil le horaire commence d&egrave;s le
      d&eacute;but, demandant &agrave; nouveau deux Boxcars SP
      suivis par une wagon TankOil. Le champ d'attente vous permet
      de d&eacute;terminer combien de trains vont visiter l'endroit
      avant de prendre le wagon. Utile si vous voulez qu'un wagon
      reste immobile pendant plusieurs sessions d'exploitation.</p>

      <p>R&eacute;p&eacute;tez en s&eacute;lectionnant le type de
      wagon et en appuyez "Ajouter un type de wagon" jusqu'&agrave;
      ce que vous ayez l'Horaire de livraison que vous voulez.
      Appuyez sur "Enregistrer Horaire "et fermez la fen&ecirc;tre
      de programmation lorsque vous avez termin&eacute;. Notez que
      seuls les types de wagon et les lignes qui sont
      accept&eacute;es par cet embranchement sont disponibles. Si
      un type de wagon ou de ligne n'est pas disponible,
      v&eacute;rifiez le type de wagon et les lignes pour cet
      embranchement et l'emplacement.</p>

      <p>L'horaire contr&ocirc;le quand et quels wagons seront
      livr&eacute;s et dans quel ordre. Il rend l'embranchement
      plus restrictif, seuls les wagons exig&eacute;s par l'Horaire
      seront remis &agrave; l'embranchement. En regardant l'Horaire
      vous verrez un pointeur dans la table sous la rubrique
      "Actuel", le pointeur montre le prochain Type de wagon que le
      programme veut remettre &agrave; l'embranchement. Lorsque le
      programme trouve ce wagon et la destination du wagon &agrave;
      cet embranchement, le pointeur se d&eacute;place &agrave;
      l'&eacute;l&eacute;ment suivant dans l'Horaire. Apr&egrave;s
      avoir desservi le dernier &eacute;l&eacute;ment dans
      l'Horaire, le pointeur sera de retour au premier
      &eacute;l&eacute;ment dans l'Horaire.</p>

      <p>Si vous voulez personnalis&eacute;e les <a href=
      "#CarLoad">Charges</a> pour vos wagons, vous pouvez les
      cr&eacute;er en utilisant <a href="#EditCarLoads">Modifier
      Attributs wagon</a> pour la "Charge" du wagon. Chaque
      nouvelle charge est associ&eacute;e &agrave; un type de wagon
      . Par exemple vous pouvez avoir "Vis" pour un wagon, et
      "p&eacute;trole" pour un wagon-citerne. Le programme
      d&eacute;livrera des wagons avec une charge
      personnalis&eacute; &agrave; un embranchement qui a un
      Horaire qui demande &eacute;galement cette charge
      particuli&egrave;re. Toutefois, les wagons avec une charge
      personnalis&eacute;e peuvent toujours &ecirc;tre
      plac&eacute;s dans les triages, les coulisses, et les
      &Eacute;changes.</p>

      <p>Vous pouvez si vous le souhaitez, sp&eacute;cifiez la
      destination finale d'un wagon une fois qu'il a
      &eacute;t&eacute; utilis&eacute; par l'embranchement. Seuls
      les voies de destination qui peuvent accepter ce type de
      wagon sont repr&eacute;sent&eacute;es dans le menu
      d&eacute;roulant des voies.La destination charg&eacute; par
      un horaire est montr&eacute;e comme <a href=
      "#CarsSet">Destination Finale du wagon</a> dans les
      diff&eacute;rentes fen&ecirc;tres du wagon.</p>

      <p>Vous pouvez &eacute;ventuellement utiliser vos <a href=
      "#StagingAndCarLoads">voies de coulisse</a> pour des wagons
      vides avec une charge personnalis&eacute;e, et vous pouvez
      aussi optionnellement avoir le programmes qui place des
      charges personnalis&eacute;es dans les wagons en utilisant
      des voies de coulisse. Si vous voulez sp&eacute;cifier la
      coulisse en tant que destination du wagon, ne pas choisir une
      voie, laisser le programme d&eacute;terminer quelle est la
      voie appropri&eacute;e de la coulisse &agrave; utiliser.
      Sinon, si vous s&eacute;lectionnez une voie, cette voie
      deviendra indisponible pour les autres wagons. Pour
      &eacute;viter de surcharger un embranchement avec des wagons
      avec des charges personnalis&eacute;es en coulisse, le
      programme va normalement limiter le nombre de wagons sur
      l'itin&eacute;raire vers une voie avec un Horaire pour la
      place disponible sur les voie. Alors si vous avez de l'espace
      pour trois wagons, la plupart du programme
      g&eacute;n&egrave;rera normalement pour vous depuis la
      coulisse trois wagons. Cependant, si vous avez besoin pour
      d'ajuster le nombre de wagons en itin&eacute;raire vers un
      embranchement avec un Horaire, s&eacute;lectionnez dans la
      fen&ecirc;tre Modifier la planification "Outils-&gt;
      Options". Une nouvelle fen&ecirc;tre devrait apparaitre, et
      ajuster le pourcentage "de charges personnalis&eacute;es
      g&eacute;n&eacute;r&eacute;es par la coulisse ". La valeur
      par d&eacute;faut est 100% ce qui signifie que
      g&eacute;n&eacute;rer suffisamment de wagons pour remplir
      &agrave; 100% l'espace de voie disponible. Si vous voulez
      seulement la moiti&eacute; de vos charges de wagon pour venir
      dans la coulisse, d&eacute;finissez la valeur &agrave; 50%,
      et si vous ne voulez pas g&eacute;n&eacute;rer en coulisse un
      wagon de charge personnalis&eacute; pour l'embranchement,
      d&eacute;finir la valeur &agrave; 0%. Parfois, il est
      appropri&eacute; de surcharger un embranchement avec des
      wagons, si vous voulez cela, augmentez la valeur
      jusqu'&agrave; 1000%. BTW 1000% signifie envoyer 10 fois
      l'espace disponible en wagons pour cet embranchement. Si vous
      entrer cette valeur, vous avez je l'esp&egrave;re 10 fois
      l'&eacute;quivalent de la longueur de l'embranchement
      disponible dans un triage de stockage &agrave;
      proximit&eacute;!</p>P&gt; L'autre option dans le menu outils
      d'&eacute;dition horaire est la possibilit&eacute; de
      sp&eacute;cifier une autre voie. Le programme quand il trouve
      un embranchement plein enverra de nouveaux wagon sur la voie
      que vous sp&eacute;cifiez dans le menu d&eacute;roulant de la
      voie alternative. Si vous ne sp&eacute;cifiez pas une
      alternative, le programme va essayer de trouver un triage
      &agrave; cet endroit. La fonction de voie alternative peut
      &ecirc;tre utilis&eacute;e pour cr&eacute;er une voie "spot
      Off" pour vos wagon. Pour emp&ecirc;cher le programme de
      mettre le wagon sur la voie spot off qui ne sont pas
      destin&eacute;s &agrave; votre secteur, utilisez la
      fen&ecirc;tre "S&eacute;lectionner des charges desservies par
      voie" pour n'accepter que des wagon avec des charges que
      votre embranchement industriel demande.

      <p>Sp&eacute;cifier une autre voie pour un horaire modifie
      &eacute;galement le comportement des wagons avec des charges
      personnalis&eacute;es, mais sans destination finale. Lorsque
      le programme trouve un wagon avec une charge
      personnalis&eacute;e, il va rechercher tous les embranchement
      pour un horaire qui exige ce type de wagon et la charge, et
      si trouv&eacute; itin&eacute;rairera le wagon l&agrave;-bas.
      Toutefois, si la voie &eacute;tait pleine, le programme
      continuera de rechercher une voie/horaire qui peut accepter
      le wagon. Si toutes les voies sont pleines et aucune voie ne
      soit sp&eacute;cifi&eacute;e pour toutes es voie/horaires, le
      programme va tenter de d&eacute;placer le wagon &agrave; un
      autre endroit. Si il y a une voie de remplacement
      sp&eacute;cifi&eacute;e, le programme ne fera que
      d&eacute;placer le wagon lorsque l'un des embranchements peut
      accepter un nouveau wagon, c'est &agrave; dire la voie n'est
      plus compl&egrave;te.</p>

      <p>Une autre caract&eacute;ristique d'utilisation d'une autre
      voie pour les wagons avec des charges personnalis&eacute;es,
      mais sans destination finale, c'est que le programme va
      essayer de transmettre un certain nombre de wagons &agrave;
      l'embranchement exigeant ce type de wagon et de charge. Le
      programme se r&eacute;f&egrave;re &agrave; ces wagons comme "
      entrant " dans l'embranchement/industrie. Un wagon en
      "entrant " a &eacute;t&eacute; transport&eacute; par les
      trains qui ne desservent pas directement
      l'embranchement/industrie. Le nombre maximal de
      v&eacute;hicules entrants vers un embranchement avec une voie
      de remplacement est d&eacute;termin&eacute; par la longueur
      de l'embranchement et de la voie de remplacement. Donc, si
      l'embranchement pouvait contenir 6 wagons, et la nouvelle
      voie 5, le programme permettrait &agrave; un maximum de 11
      wagons d'&ecirc;tre en itin&eacute;raire vers
      l'embranchement.</p>

      <p>Les Horaires peuvent fonctionnerdans un des deux modes,
      s&eacute;quentiel comme d&eacute;crit ci-dessus, ou en mode
      correspondance. Le mode correspondance &eacute;limine les
      aspects s&eacute;quentiels d'un Horaire. En mode
      correspondance, le programme va rechercher dans l'ensemble de
      l'Horaire pour trouver un type de wagon et de charge qui
      corresponde &agrave; un wagon que le programme tente de
      placer. En mode correspondance le pointeur indique le dernier
      wagon que le programme a trouv&eacute; acceptable pour
      l'embranchement. Pour modifier le planning pour le mode
      correspondance, choisissez "Correspondre" dans la
      fen&ecirc;tre Modifier la planification et appuyez sur
      "Enregistrer". Le Mode Correspondance est utile lorsque
      l'ordre des wagons qui arrivent n'est pas important, mais
      vous voulez continuer &agrave; exp&eacute;dier des wagons
      avec une charge sp&eacute;cifique, fournir la destination
      finale du v&eacute;hicule, ou avoir le wagon attendre pour un
      nombre pr&eacute;cis de trains &agrave; l'embranchement. En
      mode correspondance l'&eacute;l&eacute;ment compteur de
      l'Horaire est ignor&eacute; car il n'est pas utilis&eacute;.
      Tous les autres champs sont disponibles, et vous pouvez avoir
      le m&ecirc;me type de wagons plusieurs fois, avec chaque
      &eacute;l&eacute;ment dans l'Horaire &agrave; la recherche
      d'une charge particuli&egrave;re re&ccedil;ue.
      &Eacute;galement en mode correspondance, le bo&icirc;te de
      s&eacute;lection de type de wagon avance automatiquement au
      prochain type de wagon lors de l'ajout d'un type de wagon.
      Ceci rend facile l'ajout rapide de type de wagon dans la
      table.</p>

      <p>Vous pouvez &eacute;galement acc&eacute;der &agrave; vos
      Horaires depuis le menu Emplacements Outils. La table
      Horaires fournit l'&eacute;tat pour chaque Horaire. Puis vous
      pouvez attribuer un Horaire &agrave; de multiples
      embranchements, la table fournit &eacute;galement
      l'&eacute;tat suppl&eacute;mentaire pour chacun des
      embranchements qui utilisent cet Horaire particuli&egrave;r.
      La table vous permet &eacute;galement de modifier l'Horaire
      une fois qu'il a &eacute;t&eacute; attribu&eacute;e &agrave;
      un embranchement.</p><a name="SchedulesAndLoads" id=
      "SchedulesAndLoads"></a>

      <h3>Horaires et charges</h3>Vous avez entr&eacute; tous vos
      wagons, voies et trains et avez jouer avec le programme
      pendant un certain temps. Vous &ecirc;tes heureux avec
      l&agrave; o&ugrave; les wagons finissent, mais en regardant
      les mouvements de wagon g&eacute;n&eacute;r&eacute;s par le
      programme au cours de plusieurs s&eacute;ances vous avez
      penser que ce serait bien si les mouvements du wagon avaient
      une "fin". Qu'est-ce que vous aimeriez voir une s&eacute;rie
      de wagons se d&eacute;placer qui imitent le chemin de fer
      prototype que vous mod&eacute;lisez, ou peut-&ecirc;tre vous
      voulez juste que les wagons se d&eacute;placent dans un
      certain ordre. Horaires et charges personnalis&eacute;es de
      wagon sont les astuces pour obtenir du programme ce que vous
      voulez.

      <p>Le programme offre tous les wagons avec deux charges, un
      "L" et "E". On les appelle les charg&eacute;s et vides par
      d&eacute;faut respectivement. Vous ne pouvez pas les
      supprimer, mais vous pouvez les renommer si vous le
      souhaitez. Pour chaque type de wagon, vous pouvez
      cr&eacute;er des charges suppl&eacute;mentaires. Par exemple,
      disons que vous avez une industrie qui a besoin de papier
      charg&eacute; dans des wagons couverts. Vous pouvez
      cr&eacute;er cette <a href="#EditCarLoads">Charge</a> pour
      vos wagons et nommez-L (papier). Or, pour l'embranchement qui
      sert votre industrie du papier, vous devez cr&eacute;er un
      Horaire. Dans cet Horaire, le premier &eacute;l&eacute;ment
      que vous entrez est un wagon couvert, et puis
      s&eacute;lectionnez la charge &agrave; recevoir, L (papier).
      Si le train qui dessert cette industrie est au d&eacute;part
      de la coulisse, vous avez pratiquementt termin&eacute;. Le
      programme quand on assemble un train <a href=
      "#StagingAndCarLoads">en coulisse</a> , va chercher un wagon
      vide, et s'il est trouv&eacute;, permettra de cr&eacute;er la
      charge L (papier) pour vous. Une fois que la charge du wagon
      est cr&eacute;&eacute;e pour cette industrie, le programme
      mettra le wagon &agrave; destination de cette industrie.
      Lorsque le wagon est livr&eacute;, le programme va retirer la
      charge papier, et l'&eacute;tat de charge du wagon va devenir
      vide ou "E".</p>

      <p>C'&eacute;tait facile, nous allons donc faire des choses
      plus int&eacute;ressantes et avons une industrie
      d'exp&eacute;ditions de certains mat&eacute;riaux
      imprim&eacute;s. Nous allons cr&eacute;er et appeler cette
      charge L (impression). Or, dans le premier
      &eacute;l&eacute;ment de l'Horaire, au lieu de laisser le
      menu sous la rubrique "Exp&eacute;dition" vierge,
      s&eacute;lectionnez L (impression). Suivant dans le menu
      d'exp&eacute;dition il y a la destination et les menus voie.
      Nous pourrions choisir une destination qui est une coulisse.
      Pas besoin de s&eacute;lectionner la voie, juste
      l'emplacement de transit. Maintenant quand un train retourne
      pour collecter le wagon, sa charge sera L (impression) et
      quand le wagon arrive &agrave; la coulisse, la charge sera
      supprim&eacute;e et l'&eacute;tat de charge du wagon sera de
      retour &agrave; "E" vide.</p>

      <p>Nous aurions pu au lieu d'envoyer le wagon avec impression
      &agrave; la coulisse,l'envoyer &agrave; un embranchement . Il
      suffit de s&eacute;lectionner la destination et
      l'embranchement o&ugrave; vous voulez que le wagon aille.
      M&ecirc;me si cela prend plusieurs trains pour sortir le
      wagon de l&agrave;, le programme saura d&eacute;terminer le
      meilleur itin&eacute;raire. Maintenant, si vous cr&eacute;ez
      un autre Horaire &agrave; cet embranchement, vous pouvez
      rediriger le wagon &agrave; nouveau. En enfilant une
      s&eacute;rie d'Horaires et de charges, ensemble, vous pouvez
      cr&eacute;er la s&eacute;quence de wagons que vous
      voulez.</p>

      <p>Une autre fa&ccedil;on int&eacute;ressante de
      d&eacute;placer les wagons est d'exp&eacute;dier une charge
      personnalis&eacute;e, mais de ne pas sp&eacute;cifier de
      destination. Le programme quand il trouve un wagon avec une
      charge personnalis&eacute;e, mais aucune destination, va
      v&eacute;rifier toutes les embranchements pour voir si un
      Horaire demande ce type de wagon avec cette charge
      personnalis&eacute;e. Et s'il y a un embranchement qui
      r&eacute;pond aux exigences, le programme itin&eacute;rairera
      le wagon vers cette industrie. Mais une fois qu'un wagon a
      une charge personnalis&eacute;e, ce wagon peut seulement se
      d&eacute;placer &agrave; des triages, des
      inter&eacute;changes, et coulisses. Pas d'embranchement
      &agrave; moins que que l'embranchement ait &eacute;galement
      un Horaire demandant ce wagon et cette charge.</p>P&gt; Autre
      variante consiste &agrave; cr&eacute;er un programme qui
      fournit une charge personnalis&eacute;e pour le wagon, et une
      destination, mais sans l'affectation de voie. Le wagon sera
      accept&eacute; par les voies de triages, de
      classification/&eacute;change, de coulisse, et des
      embranchements auxdestinations qui ont un horaire qui exige
      ce type de wagon et la charge personnalis&eacute;e. les
      Embranchement sans horaire ne peuvent pas desservir un wagon
      avec une charge personnalis&eacute;e, &agrave; moins que le
      wagon ait &eacute;t&eacute; exp&eacute;di&eacute; directement
      &agrave; cette embranchement.

      <p>une attention particuli&egrave;re pour les wagons vides.
      Le programme ne itin&eacute;raire pas les wagons avec des
      charges par d&eacute;faut "E" ou "L". Donc, si votre Horaire
      demande un wagon avec l'option par d&eacute;faut "E", il peut
      se passer un certain temps avant que le wagon se montre. Une
      alternative est de g&eacute;rer les wagons vides comme des
      wagons avec des charges personnalis&eacute;s. Vous pourriez
      cr&eacute;er la charge personnalis&eacute;e "E (mpty)" et
      utiliser cette charge pour signifier un wagon vide.
      Maintenant les wagons avec cette charge seront rout&eacute;s
      et auront les m&ecirc;mes caract&eacute;ristiques que les
      wagons avec les "autres" charges personnalis&eacute;es.</p>

      <p>Les exemples ci-dessus de charges personnalis&eacute;es
      utilis&eacute;es pour aider &agrave; comprendre le mouvement
      du wagon, vous pourriez, si vous souhaitez tout simplement
      d&eacute;placer les wagons selon les horaires sans
      l'utilisation de charges personnalis&eacute;es.Les Charges
      personnalis&eacute;es sont facultatives et pas
      n&eacute;cessaire si vous souhaitez cr&eacute;er une simple
      s&eacute;quence de wagons.</p><a name=
      "ShowSchedulesByCarTypeAndLoad" id=
      "ShowSchedulesByCarTypeAndLoad"></a>

      <h3>Voir les horaires par type de wagon et
      charge</h3><img src=
      "images/ShowSchedulesByCarTypeAndLoad.png">

      <p>Vous pouvez acc&eacute;der &agrave; cet outil utile
      &agrave; partir de la fen&ecirc;tre des listes. La
      fen&ecirc;tre des annexes peuT &ecirc;tre trouv&eacute;E dans
      "Outils" dans la fen&ecirc;tre Emplacements. Il vous permet
      de s&eacute;lectionner un type de wagon, et puis toute charge
      que vous avez cr&eacute;&eacute; pour ce type de wagon. La
      fen&ecirc;tre affiche alors l'horaire qui par emplacement qui
      r&eacute;ceptionne ou exp&eacute;die la charge de ce wagon
      particuli&egrave;r.</p>

      <p>Si vous voulez une liste des charges de wagon
      personnalis&eacute;e pour chacun de vos types de wagon, vous
      pouvez utiliser l'option "Imprimer wagons complets" ou
      "Aper&ccedil;u wagons charges" trouv&eacute;s sous Outils
      dans la fen&ecirc;tre "Afficher les horaires par type de
      wagon et charge".</p><a name="Interchange" id=
      "Interchange"></a>

      <h3>Voies &Eacute;change</h3>La meilleure fa&ccedil;on de
      cr&eacute;er de l'&eacute;change de v&eacute;hicules entre
      les trains est d'utiliser une voie de
      classification/&eacute;change. Une voie de
      classification/d'&eacute;change peut &ecirc;tre
      utilis&eacute;e pour la classification, le mouvement des
      wagons dans la m&ecirc;me Cie, et un &eacute;change, la
      circulation des wagons entre Cie. Les wagons
      d&eacute;pos&eacute;s sur une voie de
      classification/d'&eacute;change par un train sur un
      itin&eacute;raire donn&eacute; ne seront pas ramass&eacute;s
      par un train utilisant le m&ecirc;me itin&eacute;raire. Un
      autre train avec un itin&eacute;raire diff&eacute;rent est
      n&eacute;cessaire pour ramasser les wagons. Par exemple, vous
      pourriez avoir un embranchement qui ramasse et laisse des
      wagons &agrave; partir d'un terminal. En d&eacute;finissant
      la voie comme une voie de classification/d'&eacute;change,
      une fois que le train de la ligne d'embranchement a fournit
      les wagons, ils y resteront jusqu'&agrave; ce que le train de
      la ligne principale s'arr&ecirc;te pour desservir la voie de
      classement/d'&eacute;change.

      <p>L'&eacute;tat de charge du wagon ne change pas lorsqu'il
      est plac&eacute; sur une voie de
      classification/d'&eacute;change.</p>

      <p>Si vous voulez plus de contr&ocirc;le sur la fa&ccedil;on
      dont votre voie classement/&eacute;change voie op&egrave;re,
      vous pouvez &eacute;ventuellement sp&eacute;cifier lesquels
      des trains ou itin&eacute;raires peuvent prendre ou laisser
      des wagons. Si vous limitez lesquels des trains, les
      itin&eacute;raires peuvent tirer wagons &agrave; partir d'une
      voie de classement/d'&eacute;change, vous devez
      &eacute;galement restreindre les types de wagon de la voie
      pour les m&ecirc;mes que les services de train, sinon vous
      pouvez avoir des wagons &eacute;chou&eacute;s sur la voie de
      classement/d'&eacute;change.</p>

      <p>Vous pouvez &eacute;galement contr&ocirc;ler les
      destinations de la voie d'&eacute;change assurera le service.
      Dans "Outils" dans la fen&ecirc;tre de voie d'&eacute;dition
      d'une voie clssification/d'&eacute;change, le menu "Voie
      Destination" vous permet de s&eacute;lectionner les
      destinations qui sont valables pour la voie.</p>P&gt;
      &Eacute;tant donn&eacute; la complexit&eacute; de ce type de
      voie, il est fortement recommand&eacute; de ne pas utiliser
      les voies de classification/&eacute;change jusqu'&agrave; ce
      que vous soyez &agrave; l'aise avec la fa&ccedil;on dont le
      programme construit les trains et que vous avez lu et
      comprenez comment cr&eacute;er des rapports. <a name=
      "CreateClassificationYard" id="CreateClassificationYard"></a>

      <h3>Comment Cr&eacute;er une Gare de Triage</h3>Une gare de
      triage/classification est utilis&eacute;e pour trier les
      wagons dans des trains diff&eacute;rents. Normalement une
      voie de triage est attribu&eacute; &agrave; un train
      sp&eacute;cifique et les wagons sont livr&eacute;es sur cette
      voie jusqu'&agrave; ce qu'il y ait assez de wagons pour
      compl&eacute;ter un train. Pour cr&eacute;er une gare de
      triage, vous devez attribuer une <a href="#Interchange">voie
      d'inter&eacute;change</a> , pour chaque train qui partira de
      ce triage. Pour chaque voie, permettre &agrave; tout les
      train de d&eacute;poser les wagons, mais attribuer un seul
      train pour les collecter. Vous devez configurer la voie
      d'&eacute;change pour servir le m&ecirc;me type wagon et de
      lignes que le train dessert, sinon vous risquez de finir avec
      des wagons orphelins

      <p>Remarquez qu'il est acceptable de cr&eacute;er plus de
      voies ce classification qu'il n'y a de voies physiques dans
      votre gare de triage. Les wagons peuvent partager le
      m&ecirc;me faisceau de voie jusqu'au moment de les classer
      dans leurs diff&eacute;rents trains. Vous pouvez
      &eacute;galement utiliser les <a href="#Polls">voies
      mutualis&eacute;es</a> caract&eacute;ristique de partage de
      l'espace de voie dans votre triage./P&gt; <a name="Staging"
      id="Staging"></a></p>

      <h3>Voies de Coulisse</h3>Les voies en coulisse sont
      normalement utilis&eacute;es pour repr&eacute;senter des
      endroits qui g&eacute;n&egrave;rent du trafic vers et depuis
      votre r&eacute;seau. Plusieurs fois, un acc&egrave;s physique
      aux voies en coulisse est limit&eacute;, donc le programme
      impose des restrictions importantes sur la fa&ccedil;on dont
      les voies de de coulisse sont utilis&eacute;s. Une "voie de
      coulisse" tient un train complet. Une fois qu'un train arrive
      sur une voie de coulisse, les wagons et les locomotives
      restent ensemble jusqu'&agrave; ce que le train quitte la
      voie de la coulisse. Le programme ne modifie jamais un train
      sur une voie de coulisse. Pour qu'un train quitte la
      coulisse, le programme doit trouver de nouveaux emplacements
      pour toutes les locomotives et les wagons stationn&eacute;s
      sur la voie de coulisse. Aucune locomotives ou wagons ne
      peuvent &ecirc;tre laiss&eacute;s pour compte.

      <p>En raison de la complexit&eacute; de voies de coulisse, il
      est fortement recommand&eacute; de ne pas utiliser les voies
      de coulisse jusqu'&agrave; ce que vous serez &agrave; l'aise
      avec la fa&ccedil;on dont le programme assemble les trains, y
      compris la capacit&eacute; de lire les rapports d'assemblage
      de train.</p>Si c'est la premi&egrave;re fois que vous
      utilis&eacute; un programme informatique pour cr&eacute;er
      des mouvements de wagon, il est recommand&eacute; que vous
      entriez un minimum de deux lieux de rassemblement pour vos
      op&eacute;rations, et avoir votre train qui partira de l'une
      et pour finir &agrave; l'autre. Par exemple, supposons que
      votre trains circulent de l'est &agrave; l'ouest. C'est mieux
      si vous cr&eacute;ez "Coulisse Est" et "Coulisse Ouest" et
      d'avoir votre trajet de trains pour dire &agrave; la coulisse
      l'ouest, sur votre r&eacute;seau, faire un peu de travail,
      puis terminer dans la coulisse est, et vice versa. Il est
      &eacute;galement pr&eacute;f&eacute;rable de nommer votre
      coulisse apr&egrave;s les emplacements r&eacute;els. Ainsi,
      par exemple, vous pourriez vouloir mod&eacute;liser les
      villes de Springfield et Worcester et avoir trains venus de
      New York et de Boston au service de votre r&eacute;seau. Dans
      ce cas, New York et Boston sont respectivement les coulisse
      ouest et est. Notez que les voies de coulisse pour New York
      et Boston peuvent &ecirc;tre le m&ecirc;me emplacement
      physique sur votre r&eacute;seau, nous avons juste besoin des
      deux noms de rassemblement afin que nos manifestes de train
      semblent plus prototypique. Notez que si vous utilisez un
      seul lieu de coulisse, le programme ne permet pas normalement
      aux wagons de se rendre de la coulisse et retourner au
      m&ecirc;me endroit de rassemblement. Si vous souhaitez que le
      programme permette ce type d'op&eacute;ration, voir
      Param&egrave;tres-&gt; Outils-&gt; <a href=
      "#AllowCarsToReturnToStaging">Options</a>

      <p><img src="images/EditStaging.png"></p>Une voie de coulisse
      vous permet d'avoir tous les wagons et les locomotives d'un
      train livr&eacute;s sur une voie. En cas de
      r&eacute;siliation d'un train dans la coulisse, le programme
      va rechercher une voie compl&egrave;tement vide, une sans
      locomotives ou wagons. La voie en coulisse par <a href=
      "#TypeRoadLoadRestrictionsStaging">d&eacute;faut</a> doit
      &eacute;galement desservir tous les types et les
      itin&eacute;raires de wagon et de la locomotive du train. Les
      trains ne peuvent pas partagerles voies en coulisse, le
      programme ne fera que mettre un train par voie. Lorsque vous
      quittez un endroit avec une voie en coulisse, toutes les
      wagons et locomotives sur une voie seront affect&eacute;s au
      train. Un emplacement peut avoir plusieurs voies de coulisse,
      mais ne peut pas avoir d'autres types de voies, des
      embranchements, des triages, etc. Les voies en coulisseT
      peuvent &ecirc;tre au d&eacute;part d'un itin&eacute;raire,
      l'extr&eacute;mit&eacute; de l'itin&eacute;raire, ou les
      deux. les voies en coulisse au milieu d'un itin&eacute;raire
      sont ignor&eacute;es par le programme.

      <p>Notez que si vous utilisez un train &agrave; destination
      et &agrave; partir du m&ecirc;me emplacement de coulisse en
      utilisant le <a href="#BuildOptions">Mode d'Assemblage
      Normal</a> , vous devez d&eacute;finir deux voies de coulisse
      pour le programme, une pour le d&eacute;part et l'autre pour
      le retour. Physiquement, les deux voies de coulisse peuvent
      &ecirc;tre les m&ecirc;mes. Si vous voulez utiliser le
      m&ecirc;me nom pour vos voies de coulisse, le programme vous
      permet de nommer les voies de coulisse &agrave; l'aide d'un
      trait d'union et un num&eacute;ro comme suffixe. Le trait
      d'union et le num&eacute;ro ne sont pas imprim&eacute;s sur
      les listes de manoeuvres ou manifestes. Si vous utilisez
      <a href="#BuildOptions">Mode Agressif</a> pour assembler les
      trains, vous pouvez <a href=
      "#MakeDepartureTrackAvailable">configurer</a> le programme
      pour permettre au train de revenir &agrave; la m&ecirc;me
      voie de coulisse d'o&ugrave; le train est parti.</p>

      <p>Si vous avez besoin d'un train en partance de la coulisse
      pour avoir un certain nombre de locomotives, mod&egrave;le de
      locomotive, ou le nom de la ligne, le programme va rechercher
      toutess les voies en coulisse &agrave; l'endroit de
      d&eacute;part pour un train qui r&eacute;ponde &agrave; ces
      exigences. Si vous d&eacute;finissez les exigences de
      locomotive &agrave; 0, le programme s&eacute;lectionnera le
      prochain train disponible depuis la coulisse; et ignore le
      nombre de locomotives en laissant cette voie de coulisse.
      Voir <a href="#TrainRequires">Train Conditions
      Optionnelles</a> pour plus d'info.</p>

      <p>Vous pouvez si vous le souhaitez, &eacute;ventuellement
      contr&ocirc;ler les voies de coulisse sur laquelle un train
      arrivera et partira. Notez que "Tous" par d&eacute;faut
      permet &agrave; tous les trains d'arriver ou de partir sur la
      voie de coulisse, donc si vous voulez restreindre les trains
      pour une voie sp&eacute;cifique ou des voies, vous devez
      configurer toutes les voies de coulisses de cet endroit.</p>

      <p>Vous pouvez en <a href="#PromptDepartureTrack">option</a>
      , avoir le programme qui vous demandera quelle voie vous
      souhaitez utiliser lors du d&eacute;part de la
      coulisse.</p><a name="StagingAndCarLoads" id=
      "StagingAndCarLoads"></a>

      <h3>Coulisse et charges de Wagon</h3>Sur les voies de
      coulisse vous pouvez &eacute;ventuellement permuter les
      charges par d&eacute;faut de wagon de vide &agrave;
      charg&eacute;, et charg&eacute; &agrave; vide.
      S&eacute;lectionnez l'"Echange par d&eacute;faut
      Charg&eacute; et Vide" si vous voulez que vos wagons
      charg&eacute;s changent en arrivant sur la voie de coulisse.
      Vous pouvez si vous le souhaitez, demander au programme de
      vider les wagons car ils sont entr&eacute;s sur la coulisse.
      S&eacute;lectionnez "Vider wagons avec des charges par
      d&eacute;faut" pour changer un &eacute;tat de wagon de
      charg&eacute; &agrave; vide. Si vous utilisez des charges
      personnalis&eacute;es, vous pouvez supprimer la charge
      personnalis&eacute;e lorsque les wagons arrivent &agrave; la
      voie de coulisse. S&eacute;lectionnez le "vider Wagons avec
      des charges personnalis&eacute;e" si vous voulez remplacer
      votre charge pesonnalis&eacute;e avec la valeur vide par
      d&eacute;faut .

      <p>Le programme offre trois options pour la mise en place de
      charges personnalis&eacute;es dans les wagons quand ils
      partent d'une coulisse. La premi&egrave;re option est
      appel&eacute;e "G&eacute;n&eacute;rer charges
      personnalis&eacute; pour embranchements desservis par ce
      train ". Si la premi&egrave;re option est
      s&eacute;lectionn&eacute;e, le programme va seulement
      v&eacute;rifier les embranchements avec des Horaires le long
      de l'itin&eacute;raire du train au d&eacute;part . Le
      programme ne fera que g&eacute;n&eacute;rer assez de charges
      de wagons pour remplir la voie de l'embranchement. Lorsque
      seule la premi&egrave;re option est
      s&eacute;lectionn&eacute;e, le programme ignore l'Horaire de
      "Pourcentage des charges personnalis&eacute;
      g&eacute;n&eacute;r&eacute; par la coulisse" et la
      fonctionnalit&eacute; optionnelle "Voie Alternative".</p>

      <p>Si la deuxi&egrave;me option est choisie,
      "G&eacute;n&eacute;rer des charges personnalis&eacute;es pour
      tous les embranchements (plusieurs trains) ", le programme va
      v&eacute;rifier toutes les embranchements avec un Horaire
      pour une demande. Maintenant le programme lors de la
      d&eacute;termination de beaucoup de wagon charg&eacute;s
      &agrave; g&eacute;n&eacute;rer, se penchera sur la valeur du
      pourcentage "des charges personnalis&eacute;es
      g&eacute;n&eacute;r&eacute;s par la coulisse ". Aussi, si
      l'embranchement est plein ou va devenir plein, le programme
      enverra les wagons &agrave; la "voie Alternative", puis
      &agrave; toutes les voies de triage &agrave; l'emplacement de
      l'embranchement.</p>

      <p>Deux options fonctionnent de la m&ecirc;me mani&egrave;re
      en ce qui concerne le placement de charges
      personnalis&eacute;es dans les wagons vides, seul le nombre
      de wagons charg&eacute;s et le nombre d'embranchements est
      consid&eacute;r&eacute; par les changements du programme. Si
      un Horaire exige un certains type de wagon, et ce type de
      wagon est au d&eacute;part de la coulisse, et le wagon
      charg&eacute; est vide par d&eacute;faut, le programme va
      placer la charge personnalis&eacute;e dans ce wagon si
      l'option appropri&eacute;e est
      s&eacute;lectionn&eacute;e.</p>

      <p>Si un embranchement demande une charge
      personnalis&eacute;e, l'embranchement doit avoir un <a href=
      "#Schedules">Horaire</a> .</p>

      <p>Pour restreindre la charge que le programme placera dans
      vos wagons, vous pouvez utiliser les voies de chargement en
      coulisse pour servir de fonction de contr&ocirc;le. Voir
      "S&eacute;lectionner charges desservies par cette voie "lors
      de l'&eacute;dition la voie de coulisse. Vous pouvez
      &eacute;galement restreindre les types de charge que le
      programme placera en limitant les types de charges dans le
      train au d&eacute;part que la coulisse est autoris&eacute;e
      &agrave; livrer. Voir "S&eacute;lectionner des charges
      desservies par ce train" sous &Eacute;dition-&gt; Train, puis
      Outils-&gt; <a href="#TrainBuildOptions">Train Options
      d'assemblage</a> .</p>

      <p>Le programme offre une autre option en ce qui concerne les
      charges de wagon. Si le train part de la coulisse et se
      termine &eacute;galement dans la coulisse, le programme va
      g&eacute;n&eacute;rer automatiquement la charge
      appropri&eacute; &agrave; vos wagons vides qui partent et se
      terminent dans la coulisse. Pour utiliser cette fonction,
      l'un des deux "G&eacute;n&egrave;rer des charges
      personnalis&eacute;s ... "dans la coulisse doit &ecirc;tre
      s&eacute;lectionn&eacute; pour la voie de d&eacute;part.
      Utilisez le menu" Options de Charge "sous" Outils " pour
      contr&ocirc;ler quele charge le programme va
      g&eacute;n&eacute;rer pour vous. Vous pouvez &eacute;galement
      utiliser les " Options de Charge " de la voie terminale de
      lacoulisse pour contr&ocirc;ler le type de charge le
      programme va g&eacute;n&eacute;rer &agrave; partir de la voie
      de la coulisse de d&eacute;part.</p>

      <p>La troisi&egrave;me option "G&eacute;n&eacute;rer des
      charges personnalis&eacute;es pour toutes les voies de
      coulisse " va essayer et placer des charges
      personnalis&eacute;es dans vos wagons vides par la recherche
      de destinations que sont les voies en coulisse. Tout d'abord,
      si le train en coulisse au d&eacute;part est &eacute;galement
      dissous avec la coulisse, le programme va essayer un endroit
      une charge personnalis&eacute;e dans un wagon vide qui
      r&eacute;pond aux exigences de charge du train, et le
      d&eacute;part du train et les exigences de charge de voie de
      transit du terminal. S'il n'y a pas une voie terminal de la
      coulisse pour le train, ou le programme n'a pas r&eacute;ussi
      &agrave; ajouter une charge personnalis&eacute;e pour le
      wagon qui r&eacute;ponde aux exigences de la voie terminal en
      coulisse, le programme va alors rechercher d'autres voies de
      coulisse qui ne sont pas au d&eacute;part ou &agrave;
      l'emplacement terminal. Si le programme trouve une voie de
      coulisse qui n'est pas situ&eacute;e &agrave; l'emplacement
      de d&eacute;part ou terminale, il attribuera
      al&eacute;atoirement une charge personnalis&eacute;e qui est
      desservi par le train, la voie de d&eacute;part de la
      coulisse et une voie de coulisse de destination. Ensuite, le
      programme permettra de d&eacute;terminer si le wagon peut
      &ecirc;tre achemin&eacute; &agrave; la voie de la coulisse de
      destination en utilisant la charge personnalis&eacute;e
      affect&eacute;e. Si la voie de la coulisse est accessible, le
      programme en plus de placer la charge personnalis&eacute;e
      dans le wagon, d&eacute;fini la destination finale du
      v&eacute;hicule &agrave; l'endroit o&ugrave; la voie de
      coulisse r&eacute;side.</p><a name="BlockingCarsFromStaging"
      id="BlockingCarsFromStaging"></a>

      <h3>Bloc de Wagons en Coulisse</h3>Le programme fournit un
      algorithme tr&egrave;s simple pour former des blocs de wagons
      &agrave; partir de la coulisse. Comme les wagons qui ont
      &eacute;t&eacute; envoy&eacute;s &agrave; la coulisse peuvent
      se trouver n'importe o&ugrave; dans le train, le programme
      utilise le dernier endroit o&ugrave; les wagonsont
      &eacute;t&eacute; ramass&eacute;s pour former des blocs dans
      le train sortant de la coulisse. Ainsi, par exemple, si un
      train qui a pris fin dans la coulisse a eu trois
      arr&ecirc;ts, A, B et C, les wagons de A seraient en bloc
      quand le prochain train quitte la coulisse. La m&ecirc;me
      chose vaut pour les ramassages
      pr&eacute;c&eacute;embranchements de B et C, ces wagons
      resteraient group&eacute;s. Le programme en tentant de
      trouver des destinations pour les wagons au d&eacute;part de
      la coulisse, commence avec le plus grand bloc de wagons, puis
      v&eacute;rifie l'itin&eacute;raire du train au d&eacute;part,
      et tente d'envoyer le plus grand bloc de l'emplacement
      demandant le plus de mouvements. Apr&egrave;s cela, le
      programme fait la m&ecirc;me chose avec le prochain bloc de
      wagons, il trouve le second emplacement sur
      &acirc;&euro;&lsaquo;&acirc;&euro;&lsaquo;la
      itin&eacute;raire et envoie les wagons. Il s'agit d'une
      approche tr&egrave;s simpliste de bloc de wagons, il suppose
      que les wagons d&eacute;j&agrave; ramass&eacute;s &agrave; un
      endroit ont &eacute;t&eacute; plac&eacute;s dans le train en
      blocs. Cette fonctionnalit&eacute; de mise en bloc ne
      &acirc;&euro;&lsaquo;&acirc;&euro;&lsaquo;consid&egrave;re
      pas o&ugrave; sont les wagons dans le train, comme certains
      op&eacute;rateurs lors de l'enl&egrave;vement des wagons,
      ajouteront des wagons dans n'importe quelle partie du train.
      Donc, le premi&egrave;r arr&ecirc;t dans l'itin&eacute;raire
      de d&eacute;part du train ne peut pas avoir les wagons en
      t&ecirc;te du train, mais ils devraient &ecirc;tre dans un
      groupe, quelque part dans le train. La premi&egrave;re fois
      que vous partez d'une coulisse avec cette fonction, les
      wagons ne seront pas group&eacute;s pour vous, vous devez
      d'abord mettre fin &agrave; un nouveau train dans la
      coulisse, ces wagons auront les &eacute;tiquettes de bloc qui
      leur sont assign&eacute;s. Pour activer cette
      fonctionnalit&eacute;, voir Modifier Voie Coulisse " Option
      Groupage Wagons" dans le coin inf&eacute;rieur droit de la
      fen&ecirc;tre. Il y a beaucoup de raisons pour lesquelles
      cette option ne va pas grouper correctement les wagons. Voir
      le rapport d'assemblage du train pour plus de d&eacute;tails.
      <a name="LoopingTrainsThroughStaging" id=
      "LoopingTrainsThroughStaging"></a>

      <h3>Boucle des Trains &agrave; Travers Coulisse</h3>Parfois,
      pour l'exploitation un train entre coulisse &agrave; un
      endroit (appelons-le A), puis quitte plus tard &agrave; un
      autre endroit (appelons B). En vue d'une pr&eacute;vision
      exploitation, les emplacements A et B sont des endroits qui
      ne sont pas directement reli&eacute;s par des trains. Nous
      avons donc besoin de d&eacute;m&eacute;nager les locomotives
      et les wagons de l'emplacement A &agrave; B ainsi le
      manifeste du train peut avoir un sens. Une fa&ccedil;on de le
      faire est de mettre fin au train dans la coulisse &agrave;
      l'Emplacement B. Faire cela fait que le programme
      "d&eacute;placer" le train et ses wagons de A &agrave; B qui
      est vraiment la m&ecirc;me voie physique. Plus tard, vous
      pouvez assembler un train qui s'&eacute;loigne de
      l'emplacement B, et la manifeste montrera que le train
      provenaitde B et non A.

      <p>Vous pouvez automatiser la reclassification d'un train en
      cr&eacute;ant un <a href="#TrainScripts">sc&eacute;nario</a>
      qui est activ&eacute; lorsque le train est
      arr&ecirc;t&eacute; dans la coulisse .</p>

      <p>un "Groupement" peut &ecirc;tre utilis&eacute; pour
      partager l'espace de la voie avec deux ou plusieurs
      industries. Par exemple, disons que vous avez un
      embranchement qui dessert deux industries, et il peut
      contenir quatre wagons de 50 pieds, ou est d'environ 220
      pieds de long. Maintenant, vous pouvez effectuer des
      op&eacute;rations d'une longueur de voie de 110 pieds pour
      l'industrie 1, et un autre de 110' pour l'industrie 2. Le
      programme pourrait d&eacute;finir jusqu'&agrave; deux wagons
      sur chacune des voies desservant chaque industrie.</p>

      <p>Mais disons que vous voulez avoir jusqu'&agrave; quatre
      wagons livr&eacute;s &agrave; n'importe quelleindustrie. Si
      vous " Grouper" les deux voies de l'industrie, le programme
      peut emprunter l'espace de l'autre secteur si
      n&eacute;cessaire. Alors maintenant, le programme pourrait
      d&eacute;finir jusqu'&agrave; quatre wagons &agrave; chaque
      industrie, mais pas plus de quatre wagons au total.</p>

      <p>Si vous ne d&eacute;finissez pas un minimum, alors une
      industrie pourrait monopoliser toute la voie. En fixant un
      minimum de mot 55 pieds pour chaque industrie, cela signifie
      que pour le plus qu'une industrie pourra obtenir, c'est trois
      wagons. Il y aura toujours un espace disponible d'au moins un
      wagon &agrave; chaque industrie. Notez que le nombre maximum
      de wagons dans tous les cas est de quatre. C'est seulement la
      fa&ccedil;on dont les wagons sont distribu&eacute;s qui
      change lors de la configuration minimum.</p>

      <p>L'utilisation des anth&egrave;res d'un " Groupement" est
      en ce qui concerne les horaires. Pour l'utilisateur de
      puissance, vous trouverez peut-&ecirc;tre qu'un horaire
      unique attribu&eacute; &agrave; un embranchement ne fait pas
      exactement ce que vous voulez. Mais si la voie pouvait avoir
      plusieurs horaires, il ferait ce qui est n&eacute;cessaire.
      En entrant plusieurs embranchements avec des horaires
      partag&eacute;es via un Groupement, vous pouvez cr&eacute;er
      une s&eacute;quence de wagon imaginables pour votre
      industrie.</p><a name="PlannedPickUps" id=
      "PlannedPickUps"></a>

      <h3>Ramassages Panifi&eacute;s</h3>Le programme pour la
      recherche de voies pour d&eacute;poser des wagons,
      v&eacute;rifie pour voir si il y a de l'espace disponible
      pour les nouveaux wagons. Parfois, en raison de l'ordre dans
      lequel vous assemblez vos trains, vous savez mieux que le
      programme que certains wagons seront ramass&eacute;s au cours
      de votre session, dits par un train qui sera assembl&eacute;
      plus tard. Cette fonction peut &ecirc;tre utile pour les
      voies de classification/&eacute;change, surtout si vous
      voulez que les voies de classification/&eacute;change soit
      plus pleine que vide. Aussi, si vous manoeuvrez des wagons
      vers et depuis des voies qui sont essentiellement pleines, en
      utilisant cette option sur l'un ou plusieurs des voies en
      question peut augmenter les mouvements du wagon.

      <p>Si vous souhaitez que le programme ignore un certain
      nombre de wagons actuellement pr&eacute;sent sur la voie,
      vous pouvez utiliser cette fonction pour sp&eacute;cifier le
      nombre de wagons &agrave; ignorer. Les choix sont 25%, 50 %,
      75% et 100 %, ce qui signifie que vous pouvez dire au
      programme d'ignorer 25 &agrave; 100 pour cent des wagons
      pr&eacute;sents sur la voie. Par exemple, si vous choisissez
      100%, le programme ignorera tous les wagons pr&eacute;sent
      sur la voie, et &eacute;tablira de nouveaux wagons &agrave;
      la longueur de la voie. Cela signifie &eacute;galement que le
      programme peut surcharger la voie jusqu'&agrave; 100%. Donc,
      si la voie peut contenir 10 wagons, le programme pourrait
      envoyer 10 autres wagons sur la voie. Maintenant, la voie
      peut &ecirc;tre surcharg&eacute;e jusqu'&agrave; ce que ce
      train ou un train plus tard arrive et ramasse les 10 wagons
      d'origines. Par cons&eacute;quent, vous devez avoir un peu
      d'espace disponible sur la voie temporaire pour contenir les
      nouveaux wagons. Donc, si vous n'avez pas d'espace "extra"
      pour les wagons, ne pas utiliser cette fonctionnalit&eacute;!
      Notez qu'il est de votre responsabilit&eacute; et non de
      celle du programmes d'assembleret de terminer un train qui
      ramasse les wagons d'origine .</p>

      <p>Garantir que les wagons seront ramass&eacute;s &agrave;
      partir d'une voie peut &ecirc;tre un peu difficile, il est
      donc recommand&eacute; de ne pas utiliser cette fonction
      jusqu'&agrave; ce que vous deveniez un expert en ce qui
      concerne l'utilisation de ce programme, sinon vous allez
      surcharger probablement vos voies lors de l'utilisationde
      cette fonction.</p><a name="ModifyLocationsByCarType" id=
      "ModifyLocationsByCarType"></a>

      <h3>Modifier des Lieux par Type de Wagon</h3>Cet outil peut
      &ecirc;tre trouv&eacute; sous Emplacements-&gt; Outils.
      Utilisez cet outil pour modifier rapidement le type de wagons
      que vos emplacements et les voies utiliseront. Tr&egrave;s
      utiles lors de l'ajout d'un nouveau type de wagon dans votre
      liste.

      <p><img src="images/ModifyLocationsByCarType.png"></p>

      <p>D'abord s&eacute;lectionner le type de wagon que vous
      d&eacute;sirez modifier. La fen&ecirc;tre montrera alors les
      emplacements et les voies qui peuvent desservir ce type de
      wagon. S&eacute;lectionnez ou d&eacute;s&eacute;lectionner
      les lieux et les voies que vous voulez voir utilis&eacute;es,
      et appuyez sur le bouton "Enregistrer" pour modifier vos
      sites et les voies. Vous pouvez &eacute;galement recopier la
      mani&egrave;re dont un wagon existant est utilis&eacute; par
      vos emplacements et appliquer ces r&egrave;gles &agrave; un
      autre wagon. Pour faire qu'un type de wagon se comporte comme
      un autre, s&eacute;lectionnez d'abord le wagon de votre
      souhaitez copier, puis s&eacute;lectionnez la case option
      "Copier", le Type wagon appara&icirc;tra maintenant &agrave;
      droite de la case, puis s&eacute;lectionnez le type de wagon
      que vous souhaitez modifier et appuyez sur "Enregistrer" pour
      avoir les deux types de wagon utilis&eacute;s par les
      m&ecirc;mes endroits et les voies.</p><a name="Cars" id=
      "Cars"></a>

      <h2>Wagons</h2>La fen&ecirc;tre de wagons vous permet
      d'&eacute;diter votre liste de wagons. Vous pouvez entrer un
      num&eacute;ro de wagon, la ligne, type, longueur. Le
      programme calcule automatiquement le poids des wagons qui est
      bas&eacute; sur la longueur et l'&eacute;chelle de votre
      mod&eacute;lisation. Vous pouvez facultativement ajouter la
      couleur du wagon, la date de Asssemblage, le chargement et le
      propri&eacute;taire. Si vous voulez un groupe de wagons pour
      &ecirc;tre man&oelig;uvr&eacute;s comme une unit&eacute;,
      vous pouvez cr&eacute;er un "noyau". Vous pouvez attribuer
      n'importe quel nombre de wagons &agrave; un noyau, mais le
      type du premier wagon affect&eacute; sera utilis&eacute; par
      le programme afin de d&eacute;terminer si le noyau est permis
      &agrave; un endroit. La longueur totale du noyau est
      utilis&eacute; pour d&eacute;terminer si les wagons dans le
      noyau vont s'ins&eacute;rer. Notez que le programme comprend
      &eacute;galement un espace pour les coupleurs du wagon lors
      du calcul de la longueur d'un noyau.

      <p><img src="images/Cars.png"></p>

      <h3>Ajouter, Enregistrer, trouver des boutons</h3>Il y a
      trois boutons situ&eacute;s au bas de la fen&ecirc;tre de
      Wagons. Le bouton "Ajouter" vous permet d'ajouter un wagon
      &agrave; votre liste. Le bouton "Sauvegarder" enregistre la
      liste des wagons sur le disque. Il sauve &eacute;galement la
      position de la Fen&ecirc;tre wagons et sa taille, et toutes
      les modifications apport&eacute;es aux largeurs de tableau.
      Le bouton "Rechercher" et la fen&ecirc;tre de texte adjacents
      peuvent &ecirc;tre utilis&eacute;s pour trouver un wagon par
      son num&eacute;ro de itin&eacute;raire. Vous pouvez utiliser
      le joker "*" en entrant un num&eacute;ro de wagon. Par
      exemple si vous vous voulez trouver toutes les wagons avec
      des num&eacute;ro qui se termine par 345, entrez *345, et
      appuyez sur trouver. Chaque fois que vous appuyez sur
      trouver, le prochain wagon avec un num&eacute;ro se terminant
      par la ligne "345" sera mis en surbrillance.

      <p><a name="ImportingCars" id="ImportingCars"></a></p>

      <h3>Importation de Wagons &agrave; partir d'un Fichier</h3>Si
      vous avez d&eacute;j&agrave; une liste de wagons dans une
      base de donn&eacute;es, vous pouvez importer les wagons dans
      le programme. La fonction d'importation n&eacute;cessite un
      fichier texte ASCII, avec une ligne pour chaque wagon.
      L'importation de wagons n&eacute;cessite quatre attributs et
      l'ordre est le num&eacute;ro de wagon, nom de la ligne, le
      type et la longueur. Les quatre attributs de wagon sont tous
      n&eacute;cessaires pour que l'importation travaille
      correctement. Les lignes suivantes montrent deux exemples de
      format correct:

      <p>336 GCR plat 40<br>
      655578 UP Boxcar 40</p>

      <p>Chaque ligne peut commencer par un espace et des espaces
      multiples entre chaque champs est correct. En option, vous
      pouvez inclure des attributs suppl&eacute;mentaires dans l'
      ordre suivant, poids, couleur, nom du propri&eacute;taire,
      date de Asssemblage, et l'emplacement. L'emplacement peut
      avoir deux domaines, le nom du lieu suivi de l'embranchement
      ou du triage s&eacute;par&eacute;s par un tiret. Le tableau
      suivant montre deux exemples de format correct:</p>

      <p>336 GCR Plat 40 3.8 Noire AT 1930 Home Town
      &Eacute;tats-Unis - Oil Terminal George<br>
      655578 UP Boxcar 40 3.8 jaune DB 1934 York - Fret York</p>

      <p>Si vous pr&eacute;f&eacute;rez utiliser des
      d&eacute;limiteurs virgules au lieu des espaces, utilisez un
      fichier avec une extension .csv ou placer le mot "comma" au
      d&eacute;but de votre fichier d'importation et utiliser des
      virgules au lieu des espaces. Voici deux exemples
      d'importation de wagons avec des virgules comme
      d&eacute;limiteurs.</p>

      <p>comma<br>
      336,GCR,Flat Car,40,3.8,Black,AT,1930,Home Town
      USA,-,George's Oil Terminal<br>
      655578,UP,Tank Car,40,3.8,Yellow,DB,1934,York,-,York
      Freight</p>

      <p>Vous devez &ecirc;tre tr&egrave;s pruembranchement avec
      les espaces lors de l'importation d'un fichie
      d&eacute;limit&eacute; par virgule. le programme comprendra
      les espaces de arri&egrave;re s'ils existent entre les
      virgules.</p>

      <p>Si vous entrez 0 pour le poids de la wagon, le programme
      va automatiquement calculer le poids des wagons pour vous en
      fonction de la longueur du wagon et de <a href=
      "#Scale">l'&eacute;chelle</a> que vous avez
      s&eacute;lectionn&eacute;e.</p>

      <p>Pour importer un fichier, utilisez le menu "Outils" dans
      le coin sup&eacute;rieur gauche du menu Outils-&gt;
      Op&eacute;rations&gt; wagons. Ensuite, s&eacute;lectionnez
      "Outils-&gt; Liste-&gt; Importer &agrave; partir du fichier".
      Notez que le programme n' ajoutera que les wagons qui
      n'existent pas dans liste de wagon du programme. Si le wagon
      existe d&eacute;j&agrave;, l'importation sera ignor&eacute;e
      par le programme.</p>

      <p>Pendant l'importation, si l'emplacement d'un wagon ou
      d'une voie n'existe pas dans la base de donn&eacute;es du
      programme, le programme vous invite &agrave; les
      cr&eacute;er. Cet ainsi, que non seulement vous importez vos
      wagons, mais aussi les endroits o&ugrave; se trouve le wagon
      et les voies. Le programme mettra une nouvelle voie d'une
      longueur de 1000 ", et va d&eacute;finir le type de voie
      comme un garage. Apr&egrave;s l'importation, vous pouvez
      &eacute;diter la voie et d&eacute;finir sa longueur correcte
      et son <a href="#ChangeTrackType">type</a> .</p>

      <p>Pour am&eacute;liorer la vitesse de l'importation de
      wagons, vous pouvez fermer la fen&ecirc;tre des wagons . Il
      faut beaucoup plus de cycles de processeur pour mettre
      &agrave; jour la fen&ecirc;tre des wagons que pour importer
      effectivement les wagons.</p>

      <p>Apr&egrave;s avoir import&eacute; vos wagons, vous devez
      les enregistrer si vous souhaitez les conserver comme une
      partie de votre liste. Utilisez le bouton "Sauvegarder"
      Wagons ou s&eacute;lectionnez un wagon en appuyant sur le
      bouton Modifier, puis appuyez sur le bouton "Sauvegarder" qui
      peut &ecirc;tre trouv&eacute; au bas &agrave; droite de la
      fen&ecirc;tre "Edition Wagon" .</p><a name="CarsEdit" id=
      "CarsEdit"></a>

      <h3>Ajout wagons &agrave; votre liste</h3>Pour ajouter
      manuellement une wagon &agrave; votre liste, appuyez sur le
      bouton "Ajouter" situ&eacute; en bas de la fen&ecirc;tre
      "Outils-&gt; Op&eacute;rations&gt; wagons" .

      <p><img src="images/EditCar.png"></p>

      <p>S&eacute;lectionnez ensuite l'itin&eacute;raire pour le
      wagon. Si l'itin&eacute;raire d&eacute;sir&eacute; n'existe
      pas, appuyez sur le bouton "&Eacute;diter" en face de la
      bo&icirc;te de menu s&eacute;lectionner itin&eacute;raire.
      Cela vous permettra d'ajouter un nouvel itin&eacute;raire ou
      de supprimer tout ce dont vous n'avez pas besoin.</p>

      <h3>Num&eacute;ro de Ligne</h3>Maintenant, entrez le
      num&eacute;ro de ligne du wagon dans la zone de texte. Le
      programme exige un nom de ligne unique et un num&eacute;ro de
      ligne pour chaque wagon. Si vous avez des wagons avec des
      lignes et des num&eacute;ros iembranchementiques, il suffit
      d'ajouter un -1, -2, etc &agrave; chacun des num&eacute;ros
      de wagons. Le programme lors de l'impression du manifeste ou
      de la liste de man&oelig;uvre supprimera les les-1, -2, etc
      du num&eacute;ro de ligne du wagon.

      <h3>Type de wagon, longueur, couleur,
      poids</h3>S&eacute;lectionnez le type de wagon et sa longueur
      dans les bo&icirc;tes de menu. Utilisez le Bouton "Modifier"
      &agrave; droite de la bo&icirc;te de menu pour ajouter ou
      supprimer des types de wagons ou des longueurs, que vous
      souhaitez ajouter ou supprimer. Le poids des wagons est
      calcul&eacute; automatiquement, mais vous pouvez entrer un
      poids diff&eacute;rent, si n&eacute;cessaire. Lorsque vous
      entrez la longueur d'un wagon, entrer dans la longueur de la
      caisse et non pas la longueur totale. Par exemple, un wagon
      de quarante pieds a une longueur de 40 pieds. Le programme
      lorsqu'il calcule la longueur, va ajouter deux pieds &agrave;
      chaque extr&eacute;mit&eacute; du wagon pour les coupleurs.
      Par cons&eacute;quent, lorsque vous placez un wagon de
      quarante pieds sur un embranchement, il utilisera 44 pieds de
      voie.

      <h3>Sous-Type de wagon</h3>

      <p>Le programme offre la possibilit&eacute; d'ajouter un
      sous-type de de wagon. L'ajout d'un "sous-type" &agrave;
      votre type de wagon va cr&eacute;er une nouveau type de
      wagon. Le "sous-type" n'est pas imprim&eacute; sur les listes
      manifeste ou de man&oelig;uvres. Par exemple vous pourriez
      avoir des wagons &agrave; charbon avec des chargement et des
      wagons de charbon qui sont vides. Si vous entrez le type de
      wagon HopCoal-C pour vos wagon avec du charbon, et HopCoal-E
      pour le vide, le programme peut utiliser cette information
      pour attribuer et livrer des wagons &agrave; leurs trains
      appropri&eacute;s et emplacements respectivement.</p><a name=
      "CabooseFredHazardous" id="CabooseFredHazardous"></a>

      <h3>Passagers, Caboose, FRED, case dangereux</h3>Si le wagon
      est utilis&eacute; dans le service passager, cochez la case
      passagers. Le programme placera les wagons en particuliers
      vers l'arri&egrave;re d'un train de service mixte
      (combinaison de passagers et wagons de marchandises). Si le
      wagon est un fourgon de queue, ou a un FRED (clignotant
      dispositif d'extr&eacute;mit&eacute; arri&egrave;re), ou est
      dangereux, s&eacute;lectionnez la case appropri&eacute;e. Le
      programme utilise les fonctions de fourgon de queue et Fred
      pour placer le wagon &agrave; la fin d'un train quand le
      train a besoin d'un fourgon de queue ou de wagon avec Fred.
      La case &agrave; cocher dangereux fera que le programme
      ajoutera une note &agrave; la liste de man&oelig;uvres pour
      le wagon qui transporte des mat&eacute;riaux dangereux .
      Votre politique de chemins de fer au sujet des
      mati&egrave;res dangereuses peut &ecirc;tre appliqu&eacute;e
      &agrave; ce wagon!

      <p>Lorsque la case utilitaire est s&eacute;lectionn&eacute;e,
      elle informe le programme lors de l'impression des manifestes
      et des listes de manoeuvresde ne pas afficher la ligne du
      wagon individuel et de le num&eacute;ro de la ligne, mais
      plut&ocirc;t la quantit&eacute; de wagons n&eacute;cessaires
      de ce type. Par exemple, les trains de prototypes lors de
      l'exp&eacute;dition du charbon ne liste pas normalement les
      wagons dans le train par le num&eacute;ro de la ligne du
      wagon, mais indique plut&ocirc;t le nombre de wagons, le type
      de wagon, et la charge du wagon sur le manifeste du
      train.</p>

      <p>Si vous utilisez la fonction d'utilit&eacute;, il est
      fortement recommand&eacute; que vous s&eacute;lectionnez la
      fonction d'utilit&eacute; pour toutes les wagons d'un type
      donn&eacute;. Puisque la ligne et le num&eacute;ro du wagon
      ne sont pas affich&eacute;s sur les manifestes et la liste de
      manoeuvres, tous les wagons de ce type peuvent &ecirc;tre
      plac&eacute;s dans un train. Plus tard, si vous essayez de
      trouver un wagon par son num&eacute;ro de lifne, il pourrait
      tr&egrave;s bien avoir &eacute;t&eacute; transport&eacute;
      sur un train plus t&ocirc;t. Donc, vous avez &agrave;
      d&eacute;cider d'utilisez les num&eacute;ros de ligne ou ou
      non pour un type donn&eacute; de wagon.</p>

      <h3>Emplacement wagon</h3>Maintenant d&eacute;finir
      l'emplacement du wagon sur le r&eacute;seau. Si le wagon est
      hors du r&eacute;seau, laisser l'emplacement blanc (espace
      vide). <a name="CarLoad" id="CarLoad"></a>

      <h3>Charge de wagon</h3>Vous pouvez &eacute;ventuellement
      d&eacute;finir l'&eacute;tat de charge du wagon.
      S&eacute;lectionnez E pour des vides ou L pour des
      charg&eacute;s. Vous pouvez &eacute;galement cr&eacute;er vos
      propres <a href="#EditCarLoads">charges wagon</a> , mais il y
      a des restrictions. Normalement les embranchements avec
      <a href="#Schedules">Horaires</a> sont utilis&eacute;s pour
      charger ou d&eacute;charger des wagons avec des charges
      personnalis&eacute;es que vous avez cr&eacute;&eacute;es.
      Vous pouvez &eacute;galement utiliser les <a href=
      "#coulisseAndCarLoads">Coulisses</a> pour charger ou
      d&eacute;charger votre wagon avec des charges
      personnalis&eacute;es. Il est &eacute;galement
      sugg&eacute;r&eacute; que vous utilisiez un format similaire
      &agrave; L(mati&egrave;res premi&egrave;res) pour
      d&eacute;crire vos charges. Par exemple une charge d'outils
      peut &ecirc;tre entr&eacute; comme L(Outils). <a name=
      "Kernel" id="Kernel"></a>

      <h3>Noyau, ou groupe de wagons</h3>Si ce wagon souhaite faire
      partie d'un noyau qui est un groupe de wagons que vous voulez
      passer comme une seule unit&eacute;, appuyez sur "Modifier"
      en face du "Noyau" et entrez un nom de noyau.
      S&eacute;lectionnez ensuite le noyau de la bo&icirc;te de
      menu.

      <h3>Champs facultatifs</h3>Enfin vous pouvez
      &eacute;ventuellement entrer la couleur, la date de la
      Asssemblage, le propri&eacute;taire et un commentaire pour ce
      wagon. La date de Asssemblage peut &ecirc;tre saisie comme
      une ann&eacute;e &agrave; quatre chiffres, ou dans le format
      de mois-ann&eacute;e.

      <h3>Ajouter</h3>Appuyez sur le bouton "Ajouter" pour entrer
      un nouveau wagon dans votre liste. Si vous avez des wagons
      semblables, vous pouvez choisir un wagon existant en
      utilisant le bouton "Modifier" dans la "fen&ecirc;tre" wagon,
      puis modifier le num&eacute;ro de la ligne du wagon, et tous
      les autres attributs de wagons, suivis par l'appui sur le
      bouton" Ajouter "pour cr&eacute;er un autre wagon pour votre
      liste. Appuyer sur le bouton "Ajouter" provoque
      &eacute;galement la sauvegarde du nouveau wagon. Voir le
      bouton "Enregistrer" ci-dessous.

      <h3>Enregistrer</h3>Appuyez sur "Sauvegarder" pour stocker
      les param&egrave;tres du wagon. Le programme va cr&eacute;er
      un fichier (OperationsCarRoster.xml) dans votre
      r&eacute;pertoire JMRI dans un dossierl appel&eacute;
      "EOperations". Un fichier de sauvegarde avec les derniers
      r&eacute;glages pour l'ensemble de vos wagons est
      &eacute;galement cr&eacute;&eacute; &agrave; chaque fois que
      le bouton "Sauvegarder" est press&eacute;. <a name=
      "EditCarAttributes" id="EditCarAttributes"></a>

      <h3>Modifier Attributs Wagon</h3>&agrave; la droite de chacun
      des attributs de wagon (ligne, le type, Longueur, Couleur,
      Noyau, Charge, Propri&eacute;taire) il y a un bouton
      "&Eacute;diter". Utilisez cette fonction pour ajouter,
      supprimer ou remplacer les attributs disponibles pour une
      wagon.

      <p><img src="images/EditCarAttribute.png"></p>

      <h3>Ajouter Bouton</h3>Pour ajouter un attribut &agrave; un
      nouveau wagon, saisissez le texte souhait&eacute; dans la
      zone de texte et appuyez sur le bouton "Ajouter". Lorsque
      vous entrez un attribut pour un nouveau wagon il apparaitra
      au d&eacute;but de la liste. Plus tard, lorsque vous
      red&eacute;marrerez le programme, ils seront tri&eacute;s
      dans l'ordre correct.

      <h3>Bouton Supprimer</h3>Pour supprimer un attribut de wagon,
      s&eacute;lectionnez l'attribut que vous souhaitez supprimer
      dans la la bo&icirc;te du menu et appuyez sur le bouton
      "Supprimer".

      <h3>Remplacer le bouton</h3>Si vous avez besoin de changer un
      attribut sp&eacute;cifique du wagon (ligne, type, couleur,
      etc) dans votre liste enti&egrave;re de wagons, vous pouvez
      utiliser le bouton "Remplacer" qui se trouve en bas &agrave;
      droite de la fen&ecirc;tre d'&eacute;dition d'attributs
      wagon. Par exemple, si vous souhaitez changer l'attribut nom
      de ligne du wagon "UP" &agrave; "UPS" pour tous vos wagons.
      Appuyez sur le bouton "&Eacute;diter" pour chacun de vos
      wagons dans la fen&ecirc;tre de wagons, puis appuyez sur le
      bouton "&Eacute;diter" en face de la ligne dans la
      fen&ecirc;tre "Modifier wagon" . Entrez la nouvelle ligne
      "UPS" dans la bo&icirc;te de texte, s&eacute;lectionnez "UP"
      dans la bo&icirc;te de menu , et appuyez sur "Remplacer".
      Tous les wagons avec "UP" comme itin&eacute;raire auront
      d&eacute;sormais "UPS" comme nom de ligne. <a name=
      "EditCarLoads" id="EditCarLoads"></a>

      <h3>Modifier Charge Wagon</h3>Pour modifier la charge d'un
      wagon, appuyez sur le bouton "&Eacute;diter" charge dans la
      fen&ecirc;tre Modifier Wagon .

      <p><img src="images/EditCarLoads.png"></p>

      <p>En plus de d'Ajouter, Supprimer et Remplacer les boutons
      et les champs d&eacute;crits ci-dessus dans <a href=
      "#EditCarAttributes">Modifier Attributs Wagon</a> , la
      fen&ecirc;tre modifier charges Wagon vous permet de
      d&eacute;finir la priorit&eacute; de la charge. La valeur par
      d&eacute;faut de la priorit&eacute; est faible et vous pouvez
      changer la priorit&eacute; &agrave; &eacute;lev&eacute;e pour
      un type et une charge pour un wagon donn&eacute; . Des
      charges &eacute;lev&eacute;es de wagons prioritaires sont
      normalement desservies avant la faible priorit&eacute;. Utile
      si vous avez besoin d'obtenir que votre frigorifique
      charg&eacute; de fruits soit au march&eacute; d&egrave;s que
      possible!</p>Modifier

      <p>Vous pouvez &eacute;galement fournir des messages en
      option pour vos op&eacute;rateurs bas&eacute;s sur le type et
      la charge du wagon. Les messages peuvent &ecirc;tre utiles si
      vous avez des charges de wagon visibles qui doivent
      &ecirc;tre ajout&eacute;s ou supprim&eacute;s par vos
      op&eacute;rateurs.</p><a name="CarsSet" id="CarsSet"></a>

      <h3>D&eacute;finir Wagon</h3>Apr&egrave;s la cr&eacute;ation
      d'un wagon, vous pouvez d&eacute;finir l'emplacement du
      wagon, et &eacute;ventuellement la destination du wagon et le
      train en utilisant le bouton "Param&eacute;trage"
      trouv&eacute; pour chaque wagon dans la fen&ecirc;tre
      <a href="#Cars">Wagon</a> . Normalement la destination du
      wagon et et le train affect&eacute; sont
      g&eacute;n&eacute;r&eacute;s par le programme, mais vous
      pouvez utiliser ces champs pour forcer un wagon &agrave; un
      endroit pr&eacute;cis en utilisant un train
      sp&eacute;cifi&eacute;.

      <p>Vous pouvez &eacute;galement supprimer un wagon qui a
      &eacute;t&eacute; attribu&eacute; &agrave; un train en
      appuyant simplement sur le bouton "Sauvegarder". Vous pouvez
      &eacute;galement ajouter un un wagon &agrave; un train
      d&eacute;j&agrave; assembl&eacute; qui n'a pas quitt&eacute;
      son premier emplacement. S&eacute;lectionnez une destination
      et le train pour le wagon, puis appuyez sur le bouton
      "Enregistrer".voie</p>

      <p><img src="images/SetCarLocation.png"></p>

      <p>Dans le coin sup&eacute;rieur droit de la fen&ecirc;tre
      D&eacute;finir Wagon il y a une case "Lieu inconnu". Cocher
      la case lieu inconnu fait plusieurs choses. D'abord le
      programme ignorera le wagon lors de l'assemblage de nouveaux
      trains. Deuxi&egrave;mement, sur les manifestes et les listes
      de man&oelig;uvres, le programme donnera la liste de tous les
      wagons &eacute;gar&eacute;s. Maintenant, vos
      op&eacute;rateurs peuvent vous aider &agrave; trouver les
      wagons qui sont <a href=
      "#MisplacedCarsComment">&eacute;gar&eacute;s</a> . Et enfin,
      lorsque cette case est coch&eacute;e, les autres champs de la
      fen&ecirc;tre emplacement d&eacute;fini du wagon sont
      d&eacute;sactiv&eacute;s.</p>

      <p>La case "Hors service" quand elle est
      s&eacute;lectionn&eacute;e indique au programme d'ignorer le
      wagon lors de l'assemblage de nouveaux trains. De nombreux
      op&eacute;rateurs ont une voie RIP (r&eacute;paration sur
      Place) et utilisent cette fonction pour maintenir le wagon
      l&agrave; jusqu'&agrave; ce que les r&eacute;parations aient
      &eacute;t&eacute; faites.</p>

      <p>Utilisez l'ensemble de champ "Lieu" pour placer la wagon
      sur le r&eacute;seau. Utilisez la case "Auto" pour montrer
      les voies valides pour un endroit donn&eacute;. Vous pouvez
      &eacute;galement entrer l'emplacement et la voie
      o&ugrave;vous voulez que le wagonrevienne quand l'&eacute;tat
      de charge de la wagon est vide. Notez que le changement
      manuel de l'&eacute;tat de charge &agrave; vide ne provoque
      pas le retour Quand destination Vide (RWE) deviendra actif,
      seulement lorsque le wagon est d&eacute;pos&eacute; par le
      programme quandla destination RWE devient active.</p>

      <p>Vous pouvez &eacute;galement modifier la charge du wagon
      ou cr&eacute;&eacute;er de nouvelles en utilisant le bouton
      "Editer".</p>

      <p>Les trois prochains ensemble de champs sont normalement
      fix&eacute;s par le programme lors de l'assemblage des
      trains. Nous allons vous expliquer comment ils travaillent si
      vous &ecirc;tes int&eacute;ress&eacute;s par le
      fonctionnement du programme ou si vous voulez
      r&eacute;&eacute;crire manuellement le programme. Le premier
      est l'ensemble "Destination" du menu d&eacute;roulant . Par
      d&eacute;faut, les champs de destination sont
      d&eacute;sactiv&eacute;s. Dans "Outils" il ya une option pour
      activer les champs de destination. .</p>

      <p>Le "Destination" est le prochain endroit o&ugrave; le
      wagon sera livr&eacute;. La destination doit &ecirc;tre
      accessible par un seul train depuis l'emplacement actuel du
      wagon ou le wagon ne sera pas desservi. Normalement, nous
      vous recommandons de ne pas utiliser la "Destination" des
      menus d&eacute;roulants pour transmettre un wagon &agrave; un
      endroit, mais l'utilisation de la "destination finale", comme
      d&eacute;crit ci-dessous. Toutefois, si vous ajoutez
      manuellement un wagon &agrave; un train assembl&eacute;, vous
      devez d&eacute;finir la destination et la voie du wagon.</p>

      <p>Le dernier champ est la mission du train. Si vous
      souhaitez sp&eacute;cifier une destination pour le wagon ou
      le train, il les placera avant que vous n'assembliez vos
      trains.</p>

      <p>Lorsque du r&eacute;glage manuel de la destination, vous
      n'avez pas &agrave; sp&eacute;cifier une voie. Et quand vous
      choisissez manuellement une destination qui est une coulisse,
      vous ne devez jamais choisir une voie de destination, laisser
      le programme le faire pour vous sauf si vous ajoutez un wagon
      &agrave; un train d&eacute;j&agrave;
      assembl&eacute;.</p><a name="SetCars" id="SetCars"></a>

      <h3>D&eacute;finition des wagons</h3>Si vous voulez changer
      l'emplacement, les destinations, le statut, ou le train
      affect&eacute; pour un groupe de wagons, utilisez l'outil
      "D&eacute;finir Wagons" qui trouve sous "Outils" dans la
      fen&ecirc;tre <a href="#Cars">Wagons</a> . L'outil fonctionne
      de la m&ecirc;me mani&egrave;re que l'emplacement <a href=
      "#CarsSet">D&eacute;finir Wagon</a> comme d&eacute;crit
      ci-dessus, sauf que plusieurs wagons sont modifi&eacute;s.
      S&eacute;lectionnez les wagons que vous souhaitez changer
      dans le tableau, puis s&eacute;lectionnez "D&eacute;finition
      Auto". Le premier wagon s&eacute;lectionn&eacute; devient la
      valeur par d&eacute;faut, et si vous appuyez sur le bouton
      "Modifier", tous les autres wagons s&eacute;lectionn&eacute;s
      auront les m&ecirc;mes param&egrave;tres que le wagon par
      d&eacute;faut. Veillez &agrave; appuyer sur "Sauvegarder"
      dans la fen&ecirc;tre de wagons si vous voulez conserver vos
      modifications.

      <h3>Outils</h3>Le menu "Outils" wagons vous permet
      d'effectuer quelques fonctions utiles pour votre liste de
      wagons. En plus de "Importer depuis un fichier"
      fonctionnalit&eacute; d&eacute;crite
      pr&eacute;c&eacute;demment, vous pouvez &eacute;galement
      exporter vos wagons dans un fichier de valeurs
      s&eacute;par&eacute;es par une virgule. La fonction "Exporter
      vers un fichier" cr&eacute;e un fichier nomm&eacute;
      "ExportOperationsCarRoster.csv" dans le r&eacute;pertoire
      JMRI-&gt; operations. Vous pouvez supprimer tous les wagons
      dans votre liste en utilisant le bouton option "Supprimer
      tous les wagons."

      <p>Le bouton "R&eacute;initialiser compter mouvement tous les
      wagons" remets &agrave; z&eacute;ro le compteur de mouvements
      de tous les wagons. En utilisation normale, vous ne devriez
      jamais r&eacute;initialise les compteurs de mouvements. Le
      programme utilise compteur pour d&eacute;terminer quels
      wagons ont du mal &agrave; trouver des voies de destination
      valides. Les wagons avec un faible nombre de mouvement
      finalement obtiennent une plus grande priorit&eacute; sur les
      wagons avec un grand nombre de mouvements. En servant en
      premier les wagons avec le nombre le plus bas, les wagon se
      d&eacute;placant difficilement finissent par &ecirc;tre
      d&eacute;plac&eacute;s par le programme. La
      R&eacute;initialisation des mouvements du wagon d&eacute;joue
      cet algorithme. La seule raison valable pour la
      r&eacute;initialisation de votre compteur, c'est quand vous
      ajoutez de nouveaux wagons &agrave; votre liste et vous ne
      voulez pas que vos nouveaux wagons aient la priorit&eacute;
      sur les wagons anciens. Cependant, dans la plupart des cas,
      les gens veulent voir les nouveaux wagons cieculer dans le
      premier train en dehors de la ville, aussi ne pas
      r&eacute;initialiser lecompteur si vous voulez mettre vos
      nouveaux ajouts imm&eacute;diatement au travail!</p>Vous
      pouvez &eacute;galement pr&eacute;visualiser et imprimer
      votre liste de wagon. L'aper&ccedil;u et les fonctions
      d'impression utilisent le m&ecirc;me boutons radio "Trier
      par" la fen&ecirc;tre du wagon. L'un des tri les plus utiles,
      c'est par "Emplacement", ce qui vous permet de
      v&eacute;rifier rapidement l'emplacements de vos wagon avant
      ou apr&egrave;s une s&eacute;ance d'exploitation.

      <p>Vous pouvez si vous le d&eacute;sirez seulement avoir un
      aper&ccedil;u ou wagons d'imprer les wagons pour un
      emplacement ou une voie sp&eacute;cifique. Dans les
      fen&ecirc;tres "Editer Emplacement" et "Editer Voie" le menu
      "Outils" offre une s&eacute;lection "Montrer Wagons" qui fera
      appara&icirc;tre la fen&ecirc;tre "Wagons", mais seulement la
      liste des wagons &agrave; cet endroit ou sur la voie.
      Utilisez l'impression de la liste ou la fonctions de
      pr&eacute;visualisation de la fen&ecirc;tre "wagons" pour
      imprimer une liste des wagons &agrave; cet endroit ou sur la
      voie.</p><a name="Locomotives" id="Locomotives"></a>

      <h2>Locomotives</h2>La fen&ecirc;tre de locomotives vous
      permet d'&eacute;diter votre liste de locomotive. Vous pouvez
      entrer un num&eacute;ro de locomotive, sa itin&eacute;raire,
      son mod&egrave;le, son type et sa longueur. Vous pouvez
      &eacute;ventuellement ajouter la date de la Asssemblage et le
      propri&eacute;taire. Si vous voulez qu'un groupe de
      locomotives soit assign&eacute; comme une unit&eacute;, vous
      pouvez cr&eacute;er un "couplage". Le type de locomotive est
      utilis&eacute; par le programme afin de d&eacute;terminer
      o&ugrave; les locomotives sont ramass&eacute;es et/ou
      stock&eacute;es &agrave; divers endroits sur votre
      r&eacute;seau. Certaines locomotives sont par d&eacute;faut
      de types soit &eacute;lectriques, diesel, turbine &agrave;
      gaz ou &agrave; vapeur.

      <p><img src="images/Locomotives.png"></p><a name=
      "ImportLocomotives" id="ImportLocomotives"></a>

      <h3>Importer Locomotives</h3>Si vous avez d&eacute;j&agrave;
      une liste de locomotives dans votre liste JMRI ou dans un
      base de donn&eacute;es, vous pouvez importer les locomotives
      dans le programme. Pour obtenir votre locomotive &agrave;
      partir de votre liste JMRI, s&eacute;lectionnez "Importer
      &agrave; partir de Liste JMRI" du menu Outils Outils-&gt;
      Exploitation&gt; Locomotives-&gt; . Seules les locomotives
      qui n'existent pas seront ajout&eacute;es &agrave; la liste
      de locomotive du programme. De cette fa&ccedil;on, vous
      pouvez utiliser cet outil tout moment vous ajoutez &agrave;
      votre liste de locomotives des locomotives JMRI. La liste de
      locomotive JMRI n'a pas le champ de longueur, donc une
      longueur par d&eacute;faut est entr&eacute;e pour vous. Vous
      devrez corriger la longueur de la locomotive si vous voulez
      que le programme calcule correctement vos longueurs de train.

      <h3>Importer Locomotives partir d'un
      Fichier</h3>L'importation depuis la fonction fichier
      n&eacute;cessite un fichier texte ASCII, avec une ligne pour
      chaque locomotive. L'importation de locomotive
      n&eacute;cessite quatre attributs et dans l'ordre ,le
      num&eacute;ro de la locomotive, le nom de ligne, le
      mod&egrave;le, et la longueur. Ces quatre attributs sont
      requis pour que l'importation se fasse correctement. Ce qui
      suit montre deux exemples de bon format:

      <p>236 UP RS4 40<br>
      5578 SP SW1200 42</p>

      <p>Chaque ligne peut commencer par un espace et des espaces
      multiples entre champs est correct. En option, vous pouvez
      inclure des attributs suppl&eacute;mentaires dans l' ordre
      suivant, le nom du propri&eacute;taire, date de Asssemblage,
      et l'emplacement. L'emplacement peut avoir deux domaines, le
      nom du lieu suivi par un embranchement ou triage &agrave;
      l'emplacement s&eacute;par&eacute;s par un tiret. Le tableau
      suivant montre deux exemples de format correct:</p><br>
      236 UP RS4 40 &agrave; 1930 Home Town
      &Eacute;tats-Unis-Terminal Machines<br>
      5578 SP SW1200 42 DB 1934 York-York Garage Machine

      <p>Si vous pr&eacute;f&eacute;rez utiliser des virgules comme
      d&eacute;limiteurs au lieu des espaces, utilisez un fichier
      avec une extension .csv ou placer le mot "comma" au
      d&eacute;but de votre fichier d'importation et utiliser des
      virgules au lieu des espaces. Voici deux exemples
      d'importation de locomotives avec des virgules comme
      d&eacute;limiteurs .</p><br>
      comma

      <p>236, UP, RS 4,40, AT, 1930, Home Town Etats-Unis,-,
      Terminal Machines<br>
      5578, SP, SW 1200,42, DB, 1934, ville de York,-, York Garage
      Machine</p>

      <p>Vous devez &ecirc;tre tr&egrave;s pruembranchement avec
      les espaces lors de l'importation d'un fichier
      d&eacute;limit&eacute; par des virgules . Le programme
      comprendra les espaces avant et arri&egrave;re entre les
      virgules si ils existent .</p>

      <p>Pour importer un fichier, utilisez le menu "Outils" dans
      le coin sup&eacute;rieur gauche du menu Outils-&gt;
      Exploitation&gt; Locomotives. S&eacute;lectionnez
      "Outils-&gt; Liste-&gt; Importer. Notez que le programme ne
      fera qu'ajouter des locomotives qui n'existent pas dans liste
      de locomotive du programme. Si la locomotive existe
      d&eacute;j&agrave;, elle sera ignor&eacute;e par le
      programme.</p>

      <p>Apr&egrave;s avoir import&eacute; vos locomotives, vous
      devez les enregistrer si vous voulez les garder comme partie
      de votre liste. Appuyez sur le bouton "Sauvegarder"
      situ&eacute; au bas de la fen&ecirc;tre Locomotives, ou
      s&eacute;lectionnez une locomotive en appuyant sur le bouton
      &Eacute;dition et appuyez sur le bouton "Sauvegarder" qui
      peut &ecirc;tre trouv&eacute; en bas &agrave; droite de la
      fen&ecirc;tre "&Eacute;dition Locomotive ".</p><a name=
      "LocomotivesAdd" id="LocomotivesAdd"></a>

      <h3>Ajouter Locomotives &agrave; votre liste</h3>Pour ajouter
      manuellement une locomotive &agrave; votre liste, appuyez sur
      le bouton "Ajouter" situ&eacute; au bas de la fen&ecirc;tre
      "Locomotive". S&eacute;lectionnez ensuite la ligne pour la
      locomotive. Si la ligne d&eacute;sir&eacute;e n'existe pas,
      appuyez sur le bouton "&Eacute;diter" en face de la
      bo&icirc;te de menu s&eacute;lectionner ligne. Cela vous
      permettra d'ajouter une nouvelle ligne ou de supprimer toutes
      celles dont vous n'avez pas besoin. Maintenant, entrez le
      num&eacute;ro de la locomotive, le mod&egrave;le, le type, la
      longueur et la puissance. La puissance de la locomotive, le
      poids de la locomotive, et la pente de la voie qui sera
      utilis&eacute;e par le programme pour calculer combien de
      locomotives seront n&eacute;cessaires lorsque vous utilisez
      l'option "automatique" lors de l'assemblage des trains.

      <p>Maintenant d&eacute;finir l'emplacement de la locomotive
      sur le r&eacute;seau. Si la locomotive n'est pas sur le
      r&eacute;seau , laisser l'emplacement vide. Si voulez que
      cette locomotive fasse partie d'un couplage, appuyez sur
      "Modifier" en face de "couplage" et entrez le nom d'un
      couplage . Ensuite, s&eacute;lectionnez le nom du couplage
      dans la zone de menu. Enfin vous pouvez &eacute;ventuellement
      entrer la date de la Asssemblage, le propri&eacute;taire et
      commentaires pour cette locomotive.</p><a name=
      "LocomotiveModels" id="LocomotiveModels"></a>

      <h3>Mod&egrave;les de locomotive</h3>Le programme vous permet
      d'organiser vos locomotives par mod&egrave;le. Chaque
      mod&egrave;le peut n'avoir qu'un seul type de locomotive,
      longueur, poids et puissance nominale qui lui sont
      associ&eacute;s. Par exemple, si vous attribuez le nom de
      mod&egrave;le "RS11" &agrave; un ensemble de locomotives,
      lorsque vous modifiez la longueur de l'un des "RS11", la
      longueur sera &eacute;galement changer pour les autres.

      <h3>Enregistrer</h3>Appuyez sur "Enregistrer" pour stocker
      les param&egrave;tres de la locomotive. Le programme va
      cr&eacute;er un fichier (OperationsEngineRoster.xml) dans
      votre r&eacute;pertoire JMRI dans un dossier appel&eacute;
      "Exploitationns". Un fichier de sauvegarde avec les derniers
      r&eacute;glages pour toutes vos locomotives est
      &eacute;galement cr&eacute;&eacute; chaque fois que le bouton
      "Sauvegarder" est press&eacute;. <a name="LocomotivesSet" id=
      "LocomotivesSet"></a>

      <h3>D&eacute;finir Locomotive</h3>Apr&egrave;s la
      cr&eacute;ation d'une locomotive, vous pouvez d&eacute;finir
      l'emplacement de la locomotive et, &eacute;ventuellement, la
      destination et le train de la locomotive. Normalement, la
      destination de la locomotive et le train affect&eacute;, sont
      g&eacute;n&eacute;r&eacute;s par le programme, mais vous
      pouvez utiliser ces champs pour forcer une locomotive
      &agrave; un endroit pr&eacute;cis pour un train
      sp&eacute;cifi&eacute;. <a name="SynchronizeWithNCEConsists"
      id="SynchronizeWithNCEConsists"></a>

      <h3>Synchroniser avec des Couplages NCE</h3>Si vous utilisez
      une NCE comme centrale DCC, vous pouvez avec le programme
      synchroniser vos num&eacute;ros de couplage avec vos
      locomotives. Le programme va lire toutes les couoplages du
      syst&egrave;me NCE, puis va chercher les locomotives
      correspondantes dans votre liste Exploitation. Le programme
      attribuera le nom de couplage nce_xxx o&ugrave; xxx est le
      num&eacute;rodu couplage. Pour synchroniser vos couplage,
      s&eacute;lectionnez "Synchroniser avec couplage NCE" sous le
      menu "Outils". <a name="Routes" id="Routes"></a>

      <h2>Itin&eacute;raires</h2>Un itin&eacute;raire est une liste
      d'emplacement o&ugrave; le train va passer. Plus tard, vous
      pouvez d&eacute;cider si le train s'arr&ecirc;te &agrave; un
      endroit pour man&oelig;uvrer. Les itin&eacute;raires peuvent
      &ecirc;tre de point &agrave; point ou aller et retour. Pour
      asssembler un itin&eacute;raire, s&eacute;lectionnez
      "Outils-&gt; Exploitation&gt; Itin&eacute;raires". La
      fen&ecirc;tre Itin&eacute;raires fournit &eacute;galement le
      statut de l'itin&eacute;raire, par exemple, "Orphelin"
      d&eacute;signe un itin&eacute;raire qui n'a pas
      &eacute;t&eacute; affect&eacute; &agrave; un train.

      <p><img src="images/Routes.png"></p>

      <p>Puis appuyez sur la bouton "Ajouter" situ&eacute; au bas
      de la fen&ecirc;tre.</p>

      <p><img src="images/EditRoute.png"></p>

      <p>Entrez le nom de l'itin&eacute;raire et un commentaire
      facultatif. Ce commentaire est montr&eacute; dans la
      fen&ecirc;tre itin&eacute;raire et <a href=
      "#ManifestComments">optionnellemnt</a> sur votre manifeste.
      Chaque itin&eacute;raire doit avoir un nom unique. Puis
      appuyez sur le bouton "Ajouter Itin&eacute;raire "
      situ&eacute; au bas de la fen&ecirc;tre. Maintenant,
      s&eacute;lectionnez l'emplacement d'o&ugrave; le train
      partira en s&eacute;lectionnant l'emplacement dans la
      bo&icirc;te de menu situ&eacute;e sur le c&ocirc;t&eacute;
      inf&eacute;rieur gauche de la fen&ecirc;tre. Appuyez sur
      "Ajouter un emplacement". Maintenant construisez votre
      itin&eacute;raire en s&eacute;lectionnant l'emplacement
      suivant o&ugrave; le train va passer, s&eacute;lectionnez
      tous les endroits o&ugrave; le train passera, m&ecirc;me si
      le train ne man&oelig;uvre pas &agrave; l'emplacement. De
      cette fa&ccedil;on, le conducteur de votre train va savoir
      &agrave; la lecture de son manifeste dans quelles villes il
      se rendra . Chaque fois que vous ajoutez un emplacement sur
      l' itin&eacute;raire, le tableau montre l'ordre dans lequel
      le train va les visiter. Vous pouvez d&eacute;placer un
      emplacement, le monter ou le descendre dans la
      s&eacute;quence si n&eacute;cessaire.</p><a name="EditRoute"
      id="EditRoute"></a>

      <h3>Modifier l'itin&eacute;raire</h3>Chaque emplacement a une
      direction pour le train au d&eacute;part, le nombre de wagon
      qui se d&eacute;placent, et si lescollectes ou les livraisons
      de wagons sont autoris&eacute;s &agrave; cet emplacement. Un
      mouvement de wagon peut &ecirc;tre un wagon collect&eacute;
      ou un wagon livr&eacute; &agrave; cet endroit. Par exemple, 5
      mouvements peuvent &ecirc;tre 5 collectes, ou 5 livraisons,
      ou toute combinaison de 5 collectes ou de livraisons
      ensemble. Prendre ou d&eacute;poser un groupe de wagons ou un
      <a href="#Kernel">noyau</a> repr&eacute;sente un
      mouvement.Pour modifier le nombre de mouvements pour un
      emplacement, cliquez directement sur la cellule dans la table
      de routage. Lorsque vous entrez le nombre
      d&eacute;sir&eacute; de wagon se d&eacute;place, saisir des
      chiffres raisonnables qui refl&egrave;tent ce que vous voulez
      que le programme fasse pour vous. Par exemple, si vous voulez
      que votre train parte avec 15 wagons, alors 15 est la valeur
      correcte pour vos mouvements au d&eacute;part de
      l'itin&eacute;raire. A la fin de la itin&eacute;raire, si
      vous voulez 12 wagons dans le train quand il s'arr&ecirc;te,
      puis 12 est la bonne valeur pour le nombre de mouvement pour
      le dernier emplacement dans la voie de votre train.

      <p>Si vous voulez retarder le d&eacute;part du train &agrave;
      partir d'un lieu ou 'augmenter le temps de parcours du train,
      entrez le nombre de minutes souhait&eacute; dans la cellule
      "d'attente". Un autre choix est de pr&eacute;ciser l'heure de
      d&eacute;part du train &agrave; partir d'un emplacement en
      s&eacute;lectionnant le bouton radio "Heure de D&eacute;part"
      dans le coin inf&eacute;rieur droit de la fen&ecirc;tre de
      modification d'itin&eacute;raire.voie</p>

      <p>Vous pouvez &eacute;galement ajuster <a href=
      "#MaximumTrainLength">la longueur maximale des trains</a>
      utilisant <a href="#UnitOfLength">(Pieds ou
      M&egrave;tres)</a> qui partent de chaque emplacement La pente
      est utilis&eacute;e pour d&eacute;terminer le nombre de
      locomotives dont le train a besoin pour ce
      tron&ccedil;on.</p>

      <p>Les X et Y sont les coordonn&eacute;es sur le panneau de
      votre r&eacute;partiteur pour l'ic&ocirc;ne du Train en
      option. Vous pouvez d&eacute;finir les coordonn&eacute;es
      ici, en utilisant l'outil <a href=
      "#SetTrainIconCoordinates">D&eacute;finir Coordonn&eacute;es
      de l'Ic&ocirc;ne du Train</a> , ou en utilisant la fonction
      "d&eacute;finir X &amp; Y" de l'ic&ocirc;ne du train du menu
      contextuel pour renseigner le programme o&ugrave; vous voulez
      que l'ic&ocirc;ne du train soit plac&eacute;e lorsque le
      train est &agrave; l'emplacement sp&eacute;cifi&eacute;.
      Laissez les coordonn&eacute;es X et Y &agrave; z&eacute;ro si
      vous voulez d&eacute;placer manuellement l'ic&ocirc;ne ou que
      vous n'utilisez pas la fonction de l'ic&ocirc;ne.</p><a name=
      "RouteComment" id="RouteComment"></a>

      <p>Chaque lieu de l'itin&eacute;raire peut aussi avoir un
      commentaire optionnel qui appara&icirc;tra sur le manifeste
      du train. Appuyez sur le bouton "Ajouter" sous la rubrique
      "Commentaire" pour ajouter un commentaire &agrave; un
      emplacemen.</p>

      <h3>Sauvegarde de l'Itin&eacute;raire</h3>Appuyez sur
      "Sauvegarder l'itin&eacute;raire" pour sauvegarder votre
      itin&eacute;raire. Le programme va cr&eacute;er un fichier
      (Operationsitin&eacute;raireRoster.xml) dans votre
      r&eacute;pertoire JMRI dans un dossier appel&eacute;
      "operations". Un fichier de sauvegarde avec les derniers
      param&egrave;tres de tous vos itin&eacute;raires est
      &eacute;galement cr&eacute;&eacute; &agrave; chaque fois que
      l'option "Enregistrer l'itin&eacute;raire" est
      enfonc&eacute;e. <a name="CopyRoute" id="CopyRoute"></a>

      <h3>Copiez Itin&eacute;raire</h3>Dans la fen&ecirc;tre
      Itin&eacute;raire s&eacute;lectionnez "Outils-&gt; Copier
      Itin&eacute;raire" pour faire une copie de votre
      itin&eacute;raire. Entrez le nom du nouvel itin&eacute;raire
      et s&eacute;lectionner l'itin&eacute;raire que vous voulez
      copier. Si vous souhaitiez que l'itin&eacute;raire soit
      invers&eacute; cocher la case "Inverser" . <a name=
      "PassengerTrainRoute" id="PassengerTrainRoute">voie</a>

      <h3>Itin&eacute;raire Train Passager</h3>Normalement, les
      trains de voyageurs fonctionnent sur un horaire bas&eacute;
      sur les heures de d&eacute;part. Si vous voulez que vos
      manifestes affichent les heures de d&eacute;part de votre
      train, cr&eacute;er un itin&eacute;raire dans lequel vous
      sp&eacute;cifiez l'heure de d&eacute;part &agrave; chaque
      emplacement. Dans le coin inf&eacute;rieur droit de la
      fen&ecirc;tre "Editer itin&eacute;raire", s&eacute;lectionnez
      "Heure de d&eacute;part" dans la zone d'affichage.
      Maintenant, s&eacute;lectionnez l'heure de d&eacute;part pour
      chaque emplacement dans l'itin&eacute;raire du train. La
      d&eacute;claration du manifeste "Pas de travail au xxx" n'est
      pas appropri&eacute; pour un train de voyageurs. Pour
      &eacute;liminer cette d&eacute;claration, il suffit d'ajouter
      un commentaire &agrave; chaque emplacement dans
      l'itin&eacute;raire du train. Utilisez la fen&ecirc;tre de
      modification d'itin&eacute;raire et, pour chaque emplacement,
      vous pouvez ajouter un commentaire ou modifier un existant.
      <a name="RouteFeatures" id="RouteFeatures"></a>

      <h3>Fonctionnalit&eacute;s Itin&eacute;raire</h3>Une
      fonctionnalit&eacute; tr&egrave;s puissante de
      itin&eacute;raires est la possibilit&eacute; de
      sp&eacute;cifier les m&ecirc;mes emplacements plus d'une
      fois. Lorsque le m&ecirc;me nom de lieu est utilis&eacute; au
      retour, le manifeste du train sera imprim&eacute; comme si le
      train est seulement arriv&eacute; et reparti. Notez que les
      noms "Danville", "Danville-1", et "Danville-2" sont tous les
      m&ecirc;mes en ce qui concerne l'impression des listes de
      manifeste et de man&oelig;uvres mais le programme les traite
      comme s'ils &eacute;taient des endroits diff&eacute;rents

      <p>Par exemple, vous pouvez contr&ocirc;ler s'il y a des
      d&eacute;poses ou des ramassages &agrave; tous les
      emplacements dans l'itin&eacute;raire. Par cons&eacute;quent,
      si vous vouliez seulement livrer 3 wagons, vous pouvez
      sp&eacute;cifier une livraison et 3 mouvements. Mais que
      faire si vous vouliez livr&eacute;s 3 wagons et ramasser 7
      wagons. Si vous sp&eacute;cifiez 10 mouvements pour un
      emplacement, ce peut &ecirc;tre n'importe quelle combinaison
      de 10 ramassages et et de livraisons ensemble. En utilisant
      "Danville" comme notre emplacement, nous pouvons dans notre
      itin&eacute;raire pr&eacute;ciser deux "Danville" , dos
      &agrave; dos. Dans le premier "Danville", nous pouvons
      indiquer trois livraisons uniquement. Dans le second
      "Danville" nous pouvons sp&eacute;cifier 7 ramassages
      uniquement. Maintenant, le programme va "essayer" et
      r&eacute;pondre &agrave; votre demande en ramassant
      jusqu'&agrave; 7 wagons et d&eacute;posant jusqu'&agrave; 3
      wagons.</p>

      <p>Autre exemple, le programme ne vous permettra pas d'avoir
      des voies de coulisse et d'autres types de voies
      (embranchements, chantiers, &eacute;changes) au m&ecirc;me
      endroit. Mais en utilisant les noms ci-dessus, on pourrait
      attribuer le chantier et l'embranchement &agrave; "Danville",
      et puisque "Danville-1" est le dernier emplacement ou le
      premier d'un itin&eacute;raire, attribuer la coulisse
      &agrave; "Danville-1". Maintenant, quand le train
      s'arr&ecirc;te &agrave; Danville, la cour et l'embranchements
      sont desservis, et puis le train se termine en coulisse
      &agrave; "Daville-1".</p>

      <p>Autre exemple. Disons que nous avons un train grande ligne
      qui dessert Danville. &agrave; Danville, nous avons un garage
      et plusieurs embranchements. Nous voulons que le train grande
      ligne desserve le garage de Danville, mais pas les
      embranchements. Nous ne voulons pas utiliser de loco de
      man&oelig;uvre pour desservir les embranchements de Danville.
      Cependant, nous voulons qu'un service local les desserve!
      Nous devons dire au programme quelles voies sont desservies
      et par quels trains &agrave; Danville.</p>

      <p>Solution, nous cr&eacute;ons un triage &agrave;
      "Danville", et cr&eacute;ons les embranchements dans
      "Danville-1". Le train de grande ligne a "Danville" dans son
      itin&eacute;raire. La section locale dessert "Danville" et
      "Danville-1". Maintenant, le dilemme, faire la desserte
      locale "Danville-1" ou "Danville" en premier? Pas de
      probl&egrave;me, nous cr&eacute;ons un itin&eacute;raire pour
      le service locale "Danville-1", puis "Danville", et puis
      "Danville-1". Lors du premier "Danville-1", nous demandons
      seulement des ramassages dans les embranchements, &agrave;
      "Danville", nous sp&eacute;cifions &agrave; la fois
      ramassages et livraisons dans le triage , et lors de la
      deuxi&egrave;me "Danville-1", nous pr&eacute;cisons les
      d&eacute;poses seules.</p>

      <p>Une autre solution consiste &agrave; utiliser simplement
      la capacit&eacute; de l'embranchement pour
      s&eacute;lectionner les trains qui peuvent desservir la
      voie.</p><a name="SetTrainIconCoordinates" id=
      "SetTrainIconCoordinates"></a>

      <h3>D&eacute;finir les Coordonn&eacute;es d'Ic&ocirc;ne de
      Train</h3>Utilisez cet outil pour d&eacute;finir les
      coordonn&eacute;es X et Y par d&eacute;faut de vos
      ic&ocirc;nes de train pour chaque emplacement. L'outil vous
      permet de sp&eacute;cifier les coordonn&eacute;es de
      l'ic&ocirc;ne bas&eacute;e sur l'orientation du train. Vous
      pouvez &eacute;galement mettre &agrave; jour tous vos
      itin&eacute;raires existants et lieux avec ces nouvelles
      coordonn&eacute;es. Comme alternative, vous pouvez utiliser
      un "Outils-&gt; D&eacute;finir Coordonn&eacute;es des
      Ic&ocirc;nes du Train pour cet itin&eacute;raire" pour
      cr&eacute;er des coordonn&eacute;es uniques pour un trajet
      pr&eacute;cis. <a name="Trains" id="Trains"></a>

      <h2>Trains</h2>Maintenant que nous avons cr&eacute;&eacute;
      notre itin&eacute;raire nous avons besoin que les trains
      bougent les wagons! Cr&eacute;er un train en
      s&eacute;lectionnant "Outils-&gt; Exploitation&gt; Trains"
      dans le menu de premier niveau.

      <p><img src="images/Trains.png"></p>

      <p>La fen&ecirc;tre "Trains" affiche tous vos trains. Pour
      chaque train, il y a une case &agrave; cocher dans la colonne
      "asssembler" utilis&eacute;e pour s&eacute;lectionner les
      trains &agrave; asssembler, &agrave; imprimer et terminer.
      Les boutons en bas de la page asssemberont, imprimeront ou de
      terminerons les trains s&eacute;lectionn&eacute;s. Vous
      pouvez &eacute;galement modifier un train existant en
      utilisant le bouton "&Eacute;diter" pour ce train. Pour
      chaque train il y a aussi un bouton d'action. Vous pouvez
      s&eacute;lectionner l'unE des quatre actions pour votre
      train. L'action "Mouvement" provoque le d&eacute;part d'un
      train assembl&eacute; &agrave; partir de son emplacement
      actuel et passer &agrave; l'emplacement suivant dans
      l'itin&eacute;raire du train. L'action "Conducteur" ouvre une
      fen&ecirc;tre qui fournit le manifeste du train pour chaque
      emplacement dans l'itin&eacute;raire du train. Les deux
      derni&egrave;res actions sont "Terminer" et "R&eacute;init",
      en appuyant sur "Terminer" d&eacute;place un train
      assembl&eacute; &agrave; la derni&egrave;re position dans le
      parcours du train, et ach&egrave;ve le travail confi&eacute;
      au train. "R&eacute;init" est utilis&eacute; pour
      lib&eacute;rer tous les wagons attribu&eacute;s &agrave; un
      train assembl&eacute;. Vous ne pouvez r&eacute;initialiser un
      train qui n'a pas &eacute;t&eacute;
      d&eacute;plac&eacute;.</p>

      <p>Il y a plusieurs cases &agrave; cocher au bas de la
      fen&ecirc;tre des trains. La case "Tout afficher"
      s&eacute;lectionn&eacute;e, montre tous les trains dans votre
      liste. Lorsqu'elle est d&eacute;sactiv&eacute;e, seuls les
      trains qui ont la case "Asssembler"
      s&eacute;lectionn&eacute;e, sont affich&eacute;s. La case
      &agrave; cocher "Messages" lorsqu'elle est
      s&eacute;lectionn&eacute;e pr&eacute;sentera une bo&icirc;te
      de dialogue &agrave; chaque &eacute;chec d'un train &agrave;
      asssembler pour expliquer pourquoi le train n'a pas
      assembl&eacute;. La case "Rapport Assemblage" lorsqu'elle est
      s&eacute;lectionn&eacute;e fournit un rapport
      d&eacute;taillant comment le train a &eacute;t&eacute;
      assembl&eacute; par le programme. Utilisez la fonction
      "Imprimer" ou le bouton "Aper&ccedil;u" pour un train
      assembl&eacute; pour voir le rapport d'assemblage. Le
      programme pr&eacute;voit toujours un bouton "Rapport" dans la
      colonne "Action" pour un train qui ne parvient pas &agrave;
      &ecirc;tre asssembler.</p>

      <p>La case "Aper&ccedil;u" lorsqu'elle est
      s&eacute;lectionn&eacute;e, vous permet de
      pr&eacute;visualiser plut&ocirc;t que d'imprimer le manifeste
      de votre train ou le rapport d'assemblage.</p>

      <p>Un des boutons les plus importants est le bouton "Sauver
      Assemblages". Une fois press&eacute;, le programme enregistre
      tous les fichiers qui ont &eacute;t&eacute; modifi&eacute;s
      par l'assemblage et le d&eacute;placement de vos trainr vos
      trains. L'appui sur ce bouton vous permet d'arr&ecirc;ter le
      programme et de reprendre exactement l&agrave; o&ugrave; vous
      avez quitt&eacute; le programme.</p>

      <p>Appuyez sur le bouton "Ajouter" pour cr&eacute;er un
      train.</p>

      <p><img src="images/EditTrain.png"></p>

      <p>Entrez le nom du train et une description facultative,
      puis appuyez sur le bouton "Ajouter Train". Les deux seront
      affich&eacute;s sur le manifeste du train. Le nom du train
      sera &eacute;galement visible sur l'ic&ocirc;ne train, aussi
      les noms courts sont mieux. S&eacute;lectionnez ensuite
      l'itin&eacute;raire que ce train va suivre. Il y a un bouton
      &Eacute;dition &agrave; droite de l'itin&eacute;raire qui
      vous permet de modifier directement l'itin&eacute;raire
      s&eacute;lectionn&eacute;. Une fois qu'un itin&eacute;raire
      est s&eacute;lectionn&eacute;, une liste de lieux que le
      train visitera devrait appara&icirc;tre. Vous pouvez
      d&eacute;s&eacute;lectionner n'importe quel endroit o&ugrave;
      vous ne voulez pas que le train man&oelig;uvre</p>

      <h3>Mat&eacute;riel Roulant Utilisable</h3>Vous pouvez
      d&eacute;terminer quel type de wagons et de locomotives, le
      train va utiliser. S&eacute;lectionnez le mat&eacute;riel
      roulant que le train utilisera en cliquant sur les cases
      appropri&eacute;es. Une case coch&eacute;e signifie que le
      train va utiliser ce type de mat&eacute;riel roulant.
      <a name="TrainRequires" id="TrainRequires"></a>

      <h3>Requ&ecirc;tes Optionnelles du Train</h3>Vous pouvez
      contr&ocirc;ler le nombre de locomotives qui seront
      assign&eacute;es &agrave; ce train, et &eacute;ventuellement,
      le mod&egrave;le et le nom de ligne de la locomotive. Si vous
      ne voulez pas que le programme affecte de locomotives
      &agrave; votre train, selectionnez 0 comme nombre de locos
      requise. Si vous voulez que deux ou plusieurs locomotives
      soient affect&eacute;es &agrave; un train, les locomotives
      doivent faire partie d'un <a href=
      "#LocomotivesAdd">couplage</a> . Si vous s&eacute;lectionnez
      "Auto", le programme calculera le nombre de locomotives
      requises pour ce train sur la base des poids du train, de la
      pente de la voie, et la puissance des locomotives.

      <p>Vous pouvez aussi exiger un fourgon de queue <a href=
      "#CabooseFredHazardous">ou un wagon avec Fred (dispositif
      clignotant d'extr&eacute;mit&eacute; arri&egrave;re, non
      utilis&eacute; en France)</a> comme dernier wagon dans le
      train, et vous pouvez &eacute;ventuellement sp&eacute;cifier
      le nom de ligne pour le fourgon de queue ou le wagon avec
      Fred. Si vous laissez le nom de la ligne vide, le programme
      va essayer de trouver un fourgon de queue qui a le m&ecirc;me
      nom de ligne que la locomotive.</p><a name="TrainReset" id=
      "TrainReset"></a>

      <h3>R&eacute;initialiser le Train</h3>Le bouton
      "R&eacute;init Train" vous permet de supprimer les
      locomotives et les wagons qui ont &eacute;t&eacute;
      attribu&eacute;s &agrave; un train. Utile quand vous voulez
      essayer de diverses options d'assemblage et de ne pas
      d&eacute;placer physiquement les locomotives et les wagons
      sur le r&eacute;seau.

      <h3>Enregistrer le Train</h3>Appuyez sur "Enregistrer Train"
      pour sauver votre train. Le programme va cr&eacute;er un
      fichier (OperationsTrainRoster.xml) dans votre
      r&eacute;pertoire JMRI dans un dossier appel&eacute;
      "Op&eacute;rations". Un fichier de sauvegarde avec les
      derniers param&egrave;tres de tous vos trains est
      &eacute;galement cr&eacute;&eacute; &agrave; chaque fois que
      le bouton "Enregistrer Train" est press&eacute;. <a name=
      "TrainOptions" id="TrainOptions"></a>

      <h3>Options du Train</h3>Vous pouvez &eacute;ventuellement
      avoir un nom unique de compagnie et un logo pour chaque train
      dans votre liste. Utilisez la fonction "&Eacute;diter
      Train-&gt; Outils-&gt; Options" pour saisir votre Nom de
      Compagnie et son logo. <a name="TrainBuildOptions" id=
      "TrainBuildOptions"></a>

      <h3>Train Options de Asssemblage</h3>Dans la fen&ecirc;tre de
      menu &eacute;dition du train sous la rubrique "Outils-&gt;
      Options d'Assemblage du Train" se trouvent des options
      suppl&eacute;mentaires pour l'asemblage d'un train. Vous
      pouvez contr&ocirc;ler les lignes des wagon, les charge, les
      propri&eacute;taires, et les dates de Asssemblage que le
      train utilisera.

      <p>Vous pouvez &eacute;galement sp&eacute;cifier un
      changement de locomotive en itin&eacute;raire ou d'ajouter
      des locomotives d'assistance.</p>

      <p><img src="images/TrainBuildOptions.png"></p>

      <h3>Options</h3>

      <h4>Utilisez le mode normal lors de l'assemblage de ce
      train</h4>Vous pouvez demander &agrave; ce que le programme
      utilise le mode normal lors de l'assemblage du train. Ceci
      est utile quand un train quitte la coulisse. En mode normal,
      toutes les wagons dans la coulisse sont d&eacute;pos&eacute;s
      d'abord, o&ugrave; en mode agressif, les wagons dans coulisse
      sont d&eacute;pos&eacute;s en dernier. En
      s&eacute;lectionnant cette option lorsque vous avez des
      &eacute;checs d'assemblage hors dela coulisse, elle pourrait
      r&eacute;parer la d&eacute;faillance .

      <h4>Envoyer toutes les wagons collect&eacute;s au
      terminus</h4>Vous pouvez &eacute;galement demander que tous
      les wagons ramass&eacute;s soient envoy&eacute;s au dernier
      emplacement de votre itin&eacute;raire ( terminus). Utile si
      vous ne voulez pas que vos wagons ramass&eacute;s et
      d&eacute;pos&eacute;s &agrave; divers endroits sur le
      parcours de votre train.

      <h4>Permettre aux wagons de revenir &agrave; la coulisse si
      n&eacute;cessaire</h4>Quand un train part et revient au
      m&ecirc;me emplacement de coulisse, c'est
      consid&eacute;r&eacute; comme un tour par le programme. Un
      tour, prend normalement les wagons &agrave; partir de
      coulisse, les pr&eacute;sente sur le trac&eacute;, ramasse
      les wagons neufs et retourne en coulisse avec ces wagons.
      Normalement, le programme ne permet pas aux m&ecirc;mes
      wagons d'aller et revenir en coulisse. Toutefois,
      &ccedil;&agrave; peut &ecirc;tre souhaitable pour permettre
      au train transporter les wagons plut&ocirc;t que d'avoir le
      rapport du programme disant que les wagons dans la coulisse
      ne pouvaient pas &ecirc;tre livr&eacute;s &agrave;
      destination sur le r&eacute;seau. La s&eacute;lection de
      cette option permet un tour pour le transport des wagons vers
      et &agrave; partir du m&ecirc;me emplacement en coulisse.
      Notez que lorsque cette options est
      s&eacute;lectionn&eacute;e, que le programme retournera
      seulement les wagons &agrave; coulisse lorsque les
      destinations ne sont pas disponibles sur le r&eacute;seau.
      Vous pouvez &eacute;galement d&eacute;finir cette optionpour
      tous les tours, voir <a href="#SettingsOptions">Options</a> .

      <h4>Autoriser les mouvements locaux quand un wagon a une
      charge personnalis&eacute;e</h4>Le programme lors de la
      g&eacute;n&eacute;ration des mouvements du wagon normalement
      ne cr&eacute;e pas de mouvements locaux. Un mouvement local
      est un ramassage suivi d'une d&eacute;pose d'un wagon au
      m&ecirc;me endroit. Lorsque vous utilisez des charges sur
      mesure, le programme peut cr&eacute;er des mouvements locaux
      en fonction de la charge personnalis&eacute;e du wagon. Donc,
      si vous aviez une wagon pr&eacute;sent sur une voie avec une
      charge personnalis&eacute;e, et vous avez aussi eu un
      embranchement avec un horaire au m&ecirc;me endroit demandant
      cette charge, le manifeste du train pourrait montrer la
      collecte et la d&eacute;pose un mouvement local. C'est la
      m&ecirc;me chose pour un wagon avec une destination finale
      qui est &agrave; l'emplacement actuel du wagon. Donc, si vous
      ne voulez pas que votre train effectue des mouvements locaux
      quand un wagon a une charge personnalis&eacute;e ou une
      destination finale locale, d&eacute;sactivez cette option .

      <h4>Permettre aux v&eacute;hicules de voyager de l'origine au
      terminus</h4>Normalement, le programme permet aux wagons de
      circuler entre l'emplacement de d&eacute;part du train
      (origine) &agrave; son dernier emplacement (terminus).
      D&eacute;sactivez cette option si vous ne voulez pas que le
      train transporte des wagons de l'origine du train au Terminus
      . <a name="TrainRoadNames" id="TrainRoadNames"></a>

      <h3>Noms de Ligne de Train</h3>Vous pouvez contr&ocirc;ler
      les noms de ligne que le train dessert. S&eacute;lectionnez
      dans le menu " &Eacute;dition Train- &gt; Outils", " Options
      Assemblage Train". Cela fera appara&icirc;tre une nouvelle
      fen&ecirc;tre avec plusieurs options.

      <p>Si le train va desservir n'importe quel nom de ligne,
      s&eacute;lectionnez le bouton radio "Tout Accepter". Si vous
      voulez accepter que certains noms de ligne,
      s&eacute;lectionnez le bouton radio ""Accepter seulement".
      Ensuite, utilisez le menu des noms de ligne et le bouton
      "Ajouter Ligne" pour faire une liste de noms de ligne que le
      train dessert. Pour supprimer un nom de ligne de votre liste,
      s&eacute;lectionnez le nom de la ligne dans le menu et
      cliquez sur le bouton "Supprimer Ligne" .</p>

      <p>Pour construire une liste de noms de ligne que le train ne
      desservira pas, s&eacute;lectionnez le bouton radio
      "Exclure". Utilisez le Menu des noms de ligne et le bouton
      "Ajouter Ligne" pour construire une liste de lignes que ce
      train ne desservira pas.</p>

      <p>Appuyez sur le bouton "Enregistrer Train" pour mettre
      &agrave; jour les options d'assemblage du train et fermer la
      fen&ecirc;tre lorsque votre avez termin&eacute; .</p>

      <h3>Trains Wagon et Charge</h3>Vous pouvez d&eacute;cider
      quel wagon charg&eacute; le train va desservir. Il y a deux
      menus d&eacute;roulants, le premier est le type de wagon, et
      le second le type de charge desservie par le type de wagon
      s&eacute;lectionn&eacute;. Utilisez le bouton "Ajouter
      Charge" pour construire une liste de charges que le train va
      soit desservir soit exclure. Le bouton "Supprimer tout" va
      supprimer toutes les charges de la liste. Vous pouvez
      &eacute;galement associer une charge avec un type de wagon
      particuli&egrave;r, cochez la case " Utiliser le type de
      wagon et charge" si vous souhaitez cette
      fonctionnalit&eacute; .

      <h3>Propri&eacute;taires et Train</h3>Vous pouvez
      d&eacute;cider quels mat&eacute;riel roulant le train
      desservira par nom du propri&eacute;taire. Le contr&ocirc;le
      est similaire &agrave; <a href="#TrainRoadNames">train noms
      de ligne</a> , voir ci-dessus .

      <h3>Train Dates de Asssemblage</h3>Vous pouvez
      contr&ocirc;ler quel mat&eacute;riel roulant le train
      desservira par leur date de Asssemblage. Si vous voulez que
      les locomotives et les wagons construits apr&egrave;s une
      certaine ann&eacute;e, s&eacute;lectionnez le bouton radio
      "Apr&egrave;s" et entrez une ann&eacute;e &agrave; quatre
      chiffres dans la zone de texte. Si vous souhaitez les
      locomotives et les wagons construits avant une certaine
      ann&eacute;e, s&eacute;lectionnez le bouton radio " Avant "
      et entrez une ann&eacute;e &agrave; quatre chiffres dans la
      zone de texte. Et si vous voulez sp&eacute;cifier une
      p&eacute;riode, s&eacute;lectionnez le bouton radio "Range"
      et entrez l'ann&eacute;e avant et l'ann&eacute;e apr&egrave;s
      que vous voulez que le train desserve.

      <h3>Exigences de train option</h3>Vous pouvez avoir
      jusqu'&agrave; deux changements de locomotive pendant que le
      train est en voie . S&eacute;lectionnez l'option " changement
      de locomotive " o&ugrave; vous voulez que le changement se
      produise dans votre itin&eacute;raire, et combien de
      nouvelles locomotives devraient &ecirc;tre affect&eacute;s
      &agrave; la gare . Vous pouvez &eacute;ventuellement
      s&eacute;lectionner le nouveau mod&egrave;le de locomotives
      et de la route . Au lieu du changement de locomotive, les
      locomotives pr&eacute;c&eacute;demment assign&eacute;es
      seront retir&eacute;s du train.

      <p>Le programme vous donne &eacute;galement trois options en
      ce qui concerne le fourgon de queue du train. La
      premi&egrave;re option, " Retirez caboose ", pr&eacute;cisera
      le fourgon de queue si l'on a &eacute;t&eacute;
      affect&eacute; au train. Le train quittera alors
      l'emplacement sp&eacute;cifi&eacute; sans fourgon de queue .
      La deuxi&egrave;me option, " Aucun changement de caboose ",
      soit maintient le wagon de queue si l'on a &eacute;t&eacute;
      affect&eacute; &agrave; la gare, ou le quitte sans fourgon de
      queue s'il n'y avait pas un seul affect&eacute; au train. La
      troisi&egrave;me option, "Changement caboose ",
      pr&eacute;cisera le fourgon de queue si l'on a
      &eacute;t&eacute; affect&eacute; &agrave; la gare, puis
      ajouter un nouveau pour le train. Cette derni&egrave;re
      option devient " Ajouter caboose " si le train roulait sans
      fourgon de queue .</p>

      <p>Vous pouvez &eacute;galement demander des locomotives
      d'appoint pour les longues batailles jusqu'&agrave; la
      colline que votre train peut rencontrer . Le code actuel ne
      fait qu'ajouter un commentaire au manifeste demandant un
      service d'aide &agrave; partir de l'emplacement que vous
      choisissez, et supprime le service d'assistance au second
      emplacement sp&eacute;cifi&eacute; par vous.</p><a name=
      "TrainManifestOptions" id="TrainManifestOptions"></a>

      <h3>Train options manifeste</h3>Vous pouvez
      &eacute;ventuellement avoir un nom de Cie et un logo unique
      pour chaque train de votre liste. Vous pouvez
      &eacute;galement d&eacute;cider si vos manifestes montrent
      les heures de d&eacute;part et d'arriv&eacute;e du train.
      Utilisez "&Eacute;dition Train- &gt; Outils-&gt; Options
      Manifeste" pour d&eacute;finir ces options . <a name=
      "TrainScripts" id="TrainScripts">'</a>

      <h3>Scripts</h3>Si vous voulez lancer un <a href=
      "../../../../html/tools/scripting/index.shtml">script</a>
      quand un train est assembl&eacute;, se d&eacute;place ou se
      termine, s&eacute;lectionnez sous le "&Eacute;diter
      Train-&gt; Outils-&gt; Scripts" . Cela fera appara&icirc;tre
      une nouvelle fen&ecirc;tre avec plusieurs options de script.

      <p>Plusieurs exemples d'op&eacute;rations orient&eacute;es
      scripts sont Inclus dans le <a href=
      "http://jmri.org/jython/operations">r&eacute;pertoire
      jython</a> .</p><a name="TrainShowCarTypesServiced" id=
      "TrainShowCarTypesServiced"></a>

      <h3>Voir les types de wagons desservis</h3>

      <p>Cet outil de diagnostic peut vous aider &agrave;
      d&eacute;terminer pourquoi un train ne va pas desservir un
      type de v&eacute;hicule particulier. Vous pouvez
      s&eacute;lectionner un type de wagons et de voir comment le
      train va desservir ce type de wgons. Vous pouvez
      &eacute;galement s&eacute;lectionner une wagons
      sp&eacute;cifique pour voir comment ce wagon serait
      desservi.</p>

      <p><img src="images/ShowCarTypesServicedTrain.png"></p>

      <p>La fen&ecirc;tre affiche l'itin&eacute;raire du train avec
      tous les emplacement et une voies pouvant &ecirc;tre
      desservis par le train. A droite de chaque voie est le
      statutn actuel pour ce type de wagons actuellement
      s&eacute;lectionn&eacute; dans le menu d&eacute;roulant. Si
      l'&eacute;tat est "OK", puis ce train peut ramasser et
      d&eacute;poser ce type de wagons sur cette voie
      sp&eacute;cifique. Si l'&eacute;tat est "collecte" ou "
      D&eacute;pose ", alorss le train ne peut que prendre ou
      laisser des wagons &agrave; cette voie particuli&egrave;re .
      Un statut qui commence par un "X" signifie que le train ne
      desservira pas la voie. Le tableau suivant pr&eacute;sente un
      r&eacute;sum&eacute; des diff&eacute;rents statuts.</p>

      <table>
        <tr>
          <th>Statut&acirc;&euro;&lsaquo;&acirc;&euro;&lsaquo;</th>
        </tr>

        <tr>
          <td width="20%">OK</td>

          <td>Type de wagon s&eacute;lectionn&eacute; pouvant
          &ecirc;tre collect&eacute; et d&eacute;pos&eacute;</td>
        </tr>

        <tr>
          <td>Collecter</td>

          <td>Type wagon choisi qui peut seulement &ecirc;tre
          collect&eacute; sur cette voie</td>
        </tr>

        <tr>
          <td>D&eacute;poser</td>

          <td>Type de wagon choisi qui peut seulement &ecirc;tre
          d&eacute;pos&eacute; sur cette voie</td>
        </tr>

        <tr>
          <td>X (Train et Asssemblage)</td>

          <td>La Date de Asssemblage du wagon
          s&eacute;lectionn&eacute; n'est pas utilis&eacute; par ce
          train</td>
        </tr>

        <tr>
          <td>X (Chargement et Trains)</td>

          <td>Le wagon charg&eacute; s&eacute;lectionn&eacute;
          n'est pas utilis&eacute; par ce train</td>
        </tr>

        <tr>
          <td>X (Propri&eacute;taire et Train)</td>

          <td>Le wagon du propri&eacute;taire
          s&eacute;lectionn&eacute; n'est pas utilis&eacute; par ce
          train</td>
        </tr>

        <tr>
          <td>X (Ligne et du Train )</td>

          <td>Le wagon de la ligne choisie n'est pas utilis&eacute;
          par ce train</td>
        </tr>

        <tr>
          <td>X (Type et Train)</td>

          <td>Le Type de wagon choisi n'est pas utilis&eacute; par
          ce train</td>
        </tr>

        <tr>
          <td>X (Train Direct )</td>

          <td>Le train ne dessert pas cet endroit</td>
        </tr>

        <tr>
          <td>X (Train de Collecte)</td>

          <td>Le train ne peut que collecter les wagons sur cette
          voie</td>
        </tr>

        <tr>
          <td>X (Train de Livraison)</td>

          <td>Le train ne peut que livrer des wagons sur cette
          voie</td>
        </tr>

        <tr>
          <td>X (Itin&eacute;raire)</td>

          <td>L'itin&eacute;raire ne permet pas de collecte ou de
          livraison pour cet endroit</td>
        </tr>

        <tr>
          <td>X (Mouvements sur l'itin&eacute;raire)</td>

          <td>Le nombre de mouvements de wagon demand&eacute; pour
          cet endroit est nul</td>
        </tr>

        <tr>
          <td>X (Type par Lieu)</td>

          <td>L'emplacement n'utilise pas le type de wagon
          s&eacute;lectionn&eacute;e</td>
        </tr>

        <tr>
          <td>X (Voie et Ligne)</td>

          <td>La voie n'utilise pas le wagon de la ligne
          s&eacute;lectionn&eacute;e</td>
        </tr>

        <tr>
          <td>X (Voie et Type)</td>

          <td>La voie n 'utilise pas le type de wagon
          s&eacute;lectionn&eacute;e</td>
        </tr>

        <tr>
          <td>X (Dir et Lieu)</td>

          <td>Bas&eacute; sur la direction de d&eacute;part du
          train, l'emplacement ne permet pas de livraison et de
          collecte</td>
        </tr>

        <tr>
          <td>X (horaire annexe)</td>

          <td>La s&eacute;lection de l'horaire du <a href=
          "#Schedules">programme de l'embranchement</a>
          emp&ecirc;che la wagon d'&ecirc;tre utilis&eacute;e.</td>
        </tr>

        <tr>
          <td>X (Annexe type)</td>

          <td>Le programme de l'embranchement ne permet pas au type
          de wagon d'&ecirc;tre utilis&eacute;.</td>
        </tr>

        <tr>
          <td>X (annexe Charge)</td>

          <td>Le programme de l'embranchement ne permet pas
          l'utilisation de la charge du wagon.</td>
        </tr>

        <tr>
          <td>X (annexe Ligne)</td>

          <td>Le programme de l'embranchement ne permet pas
          &agrave; cette ligne d'utiliser le wagon .</td>
        </tr>

        <tr>
          <td>X (annexe)</td>

          <td>Le programme de l'embranchement ne permet pas la
          combinaison du type de charge, et de lligne du
          wagon.</td>
        </tr>
      </table><a name="ModifyTrainsByCarType" id=
      "ModifyTrainsByCarType"></a>

      <h3>Modifier les trains par type de wagon</h3>Cet outil peut
      &ecirc;tre trouv&eacute; sous Trains-&gt; Outils. Utilisez
      cet outil pour modifier rapidement le type de wagons que
      votre trains utilisera. Tr&egrave;s utile quand on veut
      ajouter un type nouveau de wagon &agrave; votre liste.

      <p><img src="images/ModifyTrainsByCarType.png"></p>

      <p>D'abord s&eacute;lectionner le type de wagon que vous
      d&eacute;sirez modifier. La fen&ecirc;tre montre alors
      o&ugrave; les trains peuvent utiliser ce type de wagon.
      Cochez ou d&eacute;cochez les trains que vous voulez
      utiliser, et appuyez sur le bouton "Sauvegarder" pour
      modifier vos trains. Vous pouvez &eacute;galement copier la
      fa&ccedil;on dont un wagon existant est utilis&eacute; par
      vos trains et appliquer ces r&egrave;gles &agrave; un autre
      wagon. Pour faire qu'un type de wagon se comporte comme un
      autre, d'abord s&eacute;lectionner le wagon que votre
      souhaitez copier, puis cochez la case "Copie", le type de
      wagon appara&icirc;t maintenant &agrave; droite de la case
      &agrave; cocher, puis s&eacute;lectionnez le type de wagon
      que vous souhaitez modifier, puis appuyez sur "Enregistrer"
      pour avoir les deux types de wagon utilis&eacute;s par les
      m&ecirc;mes trains.</p><a name="SwitcherService" id=
      "SwitcherService"></a>

      <h3>Service de Man&oelig;uvre</h3>De nombreux
      op&eacute;rateurs attribuent une locomotive &agrave; un
      emplacement pour faire les man&oelig;uvres locales. Utiliser
      la liste de man&oelig;uvres de l'emplacement permet &agrave;
      la personne affect&eacute;e &agrave; ce lieu d'utiliser tous
      les trains qui s'arr&ecirc;tent &agrave; cet endroit.
      Toutefois, il peut y avoir des endroits qui ne
      re&ccedil;oivent pas assez de travail suppl&eacute;mentaire
      ou de trains locaux et il serait bon de cr&eacute;er un
      travail suppl&eacute;mentaire pour l' op&eacute;rateur
      affect&eacute; &agrave; cet endroit. Pour cr&eacute;er un
      emploi de "charg&eacute; de man&oelig;uvres",cr&eacute;er un
      itin&eacute;raire avec un seul emplacement, l'emplacement que
      le charg&eacute; de man&oelig;uvres utilisera, et attribuer
      cet itin&eacute;raire &agrave; un train. Le "train" devient
      maintenant un train de man&oelig;uvres qui n'utilisera que
      cet emplacement. R&eacute;glez le compteur "Mouvement" dans
      l'itin&eacute;raire pour contr&ocirc;ler le nombre de wagons
      que le charg&eacute; de man&oelig;uvres utilisera.

      <p>Des op&eacute;rateurs peuvent produire un manifeste de
      train qui ne montre que les livraisons ou les collectes d'un
      garage ou d'un &eacute;change, et ensuite avoir une liste de
      man&oelig;uvres qui montre les mouvements entre le garage et
      des embranchement. Pour &eacute;liminer les voies qui
      apparaissent sur le manifeste du train, d&eacute;cochez
      toutes les cases de direction pour cette voie. Seul une
      "man&oelig;uvre" desservira une voie qui n'a pas toutes les
      bo&icirc;tes de direction s&eacute;lectionn&eacute;es.</p>

      <h3>Restrictions de Man&oelig;uvres</h3>Le programme lors de
      la g&eacute;n&eacute;ration d'un manifeste pour un
      charg&eacute; de man&oelig;uvres (un train avec un seul
      emplacement dans son parcours) sera par d&eacute;faut de ne
      jamais d&eacute;placez un wagon &agrave; partir d'un
      embranchement vers un embranchement ou d'un garage vers un
      autre garage, seulement d'un garage vers un embranchement ou
      d'un embranchement vers un garage . Cette r&egrave;gle
      s'applique &eacute;galement aux &eacute;changeurs. Cette
      restriction permet d'&eacute;viter des mouvements de wagon
      non r&eacute;aliste entre les embranchements (industries). Si
      vous voulez un mouvement d'un embranchement vers un
      embranchement, utilisez un Horaire <a href="#Schedules"></a>
      pour forcer le mouvement du wagon. Vous pouvez
      &eacute;galement d&eacute;sactiver cette restriction voir
      Options de <a href="#SettingsOptions">.</a> <a name=
      "BuildingTrains" id="BuildingTrains"></a>

      <h2>Assemblage de Trains</h2>Pour asssembler un train,
      appuyez sur le bouton "Assemblage" dans la rang&eacute;e pour
      le le train d&eacute;sir&eacute; dans la fen&ecirc;tre
      <a href="#Trains">trains</a> . Le bouton deviendra "Imprimer"
      ou "Pr&eacute;visualiser" apr&egrave;s que le train ait
      &eacute;t&eacute; assembler. Si vous voulez revoir la
      mani&egrave;re dont le train a &eacute;t&eacute;
      assembl&eacute;, s&eacute;lectionnez l'option "Cr&eacute;er
      des rapports" avant d'appuyer sur le bouton "Imprimer" ou
      "Aper&ccedil;u" pour le train d&eacute;sir&eacute;. Si
      l'aper&ccedil;u " Manifeste "est coch&eacute;, le programme
      va g&eacute;n&eacute;rer le rapport d'assemblage et le
      manifeste et les pr&eacute;senter dans des fen&ecirc;tres de
      pr&eacute;visualisation. Si vous voulez asssembler plusieurs
      trains sans avoir &agrave; appuyer sur les boutons pour
      chaque train, s&eacute;lectionner les trains que vous voulez
      asssembler et appuyez sur le bouton "Assemblage" situ&eacute;
      au bas de la fen&ecirc;tre des trains. Le programme va alors
      asssembler des manifestes pour tous les trains choisis.

      <p>Si la Asssemblage d'un train &eacute;choue, le bouton
      "D&eacute;placer" va changer son texte en "Rapport". Appuyer
      sur "Rapport" permet d'imprimer ou de pr&eacute;visualiser le
      rapport d'assemblage pour ce train. Chaque fois qu'un train
      ne peut pas &ecirc;tre assembl&eacute;, un message
      d'&eacute;chec Assemblage appara&icirc;tra. Si vous souhaitez
      d&eacute;sactiver cette fonctionnalit&eacute;
      d&eacute;s&eacute;lectionner la case "Messages
      d'assemblage".</p>

      <p>Vous pouvez &eacute;galement contr&ocirc;ler quels trains
      sont affich&eacute;s dans la fen&ecirc;tre Trains. Lorsque la
      case "Tout Montrer" est d&eacute;coch&eacute;e, seuls les
      trains qui ont la case "Assemblage"
      s&eacute;lectionn&eacute;e sont affich&eacute;s.</p><a name=
      "Timetable" id="Timetable"></a>

      <h3>Horaires</h3>L'outil Horaire vous permet de
      d&eacute;finir quels trains circuleront un jour donn&eacute;,
      et peut &ecirc;tre trouv&eacute; sous Trains-&gt; Outils.
      Pour chaque jour de la semaine, s&eacute;lectionnez les
      trains que vous voulez asssembler. S&eacute;lectionnez
      ensuite le jour vous souhaitez en s&eacute;lectionnant le
      bouton radio appropri&eacute;. Puis appuyez sur le Bouton
      "Appliquer" pour mettre &agrave; jour les trains dont la
      cases "Assemblage" est coch&eacute;e. Utilisez le bouton
      "Enregistrer" pour enregistrer toutes les modifications
      apport&eacute;es &agrave; l'horaire. <a name=
      "TroubleShootingBuildingTrains" id=
      "TroubleShootingBuildingTrains"></a>

      <h2>Probl&egrave;mes de Asssemblage de Trains</h2>Si vous
      voulez examiner comment un train a &eacute;t&eacute;
      assembl&eacute;, vous pouvez s&eacute;lectionner la case
      "rapports d'assemblage" au bas de la fen&ecirc;tre du train,
      puis appuyez sur la touche "Imprimer" ou le bouton
      "Aper&ccedil;u" pour ce train. Le programme fournira alors le
      manifeste du train et le rapport d'assemblage pour que vous
      puissiez l'examiner.

      <p>Quand la g&eacute;n&eacute;ration d'un train &eacute;choue
      pour une raison quelconque, le bouton d'action de train
      devient "Rapport" qui vous permet d'acc&eacute;der au rapport
      pour d'assemblage de ce train. Le programme enverra le
      rapport &agrave; votre imprimante si le "Aper&ccedil;u" n'est
      pas s&eacute;lectionn&eacute;, ou &agrave; une fen&ecirc;tre
      de pr&eacute;visualisation ou un &eacute;diteur de texte si
      le "Aper&ccedil;u" est s&eacute;lectionn&eacute;. Le rapport
      d'assemblage peut imprimer sur diff&eacute;rents niveaux de
      d&eacute;tail, de minimum &agrave; tr&egrave;s
      d&eacute;taill&eacute;e. Voir la section Param&egrave;tres
      <a href="#BuildReportDetails">Construire des options de
      rapport</a> pour plus d'informations sur la fa&ccedil;on de
      modifier le niveau de d&eacute;tail du rapport d'assemblage
      n.</p>

      <p><img src="images/BuildReport.png"></p>

      <h3>Lecture du rapport de Asssemblage</h3>Le programme lors
      de l' Asssemblage d'un train cr&eacute;e un rapport
      d'Asssemblage et l'enregistre sur le disque. Normalement vous
      pouvez acc&eacute;der au rapport d'assemblage depuis la
      fen&ecirc;tre <a href="#BuildingTrains">Trains</a> ou depuis
      le menu Outils Train. Les fichiers textes peuvent &ecirc;tre
      trouv&eacute;s dans le r&eacute;pertoire JMRI-&gt;
      op&eacute;rations-&gt; r&eacute;pertoire buildstatus. Le
      rapport d'Asssemblage montre les &eacute;tapes du programme
      pendant les op&eacute;rations d'Asssemblage d'un train. La
      premi&egrave;re page donne l'itin&eacute;raire du train et le
      nombre de mouvements de wagons demand&eacute; pour chaque
      emplacement. Le rapport montre ensuite les types de wagon et
      de locomotives et quel train sera utilis&eacute;. En lisant
      les divers commentaires figurant dans le rapport vous pouvez
      avoir une id&eacute;e des &eacute;tapes du programme
      d'Exploitationns utilis&eacute;s pour asssembler un train.
      Quand il y a un probl&egrave;me que l'Op&eacute;ration
      d'Asssemblage ne peut pas r&eacute;soudre, l'Asssemblage
      &eacute;chouera. Pour comprendre pourquoi un Asssemblage a
      &eacute;chou&eacute;, passez &agrave; la derni&egrave;re page
      du rapport d'Asssemblage et en remontant le rapport &agrave;
      partir de la derni&egrave;re ligne, vous devriez &ecirc;tre
      en mesure de comprendre pourquoi l'Asssemblage du train a
      &eacute;chou&eacute; .

      <h3>Plus de D&eacute;tails du Rapport de Asssemblage</h3>Pour
      ceux qui veulent comprendre comment le programme construit
      les trains voici les d&eacute;tails. Si le train
      n&eacute;cessite une locomotive ou plusieurs locomotives, le
      programme va chercher des locomotives au d&eacute;but de
      l'itin&eacute;raire et ensuite d&eacute;termine si
      l'emplacement de destination les accepte. Notez que si deux
      ou plusieurs locomotives sont n&eacute;cessaires pour le
      train les locomotives doivent &ecirc;tre dans un <a href=
      "#LocomotivesAdd">couplage</a> . Le programme attribue au
      mat&eacute;riel roulant (locomotives et wagons), le nombre de
      mouvements qui qu'ils subissent lors de chaque session. Le
      compteur de mouvement est incr&eacute;ment&eacute; &agrave;
      chaque fois qu'un mat&eacute;riel roulant est livr&eacute;
      sur une voie d'un nouvel emplacement &agrave; suivre un
      nouvel emplacement, ou si le mat&eacute;riel roulant a
      &eacute;t&eacute; affect&eacute; &agrave; un train et le
      train a &eacute;t&eacute; r&eacute;initialis&eacute;. Le
      programme trie le mat&eacute;riel roulant, par le nombre de
      mouvement, puis tente d' attribuer les locomotives et les
      wagons avec le moins de mouvements pour le train. Lorsque de
      l'Asssemblage d'un seul train roulant &agrave; des endroits
      qui font partie de l'itin&eacute;raire du train sont
      utilis&eacute;s. En ce qui concerne les wagons, en plus du
      nombre de mouvements connu d'un wagon, la priorit&eacute; de
      chargement du wagon est &eacute;galement
      consid&eacute;r&eacute;e. Le programme va essayer de trouver
      les destinations pour les wagons avec charges haute
      priorit&eacute;, avant les charges de faible priorit&eacute;.

      <p>L'&eacute;tape suivante consiste &agrave; attribuer une
      option fourgon de queue ou un wagon avec Fred au train. Si le
      programme trouve le fourgon de queue n&eacute;cessaire ou en
      wagon avec Fred au d&eacute;part de l'itin&eacute;raire, le
      programme tente de trouver une voie au lieu de destination
      qui l'accepte . En cas de succ&egrave;s, tous les autres
      wagons de queue et les wagons avec FRED sont retir&eacute;s
      de la liste des wagons disponibles.</p>

      <p>Ensuite le programme attribuera les wagons pour le train
      partant du lieu de d&eacute;part. Chaque wagon passe par le
      processus de trouver une voie le long de l'itin&eacute;raire
      qui va accepter le wagon. Un autre compteur affect&eacute;
      &agrave; une voie est utilis&eacute;e pour d&eacute;terminer
      si la voie a &eacute;t&eacute; utilis&eacute;e
      r&eacute;cemment. Les voies avec l'utilisation la plus faible
      sont prioritaires. Un wagon peut avoir plusieurs choix de
      voies et celle avec la plus haute priorit&eacute; sera
      affect&eacute;e en tant que destination du wagon. Le
      processus se poursuit jusqu'&agrave; ce que le nombre de
      d&eacute;placements de wagon demand&eacute; par un
      emplacement soit atteint, ou que les wagons disponibles
      trait&eacute;es par le programme soient utilis&eacute;s. Une
      fois que le wagon qui se d&eacute;place atteint l'emplacement
      requis, le prochain emplacement de l'itin&eacute;raire est
      trait&eacute;. Cela continue jusqu'&agrave; ce tous les lieux
      dans l'itin&eacute;raire d'un train aient &eacute;t&eacute;
      trait&eacute;s.</p>

      <p>En mode <a href="#SettingsOptions">agressif</a> , le
      programme au moment de d&eacute;terminer la destinations des
      wagons, va faire deux passes pour d&eacute;terminer o&ugrave;
      placer les wagons. La premi&egrave;re passe fait 50% des
      mouvements disponibles pour chaque emplacement, et la seconde
      passe le restant. En faisant deux passes, le programme peut
      rendre "libre" quelques embranchements qui ont
      d&eacute;j&agrave; les wagons, augmentant ainsi le nombre de
      wagons que le train peut utiliser. Une fois qu'un wagon a
      &eacute;t&eacute; affect&eacute; &agrave; une destination en
      mode agressif, l'espace du wagon sur la voie en cours est
      disponible pour d'autres trains.</p>

      <p>Si un wagon a une destination finale qui a
      &eacute;t&eacute; fix&eacute;e par un horaire, le programme
      va essayer de d&eacute;placer le wagon vers cette
      destination, ou si ce n'est pas possible, il va essayer de
      d&eacute;placer le wagon le plus proche de celui de la
      destination finale.</p>Si une wagon a une charge
      personnalis&eacute;e sans destination, le programme va
      rechercher un embranchement avec un horaire exigeant ce type
      de wagon et la charge, le programme va alors "router" le
      wagon pour cette destination. Le programme va utiliser
      jusqu'&agrave; cinq trains pour sortir la wagon vers une
      destination. Le programme pour d&eacute;terminer combien de
      wagons qu'une industrie peut utiliser consid&egrave;re la
      longueur de l'embranchement de service de l'industrie, et la
      longueur de la voie alternative si elle est
      sp&eacute;cifi&eacute;e. Si la wagon est au d&eacute;part de
      la coulissel avec une charge personnalis&eacute;e, le
      "Pourcentage des charges personnalis&eacute;es
      g&eacute;n&eacute;r&eacute;s par la coulisse" est
      utilis&eacute; pour d&eacute;terminer si le wagon doit
      &ecirc;tre envoy&eacute; &agrave; cette industrie. Voir les
      <a href="#Schedules">horaires</a> pour plus de
      d&eacute;tails.

      <p>Parfois la lecture du rapport d'Asssemblage peut
      &ecirc;tre fastidieuse. SUn &eacute;diteur de texte vous
      permetde chercher le rapport, vous pouvez s&eacute;lectionner
      cette option depuis <a href="#BuildReportDetails">Options
      Rapport D'Assemblage</a> sous Outils dans le menu de
      d&eacute;marrage ou la fen&ecirc;tre Trains</p>

      <h3>Impression Manifestes</h3>Apr&egrave;s la Asssemblage
      d'un train, le bouton "Construire" deviendra "Imprimer" ou
      "Aper&ccedil;u" en fonction de l'&eacute;tat de la case
      &agrave; cocher appel&eacute;e "Aper&ccedil;u Manifestes
      "situ&eacute;e dans le coin inf&eacute;rieur droit de la
      fen&ecirc;tre de trains. Appuyer sur la touche "Imprimer"
      permet d'imprimer le manifeste pour ce train. Appuyer sur la
      bouton "Aper&ccedil;u" va produire une fen&ecirc;tre dans
      laquelle vous pouvez examiner le manifeste. Si vous souhaitez
      imprimer des manifestes pour plusieurs trains,
      s&eacute;lectionner les trains que vous voulez dans la
      colonne d'Asssemblage et puis appuyez sur le bouton
      "Imprimer" ou "Aper&ccedil;u" qui se trouve au bas de la
      fen&ecirc;tre des trains. Le programme va alors imprimer ou
      pr&eacute;visualiser les manifestes pour tous les trains
      s&eacute;lectionn&eacute;s. Vous pouvez modifier l'aparence
      de vos manifestes depuis la fen&ecirc;tre <a href=
      "#PrintOptions">Options d'Impression Manifeste</a> .

      <p>Vous pouvez &eacute;galement acc&eacute;der &agrave; un
      manifeste de train et construire le rapport dans le menu
      Outils dans la fen&ecirc;tre &eacute;dition du train.
      L'option Outils du menu vous permet de
      r&eacute;cup&eacute;rer le manifeste et de construire le
      rapport d'un train qui a &eacute;t&eacute; termin&eacute;.
      Utile si vous avez accidentellement r&eacute;sili&eacute; un
      train avant d'imprimer le manifeste du train.</p>.

      <p><img src="images/Manifest.png"></p><a name="SwitchList"
      id="SwitchList"></a>

      <h3>Listes de Man&oelig;uvres</h3>Une liste de
      man&oelig;uvres montre les manoeuvres n&eacute;cessaires
      &agrave; effectuer pour tous les trains passant &agrave; cet
      emplacement. Normalement, une liste de man&oelig;uvres est
      donn&eacute;e &agrave; la personne responsable d'un triage ou
      dans un emplacement avec des embranchement nombreux ou des
      raccordements industriels. Vous pouvez modifier l'aparence de
      vos listes de man&oelig;uvres depuis la fen&ecirc;tre
      <a href="#PrintOptions">Options d'Impression Manifeste</a>

      <p>Appuyez sur le bouton "Imprimer la liste de
      Man&oelig;uvres" qui se rouve au bas de la fen&ecirc;tre
      "Trains" si vous voulez une liste de Man&oelig;uvres pour un
      emplacement donn&eacute;. Un menu appara&icirc;tra qui vous
      permet de s&eacute;lectionner les lieux &agrave;
      pr&eacute;visualiser ou &agrave; imprimer. Une fois que vous
      avez d&eacute;termin&eacute; quels endroits vous souhaitez
      imprimer ou pr&eacute;visualiser, appuyez sur le bouton
      "Sauvegarder" pour garder votre s&eacute;lections.</p>Options
      d'Impression Manifeste

      <p>Le menu de la liste de Man&oelig;uvres permet
      &eacute;galement d'ajouter un commentaire &agrave; la liste
      de Man&oelig;uvres pour un emplacement et s&eacute;lectionnez
      l'imprimante &agrave; utiliser lors de l'impression de la
      liste de Man&oelig;uvres. Notez que le programme lors de
      l'impression du manifeste utilise &eacute;galement
      l'imprimante associ&eacute;e &agrave; l'emplacement de
      d&eacute;part du train.</p>

      <p>Vous pouvez &eacute;galement obtenir une version
      d&eacute;mat&eacute;rialis&eacute;e d'une liste de
      Man&oelig;uvres &eacute;galement par l'activation de la
      fen&ecirc;tre de Chef de Triage appropri&eacute;e pour un
      <a href="#Locations">emplacement</a></p>

      <p><img src="images/SwitchList.png"></p>

      <h3>Switch List Options</h3>Il existe trois options pour
      r&eacute;gler les listes de manoeuvres &agrave; votre
      go&ucirc;t. La premi&egrave;re case d'option lorsqu'elle est
      s&eacute;lectionn&eacute;e indique au programme d'imprimer
      tous les trains qui passent &agrave; un emplacement,
      m&ecirc;me si le train n'a pas de manoeuvre. Si vous
      d&eacute;sactivez cette option, le programme imprime
      uniquement les trains qui ont des manoeuvres &agrave; cet
      endroit.

      <p>L'option suivante quand elle est
      s&eacute;lectionn&eacute;e demande au programme d'imprimer la
      liste de manoeuvres d'un train sur une nouvelle page pour
      chaque train. De cette fa&ccedil;on, vos op&eacute;rateurs
      lors de l'ach&egrave;vement des manoeuvres pour un train,
      peuvent tout simplement jeter la paperasse pour ce train. Ce
      mode est &eacute;galement utile si vous avez plus d'un
      op&eacute;rateur au travail &agrave; un emplacement, de cette
      fa&ccedil;on ils peuvent facilement distribuer le travail par
      train.</p>

      <p>La derni&egrave;re option est de savoir si vous voulez que
      vos listes de manoeuvres en temps r&eacute;el ou en mode de
      consolidation. Normalement, vous devriez cr&eacute;er vos
      listes de manoeuvres en temps r&eacute;el. Dans ce mode, la
      liste de manoeuvres pour un emplacement montre les manoeuvres
      pr&eacute;vues pour les trains qui sont Assembl&eacute;ss et
      non encore termin&eacute;s.</p>

      <p>Si vous souhaitez uniquement imprimer des travaux pour les
      nouveaux trains, alors d&eacute;sactivez l'option en temps
      r&eacute;el. Une fois que vous avez imprim&eacute; la liste
      de manoeuvres pour un emplacement, o&ugrave; la nouvelle
      activit&eacute; est cr&eacute;&eacute;e par l'assemblage des
      trains, les anciens travaux pour les trains les plus
      &acirc;g&eacute;s sont supprim&eacute;s. Notez que vous
      pouvez utiliser l'aper&ccedil;u pour voir les manoeuvrespour
      un emplacement, mais jusqu'&agrave; ce que vous l'imprimiez,
      de nouvelles activit&eacute;s pourront &ecirc;tre
      ajout&eacute;e au travail qui est actuellement pr&eacute;vu.
      Alors s'il vous pla&icirc;t comprenez que
      pr&eacute;visualiser et imprimer travaille
      diff&eacute;remment en mode consolidation.</p>

      <p>Une autre utilisation pour le mode de consolidation est de
      cr&eacute;er de grandes listes de manoeuvrespour un
      emplacement en construisant et en terminant plusieurs trains
      . Par exemple, si vous avez un petit r&eacute;seau, vous
      pourriez avoir &agrave; construire et &agrave; mettre fin
      &agrave; bon nombre de trains afin de g&eacute;n&eacute;rer
      suffisamment de travail pour vos op&eacute;rateurs . Si vous
      utilisez des listes de manoeuvresen temps r&eacute;el que
      vous avez &agrave; les imprimer avant de vous r&eacute;siliez
      vos trains . Maintenant, si il n'ya pas beaucoup de
      travailler votre liste de manoeuvre va &ecirc;tre assez
      courte . En d&eacute;cochant la case " en temps r&eacute;el
      ", vous pouvez regrouper plusieurs petites listes de
      manoeuvres pour en faire une une plus grande. Utilisez ce
      mode si vous voulez &eacute;conomiser du papier, sinon pas la
      peine, car il peut &ecirc;tre difficile &agrave; utiliser.
      C'est un peu compliqu&eacute;, alors voici l'ordre dans
      lequel faire les choses :</p>

      <ul>
        <li>Appuyez sur la touche "Liste de manoeuvres" se trouve
        au bas de la fen&ecirc;tre "Trains" .</li>

        <li>S&eacute;lectionnez pour quels emplacements vous voulez
        des listes de manoeuvres dans la fen&ecirc;tre "listes de
        manoeuvres par emplacement " fen&ecirc;tre.</li>

        <li>D&eacute;cochez la case "Temps r&eacute;el" et appuyez
        sur "Enregistrer" .</li>

        <li>Maintenant Assembler les trains pour lesquels vous
        voulez des listes de manoeuvres consolid&eacute;s .</li>

        <li>Appuyez sur le bouton "&Eacute;changer des listes"
        &agrave; nouveau si vous avez ferm&eacute; la fen&ecirc;tre
        de liste de manoeuvres .</li>

        <li>puis appuyez sur "Aper&ccedil;u Changer les listes " ou
        le bouton "Mise &agrave; jour des listes de manoeuvres"
        .</li>

        <li>Maintenant imprimer vos manifestes de train et
        r&eacute;silier les trains que vous voulez
        r&eacute;silier.</li>

        <li>poursuivre l'assemblage, la mise &agrave; jour des
        listes de manoeuvres, et terminer les trains jusqu'&agrave;
        ce que votre soyez satisfait de la quantit&eacute; de
        travail produite .</li>

        <li>Enfin, imprimer vos listes de manoeuvres.</li>
      </ul>

      <p>L'Impression de la liste de manoeuvres pour un emplacement
      indique au programme que vous avez termin&eacute; la
      consolidation de vos trains &agrave; cet endroit. Le
      programme effacera la liste de manoeuvres lorse du prochain
      changement survenant &agrave; cet endroit. Si il n'y a aucun
      changement &agrave; un endroit, alors la liste de manoeuvre
      est une copie de la derni&egrave;re impression. Cela vous
      permet d'imprimer plus d'une copie de la liste de manoeuvre
      si n&eacute;cessaire.</p>

      <p><img src="images/SwitchList.png"></p><a name="TrainMove"
      id="TrainMove"></a>

      <h3>Mouvement de Trains</h3>Apr&egrave;s avoir fourni
      &agrave; vos op&eacute;rateurs un manifeste imprim&eacute; ou
      Listes de Man&oelig;uvres &agrave; l'emplacement, vous devez
      garder la base de donn&eacute;es synchronis&eacute;e avec le
      programme de mouvement r&eacute;el des trains sur votre
      r&eacute;seau. Cela se fait par le boutons "D&eacute;placer"
      train situ&eacute; sur le c&ocirc;t&eacute; droit de la
      fen&ecirc;tre <a href="#Trains">Trains</a> . Appuyer sur la
      bouton "D&eacute;placer" va provoquer le d&eacute;part du
      train de son l'emplacement actuel vers l'emplacement suivant
      dans l'itin&eacute;raire. Les locomotives et les wagons
      affect&eacute;s au train se rendront &agrave; l'emplacement
      suivant sur la ligne. &agrave; chaque endroit, les wagons
      peuvent &ecirc;tre ramass&eacute;s ou livr&eacute;s. Vous
      pouvez &eacute;galement d&eacute;placer un train en
      s&eacute;lectionnant l'ic&ocirc;ne du train et en
      s&eacute;lectionnant "D&eacute;placer" &agrave; partir du
      menu contextuel de l'ic&ocirc;ne. Chaque pression sur le
      bouton "D&eacute;placer" d&eacute;place le le train vers
      l'emplacement suivant en direction de la destination finale.
      Lorsque le train arrive au dernier emplacement de
      l'itin&eacute;raire, la derni&egrave;re pression du bouton
      "D&eacute;placer" r&eacute;silie le train. Une fois qu'un
      train est termin&eacute;e, vous pouvez l'asssembler &agrave;
      nouveau.

      <p>Chaque fois qu'une locomotive ou qu'un wagon est
      d&eacute;plac&eacute; un compteur qui leur sont
      associ&eacute;s est incr&eacute;ment&eacute;. Le programme
      l'utilise pour d&eacute;terminer quels wagons n'ont pas
      boug&eacute; r&eacute;cemment et essaie de
      s&eacute;lectionner les wagons avec le moins de mouvements
      lors de l'Asssemblage de nouveaux trains. Chaque fois qu'un
      emplacement a un wagon livr&eacute;, le programme
      incr&eacute;mente un compteur associ&eacute; &agrave; cet
      endroit. Le programme tente de d&eacute;placer les wagons
      &agrave; des endroits qui ont connu le moins d'Exploitationns
      de wagon.</p>.

      <p><img src="images/Manifest.png"></p><a name=
      "TerminateTrain" id="TerminateTrain"></a>

      <h3>Terminer Trains</h3>Lorsque vous terminez un train, vous
      demandez au programme pour d&eacute;placer le train &agrave;
      partir de son emplacement actuel vers sa destination finale.
      Les wagons et les locomotives associ&eacute;s avec le train
      seront collect&eacute;s et remis au emplacements
      indiqu&eacute;s dans le manifeste de train. Apr&egrave;s la
      fin d'un train, les locomotives et les wagons associ&eacute;s
      &agrave; ce train deviennent disponibles pour d'autres
      trains. C'est pourquoi vous devez mettre fin &agrave; un
      train uniquement apr&egrave;s l'avoir fait arriver &agrave;
      la destination finale dans l'itin&eacute;raire du train. Pour
      mettre fin &agrave; plusieurs trains, s&eacute;lectionnez les
      trains auxquels vous souhaitez mettre fin dans la colonne
      Asssemblage et appuyez sur le bouton "Terminer" au bas de la
      fen&ecirc;tre Trains <a name="SaveBuilds" id=
      "SaveBuilds"></a>

      <h3>Enregistrer Asssemblages</h3>Appuyer sur le bouton
      "Enregistrer Asssemblages" provoque la mise &agrave; jour des
      fichiers .xml de train, wagon, locmotives et emplacement par
      le programme. Chaque fois que vous "D&eacute;placer" un train
      le programme de'Exploitation apportera des modifications aux
      bases de donn&eacute;es train, wagon, locomotive, et
      emplacement. Ces bases de donn&eacute;es doivent &ecirc;tre
      sauvegard&eacute;es avant d'arr&ecirc;ter JMRI, sinon vous
      allez perdre toutes les modifications que le programme
      Exploitation aura fait pour d&eacute;placer un train &agrave;
      l'emplacement suivant. En appuyant sur le bouton "Enregistrer
      Asssemblages" avant de quitter JMRI permet au programme
      d'Exploitation de reprendre exactement au point o&ugrave;
      vous &eacute;tiez quand vous avez appuy&eacute; sur le bouton
      "Enregistrer Asssemblages". <a name=
      "BuildingMultipleTrainsSession" id=
      "BuildingMultipleTrainsSession"></a>

      <h2>Asssemblages de Multiple Trains pour une Session</h2>La
      plupart des s&eacute;ances d'exploitation n&eacute;cessitent
      plus d'un train pour garder vos op&eacute;rateurs
      occup&eacute;s. La mani&egrave;re correcte de le faire est
      d'asssembler et d'imprimer l'ensemble des trains
      n&eacute;cessaires avant de les terminer. Donc, si vous avez
      besoin d'une douzaine de trains pour une session, vous devez
      asssembler douze trains avant de mettre fin &agrave; un
      train.La fin d'une formation indique au programme que les
      locomotives et les wagons dans ce train particulier, ont
      &eacute;t&eacute; livr&eacute;s &agrave; leur emplacement
      final et peuvent &ecirc;tre utilis&eacute;s &agrave; nouveau
      lors de l'Asssemblage de nouveaux trains. Il faut donc
      toujours tout asssembler , tout imprimer, PUIS
      r&eacute;silier chaque train apr&egrave;s avoir
      termin&eacute; sa course! Il est ok pour asssembler tous les
      trains, d'imprimer tous les trains, puis utilisez la fonction
      "Enregistrer Asssemblage" "et arr&ecirc;ter le programme.
      Plus tard, vous pouvez red&eacute;marrer le programme et
      r&eacute;silier les trains qui ont termin&eacute; leurs
      courses.

      <p>Le bon moment pour mettre fin &agrave; un train est quand
      le train arrive &agrave; sa destination. Terminer un train
      avant qu'il compl&egrave;te son parcours signifie que la base
      de donn&eacute;es estime que les locomotives et les wagons
      ont &eacute;t&eacute; livr&eacute;s. Il est
      pr&eacute;f&eacute;rable d'asssembler et d'imprimer douze
      trains et puis plus tard apprendre que seulement neuf trains
      ont termin&eacute; leur ex&eacute;cution. Vous aurez alors
      &agrave; r&eacute;silier neuf trains, et laisser les trois
      autres pour la prochaine session . Ou si vous le souhaitez
      vous pouvez r&eacute;initialiser tous les trains qui ne
      s'&eacute;carte pas de leur terminal. La
      r&eacute;initialisation des trains n'est pas vraiment
      n&eacute;cessaire, les trains qui ne pas circulent pas durant
      cette session pourraientt circuler au cours de la prochaine
      session.</p>

      <p>Une autre m&eacute;thode consiste &agrave; asssembler,
      imprimer et utiliser le bouton "D&eacute;placer" pour chaque
      train pour suivre le mouvement r&eacute;el des trains au
      cours de votre session. Aussi longtemps que les trains sur le
      r&eacute;seau correspondent &agrave; l'emplacement dans le
      programme vous pouvez asssembler un nouveau
      train.</p><a name="OperationWindows" id=
      "OperationWindows"></a>

      <h2>Fonctionnement des Fen&ecirc;tres</h2>Toutes les
      fen&ecirc;tres Exploitations peuvent &ecirc;tre
      redimensionn&eacute;es et plac&eacute;es &agrave; votre
      convenance. Lorsque vous fermez la fen&ecirc;tre, la taille
      et l'emplacement des fen&ecirc;tres sur votre &eacute;cran
      sont enregistr&eacute;s.

      <p>Le programme vous permet &eacute;galement de
      redimensionner les wagons, locomotives, trains et l'horaire,
      les largeurs de colonne du tableau. Ajuster la largeur des
      colonnes &agrave; votre go&ucirc;t et appuyez ensuite sur la
      fen&ecirc;tre "Enregistrer" ou "Enregistrer Asssemblages"
      pour enregistrer vos pr&eacute;f&eacute;rences.</p>

      <p>La fin de l'aide Exploitation.</p>

    </div><!-- closes #mainContent-->
  </div><!-- closes #mBody-->
</body>
</html>
