 <!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01//EN" "http://www.w3.org/TR/html4/strict.dtd"> 
 <!-- $Id$ --> 
 <!-- UpDated by Herv&#233; Blorec bzh56420@yahoo.fr 2013-11-04--> 
 <HTML LANG="fr"> 
 <HEAD> 
 <TITLE> Operations </TITLE> 
 <META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=iso-8859-1"> 
 <META CONTENT="Dan Boudreau" NAME="Author"> 
 <META NAME="keywords" CONTENT="JMRI Help Operations Setup Settings Cars Engines Locomotives Trains itin&#233;raires Locations Schedules"> 

 <!-- Style --> 
 <META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=utf-8"> 
 <LINK REL="stylesheet" TYPE="text/css" HREF="/css/default.css"
	MEDIA="screen"> 
 <LINK REL="stylesheet" TYPE="text/css" HREF="/css/print.css"
	MEDIA="print"> 
 <LINK REL="icon" HREF="/images/jmri.ico" TYPE="image/png"> 
 <LINK REL="home" TITLE="Home" HREF="/"> 
 <!-- /Style --> 
 </HEAD> 

 <BODY> 
 <!--#include virtual="/Header" --> 

 <DIV CLASS="nomenu" ID="mBody"> 
 <DIV ID="mainContent"> 

 <H2> Exploitations JMRI </H2> 

Le programme d'Exploitations vous permet de cr&#233;er des manifestes de train g&#233;n&#233;r&#233;s par ordinateur
 pour vos chemins de fer. Un <A HREF="#PrintingManifests"> manifeste du train </A> d&#233;taille le travail qu'une &#233;quipe doit r&#233;aliser durant un session d'exploitation. Le manifeste fournit une liste des wagons &#224; collecter et d&#233;poser et montre o&#249; se trouvent les wagons et o&#249; ils devraient &#234;tre &#233;ventuellement plac&#233;s sur la voie. Le programme vous permet d'entrer une liste de wagons et locomotives, de d&#233;finir des emplacements (gares) sur le r&#233;seau, et des itin&#233;raires pour la circulation des trains. La liste des wagons inclut des informations sur le wagon, y compris le nom de ligne, le num&#233;ro, le type de wagon, couleur, longueur, poids, date de Asssemblage, et le propri&#233;taire. Les trains sont affect&#233;s &#224; des itin&#233;raires qui d&#233;finissent les lieux ou gare o&#249; les wagons peuvent &#234;tre ramass&#233;s ou d&#233;pos&#233;s. Ces caract&#233;ristiques incluent la possibilit&#233; de contr&#244;ler quels types de wagons, les noms de lignes et les wagons charg&#233;s qu'un emplacement ou unembranchement industriel peut utiliser, la longueur de voie disponible pour un lieu, et la longueur maximale du train entre deux emplacements sur l'itin&#233;raire du train.
 <P> Les Emplacements peuvent avoir des voies d'embranchements, de triage, de coulisse et d'inter&#233;change. Les embranchements sont utilis&#233;s pour desservir les industries, et peuvent &#233;ventuellement avoir des <A HREF="#Schedules"> Horaires </A> personnalis&#233;s qui leur sont assign&#233;s. Les trains peuvent &#234;tre configur&#233;s pour requ&#233;rir un fourgon de queue ou un wagon avec un dispositif clignotant d'extr&#233;mit&#233; arri&#232;re (FRED). Le programme g&#233;n&#232;re un manifeste pour chaque train et des listes de man&#339;uvres pour tout emplacement. Une <A HREF="#SwitchList"> liste de man&#339;uvres </A> pour un emplacement montre le travail de tous les trains qui se rendront &#224; cet endroit. Le programme peut &#233;galement placer des ic&#244;nes repr&#233;sentant des trains sur un panneau JMRI. L'ic&#244;ne peut &#234;tre renseign&#233;e pour se d&#233;placer dans le panneau avec le train d'un endroit &#224; un autre. </P> 
 <P> 
Le programme d'Exploitation est inclus dans la suite d'outils DecoderPro/JMRI  
et peut &#234;tre trouv&#233; sous la rubrique du menu principal "Outils-> Exploitation". </P> 

 <P> 
 <img src="images/MainMenuDecoderPro.png"> 
 </P> 
 <H3> Table des mati&#232;res </h3> 
  <UL> 
   <li> <a HREF="#newUserAdvice"> Nouveaux Conseils d'Utilisation </A> </LI> 
   <li> <a HREF="#demo"> Fichiers de D&#233;monstration Exploitations </A> </LI> 
   <li> <a HREF="#QuickStartHelp"> Aide D&#233;marrage Rapide </A> </LI> 
   <li> <a HREF="#Settings"> Param&#232;tres </A> 
    <UL> 
     <li> <a HREF="#Backup"> Sauvegarde </A> </LI> 
     <li> <a HREF="#Restore"> Restaurer </A> </LI> 
     <li> <a HREF="#ResetDatabase"> R&#233;initialiser la Base de Donn&#233;es </A> </LI> 
     <li> <a HREF="#SettingsOptions"> Options </A> </LI> 
   </Ul > </li > 
   <li> <a HREF="#PrintOptions"> Manifeste Options d'Impression </A> </LI> 
   <li> <a HREF="#BuildReportDetails"> Options Rapport d'Asssemblage</A> </LI> 
   <li> <a HREF="#Locations"> Emplacements </A> 
    <UL> 
     <li> <a HREF="#Yards"> Triages </A> </LI> 
     <li> <a HREF="#Sidings"> Embranchements </A> 
      <UL> 
       <li> <a HREF="#Schedules"> Horaires </A> </LI> 
       <li> <a HREF="#SchedulesAndLoads"> Horaires et Charges </A> </LI> 
       <li> <a HREF="#ShowSchedulesByCarTypeAndLoad"> Montrer les Horaires par Type de Wagon et de Charge </A> </LI> 
     </Ul > </li > 
     <li> <a HREF="#Interchange"> Voies de Classification/&#201;changes </A> 
      <UL> 
       <li> <a HREF="#CreateClassificationYard"> Comment Cr&#233;er un Faisceau de Triage </A> </LI> 
     </Ul > </li > 
     <li> <a HREF="#Staging"> Voies en Coulisse </A> 
      <UL> 
       <li> <a HREF="#StagingAndCarLoads"> Coulisse et Charges de Wagons </A> </LI> 
       <li> <a HREF="#BlockingCarsFromStaging"> Bloc de Wagons depuis la Coulisse </A> </LI> 
       <li> <a HREF="#LoopingTrainsThroughStaging"> Looping trains &#224; travers la Coulisse </A> </LI> 
     </Ul > </li > 
     <li> <a HREF="#ChangeTrackType"> Modifier le Type de Voie </A> </LI> 
     <li> <a HREF="#Polls"> Voies Mutualis&#233;es </A> </LI> 
     <li> <a HREF="#ModifyLocationsByCarType"> Modifier Emplacements et Voies par Type de Wagons </a > </li> 
   </Ul > </li > 
   <li> <a HREF="#Cars"> Wagonss </a> 
    <UL> 
     <li> <a HREF="#ImportingCars"> Importation de Wagons &#224; partir d'un Fichier </A> </LI> 
     <li> <a HREF="#CarsEdit"> Ajout de Wagons &#224; votre Liste </A> </LI> 
     <li> <a HREF="#CarLoad"> Charges Wagons </A> </LI> 
     <li> <a HREF="#Kernel"> Noyau, ou Groupe de Wagons </A> </LI> 
     <li> <a HREF="#EditCarAttributes"> Modifier les Attributs de Wagon </a > </li> 
     <li> <a HREF="#EditCarLoads"> Modifier Charges de Wagon </a> </li> 
     <li> <a HREF="#CarsSet"> D&#233;finir Wagons </a> </li> 
   </Ul > </li > 
   <li> <a HREF="#Locomotives"> Locomotives </a> 
    <UL> 
     <li> <a HREF="#ImportLocomotives"> Importation de Locomotives </A> </LI> 
     <li> <a HREF="#LocomotivesAdd"> Ajout de Locomotives &#224; votre Liste </A> 
      <UL> 
       <li> <a HREF="#LocomotiveModels"> Mod&#232;les de locomotives </A> </LI> 
     </Ul > </li > 
     <li> <a HREF="#LocomotivesSet"> D&#233;finir  Locomotive </A> </LI> 
     <LI> <A HREF="#SynchronizeWithNCEConsists"> Synchroniser avec Couplage NCE </A> </LI> 
   </Ul > </li > 
   <li> <a HREF="#Routes"> Itin&#233;raires </a> 
    <UL> 
     <li> <a HREF="#EditRoute"> Modifier l'Itin&#233;raire </A> </LI> 
     <li> <a HREF="#PassengerTrainRoute"> Itin&#233;raire Train Passagers </A> </LI> 
     <li> <a HREF="#RouteFeatures"> Caract&#233;ristiques Itin&#233;raire </A> </LI> 
     <li> <a HREF="#SetTrainIconCoordinates"> D&#233;finir Coordonn&#233;es Ic&#244;ne du Train </A> </LI> 
   </Ul > </li > 
   <li> <a HREF="#Trains"> Trains </A> 
    <UL> 
     <li> <a HREF="#TrainReset"> R&#233;initialiser Train </A> </LI> 
     <li> <a HREF="#TrainBuildOptions"> Options d'Assemblage du Train </A> </LI> 
     <li> <a HREF="#TrainManifestOptions"> Options du Manifeste du Train </A> </LI> 
     <li> <a HREF="#TrainScripts"> Scripts </A> </LI> 
     <li> <a HREF="#TrainShowCarTypesServiced"> Voir les Types de Wagons desservis </A> </LI> 
     <li> <a HREF="#ModifyTrainsByCarType"> Modifier Trains par Type de Wagon </a > </li > 
     <li> <a HREF="#SwitcherService"> Utilisation du Switcher </a > </li > 
     <li> <a HREF="#BuildingTrains"> Assemblage des Trains </A> </LI> 
     <li> <a HREF="#Timetable"> Horaire </A> </LI> 
     <li> <a HREF="#TroubleShootingBuildingTrains"> Probl&#232;mes d'Assemblage Trains Comment r&#233;parer </A> </LI> 
     <li> <a HREF="#ReadingBuildReport"> Lecture du Rapport d'Assemblage </A> </LI> 
     <li> <a HREF="#PrintingManifests"> Impression des Manifestes </A> </LI> 
     <li> <a HREF="#SwitchList"> Changer les Listes </A> </LI> 
     <li> <a HREF="#TrainMove"> Mouvement des Trains </A> </LI> 
     <li> <a HREF="#TerminateTrain"> Terminer Train </A> </LI> 
     <li> <a HREF="#SaveBuilds"> Sauvegarder Assemblagess </A> </LI> 
     <li> <a HREF="#BuildingMultipleTrainsSession"> Assemblage de Plusieurs Trains pour une Session </A> </LI> 
   </Ul > </li > 
   <li> <a HREF="#OperationWindows"> Fen&#234;tre Exploitation </A> </LI> 
 </Ul> 

  <A NAME="newUserAdvice"> </A> 
  <H3> Nouvel avis &#224; l'utilisateur </h3> 
 <A NAME="demo"> </A> 
 <H3> Fichiers D&#233;mo exploitation </H3> 

Si vous n'avez jamais utilis&#233; un programme informatique pour g&#233;n&#233;rer des manifestes et des listes de man&#339;uvres, nous vous recommandons de t&#233;l&#233;chargez et utilisez les
  <A HREF="#demo"> Fichiers de d&#233;monstration </A> fournis. S'il vous pla&#238;t lire les <A
    Href = "#BuildReportDetails " > Rapports d'Assemblage </A> pour les trains de d&#233;monstration en mode tr&#232;s d&#233;taill&#233;, m&#234;me si
  ils sont des fichiers d&#233;mo. Vous drevez apporter des modifications ao programme de d&#233;mo et voir quels sont les r&#233;sultats. Ceci est votre chance d'exp&#233;rimenter avec le programme avant
   d'entrer vos propres donn&#233;es. Vous pouvez imprimer et sauvegarder un manifestevde train de d&#233;monstration et de asssembler rapport pour avoir une r&#233;f&#233;rence ult&#233;rieurement.

  <P> 
    Apr&#232;s avoir jou&#233; avec les fichiers de d&#233;monstration, vous pouvez <A HREF="#ResetDatabase"> r&#233;initialiser la base de donn&#233;es
 </A> et
    commencer &#224; entrer vos propres donn&#233;es. Nous recommandons fortement que vous obteniez vos trains &#224; assembler &#224; votre
    go&#251;t sans l'utilisation de voies en coulisse, voie de classification/&#233;change, et en particulier les horaires et les charges personnalis&#233;s. Nous constatons que les utilisateurs qui tentent d'utiliser les fonctions avanc&#233;es avant
   de comprendre comment fonctionne le programme, ont tendance &#224; avoir besoin de beaucoup d'aide pour obtenir le mouvement du wagon, quils
    d&#233;sirent. Donc, commencez petit et obtenez vos trains &#224; assembler correctement, lire les rapports d'assemblage dans le
    Mode tr&#232;s d&#233;taill&#233; pour vos trains, m&#234;me s'ils s'assemblent &#224; votre go&#251;t. Vous devez obtenir de la
    comp&#233;tence  avec les rapports de d'assemblage  avant de commencer &#224; utiliser les fonctionnalit&#233;s les plus avanc&#233;es 
du programme. Une fois que vous obtenez vos trains assembl&#233;s correctement, vous pouvez ajouter les voies en coulisse  si vous avez
    con&#231;u une coulisse sur votre r&#233;seau. Les trois autres fonctions avanc&#233;es sont compl&#232;tement optionnels et
    ne sont pas n&#233;cessaires pour la majorit&#233; des utilisateurs. Le type de voie suivant &#224; exp&#233;rimenter pourrait &#234;tre les voies
    classification/&#233;change. Une fois que vous obtenez de bons r&#233;sultats avec les voies classification/&#233;change, vous pouvez alors introduire des horaires pour vos embranchements et des charges personnalis&#233;es pour vos wagons. Si vous d&#233;cidez d'utiliser les horaires, la premi&#232;re chose &#224; comprendre, c'est que vous n'avez pas besoin des horaires pour l'ensemble de vos embranchements. Encore une fois commencer petit et avec seulement une paire d'embranchements et de voir quels sont les r&#233;sultats. L'Ajout de planifications ne peut pas augmenter le mouvement du wagon, et dans la plupart des cas, permettra de r&#233;duire le mouvement du wagon! Donc, notre conseil est d'apprendre &#224; marcher avant d'essayer de courir.
 </P> 

 <A NAME="demo"> </A> 
  <H3> Fichiers D&#233;monstration Exploitation </H3> 

Le programme d'Exploitation fournit un ensemble de fichiers de d&#233;monstration pour aider &#224; vous introduire dans l'une des caract&#233;ristiques et des capacit&#233;s de ce programme. Pour
charger les fichiers de d&#233;monstration, d'abord ouvrir la fen&#234;tre des param&#232;tres d'Exploitation
"Outils-> Exploitation> Param&#232;tres", et dans le coin sup&#233;rieur gauche de la fen&#234;tre de R&#233;glages
 dans le menu Outils, s&#233;lectionnez "Charger Fichiers D&#233;mo". Le programme
cr&#233;era une sauvegarde <A HREF="#BackupRestore"> </A> de votre configuration &#224; la position actuelle
 si vous en avez une, puis charge les fichiers de d&#233;monstration. Red&#233;marrez
JMRI pour compl&#233;ter le processus de chargement d&#233;mo.

 <P> Le programme fournit &#233;galement un simple panneau pour montrer comment les ic&#244;nes de train travaillent. Chargez le panneau avant de asssembler les trains en s&#233;lectionnant dans le menu principal JMRI, "Panneaux-> Charger Panneaux .." une fen&#234;tre devrait appara&#238;tre et ouvrir le r&#233;pertoire "operations"  puis ouvrez le fichier xml "Operations Demo Panel".

 </P> 
 <A NAME="QuickStartHelp"> </A> 
 <H3> Aide d&#233;marrage rapide </H3> 

Dans le menu de niveau sup&#233;rieur pour JMRI trouvez le menu "Outils-> Exploitation". Il
existe six &#233;l&#233;ments dans ce menu. Nous vous recommandons de commencer avec <A HREF="#Settings"> Param&#232;tres </A> et de suivre votre chemin jusqu'&#224; <a HREf= "#Trains"> Trains </A> . Saisir et Requ&#233;rir des locomotives pour vos trains est compl&#232;tement optionnel, et les locomotives ne sont pas n&#233;cessaires pour que le programme fonctionne correctement. Donc, si vous voulez assigner manuellement vos locomotives &#224; vos trains, pas la peine d'entrer les donn&#233;es de la locomotive dans le programme. Nous recommandons &#233;galement que lors de la d&#233;finition de vos emplacements que vous utilisez pour la premi&#232;re fois les voies de Triage et d'Embranchements
 et essayer Les voies en coulisses et les voies de classification/change lorsque vous &#234;tes plus &#224; l'aise avec le fonctionnement de votre programme.

 <P> Si ceci est votre premi&#232;re exp&#233;rience de l'utilisation d'un programme de transfert de wagons g&#233;n&#233;r&#233; par ordinateure, il est pr&#233;f&#233;rable de commencer par un petit travail et progressivement de cheminer &#224; travers les diff&#233;rentes options et fonctionnalit&#233;s disponibles. Commencez par entrer seulement trois ou quatre lieux <A HREF="#Locations"> </A> avec chaque emplacement
ayant seulement deux ou trois voies. Gardez les choses simples et ne modifiez pas les
lieux et les voies par d&#233;faut en les rendant contraignantes en ce qui concerne
le type de wagons ou locomotives qui  assureront la desserte de ce lieu et voies par des trains venant de n'importe quelle direction.  Ne changez pas les param&#232;tres par d&#233;faut jusqu'&#224; ce
vous puissiez r&#233;ussir &#224; asssembler des trains &#224; votre go&#251;t. </P> 

 <P> Maintenant, entrez quelques wagons <A HREF="#CarsEdit"> </A> dans la base de donn&#233;es Exploitation
, ne vous emb&#234;tez pas &#224; entrer les locomotives pour l'instant. Soyez s&#251;r de placer les
wagons sur une voie en utilisant <A HREF="#CarsEdit"> &#201;dition Wagon </A> ou la fen&#234;tre <A HREF="#CarsSet"> ld&#233;finir Wagon </A> . Le
programme fonctionne mieux si vous gardez au moins 50% de vos voies vides, alors
ne placez pas trop de wagons sur les voies jusqu'&#224; ce que vous compreniez comment le programme construit les trains. </P> 

 <P> Maintenant, cr&#233;ez un simple trajet <A HREF="#Routes"> </A> que votre premier
 train va suivre. Entrez chacun de vos lieux sur l'itin&#233;raire, et les garder
simples en entrant seulement une fois chacun de vos lieux dans l'itin&#233;raire. Pour l'instant
ne pas modifier l'itin&#233;raire en aucune fa&#231;on, utiliser juste le bouton "Ajouter Lieu ". </P> 

 <P> Maintenant vous &#234;tes pr&#234;t &#224; cr&#233;er votre premier <a HREF="#Trains"> train </A> .
Soyez s&#251;r de choisir l'itin&#233;raire que vous avez cr&#233;&#233; pour votre premier train. Laissez toutes
les cases &#224; cocher vides ce qui signifie que le train peut  utiliser tous les wagons et
types de locomotives. Laissez les "Options" pour les locomotives et la zone caboose pour
le moment. Enregistrer le train, fermez la fen&#234;tre et revenir &#224; la fen&#234;tre Trains.
Appuyez sur le  bouton <A HREF="#BuildingTrains"> Assembler </A> pour le train. Il devrait se asssembler. Maintenant presser la touche "Imprimer" ou le bouton "Aper&#231;u" va produire un
manifeste pour votre train. A l'examen du manifeste vous devriez voir que le
le train fournit tous les types de wagons. Si vous examinez la fen&#234;tre <A HREF="#Cars"> Wagons </A> , vous pouvez voir quels wagons sont d&#233;sormais affect&#233;s &#224; votre train. </P> 

 <P> Maintenant, essayez de limiter les types de wagon que le train va fournir en
modifiant certaines cases de types de wagons dans la fen&#234;tre <A HREF="#Trains"> &#201;dition Train </A> . Utilisez le bouton <A HREF="#TrainReset"> r&#233;init </A> train pour lib&#233;rer
les wagons qui ont &#233;t&#233; affect&#233;s &#224; la formation afin que vous puissiez l'assembler &#224; nouveau
sans bouger le train. Avec les nouveaux types restreints de wagons en place, vous pouvez voir que le train
ne prendra et d&#233;posera que les types de wagons qui ont &#233;t&#233; s&#233;lectionn&#233;s dans la fen&#234;tre &#201;dition Train </P> 

 <P> Maintenant, essayez de restreindre vos <a HREF="#Yards"> voies </A> pour seulement
certains types de wagons en modifiant les types de wagons fournis par une voie.
Maintenant, quand vous construisez le train, le train liste seulement les wagons pour les voies
qui sont pr&#234;tes &#224; les accepter. </P> 

 <P> Appuyez sur le bouton <A HREF="#TrainMove"> D&#233;placer </A> situ&#233; dans la fen&#234;tre <A
HREF= "#Trains"> Trains </A> et vous verrez que le train
va passer d'un emplacement &#224; l'autre dans l'itin&#233;raire. Vous verrez aussi que la fen&#234;tre
 <a HREF="#Cars"> Wagons </A> sera mise &#224; jour pour montrer les wagons
fournis par le train en marche vers leur nouvel emplacement quand les trains se d&#233;placent
d'un endroit &#224; un autre. </P> 

 <P> Maintenant, entrez  certaines <A HREF="#Locomotives"> locomotives </A> dans la
base de donn&#233;es de l'exploitation, et  modifier les exigences du train pour n&#233;cessiter une
locomotive. Placer une partie de vos locomotives sur une voie situ&#233;e au
d&#233;part de l'itin&#233;raire. Notez que si vous voulez que deux ou plusieurs locomotives
tractent votre train, les locomotives doivent &#234;tre dans un <A
Href= "#LocomotivesAdd"> Couplage </A> . Le dernier emplacement de votre itin&#233;raire
doit avoir une voie qui assurera la r&#233;ception  du <A
HREF= "#LocomotiveModels"> Type </A> de la locomotive ou l'assemblage &#233;chouera. </P> 

 <P> Si vous voulez un fourgon de queue ou une wagon avec Fred pour votre train, tout d'abord
configurer certains de vos wagons en fourgon de queue en s&#233;lectionnant le fourgon de queue ou la
 <A HREF="#CabooseFredHazardous"> case FRED </A> dans la fen&#234;tre Edition Wagon
. Maintenant changer le bouton radio Requ&#234;te Optionnelle pour le train d'un Caboose ou Fred.
Soyez s&#251;r que le dernier emplacement sur votre itin&#233;raire des trains a une voie qui
acceptera la wagon fourgon de queue ou le train ne s'assemblera pas correctement. </P> 

 <P> Si vous continuez &#224; asssembler votre premier train et en le d&#233;pla&#231;ant, &#233;ventuellement
tous vos wagons finissent &#224; la derni&#232;re position dans votre itin&#233;raire! Cr&#233;er
une autre voie qui est l'inverse du premier train. Allez &#224; <A
HREF= "#Routes"> Itin&#233;raires </A> et sous le menu "Outils" s&#233;lectionner "Copier Itin&#233;raire".
Choisissez votre itin&#233;raire initial, cochez la case "Inverser",
entrez un nom pour cet itin&#233;raire, puis le bouton "Copier". Maintenant, cr&#233;ez un
deuxi&#232;me train qui utilise cette voie pour envoyer les wagons dans la direction oppos&#233;e
&#224; votre premier train. </P> 

 <P> Vous devriez maintenant &#234;tre sur la bonne voie en ce qui concerne les Exploitationns JMRI
. L'aide est &#233;galement disponible sur <a HREF= "http://groups.yahoo.com/group/jmriusers/"> la liste jmriusers </A> </P> 



 <A NAME="BritishRailways"> </A> 
 <H3> Chemin de Fer Britannique </H3> 

Le programme supporte un autre jeu de la terminologie ferroviaire pour nos
Mod&#233;listes Britanniques. Pour utiliser la terminologie britannique, modifier l'affichage JMRI avec la 
Locale  anglaise (Royaume-Uni). Avec la terminologie britannique, les trains
voyages Haut/Bas et Est/Ouest, et certains noms de chemins de fer britanniques et types de wagons
 sont fournis pour vous aider &#224; d&#233;marrer. 

 <A NAME="Settings"> </A> 
 <H2> R&#233;glages </H2> 

La fen&#234;tre Param&#232;tres contient les param&#232;tres g&#233;n&#233;raux pour le programme Exploitation
. S&#233;lectionnez dans la fen&#234;tre principale JMRI "Outils-> Exploitation> Param&#232;tres"
pour ouvrir la fen&#234;tre Param&#232;tres. La fen&#234;tre de r&#233;glage a des champs et des boutons pour
vous permettre d'entrer votre nom de chemins de fer, les directions de voyage de votre train,
, l'&#233;chelle que vous utilisez, les commandes de l'imprimante et l'ic&#244;ne, et le
capacit&#233; de cr&#233;er des sauvegardes et restaurer les fichiers pour l'exploitation.
 <P> 
 <img src="images/Settings.png"> 
 </P> 
 <H3> Nom de la Compagnie </H3> 

Entrez votre nom dans le champ  en face du "Nom de la Compagnie". Ce
nom appara&#238;tra sur votre manifeste. Vous pouvez aussi avoir un autre
Nom de Compagnie pour tous les trains dans votre liste, voir
Options de <A HREF="#TrainOptions"> Train </a> pour plus de d&#233;tails.

 <H3> Direction du Train </H3> 

Si votre chemin de fer repr&#233;sente les trains voyageant vers le nord et le sud s&#233;lectionner la boite
"Nord/Sud", si vos train voyagent de l'est et l'ouest  s&#233;lectionner la boite
"Est/Ouest". Vous devez s&#233;lectionner au moins une direction, et pouvez, si
souhait&#233; s&#233;lectionner les deux.

 <A NAME="Scale"> </A> 
 <H3> &#201;chelle </H3> 

Ensuite, s&#233;lectionnez l'&#233;chelle &#224; laquelle vous mod&#233;lisez. Ceci est utile lorsque vous entrez
la longueur des wagons et des voies. Vous pouvez entrer le nombre de pouces r&#233;els
et le programme va le convertir &#224; l'&#233;chelle en pieds. Ajouter un guillemet &#224; la
Longueur en entrant pouces r&#233;els. Le programme saura aussi automatiquement
attribuer le poids NMRA appropri&#233; pour un wagon bas&#233; sur l'&#233;chelle et la longueur.


 <A NAME="MaximumTrainLength"> </A> 
 <H3> Longueur maximale des trains </H3> 

Maintenant, entrez la valeur par d&#233;faut "Longueur Maximale des Trains" que vous d&#233;sirez pour vos trains.
Ce champ indique la longueur maximale par d&#233;faut du train entre les villes.
Plus tard, vous pouvez remplacer cette longueur si vous souhaitez par une plus courte entre
deux emplacements. Un train de 1000 pieds peut transporter environ 20 wagons,
et est bien s&#251;r d&#233;pendant de la longueur des wagons affect&#233;s au train.

 <H3> Nombre maximal des locomotives </H3> 

Maintenant d&#233;finir le nombre maximal de locomotives que vous voulez que le programme
affectee &#224; un train. Si vous ne voulez pas que le programme attribut de locomotive, mettre cette
 valeur &#224; 0.

 <H3> Man&#339;uvre et Temps de Voyage </H3> 

Le programme lors de la g&#233;n&#233;ration des listes pour les man&#339;uvres &#224; divers endroits sur
votre chemin de fer, permettra d'estimer l'heure d'arriv&#233;e des trains bas&#233;e sur votre
heure de d&#233;part du train et le temps de man&#339;uvre et de voyage. Entrez le
nombre moyen de minutes qu'il faut pour d&#233;poser ou collecter un wagon sur votre
r&#233;seau. Ensuite, entrez la quantit&#233; moyenne de temps en minutes qu'il faut pour
voyager d'un endroit &#224; l'autre. Plus tard, lorsque vous cr&#233;ez un itin&#233;raire <A HREF="#Edititin&#233;raire"> </A> 
vous serez en mesure d'augmenter ou de diminuer le temps de d&#233;placement du train entre les
deux emplacements.

 <H3> Types de Wagons </H3> 

Le programme comporte deux ensembles de types de wagons &#224; utiliser pour vous. Descriptif:
fournit des noms de type comme "Boxcar" et "Tankcar", et AAR :fournit des typex 
des noms comme "XM" et "T" pour wagons couverts et wagons-citernes, respectivement. S&#233;lectionnez
celui que vous pr&#233;f&#233;rez.

 <H3> Ann&#233;e Optionnelle de la mod&#233;lisation </H3> 

Vous pouvez &#233;ventuellement entrer l'ann&#233;e que vous voulez imprimer sur votre manifeste train.

 <H3> Ajouter Menu Exploitation au Menu Principal </H3> 

Lorsqu'elle est s&#233;lectionn&#233;e, ajoute le menu Exploitation &#224; la barre de menu principal. Le
 menu d'exploitation appara&#238;tra la prochaine fois que vous red&#233;marrez JMRI.

 <H3> Fermer sur Sauvegarder </H3> 
Lorsqu'elle est s&#233;lectionn&#233;e, les fen&#234;tres se ferment lorsque le bouton "Sauvegarder" est enfonc&#233;.
 
 <H3> Sauvegarde Auto </h3> 
    Lorsqu'elle est s&#233;lectionn&#233;e, le programme enregistre automatiquement les fichiers de fonctionnement apr&#232;s avoir &#233;t&#233;
    chang&#233;. Quand un changement survient le programme apr&#232;s 1 &#224; 2 minutes sauvegarde automatiquement les fichiers Exploitation.

   <H3> Backup automatique </h3> 

    Une fois s&#233;lectionn&#233;, le programme va cr&#233;er un ensemble de sauvegarde des fichiers Exploitationchaque fois que le programme est
   d&#233;marr&#233;. Voir <A HREF="#BackupRestore"> Sauvegarde et Restauration </a> pour plus d'informations.

 <H3> Options du Panneau (Ic&#244;nes Train) </H3> 

Si vous voulez que le programme d'Exploitation place une ic&#244;ne repr&#233;sentant le
train sur un panneau, saisissez le nom du panneau (PAS le chemin du nom de fichier panneau
!), sinon laissez le nom en blanc pour d&#233;sactiver.
Chargez le panneau en utilisant le menu principal "Panneau de configuration-> Charger Panneaux  ..." ou utiliser d'autres options
de chargement du panneau disponible en JMRI.

 <P> La case "Activer Ic&#244;ne Train en X & Y" lorsqu'elle est s&#233;lectionn&#233;e vous permet de
d'apprendre au programme Exploitation o&#249; placer l'ic&#244;ne du train sur votre panneau et de
 transf&#233;rer votre train de lieu en lieu. D&#233;cocher cette fonction
apr&#232;s avoir renseign&#233; le programme vise &#224; pr&#233;venir la modification acciembranchementelle de
l'ic&#244;ne de position du train sur votre panneau. Si vous souhaitez &#233;galement que le num&#233;ro de la locomotive de t&#234;te apparaisse dans le cadre de votre texte de l'ic&#244;ne train, choisissez la boite "Ajouter Num&#233;ro de Locomotive ". Vous pouvez s&#233;lectionner la couleur de fond de votre ic&#244;ne du Train selon la direction du train. S&#233;lectionnez la couleur souhait&#233;e
pour chaque direction en utilisant les menus d&#233;roulants. Une <A
Href= "#SwitcherService"> Loco de Man&#339;uvre </A> est un train avec un seul emplacement
dans son itin&#233;raire
 <P> 
 <img src="images/PanelWithMarkers.png"> 
 </P> 

 <H3> Sauvegarder </H3> 

Lorsque vous avez termin&#233; avec la fen&#234;tre des param&#232;tres, appuyez sur le bouton Enregistrer pour
enregistrer le r&#233;glage dans un fichier appel&#233; "Operations.xml". Vous pouvez trouver ce
fichier dans votre r&#233;pertoire JMRI dans un dossier appel&#233; "operations". Le programme
va &#233;galement cr&#233;er un fichier de sauvegarde chaque fois que vous appuyez sur le bouton Enregistrer.

 <H3> <A NAME="BackupRestore"> </A> Sauvegarde </H3> 

 <p> Des copies des fichiers d'exploitation peuvent &#234;tre faits pour fournir des sauvegardes &#224; la fois pour la r&#233;cup&#233;ration d'erreur et     pour l'archivage. Les fichiers de donn&#233;es utilis&#233;s pour l'exploitation est un ensemble de six dossiers, et ils sont 
appel&#233;s comme un "jeu de sauvegarde". Le programme comporte deux endroits qu'il utilise pour stocker ces jeux de sauvegarde, nomm&#233;s
    l'"Enregistrement de sauvegarde automatique " et l'"Enregistrement  de sauvegarde r&#233;guli&#232;re". Ceux-ci sont stock&#233;s dans le
    r&#233;pertoire JMRI"operations" dans votre r&#233;pertoire comme "autobackups" et "sauvegardes". le but des sauvegardes automatiques est de faire une copie des fichiers "en lieu s&#251;r" avant que des changements soient
    apport&#233;s aux fichiers principaux d'Exploitations. De cette fa&#231;on, si quelque chose est foir&#233;, il y aune copie de la
    derni&#232;re adresse connue de bonnes donn&#233;es qui peuvent facilement &#234;tre restaur&#233;es pour r&#233;parer les d&#233;g&#226;ts. En fonctionnement normal, une sauvegarde automatique est effectu&#233;e chaque fois que le programme d&#233;marre (si le param&#232;tre "Sauvegarde automatique" est coch&#233;e sur la page Param&#232;tres), et juste avant une Restauration, R&#233;initialisation de la Base de donn&#233;es, ou qu'un chargement de fichiers de d&#233;monstration  est fait. </p> 
 <p> Tous les jeux de sauvegarde ont un nom par d&#233;faut bas&#233; sur la date &#224; laquelle la sauvegarde a &#233;t&#233; effectu&#233;e, ainsi qu'une s&#233;quence de nombre, mais ce nom peut &#234;tre chang&#233; en quelque chose que l'utilisateur souhaite pour des sauvegardes r&#233;guli&#232;res. il est recommand&#233; que les noms des jeux de sauvegardes effectu&#233;es &#224; des fins d'archivage donner un nom significatif, surtout si vous g&#233;rez des donn&#233;es pour plus d'un chemin de fer. Par exemple, si aujourd'hui est Ao&#251;t 29, 2012, le programme va cr&#233;er un r&#233;pertoire de sauvegarde appel&#233; "2012_08_29_00". </P> 

 <A NAME="Restore"> </A> 
   <H3> Restaurer </h3> 

      <p> Notez que la restauration d'un jeu de sauvegarde &#233;crase les fichiers d'exploitation en cours, donc une
     Sauvegarde automatique est effectu&#233;e juste avant la restauration copie les fichiers, "juste au cas o&#249;". </P> 

   <p> les jeux de sauvegarde surpeuvent &#234;tre restaur&#233;s &#224; partir soit de l'enregistement automatique ou l'enregistement ordinaire en utilisant le Bouton "Restaurer" sur la page Param&#232;tres. Sinon, l'option "Restaurer" sur le menu Outils
      de la page Param&#232;tres d'Exploitation vous permet de naviguer vers n'importe quel r&#233;pertoire, et doit &#234;tre utilis&#233;
     pour restaurer un jeu de sauvegarde archiv&#233;e. </p> 

   <img src="images/RestoreDialog.png"> 

   <p> La date et l'heure &#224; laquelle le jeu de sauvegarde a &#233;t&#233; fait sont affich&#233;es avec le nom mis pour
     aider &#224; distinguer le jeu de sauvegarde correcte. </p> 

   <p> Vous devez quitter et red&#233;marrer JMRI pour achever la restauration des fichiers d'exploitation. </p> 


 <A NAME="ResetDatabase"> </A> 
  <H3> R&#233;initialisation base de donn&#233;es </h3> 

  <p> Pour r&#233;initialiser les donn&#233;es de fonctionnement et supprimer tous les fichiers d'exploitation, utilisez l'option "R&#233;initialiser Base de Donn&#233;es" sur le Menu Outils de la page Param&#232;tres d'Exploitation. Une copie de sauvegarde automatique des fichiers d'exploitation courants sera faite avant la suppression des fichiers principaux. Les r&#233;sultats seront que les param&#232;tres, les wagons, locomotives, les lieux, et les fichiers de trains seront purg&#233;s. Notez qu'apr&#232;s cela soit fait et red&#233;marre JMRI, l'&#233;l&#233;ment de menu "Exploitation" dans le menu principal ne sera plus visible, car il n'y a pas de fichiers d'exploitation &#224; charger. Si vous voulez de nouveau utiliser la fonctionnalit&#233; de l'Exploitation, vous pouvez charger les fichiers de d&#233;monstration ou de restaurer une sauvegarde pr&#233;c&#233;embranchemente. Pour ce faire, ouvrez la page Param&#232;tres d'exploitation en s&#233;lectionnant l'option "Param&#232;tres" dans le menu Outils- > Op&#233;rations de la page principale. De l&#224;, vous pouvez faire soit une restauration ou une chargement des fichiers de d&#233;monstration de la mani&#232;re habituelle. </P> 

 Il n'y a pas de fichiers d'exploitation &#224; charger. Si vous voulez de nouveau utiliser la fonctionnalit&#233; de l'exploitation, vous pouvez charger les fichiers de d&#233;monstration ou de restaurer une sauvegarde pr&#233;c&#233;embranchemente. Pour ce faire, ouvrez la page Param&#232;tres d'exploitation en s&#233;lectionnant l'option "Param&#232;tres" dans le menu Outils- > Op&#233;rations de la page principale. De l&#224;, vous pouvez faire soit une restauration ou recharger des fichiers de d&#233;monstration de la mani&#232;re habituelle. </P> 


 <P> <img Src="images/SettingsOptions.png"> </P> 

 <H3> Options d'Assemblage </H3> 

Il y adeux options d'assemblage du train, normale et agressive. Il est
recommand&#233; que vous s&#233;lectionnez l'option normale lorsque vous commencez &#224; utiliser le
programme. L'assemblage normal garantie que quand un wagon est livr&#233; 
par un train qu'il y aura une longueur de voie disponible pour ce wagon.

 <P> 
L'assemblage agressif rend la longueur de voie du wagon disponible d&#232;s qu'un
wagon est pr&#233;vu pour &#234;tre collect&#233;. Donc il peut y avoir des cas o&#249; un
train collecte un wagon pour quitter la voie, mais un autre train pr&#233;vu plus tard arrive plus t&#244;t avec un wagon &#224; livrer sur cette voie et l'autre wagon n'a pas encore &#233;t&#233; collect&#233;. Cependant, le plus souvent ce ne sera pas le m&#234;me train qui effectuera la
collecte et la livraison  minimisant ainsi le nombre de conflits. L'assemblage agressif effectue aussi
 une d&#233;termination par deux passes de mouvements pour les wagon. L'effet net est
que les wagons sont plus d&#233;plac&#233;s dans un train donn&#233;. Agressif tend &#233;galement &#224;
livrer des wagons aux embranchements disponibles. Le plus petit embranchement, triage, ou inter&#233;change
tel qu'il est probable que le programme attribuera les wagons &#224; cette voie. </P> 
 <P> 
Notez qu'une fois que vous avez construit un train, l'option d'assemblage ne peut &#234;tre chang&#233;e jusqu'&#224; ce que
tous les trains soient termin&#233;s ou r&#233;initialis&#233;s.
 </P> 

 <A NAME="AllowLocalCarMovements"> </A> 
  <H3> Service de Man&#339;uvre </H3> 

Le prochain jeu d'options commandee les mouvements locaux de wagon. Normalement, il est
pr&#233;f&#233;rable de ne pas permettre &#224; un wagon de se d&#233;placer d'un embranchement directement &#224; un autre
 dans le m&#234;me lieu. Ce type de mouvement peut &#234;tre tr&#232;s irr&#233;aliste,
image anim&#233;e d'un wagon couvert d'une fabrique de chaussures directement &#224; une fabrique automobile.
Aussi le d&#233;placement d'un wagon d'un voie de triage &#224; l'autre peut voir vos op&#233;rateurs
demander quel genre de travail est g&#233;n&#233;r&#233;! Mais si vous avez besoin
de ces types de mouvements, cochez la case appropri&#233;e.

 <A NAME="TypeRoadLoadRestrictionsStaging"> </A> 
 <H3> Activer les Restrictions de Type, de Ligne et de Charge dans la Coulisse </H3> 

L'option suivante est la restriction des trains pour les voies de coulisse qui n'
acceptent que le type, la ligne et les charges des trains du stock de mat&#233;riel roulant. Lorsque le bouton "Activer Restriction du Type, de la Ligne et de la Charge dans la coulisse "est s&#233;lectionn&#233;, le programme ne d&#233;livrera un train qu'&#224; une voie de coulisse qui a les m&#234;mes restrictions. Ceci est utile lorsque vous voulez livrer des trains &#224; une coulisse et que ce soit bas&#233;s sur les restrictions du train roulant. Toutefois, si vous voulez que certains types de wagons, de charge de wagon, ou noms de ligne soient transport&#233;s par un train, mais non livr&#233;s &#224; la coulisse, d&#233;cochez cette option.
 <P> Si vous sp&#233;cifiez un certain train ou une voie pour &#234;tre accept&#233; par une voie en coulisse, cette option est
     ignor&#233;e, et vous pouvez alors contr&#244;ler les types de wagons, les charges, et de la ligne qui doivent &#234;tre accept&#233;es par la voie en coulisse. </P> 

   
 <H3> <A NAME="PromptDepartureTrack"> </A> 
Invite pour voie de D&#233;part de Coulisse </H3> 

Si vous souhaitez que le programme vous demandera de quelle voie un train doit
partir de la coulisse lors de la Asssemblage du train, s&#233;lectionnez cette option. Normalement
pendant que la Asssemblage du train le programme  s&#233;lectionnera au moins la voie la plus r&#233;cente utilis&#233;e comme voie de D&#233;part
. Notez que le
programme ne vous le demandera que s'il y adeux ou plusieurs trains disponibles
dans la coulisse qui r&#233;ponembranchement aux exigences du train.

 <A NAME="MakeDepartureTrackAvailable"> </A> 
   <H4> Rendre des Voies de D&#233;part Disponibles apr&#232;s Assemblage du Train </h4> 

    Lorsque cette option est s&#233;lectionn&#233;e, elle rend la voie de d&#233;part dans la coulisse disponible pour les autres trains imm&#233;diatement apr&#232;s que le train au d&#233;part ait &#233;t&#233; assembl&#233;. Pour les trains qui retournent au m&#234;me endroit de la coulisse, cette l'option permet au train d'utiliser la m&#234;me voie, qu'il a quitt&#233;e. Cette option n'est disponible que lorsque vous utilisez le mode <A HREF="#BuildOptions"> agressif </A> pour les trains &#224; assembler.

 <A NAME="AllowCarsToReturnToStaging"> </A> 
   <H4> Permettre aux Wagons de Revenir &#224; la Coulisse si N&#233;cessaire </h4> 

    Quand un train part et revient au m&#234;me emplacement de la coulisse, c'est consid&#233;r&#233; comme un tour par le programme. A son tour, il prend normalement les wagons &#224; partir de la coulisse, les pr&#233;sente sur le trac&#233;, ramasse les wagons neufs et retourne &#224; la coulisse avec ces wagons. Normalement, le programme ne permet pas aux m&#234;mes wagons d'aller et revenir &#224; la coulisse. Toutefois, il peut &#234;tre souhaitable de permettre au train de transporter les wagons plut&#244;t que d'avoir le rapport du programme que les wagons dans la coulisse ne pouvaient pas &#234;tre livr&#233;s &#224; destination sur la coulisse. La s&#233;lection de cette option permet un tour pour le transport des wagons vers et &#224; partir du m&#234;me emplacement de la coulisse. Notez que lorsque cette option est s&#233;lectionn&#233;e, que le programme retournera seulement les wagons &#224; la coulisse quand les destinations ne sont pas disponibles sur le r&#233;seau.

   <P> 
     Cette option est &#233;galement disponible sur un train de base. Voir <A HREF="#TrainBuildOptions"> Train Options d'Assemblage </A> .

 <A NAME="PromptDepartureTrack"> </A> 
   <H4> Demander la Voie de D&#233;part de la Coulisse </h4> 

    Si vous souhaitez que le programme vous demande quelle voie le train devra utiliser au d&#233;part de la coulisse, pendant l'assemblage, s&#233;lectionnez cette option. Normalement, pendant l'assemblage du train le programme choisit la voie la moins r&#233;cemment utilis&#233;e pour d&#233;terminer la voie au d&#233;part. Notez que le programme ne vous demandera pas s'il y adeux ou plusieurs trains disponibles dans la coulisse qui r&#233;ponembranchement aux exigences du train.
 
 <A NAME="PromptArrivalTrack"> </A> 
 <H4> Demander la Voie d'Arriv&#233;e de la Coulisse /h4> 

    Si vous souhaitez que le programme vous demande quelle voie le train devra utiliser &#224; l'arriv&#233;e de la coulisse, pendant l'assemblage, s&#233;lectionnez cette option. Normalement, pendant l'assemblage du train le programme choisit la voie la moins r&#233;cemment utilis&#233;e pour d&#233;terminer la voie d'Arriv&#233;e. Notez que le programme ne vous demandera pas s'il y adeux ou plusieurs trains disponibles dans la coulisse qui r&#233;ponembranchement aux exigences du train.


 <A NAME="CarRouting"> </A> 
 <H3> Routage Wagon </H3> 

 <P> Quand le routage du wagon est activ&#233;, le programme va utiliser plusieurs trains
pour amener ce wagon &#224; sa destination finale. Il est recommand&#233; que vous
laissiez cette option activ&#233;e. Avec le routage du wagon activ&#233;, vous pouvez utiliser un <A
HREF= "#Schedules"> Horaire </A> pour livrer un wagon &#224; un endroit pr&#233;cis.
L'algorithme de routage de wagon va rechercher l'itin&#233;raire le plus efficace pour
le voyage du wagon. L'algorithme va tenter d'utiliser des inter&#233;changes et
 des triages pour d&#233;placer le wagons. Si vous ne voulez pas le itin&#233;raireur &#224; utiliser les triages, vous pouvez d&#233;s&#233;lectionner l'option "Activer Routage Wagon via les Triages". Le Routage via la coulisse est d&#233;sactiv&#233; par d&#233;faut.
L'algorithme va essayer de trouver un itin&#233;raire en utilisant un maximum de cinq trains
pour terminer le d&#233;placement du wagon. Notez que le programme ne donne jamais &#224; essayer de
itin&#233;rairer un wagon. Si un wagon a &#233;t&#233; attribu&#233; &#224; une "Destination Finale", le programme
vais essayer et itin&#233;rairer le wagon apr&#232;s chaque mouvement. </P> 
 <A NAME="LoggingOptions"> </A> 

 <A NAME="LoggingOptions"> </A> 
 <H3> Options de Rapport </H3> 

Si vous voulez que le programme Exploitation enregistre les mouvements de  votre locomotive, wagon ou train dans 
un fichier, s&#233;lectionnez les cases appropri&#233;es. Le programme va cr&#233;er une nouveau
r&#233;pertoire appel&#233; "logger" dans le r&#233;pertoire des Op&#233;rations. Pour la session de chaque jour
le programme va cr&#233;er un nouveau fichier (. csv) en utilisant la date du jour.

 <A NAME="ManifestOptions"> </A> 
 <H3> Options </H3> 

Si vous voulez cr&#233;er votre propre manifeste en utilisant des valeurs s&#233;par&#233;es par une virgule (.Csv), s&#233;lectionnez
cette option. Vous pouvez utiliser un programme comme Excel pour cr&#233;er un manifeste &#224; votre go&#251;t.
Vous pouvez trouver les fichiers manifeste dans le r&#233;pertoire des Operationss dans un r&#233;pertoire appel&#233; "csvManifests".
Chaque ligne du fichier commence par un code &#224; deux ou trois lettres, suivie de la description du code,
et ensuite tous les param&#232;tres associ&#233;s avec le code.
Voici une liste des codes actuels et leurs descriptions:
 <P> </P > 
 <table> 
 <tr> <td> Code </td> <td> Description </td> <td> Param&#232;tres </td> </tr> 
 <tr> <td> AH </td> <td> Ajouter Assistances </td> </tr> 
 <tr> <td> AT </td> <td> Heure d'arriv&#233;e </td> <td> Heure </td> </tr> 
 <tr> <td> CC </td> <td> Changer Locos et Caboose </td> </tr> 
 <tr> <td> CL </td> <td> Changer Locos </td> </tr> 
 <tr> <td> DT </td> <td> Heure de d&#233;part </td> <td> Heure </td> </tr> 
 <tr> <td> DTR </td> <td> Heure de d&#233;part Itin&#233;raire </td> <td> Heure </td> </tr> 
 <tr> <td> EDT </td> <td> Heure D&#233;part Estim&#233;e </td> <td> Heure </td> </tr> 
 <tr> <td> LC </td> <td> Commentaire Lieu </td> <td> Commentaire </td> </tr> 
 <tr> <td> LN </td> <td> Nom Lieu </td> <td> Nom </td> </tr> 
 <tr> <td> LOGO </td> <td> Nom du chemin pour le logo </td> <td> URL </td> 
 <tr> <td> NW </td> <td> Pas de travail </td> </tr> 
 <tr> <td> PC </td> <td> Wagon ramass&#233; </td> <td> Voir ci-dessous </td> </tr> 
 <tr> <td> PL </td> <td> Loco ramass&#233;e </td> <td> Voir ci-dessous </td> </tr> 
 <tr> <td> PRNTR </td> <td> Nom Imprimante </td> <td> Nom </td> </tr> 
 <tr> <td> RC </td> <td> Commentaire Itin&#233;raire </td> <td> Commentaire </td> </tr> 
 <tr> <td> RLC </td> <td> Commentaire Emplacement Itin&#233;raire </td> <td> Commentaire </td> </tr> 
 <tr> <td> HR </td> <td> Retirer Assistances </td> </tr> 
 <tr> <td> RN </td> <td> Nom de la Compagnie </td> <td> Nom </td> </tr> 
 <tr> <td> SC </td> <td> D&#233;pose wagon </td> <td> Voir ci-dessous </td> </tr> 
 <tr> <td> SL </td> <td> D&#233;pose loco </td> <td> Voir ci-dessous </td> </tr> 
 <tr> <td> TC </td> <td> Commentaire train </td> <td> Commentaire </td> </tr> 
 <tr> <td> TD </td> <td> Train D&#233;part </td> <td> Nom </td> </tr> 
 <tr> <td> TL </td> <td> Longueur train </td> <td> Longueur, Vides, Nb de Wagons </td> </tr> 
 <tr> <td> TM </td> <td> Description du Manifeste Train </td> <td> Description </td> </tr> 
 <tr> <td> TN </td> <td> Nom train </td> <td> Nom </td> </tr> 
 <tr> <td> TRUN </td> <td> Tronquer </td> </tr> 
 <tr> <td> TT </td> <td> Train Termine </td> <td> Nom </td> </tr> 
 <tr> <td> TW </td> <td> Poids train </td> <td> Poids </td> </tr> 
 <tr> <td> VT </td> <td> valide </td> <td> Mois/jour/Ann&#233;e Heure </td> </tr> 
 </Table> 

 <P> Temps utilise le format Heure: Minute </P> 
 <P> Les param&#232;tres de wagon pour ramasser wagon (PC) et Livrer wagon (SC) sont: la ligne,
le num&#233;ro, le type, la longueur, charge, couleur, nom du lieu, nom de la voie,
nom de la destination, le nom de la voie de destination, le nom du propri&#233;taire, nom du noyau, 
commentaire wagon, commentaires ramassage, observations livraison, C, F, H, RFID. O&#249; C =
Caboose, F = FRED, et H = dangereux </P> 
 <P> Les param&#232;tres loco  pour ramasser Loco (PL) et livrer loco (SL) sont: la itin&#233;raire,
num&#233;ro, mod&#232;le, longueur, type, Puissance, nom du lieu, nom de la voie, nom de la destination
, nom de la voie de destination, le nom du propri&#233;taire, nom du couplage, le commentaire de wagon,
RFID. </P> 

 <P> Vous pouvez trouver quelques exemples de manifestes personnalis&#233;s &#224; <A
HREF=http://groups.yahoo.com/group/jmriusers/files/Operations> http://groups.yahoo.com/group/jmriusers/files/Operations. </A> </P> 
 <P> Vous pouvez &#233;galement cr&#233;er des fichiers (.Csv) de listes de manoeuvrespersonnalis&#233;es &#224; l'aide de valeur s&#233;par&#233;es par des virgules. Vous pouvez trouver les fichiers de listes de manoeuvresdans le r&#233;pertoire des op&#233;rations dans un r&#233;pertoire appel&#233; "csvSwitchLists". Les listes de manoeuvrescsv utilisent les m&#234;mes codes et les descriptions que les manifestes CSV, plus le suivant: </p> 

 <P> </P> 
   <table> 
    <tr> <td> Code </td> 	 <td> Description </td> 	   		 <td> Param&#232;tres </td> </tr> 
    <tr> <td> DL </td> 	 <td> Nom du lieu de D&#233;part </td> 	 	 <td> Nom </td> </tr> 
    <tr> <td> ETA </td> 	 <td> Heure d'Arriv&#233;e Attendue </td> 	 <td> Temps </td> </tr> 
    <tr> <td> ETE </td> 	 <td> Temps de Trajet Estim&#233; </td> 		 <td> Temps </td> </tr> 
    <tr> <td> NCPU </td> 	 <td> Pas de Wagons &#224; Collecter </td> </tr> 
    <tr> <td> NCSO </td> 	 <td> Pas de Wagons &#224; D&#233;poser </td> </tr> 
    <tr> <td> TA </td> 	 <td> Train Arrives </td> 			 <td> Direction </td> </tr> 
    <tr> <td> TDC </td> 	 <td> Train change Direction, D&#233;parts </td> <td> Direction </td> </tr> 
    <tr> <td> TIR </td> 	 <td> Train en itin&#233;raire </td> </tr> 
    <tr> <td> TDONE </td> 	 <td> Train a d&#233;j&#224; d&#233;sservi ce Lieu </td> </tr> 
    <tr> <td> VN </td> 	 <td> Visite Num&#233;ro </td> 			  <td> Nombre </td> </tr> 
   </table> 


 <P> Il y a deux autres options, "Activer les champs de valeur" et "Activer Champs Radio Frequency Iembranchementification (RFID)".
Vous pouvez utiliser ces champs pour entrer la valeur ou le co&#251;t de votre mat&#233;riel roulant et la RFID, si vous les utilisez
pour le suivi de votre mat&#233;riel roulant. Vous pouvez aussi renommer ces champs si vous le souhaitez et les utiliser &#224; d'autres fins. </P> 

 <A NAME="PrintOptions"> </A> 
 <h2> Options d'impression des Manifestes </h2> 

Vous pouvez modifier la fa&#231;on dont le programme imprime le manifeste du train et Les listes de manoeuvre par lieu. Depuis le menu "Exploitation-> Param&#232;tres-> Outils" s&#233;lectionnez "Options d'impression" pour ouvrir la fen&#234;tre d'options d'impression.
 <P> 
 <img src="images/PrintOptions.png"> 
 </P> 
 <H3> Police Imprimante Manifeste </H3> 

Le programme supporte plusieurs types de polices pour l'impression. S&#233;lectionnez la police d&#233;sir&#233;e
et la taille en utilisant les menus d&#233;roulants.

H3> Format de message </h3> 

    Si vous souhaitez que votre manifeste et listes de manoeuvressoit imprim&#233; dans un format tabulaire s&#233;lectionner la case &#224; cocher tabulaire
. Seules les polices &#233;quidistantes comme "Courier New" ou "mono-espace" sont affich&#233;es dans la bo&#238;te de s&#233;lection police
  

 <H3> Couleur du texte pour les livraisons </H3> 

Vous pouvez s&#233;lectionner la couleur du texte de votre manifeste lorsque l'op&#233;ration est de
livrer un wagon ou une locomotive. S&#233;lectionnez la couleur souhait&#233;e dans le menu d&#233;roulant
.

 <H3> Couleur du Texte Ramassage </H3> 

Vous pouvez s&#233;lectionner la couleur du texte de votre manifeste lorsque l'op&#233;ration est de
ramasser une wagon ou locomotive. S&#233;lectionnez la couleur souhait&#233;e dans le menu d&#233;roulant
.

 <H3> Couleur du Texte pour Mouvement Local </H3> 

Vous pouvez s&#233;lectionner la couleur du texte de votre manifeste lorsque l'op&#233;ration est de
d&#233;placer une wagon d'une voie &#224; une autre au m&#234;me endroit. Le wagon dans
dans ce cas n'est pas ajout&#233; au train. S&#233;lectionnez la couleur souhait&#233;e &#224; partir du
menu d&#233;roulant.

 <H3> Format Liste de Manoeuvre </ h3> 

    Vous pouvez utiliser le m&#234;me format que votre manifeste pour vos listes de manoeuvres, ou vous pouvez personnaliser votre
    liste de manoeuvres &#224; votre go&#251;t. D&#233;cochez la "M&#234;me comme Manifeste" si vous voulez un format diff&#233;rent pour
    vos listes de manoeuvre.
 
 <H3> Formats de Message </H3> 

Vous pouvez personnaliser les manifestes pour les ramassages, les livraisons, et  pour votre mouvement local
 et les listes de de man&#339;uvre en s&#233;lectionnant le menu appropri&#233; des menus d&#233;roulants.
Pour supprimer un attribut s&#233;lectionner vide. Vous pouvez &#233;galement modifier ou remplacer les pr&#233;fixes "[] livraisons",
"[] Collectes" et "[] Mouvement".  Deux pr&#233;fixes populaires sont "Spot" et "Pull" pour Livraisons et ramassages respectivement. Si vous souhaitez utiliser les option de couleur du texte, les pr&#233;fixes de
, livraison, collecte et mouvement  doivent &#234;tre uniques.

 <A NAME="ManifestComments"> </A > 
   <H3> Options Manifestes </h3> 

   Le programme vous permet de personnaliser votre manifeste de train &#224; votre go&#251;t. Il y a huit cases optionnelles et leurs fonctions sont d&#233;crites ci-dessous.
   <P> La case &#224; cocher "Impression valide" provoque le programme pour imprimer le jour et l'heure o&#249; le train a &#233;t&#233; assembl&#233;, ce qui n'est pas le m&#234;me que le jour o&#249; le manifeste a &#233;t&#233; imprim&#233;. Le temps d'impression est toujours affich&#233; en haut &#224; droite du manifeste. </P> 
   <P> 
    Chaque itin&#233;raire de l'emplacement et le train peuvent avoir un commentaire facultatif. Vous pouvez imprimer ces commentaires sur votre manifeste si les cases  "Emplacement" et " Itin&#233;raire" sont s&#233;lectionn&#233;s respectivement. Si vous voulez que le manifeste montre combien de wagons complets et vide sont dans le train, cochez la case "Charg&#233;s et Vides". Vous pouvez &#233;galement utiliser un format d'horloge de 12 heures plut&#244;t que de 24 heures sur vos manifestes et les listes de manoeuvres. Le manifeste indique g&#233;n&#233;ralement l'heure d'arriv&#233;e estim&#233;e pour le train &#224; chaque emplacement o&#249; le train doit &#234;tre manoeuvr&#233;, la s&#233;lection de l'"heure de d&#233;part" change de case &#224; cocher le format d' affichage de l'heure de d&#233;part. Vous pouvez si vous le souhaitez, imprimer votre manifeste sans heures de d&#233;part et d'arriv&#233;e. Voir <A HREF="#TrainManifestOptions"> Options Manifeste Train </a> pour plus de d&#233;tails .
   <P> 
    La s&#233;lection de "Afficher Horaires" imprime l' <A REF="#Timetable"> horaire du train </A> que vous utilisez lors de l'assemblage de vos trains .
   </P> 
   <P> L'option suivante est "Tronquer" et lorsqu'elle est s&#233;lectionn&#233; entra&#238;ne le programme &#224; r&#233;duire la quantit&#233; d'information imprim&#233;e lors de la d&#233;pose ou du ramassager d'un wagon &#224; un endroit qui dispose &#233;galement d'une liste de manoeuvre. L'id&#233;e ici est que vous avez un endroit occup&#233; par un op&#233;rateur avec une liste de manoeuvres et il ou elle fera ramasser ou d&#233;poser le wagon par le train. Puisque la liste de manoeuvres  contient toutes les informations n&#233;cessaires en ce qui concerne l'endroit o&#249; les wagons sont et finalement l&#224; o&#249; ils doivent &#234;tre, le manifeste du train montre seulement quels wagons sont retir&#233;s et ajout&#233;s au train. </P> 

   <P> Les derni&#232;res options est "Trier par Voie ". Le programme lors de la cr&#233;ation d'un manifeste de train r&#233;pertorie normalement les wagons dans l'ordre o&#249; ils doivent &#234;tre plac&#233;s dans le train pour le noyau appropri&#233;. Si vous pr&#233;f&#233;rez avoir les wagons &#233;num&#233;r&#233;s par le nom de la voie, s&#233;lectionnez l'option " Trier par Voie" .

 <H3> Apercu Manifeste </h3> 

    Si vous souhaitez utiliser un &#233;diteur de texte pour pr&#233;visualiser vos manifestes et les listes de manoeuvres, s&#233;lectionnez cette option. Cette option vous permet &#233;galement d'effectuer des modifications manuelles sur vos manifestes avant de les imprimer.

 <H3> Ajouter le Logo </H3> 

Si vous voulez un logo dans le coin sup&#233;rieur droit de votre manifeste et
listes de man&#339;uvre, appuyez sur le bouton "Ajouter Logo" et s&#233;lectionnez un fichier avec 
l'image que vous souhaitez afficher. Vous pouvez &#233;galement avoir un logo diff&#233;rent pour chaque
train dans votre liste, voir <A HREF="#TrainOptions"> Options Train </A> pour
plus de d&#233;tails.

 <A NAME="MisplacedCarsComment"> </A> 
 <H3> Commentaire Wagons Mal Plac&#233;s </H3> 

Le programme fournit un commentaire pour vos op&#233;rateurs pour rechercher <A HREF="#CarsSet"> les wagons &#233;gar&#233;s </A> . Vous pouvez modifier le commentaire &#224; votre go&#251;t.

 <A NAME="HazardousComment"> </A> 
    <H3> Commentaire Dangereux </h3> 

    Le programme va ajouter le "Commentaire Dangereux" pour les manifestes et les listes de manoeuvres quand un wagon a la case <A HREF="#CabooseFredHazardous"> dangereux </A> s&#233;lectionn&#233;e dans la fen&#234;tre "Edition Wagon" et le format de message "Dangereux" est s&#233;lectionn&#233; dans les options d'impression pour vos manifestes et listes de manoeuvres. Vous pouvez modifier le commentaire, si d&#233;sir&#233;, et appuyez sur "Enregistrer" pour garder la changement.


 <A NAME="BuildReportDetails"> </A> 
 <H3> asssembler Rapport D&#233;taill&#233;s </H3> 
Dans le menu "Exploitation-> Param&#232;tres-> Outils", s&#233;lectionnez "asssembler des Options de Rapport" pour ouvrir la fen&#234;tre des options du rapport d'assemblage.
Vous pouvez ajuster la quantit&#233; d'informations que le rapport d'assemblage montrera. S&#233;lectionnez l'un des quatre niveaux en utilisant les boutons radio. Le programme
lors de la g&#233;n&#233;ration des rapports enregistre des informations "Tr&#232;s d&#233;taill&#233;es" 
sur le disque. Les boutons radio contr&#244;lent la quantit&#233; de ces donn&#233;es qui sont r&#233;ellement
imprim&#233;es. Le bouton radio "Minimal"  donne le moins d''information et le "Tr&#232;s D&#233;taill&#233;" fournit le plus. Si vous &#234;tes seulement
int&#233;ress&#233;s de savoir pourquoi un train ne sera pas assembl&#233;, le r&#233;glage "Minimal" peut vous offrir
 cette information. Le r&#233;glage "Normal", qui montre les locomotives et les
wagons qui sont exclus du train, et les locomotives et les wagons qui sont
 collect&#233;s et livr&#233;s. Le "D&#233;tail" va en g&#233;n&#233;rer
quelques pages en fonction de la taille de votre Compagnie. Il va montrer tous les
wagons et les locomotives disponibles, et un peu la fa&#231;on dont le programme trouve les destinations
pour les wagons et locomotives. Le bouton "Tr&#232;s d&#233;taill&#233;" produit le plus de
pages, et montrera pourquoi les wagons ne sont pas collect&#233;s ou d&#233;pos&#233;s. Soyez s&#251;r et
appuyez sur "Enregistrer" apr&#232;s avoir chang&#233; la s&#233;lection du rapport d'assemblage.

 <P> Vous avez &#233;galement la possibilit&#233; d'utiliser un &#233;diteur de texte pour afficher votre rapport d'assemblage. Un &#233;diteur de texte peut rendre le d&#233;pannage d'un probl&#232;me beaucoup plus facile pour vous. Par exemple, disons que vous avez un wagone qui ne bouge pas. Utilisation de l'&#233;diteur de trouver fonctionnalit&#233;, vous pouvez consulter la rapport de build en utilisant le num&#233;ro de la itin&#233;raire de la wagon et de trouver rapidement pourquoi la wagon n'est pas capt&#233; par le train. Un des trucs
     lorsque vous utilisez un &#233;diteur de texte est d'augmenter le nombre de caract&#232;res par ligne, en r&#233;duisant la taille de la police sp&#233;cifi&#233;e dans la fen&#234;tre Options de rapport de build. </P> 

    <p> 
     Pour la plupart des utilisateurs, le r&#233;glage "Tr&#232;s D&#233;taill&#233;"est le plus appropri&#233; lors de la lecture du rapport d'assemblage  d'un train. Pour plus d'informations sur le contenu du rapport d'assemblage s'il vous pla&#238;t voir <A HREF="#TroubleShootingBuildingTrains"> Comment R&#233;soudre Probl&#232;mes Assemblages Trains </A> .

 <A NAME="Locations"> </A> 
 <H2> Emplacements </H2> 

Les emplacements sont des endroits sur votre r&#233;seau que les trains visitent pour ramasser ou d&#233;poser
les wagons et locomotives. Les emplacements peuvent &#234;tre des cit&#233;s, villes, ou tout simplement
 des endroits o&#249; les trains ont besoin de manoeuvrer les wagons. S&#233;lectionnez
"Outils-> Exploitation > Emplacements" pour ajouter ou modifier les emplacements sur votre
r&#233;seau.

 <P> 
 <img src="images/Locations.png"> 
 </P> 
 <P> 
La fen&#234;tre "Lieux" affiche tous les endroits o&#249; vos trains peuvent manoeuvrer. Pour chaque emplacement la fen&#234;tre affiche la longueur totale de toutes les voies &#224; cet endroit, la valeur de la voie utilis&#233;e par votre mat&#233;riel roulant, la quantit&#233; de mat&#233;riel roulant, et le nombre de ramassages et d&#233;poses de votre mat&#233;riel roulant qui est pr&#233;vu pourcet emplacement. Le bouton "chef de triage" produit une fen&#234;tre <A
      Href = "#SwitchList"> (Liste de manoeuvre) </A> qui vous permet de voir les ramassagess pr&#233;vue et d&#233;poses par train. Seuls les trains qui ont des manoeuvres &#224; l'emplacement sont disponibles.
 </P> 
 <P> 
 <img src="images/EditLocation.png"> 
 </P> 

 <P> Dans la fen&#234;tre "Ajouter un emplacement", entrez le nom de l'emplacement dans la
case en face du "Nom". Le nom de l'emplacement doit &#234;tre unique, le programme
ne permettra pas deux endroits avec des noms iembranchementiques. Toutefois, si vous voulez
plus d'un endroit &#224; avoir le m&#234;me nom pour votre manifeste et
listes de man&#339;uvres, ajouter un tiret et un num&#233;ro au nom de lieux. Pour
Par exemple, "Boston-1" et "Boston-2" sera imprim&#233; comme "Boston". Le programme
va supprimer le trait d'union et le num&#233;ro lors de l'impression du manifeste et de la liste de man&#339;uvres . </P> 

 <P> Appuyez maintenant sur le bouton "Ajouter Emplacement" au
le bas de la fen&#234;tre. Les diff&#233;rents champs  qui &#233;taient d&#233;sactiv&#233;s doivent
apparaitre maintenant.
 </P> 
Chaque emplacement peut avoir plusieurs voies <A HREF="#Yards"> de triages </A> , <A HREF="#Sidings"> d'embranchements </A> , <A
      Href = "#Interchange"> de classements/&#233;changes </A> <A ou HREF="#Staging"> de coulisse </A> .
 Les Triages sont l&#224; o&#249; les wagons et les locomotives sont plac&#233;s pour le stockage temporaire. Un embranchement peut &#234;tre une voie industriel ou tout endroit o&#249; un wagon est charg&#233; ou d&#233;charg&#233;. Une voie de classification/d'&#233;change est utilis&#233; pour &#233;changer des wagons entre les trains, ou pour cr&#233;er une gare de triage qui est utilis&#233; pour assembler des trains.
     Les Voies en Coulisse repr&#233;sentent des endroits &#233;loign&#233;s o&#249; les trains peuvent voyager &#224; travers pour &#234;tre utilis&#233; sur le r&#233;seau.
    <P> Pour qu'un train puisse desservir un lieu, il doit y avoir au moins une voie &#224; cet endroit. Voir ci-dessous comment ajouter des voie &#224; votre emplacement. </P> 
 <P> Les tableaux montrent la longueur des voies, la longueur de la voie
qui est occup&#233;e (utilis&#233;e) par les wagons et les locomotives, la longueur de voie r&#233;serv&#233;e, le nombre total de wagons
et de locomotives (mat&#233;riel roulant) &#224; chaque emplacement, le nombre de wagons et de
locomotives qui seront collect&#233;s par les trains, et le nombre de
wagons et locomotives qui seront livr&#233;s par les trains.Lorsque le programme assemble un train, la valeur r&#233;serv&#233;e indique la longueur de voie qui va &#234;tre consomm&#233;e par d&#233;pose. En mode agressif, la valeur r&#233;serv&#233;e indique &#233;galement la longueur de la voie qui va &#234;tre lib&#233;r&#233; par les collectes. Par cons&#233;quent, une valeur positive signifie que de la longueur de la voie va &#234;tre consomm&#233;e par les d&#233;poses, et un nombre n&#233;gatif signifie que de la longueur de la voie va &#234;tre lib&#233;r&#233;e par les collectes. </P> 

 <H3> Direction Desservie par ce Lieu </H3> 

Vous pouvez d&#233;cider quelle direction sera desservie par le train desservant cet emplacement.
Par exemple, si seul les trains &#224; destination de l'est peuvent acc&#233;der &#224; l'emplacement, s&#233;lectionner
"Est" et d&#233;cochez les autres directions. Cela peut &#234;tre utile si vous
voulez que ce point soit un lieu de convergence pour un lieu donn&#233;. Si un
emplacement peut soutenir de multiples directions, s&#233;lectionner alors celles qui sont
appropri&#233;es

 <H3> Emplacement et materiel roulant </H3> 

Vous pouvez contr&#244;ler le mat&#233;riel roulant qu'un emplacement peut desservir. Poussez les boutons
"Tout Effacer" pour d&#233;s&#233;lectionner tous les types, ou "S&#233;lectionner tout" pour s&#233;lectionner tous les
types, puis cochez ou d&#233;cochez le mat&#233;riel roulant que vous souhaitez que l'emplacement desserve.
 Apr&#232;s la configuration des voies pour un emplacement, vous pouvez utiliser la
"S&#233;lection automatique" pour avoir l'emplacement refl&#232;tant le mat&#233;riel roulant
desservi par les voies diverses.

 <H3> Lieu Commentaire </h3> 

    Vous pouvez entrer un commentaire facultatif pour votre emplacement. Si vous voulez que le commentaire soit imprim&#233; sur vos manifestes vous devez s&#233;lectionner l'option d'impression <A  HREF="#ManifestComments"> commentaires emplacement </A> 

 <A NAME="Yards"> </A> 
 <H3> Triages </H3> 

Une triage est utilis&#233;e pour stocker des wagons et des locomotives. L'&#233;tat de charge d'un wagon ne change pas lorsqu'il est livr&#233; &#224; une voie de triage. Pour ajouter une triage, s&#233;lectionnez le bouton radio "Triages" puis appuyez sur le bouton "Ajouter voie de triage".
 <P> 
    <img src="images/AddYard.png"> 
 </P> 

Maintenant, entrez le nom du triage avec la longueur de la voie en pieds ou dans l'&#233;chelle r&#233;elle en
pouces. Ajouter un guillemet (") &#224; la longueur lors de la saisie r&#233;elle en
pouces et le programme permet de convertir la longueur en pieds &#224; l'&#233;chelle. Ajouter
cm si vous voulez convertir des centim&#232;tres en m&#232;tres. Appuyez sur le bouton  "Ajouter Voie de triage " au bas de la fen&#234;tre et les champs d&#233;sactiv&#233; devraient maintenant appara&#238;tre.

 <H3> Mat&#233;riel Roulant Desservi </H3> 

Vous pouvez contr&#244;ler ce type de mat&#233;riel roulant que le triage peut desservir. Remarquez
que le mat&#233;riel roulant du triage est limit&#233; &#224; celui que l'emplacement
peut desservir. Si le mat&#233;riel roulant que vous souhaitez n'appara&#238;t pas pour un
triage, v&#233;rifiez que les types de mat&#233;riel roulant pour l'emplacement soient correctement
s&#233;lectionn&#233;s. Si le type de mat&#233;riel roulant que vous voulez n'existe pas pour un
emplacement, vous devrez cr&#233;er le type en utilisant la fen&#234;tre "Wagons", voir
 <A  HREF="#Cars"> wagons </A> ci-dessous.
gare de triage
 <H3> Noms de Ligne Desservies </H3> 

Vous pouvez &#233;galement restreindre les lignes qu'une cour peut desservir. S&#233;lectionnez "Accepter
Seul "si vous voulez asssembler une liste de noms de lignes que le triage
accepte. S&#233;lectionnez "Exclure" si vous voulez asssembler une liste de noms de ligne que
vous voulez exclure du triage.

 <H3> Chargement desservi </H3> 

Vous pouvez &#233;galement restreindre les wagons charg&#233;s qu'un triage peut accepter. S&#233;lectionnez "Accepter
Seul" si vous voulez asssembler une liste de noms de chargement de wagon que le chantier
accepte. S&#233;lectionnez "Exclure" si vous voulez asssembler une liste de noms de chargement de wagon que
vous voulez exclure du triage.

 <H3> Ordre de Ramassage de Wagons </H3> 

Il y atrois options pour collecter les wagons du triage. "Normal" utilise
le compteur de mouvement des wagons pour d&#233;terminer l'ordre dans lequel les wagons sont retir&#233;s du triage, "FIFO" (Premier Entr&#233;, Premier Sorti), et "LIFO" (Dernier Entr&#233;, Premier Sorti). LIFO est
utile si vous avez un simple triage ferm&#233; que vous utilisez pour les wagons de service. Pour
par exemple le stockage de wagons de charbon vides, il serait plus judicieux de tirer un wagon &#224; charbon vide
 de l'avant de la ligne au lieu du milieu du Triage.


 <H3> Commentaire </H3> 

Vous pouvez entrer un commentaire facultatif pour le triage.

 <H3> Enregistrer Voie de Triage </H3> 

Appuyez sur la "Enregistrer Voie de Triage " pour enregistrer votre travail. Le programme va cr&#233;er un
fichier (OperationsLocationRoster.xml) dans votre r&#233;pertoire JMRI dans un dossier
appel&#233; "operations". Le programme permettra &#233;galement de cr&#233;er un fichier de sauvegarde
contenant les derniers r&#233;glages pour l'ensemble de vos emplacements.

 <A NAME="Sidings"> </A> 
   <H3> Embranchements </h3> 

   Un embranchement est utilis&#233; pour desservir une industrie. Pour ajouter un embranchement, appuyez sur le bouton "Ajouter Embranchement ".les Embranchements sont tr&#232;s similaires aux <a HREF="#Yards"> Triages </A> , donc voir ci-dessus pour plus d'informations. Lors de la saisie de la longueur de l'embranchement, saisissez la longueur des wagons qui desserviront la voie industrielle ainsi que les longueurs d'attelage. Par exemple, disons que vous avez une voie industrielle que peut desservir deux 50' Boxcars, la longueur de la voie dans ce cas est de 100' plus 8' pour les coupleurs (4' pour chaque wagon), pour un total de 108. Vous pourriez &#233;ventuellement arrondir la longueur de 110 pieds ou plus.

   <P> Quand un wagon est plac&#233;e dans un Embranchement l'&#233;tat de charge dua wagonu est modifi&#233;. Le programme fournit deux noms de charge pour toutes les wagons, par d&#233;faut le "E" ou vide, et la charge par d&#233;faut ou  "L". Si un wagon a une de ces charges quand il arrive &#224; un embranchement, le nom de la charge passe &#224; l'autre, c'est &#224; dire "E" devient "L" et "L" devient "E". </P > 

   <P> 
    Vous pouvez si vous le d&#233;sirez programmer l'ordre dans lequel les wagons seront livr&#233;s &#224; un embranchement, ou demande des wagons avec certaines charges. Voir <A HREF="#Schedules"> Horaires </A> ci-dessous pour plus d'informations .
   </P> 

 <A NAME="Sidings"> </A> 
 <H3> Embranchements </H3> 

Un Embranchement est utilis&#233; au service d'une industrie. Pour ajouter un embranchement, appuyez sur le bouton Ajouter "
Embranchement". Les branchements sont tr&#232;s similaires aux <a HREF="#Yards"> Triages </A> ,
donc voir ci-dessus pour plus d'informations. Vous pouvez si vous le souhaitez planifier l'ordre dans lequelles les wagons seront livr&#233;es &#224; un embranchementn, ou demander des wagons  avec
certaines charges. Voir les <a HREF="#Schedules"> Horaires </A> ci-dessous pour plus d'informations. 
 <P> Quand une wagon est plac&#233; &#224; un embranchement l'&#233;tat de charge du wagon est modifi&#233;. Le programme
fournit deux noms de charge pour toutes les wagons, le vide par d&#233;faut ou "E", et le chargement par d&#233;faut
ou "L". Si une wagon a un de ces charges quand il arrive &#224; un embranchement, le nom de charge
va changer &#224; l'autre, c'est &#224; dire "E" devient "L" et "L" devient "E". </P> 
 <A NAME="Schedules"> </A> 
   
   </P> 
 <A NAME="Schedules"> </A> 
 <H3> Horaires </H3> 

Si vous souhaitez voir les wagons livr&#233;s dans un ordre particulier, ou
avec une charge sp&#233;cifique pour la livraison ou l'exp&#233;dition, le programme vous permet d'
appliquer un Horaire &#224; un embranchement. Ceci est une fonctionnalit&#233; optionnelle et ne doit pas
&#234;tre utilis&#233; tant que vous n'&#234;tes pas devenu tr&#232;s familier avec la fa&#231;on dont le programme g&#233;n&#232;re les
manifestes et les listes de man&#339;uvres. Un Horaire permet un contr&#244;le tr&#232;s fin sur l'ordre dans lequel les types wagons seront livr&#233;s &#224; un embranchement. Vous pouvez &#233;galement sp&#233;cifier
le nom de ligne pour le type de wagon livr&#233;. Par exemple, si vous vouliez
deux wagons SP pour &#234;tre livr&#233;s suivie d'un wagon-citerne charg&#233; de "p&#233;trole",
vous pouvez cr&#233;er un Horaire qui va faire exactement cela. Pour cr&#233;er un Horaire
presser le bouton "Editer" &#224; c&#244;t&#233; de "l'Horaire optionnel" tirer vers le bas le
menu sur la fen&#234;tre "Modifier Voie Embranchement". En appuyant sur la
bouton "Editer" devrait cr&#233;er la fen&#234;tre "Ajouter Horaire" .
 <P> 
 <img src="images/EditSchedule.png"> 
 </P> 
 <P> Entrez un nom pour votre Horaire et appuyez sur le bouton "Ajouter Horaire"
 sur le bas de la fen&#234;tre.Des embranchements multiples peuvent utiliser le m&#234;me
Horaire aussi longtemps que les embranchements utilisent les m&#234;me types de  wagon et les m&#234;mes lignes. Maintenant
ajouter votre premi&#232;re livraison pour cet embranchement en choisissant un type de wagon dans la
bo&#238;te de menu dans le coin inf&#233;rieur gauche de la fen&#234;tre et en appuyant sur le bouton
"Ajouter un type de wagon". Un nouveau point devrait figurer dans votre Horaire
contenant le type de wagon, un menu d&#233;roulant pour les noms de ligne, et une num&#233;rotation &#224; partir
de 1. Vous pouvez si vous le souhaitez sp&#233;cifier une ligne particuli&#232;re pour le type de wagon que
vous avez entr&#233;, ou laisser vide si vous ne vous souciez pas du nom de la ligne.
Vous pouvez &#233;galement sp&#233;cifier la charge des wagon re&#231;ues et exp&#233;di&#233;es. Vous pouvez &#233;galement
contr&#244;ler si le wagon sera livr&#233; au cours de la session. Choisissez parmi les
"Horaires" du menu d&#233;roulant les horaires des trains que vous voulez. Lorsqu'un horaire de train
est s&#233;lectionn&#233;, un wagon ne sera livr&#233; que lorsque l'horaire du trains est actif.
Voir Trains-> Outils-> <A HREF="#Timetable"> Horaire </A> pour s&#233;lectionner
les horaires des trains pour votre session. </P> 

 <P> Si vous vouliez plus d'un type de wagon &#224; livrer cons&#233;cutivement,
augmenter le compteur du nombre que vous souhaitez. Le nombre maximal est de 10
et le minimum est 1. Dans le tableau ci-dessus, le programme sollicite deux Boxcars SP dans une rang&#233;e, puis une wagon TankOil avec une charge de "L (Huile)". Apr&#232;s que le wagon est livr&#233;e TankOil le horaire commence d&#232;s le d&#233;but, demandant &#224; nouveau deux Boxcars SP suivis par une wagon TankOil. Le champ d'attente vous permet de d&#233;terminer combien de trains vont visiter l'endroit avant de prendre le wagon. Utile si vous voulez qu'un wagon reste immobile pendant plusieurs sessions d'exploitation. </P> 

 <P> R&#233;p&#233;tez en s&#233;lectionnant le type de wagon et en appuyez
"Ajouter un type de wagon" jusqu'&#224; ce que vous ayez l'Horaire de livraison que vous voulez. Appuyez sur "Enregistrer
Horaire "et fermez la fen&#234;tre de programmation lorsque vous avez termin&#233;.
Notez que seuls les types de wagon et les lignes qui sont accept&#233;es par cet embranchement
sont disponibles. Si un type de wagon ou de ligne n'est pas disponible, v&#233;rifiez le type de wagon
 et les lignes pour cet embranchement et l'emplacement.
 </P> 
 <P> L'horaire contr&#244;le quand et quels wagons seront livr&#233;s et dans quel
ordre. Il rend l'embranchement plus restrictif, seuls les wagons exig&#233;s par l'Horaire
 seront remis &#224; l'embranchement. En regardant l'Horaire vous
verrez un pointeur dans la table sous la rubrique "Actuel", le pointeur
montre le prochain 
Type de wagon que le programme veut remettre &#224; l'embranchement. Lorsque
le programme trouve ce wagon et  la destination du wagon &#224; cet
embranchement, le pointeur se d&#233;place &#224; l'&#233;l&#233;ment suivant dans l'Horaire. Apr&#232;s avoir desservi
le dernier &#233;l&#233;ment dans l'Horaire, le pointeur sera de retour au premier &#233;l&#233;ment
dans l'Horaire. </P> 

 <P> Si vous voulez personnalis&#233;e les <A HREF="#CarLoad"> Charges </A> pour vos wagons,
vous pouvez les cr&#233;er en utilisant <A HREF="#EditCarLoads"> Modifier Attributs wagon
 </A> pour la "Charge" du wagon. Chaque nouvelle charge est associ&#233;e &#224; un type de wagon
. Par exemple vous pouvez avoir "Vis" pour un wagon, et "p&#233;trole" pour un
wagon-citerne. Le programme d&#233;livrera des wagons avec une charge personnalis&#233; &#224; un
embranchement qui a un Horaire qui demande &#233;galement cette charge particuli&#232;re.
Toutefois, les wagons avec une charge personnalis&#233;e peuvent toujours &#234;tre plac&#233;s dans les triages,
les coulisses, et les &#201;changes. </P> 

 <P> Vous pouvez si vous le souhaitez, sp&#233;cifiez la destination finale d'un wagon une fois
qu'il a &#233;t&#233; utilis&#233; par l'embranchement. Seuls les voies de destination qui peuvent
accepter ce type de wagon sont repr&#233;sent&#233;es dans le menu d&#233;roulant des voies.La destination charg&#233; par un horaire est montr&#233;e comme <A HREF="#CarsSet"> Destination Finale du wagon </A> dans les diff&#233;rentes fen&#234;tres du wagon. </P> 

 <P> Vous pouvez &#233;ventuellement utiliser vos <A HREF="#StagingAndCarLoads"> 
voies de coulisse </A> pour des wagons vides avec une charge personnalis&#233;e, et vous pouvez aussi optionnellement
avoir le programmes qui place des charges personnalis&#233;es dans les wagons en utilisant des voies de coulisse. Si
vous voulez sp&#233;cifier la coulisse en tant que destination du wagon, ne pas choisir une
voie, laisser le programme d&#233;terminer quelle est la voie appropri&#233;e de la coulisse &#224; utiliser. Sinon, si vous s&#233;lectionnez une voie, cette voie deviendra indisponible pour les autres wagons. Pour &#233;viter de surcharger un embranchement avec des
wagons avec des charges personnalis&#233;es en coulisse, le programme va normalement limiter le
nombre de wagons sur l'itin&#233;raire vers une voie avec un Horaire pour la place disponible sur les voie. Alors
si vous avez de l'espace pour trois wagons, la plupart du programme g&#233;n&#232;rera normalement
 pour vous  depuis la coulisse  trois wagons. Cependant, si vous avez besoin pour
d'ajuster le nombre de wagons en itin&#233;raire vers un embranchement avec un Horaire, s&#233;lectionnez
dans la fen&#234;tre Modifier la planification "Outils-> Options". Une nouvelle fen&#234;tre devrait
apparaitre, et ajuster le pourcentage "de charges personnalis&#233;es g&#233;n&#233;r&#233;es par la
coulisse ". La valeur par d&#233;faut est 100% ce qui signifie que g&#233;n&#233;rer suffisamment de
wagons pour remplir &#224; 100% l'espace de voie disponible. Si vous voulez seulement la moiti&#233; de
vos charges de wagon pour venir dans la coulisse, d&#233;finissez la valeur &#224; 50%, et si vous
ne voulez pas g&#233;n&#233;rer en coulisse un wagon de charge personnalis&#233; pour l'embranchement,
d&#233;finir la valeur &#224; 0%. Parfois, il est appropri&#233; de surcharger un embranchement
avec des wagons, si vous voulez cela, augmentez la valeur jusqu'&#224; 1000%. BTW 1000%
signifie envoyer 10 fois l'espace disponible en wagons pour cet embranchement. Si vous
entrer cette valeur, vous avez je l'esp&#232;re 10 fois l'&#233;quivalent de la longueur de l'embranchement disponible dans un triage de stockage &#224; proximit&#233;! </P> 

P> L'autre option dans le menu outils d'&#233;dition horaire  est la possibilit&#233; de sp&#233;cifier une autre voie. Le programme quand il trouve un embranchement plein enverra de nouveaux wagon sur la voie que vous sp&#233;cifiez dans le menu d&#233;roulant de la voie 	alternative. Si vous ne sp&#233;cifiez pas une alternative, le programme va essayer de trouver un triage &#224; cet endroit. La fonction de voie alternative peut &#234;tre utilis&#233;e pour cr&#233;er une voie "spot Off" pour vos wagon. Pour emp&#234;cher le programme de mettre le wagon sur la voie spot off qui ne sont pas destin&#233;s &#224; votre secteur, utilisez la fen&#234;tre "S&#233;lectionner des charges desservies par voie" pour n'accepter que des wagon avec des charges que votre embranchement industriel demande. </P> 

 <P> Sp&#233;cifier une autre voie pour un horaire modifie &#233;galement le comportement des wagons avec des charges personnalis&#233;es, mais sans destination finale. Lorsque le programme trouve un wagon avec une charge personnalis&#233;e, il va rechercher tous les embranchement pour un horaire qui exige ce type de wagon et la charge, et si trouv&#233; itin&#233;rairera le wagon l&#224;-bas. Toutefois, si la voie &#233;tait pleine, le programme continuera de rechercher une voie/horaire qui peut accepter le wagon. Si toutes les voies sont pleines et aucune voie ne soit sp&#233;cifi&#233;e pour toutes es voie/horaires, le programme va tenter de d&#233;placer le wagon &#224; un autre endroit. Si il y a une voie de remplacement sp&#233;cifi&#233;e, le programme ne fera que d&#233;placer le wagon lorsque l'un des embranchements peut accepter un nouveau wagon, c'est &#224; dire la voie n'est plus compl&#232;te. </P> 

   <P> Une autre caract&#233;ristique d'utilisation d'une autre voie pour les wagons avec des charges personnalis&#233;es, mais sans destination finale, c'est que le programme va essayer de transmettre un certain nombre de wagons &#224; l'embranchement exigeant ce type de wagon et de charge. Le programme se r&#233;f&#232;re &#224; ces wagons comme " entrant " dans l'embranchement/industrie. Un wagon en "entrant " a &#233;t&#233; transport&#233; par les trains qui ne desservent pas directement l'embranchement/industrie. Le nombre maximal de v&#233;hicules entrants vers un embranchement avec une voie de remplacement est d&#233;termin&#233; par la longueur de l'embranchement et de la voie de remplacement. Donc, si l'embranchement pouvait contenir 6 wagons, et la nouvelle voie 5, le programme permettrait &#224; un maximum de 11 wagons d'&#234;tre en itin&#233;raire vers l'embranchement. </P> 


 <P> Les Horaires peuvent fonctionnerdans un des deux modes, s&#233;quentiel comme
d&#233;crit ci-dessus, ou en mode correspondance. Le mode correspondance &#233;limine les aspects s&#233;quentiels
 d'un Horaire. En mode correspondance, le programme va rechercher dans l'ensemble
de l'Horaire pour trouver un type de wagon et de  charge qui corresponde &#224; un wagon que le
programme tente de placer. En mode correspondance le pointeur indique le dernier wagon
que le programme a trouv&#233; acceptable pour l'embranchement. Pour modifier le planning
pour le mode correspondance, choisissez "Correspondre" dans la fen&#234;tre Modifier la planification
et appuyez sur "Enregistrer". Le Mode Correspondance est utile lorsque l'ordre des
wagons qui arrivent n'est pas important, mais vous voulez continuer &#224; exp&#233;dier des wagons avec une
charge sp&#233;cifique, fournir la destination finale du v&#233;hicule, ou avoir le wagon attendre
pour un nombre pr&#233;cis de trains &#224; l'embranchement. En mode correspondance l'&#233;l&#233;ment compteur de l'Horaire
 est ignor&#233; car il n'est pas utilis&#233;. Tous les autres champs
sont disponibles, et vous pouvez avoir le m&#234;me type de wagons plusieurs fois, avec
chaque &#233;l&#233;ment dans l'Horaire &#224; la recherche d'une charge particuli&#232;re re&#231;ue. &#201;galement en
 mode correspondance, le  bo&#238;te de s&#233;lection de type de wagon avance automatiquement au prochain
type de wagon lors de l'ajout d'un type de wagon. Ceci rend facile l'ajout rapide de type de wagon
dans la table. </P> 

 <P> Vous pouvez &#233;galement acc&#233;der &#224; vos Horaires depuis le menu Emplacements Outils.
La table Horaires fournit l'&#233;tat pour chaque Horaire. Puis vous pouvez
attribuer un Horaire &#224; de multiples embranchements, la table fournit &#233;galement l'&#233;tat suppl&#233;mentaire pour chacun des embranchements qui utilisent cet Horaire particuli&#232;r. La table vous permet &#233;galement de modifier l'Horaire une fois qu'il a &#233;t&#233; attribu&#233;e &#224; un embranchement. </P> 

 <A NAME="SchedulesAndLoads"> </A> 
 <H3> Horaires et charges </H3> 

Vous avez entr&#233; tous vos wagons, voies et trains et avez
jouer avec le programme pendant un certain temps. Vous &#234;tes heureux avec l&#224; o&#249; les wagons
finissent, mais en regardant les mouvements de wagon g&#233;n&#233;r&#233;s par le programme au cours de
plusieurs s&#233;ances vous avez penser que ce serait bien si les mouvements du wagon
 avaient une "fin". Qu'est-ce que vous aimeriez voir une s&#233;rie de wagons se
d&#233;placer qui imitent le chemin de fer prototype que vous mod&#233;lisez, ou peut-&#234;tre vous
voulez juste que les wagons se d&#233;placent dans un certain ordre. Horaires et 
charges personnalis&#233;es de wagon sont les astuces pour obtenir du programme ce que vous voulez.

 <P> Le programme offre tous les wagons avec deux charges, un "L" et "E".
On les appelle les charg&#233;s et vides par d&#233;faut respectivement. Vous ne pouvez pas
les supprimer, mais vous pouvez les renommer si vous le souhaitez. Pour chaque type de wagon,
vous pouvez cr&#233;er des charges suppl&#233;mentaires. Par exemple, disons que vous avez une
industrie qui a besoin de papier charg&#233; dans des wagons couverts. Vous pouvez cr&#233;er cette <a
HREF= "#EditCarLoads"> Charge </A> pour vos wagons et nommez-L (papier).
Or, pour l'embranchement qui sert  votre industrie du papier, vous devez cr&#233;er un
Horaire. Dans cet Horaire, le premier &#233;l&#233;ment que vous entrez est un wagon couvert, et
puis s&#233;lectionnez la charge &#224; recevoir, L (papier). Si le train qui dessert 
cette industrie est au d&#233;part de la coulisse, vous avez pratiquementt termin&#233;. Le programme
quand on assemble un train  <A HREF="#StagingAndCarLoads"> en coulisse </A> , va chercher un wagon vide, et
s'il est trouv&#233;, permettra de cr&#233;er la charge L (papier) pour vous. Une fois que la charge du wagon est
cr&#233;&#233;e pour cette industrie, le programme mettra le wagon &#224; destination de cette industrie. Lorsque le wagon est livr&#233;, le programme va retirer la charge papier, et l'&#233;tat de charge du wagon va devenir vide ou "E". </P> 

 <P> C'&#233;tait facile, nous allons donc faire des choses plus int&#233;ressantes et avons une
industrie d'exp&#233;ditions de certains mat&#233;riaux imprim&#233;s. Nous allons cr&#233;er et appeler cette charge
L (impression). Or, dans le premier &#233;l&#233;ment de l'Horaire, au lieu de laisser le menu
sous la rubrique "Exp&#233;dition" vierge, s&#233;lectionnez L (impression). Suivant dans le menu d'exp&#233;dition il y a
la destination et les menus voie. Nous pourrions choisir une destination qui est
une coulisse. Pas besoin de s&#233;lectionner la voie, juste l'emplacement de transit. Maintenant
quand un train retourne pour collecter le wagon, sa charge sera L (impression)
et quand le wagon arrive &#224; la coulisse, la charge sera supprim&#233;e et l'&#233;tat de charge du wagon sera de retour &#224; "E" vide. </P> 

 <P> Nous aurions pu au lieu d'envoyer le wagon avec impression &#224; la coulisse,l'envoyer &#224; un embranchement
. Il suffit de s&#233;lectionner la destination et l'embranchement o&#249;  vous voulez que le
wagon aille. M&#234;me si cela prend plusieurs trains pour sortir le wagon de l&#224;, le
programme saura  d&#233;terminer le meilleur itin&#233;raire. Maintenant, si vous cr&#233;ez un autre
Horaire &#224; cet embranchement, vous pouvez rediriger le wagon &#224; nouveau. En enfilant une
s&#233;rie d'Horaires et de charges, ensemble, vous pouvez cr&#233;er la s&#233;quence de wagons
que vous voulez. </P> 

 <P> Une autre fa&#231;on int&#233;ressante de d&#233;placer les wagons est d'exp&#233;dier une charge personnalis&#233;e,
mais de ne pas  sp&#233;cifier de destination. Le programme quand il trouve un wagon avec une
charge personnalis&#233;e, mais aucune destination, va v&#233;rifier toutes les embranchements pour voir si un Horaire demande ce type de wagon avec cette charge personnalis&#233;e. Et s'il y a un embranchement qui r&#233;pond aux exigences, le programme itin&#233;rairera
le wagon vers cette industrie. Mais une fois qu'un wagon a une charge personnalis&#233;e, ce wagon peut
seulement se d&#233;placer &#224; des triages, des inter&#233;changes, et coulisses. Pas d'embranchement &#224; moins que que l'embranchement
 ait &#233;galement un Horaire demandant ce wagon et cette charge. </P> 

P> Autre variante consiste &#224; cr&#233;er un programme qui fournit une charge personnalis&#233;e pour le wagon, et une destination, mais sans l'affectation de voie. Le wagon sera accept&#233; par les voies de triages, de classification/&#233;change, de coulisse, et des embranchements auxdestinations qui ont un horaire qui exige ce type de wagon et la charge personnalis&#233;e. les Embranchement sans horaire ne peuvent pas desservir un wagon avec une charge personnalis&#233;e, &#224; moins que le wagon ait &#233;t&#233; exp&#233;di&#233; directement &#224; cette embranchement. </P> 

 <P> une attention particuli&#232;re pour les wagons vides. Le programme ne itin&#233;raire pas
les wagons avec des charges par d&#233;faut "E" ou "L". Donc, si votre Horaire demande
 un wagon avec l'option par d&#233;faut "E", il peut se passer un certain temps avant
que le wagon se montre. Une alternative est de g&#233;rer les wagons vides comme des wagons
avec des charges personnalis&#233;s. Vous pourriez cr&#233;er la charge personnalis&#233;e "E (mpty)" et utiliser
cette charge pour signifier un wagon vide. Maintenant les wagons avec cette charge seront
rout&#233;s et auront les m&#234;mes caract&#233;ristiques que les wagons avec les "autres"
charges personnalis&#233;es. </P> 

 <P> Les exemples ci-dessus de charges personnalis&#233;es utilis&#233;es pour aider &#224; comprendre le mouvement du wagon, vous pourriez, si vous souhaitez tout simplement d&#233;placer les wagons selon les horaires sans l'utilisation de charges personnalis&#233;es.Les Charges personnalis&#233;es sont facultatives et pas n&#233;cessaire si vous souhaitez cr&#233;er une simple s&#233;quence de wagons. </P> 

 <A NAME="ShowSchedulesByCarTypeAndLoad"> </A> 
    <H3> Voir les horaires par type de wagon et charge </h3> 

    <img src="images/ShowSchedulesByCarTypeAndLoad.png"> 

    <P> Vous pouvez acc&#233;der &#224; cet outil utile &#224; partir de la fen&#234;tre des listes. La fen&#234;tre des annexes peuT &#234;tre trouv&#233;E dans "Outils" dans la fen&#234;tre Emplacements. Il vous permet de s&#233;lectionner un type de wagon, et puis toute charge que vous avez cr&#233;&#233; pour ce type de wagon. La fen&#234;tre affiche alors l'horaire qui par emplacement qui r&#233;ceptionne ou exp&#233;die la charge de ce wagon particuli&#232;r. </P> 

    <P> Si vous voulez une liste des charges de wagon personnalis&#233;e pour chacun de vos types de wagon, vous pouvez utiliser l'option "Imprimer wagons complets" ou "Aper&#231;u wagons charges" trouv&#233;s sous Outils dans la fen&#234;tre  "Afficher les horaires par type de wagon et charge". </P> 

 <A NAME="Interchange"> </A> 
 <H3> Voies &#201;change </H3> 

La meilleure fa&#231;on de cr&#233;er de l'&#233;change de v&#233;hicules entre les trains est d'utiliser une voie de classification/&#233;change. Une voie de classification/d'&#233;change peut &#234;tre utilis&#233;e pour la classification, le mouvement des wagons dans la m&#234;me Cie, et un &#233;change, la circulation des wagons entre Cie. Les wagons d&#233;pos&#233;s sur une voie de classification/d'&#233;change par un train sur un itin&#233;raire donn&#233; ne seront pas ramass&#233;s par un train utilisant le m&#234;me itin&#233;raire. Un autre train avec un itin&#233;raire diff&#233;rent est n&#233;cessaire pour ramasser les wagons. Par exemple, vous pourriez avoir un embranchement qui ramasse et laisse des wagons &#224; partir d'un terminal. En d&#233;finissant la voie comme une voie de classification/d'&#233;change, une fois que le train de la ligne d'embranchement a fournit les wagons, ils y resteront jusqu'&#224; ce que le train de la ligne principale s'arr&#234;te pour desservir la voie de classement/d'&#233;change.

 <P> L'&#233;tat de charge du wagon ne change pas lorsqu'il est plac&#233; sur une voie de classification/d'&#233;change. </P> 

 <P> Si vous voulez plus de contr&#244;le sur la fa&#231;on dont votre voie classement/&#233;change voie op&#232;re, vous pouvez &#233;ventuellement sp&#233;cifier lesquels des trains ou itin&#233;raires peuvent prendre ou laisser des wagons. Si vous limitez lesquels des trains, les itin&#233;raires peuvent tirer wagons &#224; partir d'une voie de classement/d'&#233;change, vous devez &#233;galement restreindre les types de wagon de la voie pour les m&#234;mes que les services de train, sinon vous pouvez avoir des wagons &#233;chou&#233;s sur la voie de classement/d'&#233;change. </P > 

    <P> Vous pouvez &#233;galement contr&#244;ler les destinations de la voie d'&#233;change assurera le service. Dans "Outils" dans la fen&#234;tre de voie d'&#233;dition d'une voie clssification/d'&#233;change, le menu "Voie Destination" vous permet de s&#233;lectionner les destinations qui sont valables pour la voie. </P> 

P> &#201;tant donn&#233; la complexit&#233; de ce type de voie, il est fortement recommand&#233; de ne pas utiliser les voies de classification/&#233;change jusqu'&#224; ce que vous soyez &#224; l'aise avec la fa&#231;on dont le programme construit les trains et que vous avez lu et comprenez  comment cr&#233;er des rapports. </P > 

 <A NAME="CreateClassificationYard"></A>
 <H3> Comment Cr&#233;er une Gare de Triage </H3> 

Une gare de triage/classification est utilis&#233;e pour trier les wagons dans des trains diff&#233;rents. Normalement
une voie de triage est attribu&#233; &#224; un train sp&#233;cifique et les wagons sont livr&#233;es sur
cette voie jusqu'&#224; ce qu'il y ait assez de wagons pour compl&#233;ter un train. Pour cr&#233;er une
gare de triage, vous devez attribuer une <A HREF="#Interchange"> 
 voie d'inter&#233;change </a> , pour chaque train qui partira de ce triage.
Pour chaque voie, permettre &#224; tout les train de d&#233;poser les wagons, mais attribuer un seul train pour
les collecter. Vous devez configurer la voie d'&#233;change pour servir le m&#234;me
type wagon et de lignes que le train dessert, sinon vous risquez de
finir avec des wagons orphelins

 <P> Remarquez qu'il est acceptable de cr&#233;er plus de voies ce classification qu'il n'y a de voies physiques dans votre gare de triage. Les wagons peuvent partager le m&#234;me faisceau de voie jusqu'au moment de les classer dans leurs diff&#233;rents trains. Vous pouvez &#233;galement utiliser les <A HREF="#Polls"> voies mutualis&#233;es </A> caract&#233;ristique de partage de l'espace de voie dans votre triage./P> 

 <A NAME="Staging"> </A> 
 <H3> Voies de Coulisse </H3> 

Les voies en coulisse sont normalement utilis&#233;es pour repr&#233;senter des endroits qui g&#233;n&#232;rent du trafic vers et depuis votre r&#233;seau. Plusieurs fois, un acc&#232;s physique aux voies en coulisse est limit&#233;, donc le programme impose des restrictions importantes sur la fa&#231;on dont les voies de de coulisse sont utilis&#233;s. Une "voie de coulisse" tient un train complet. Une fois qu'un train arrive sur une voie de coulisse, les wagons et les locomotives restent ensemble jusqu'&#224; ce que le train quitte la voie de la coulisse. Le programme ne modifie jamais un train sur une voie de coulisse. Pour qu'un train quitte la coulisse, le programme doit trouver de nouveaux emplacements pour toutes les locomotives et les wagons stationn&#233;s sur la voie de coulisse. Aucune locomotives ou wagons ne peuvent &#234;tre laiss&#233;s pour compte.

    <P> En raison de la complexit&#233; de voies de coulisse, il est fortement recommand&#233; de ne pas utiliser les voies de coulisse jusqu'&#224; ce que vous serez &#224; l'aise avec la fa&#231;on dont le programme assemble les trains, y compris la capacit&#233; de lire les rapports d'assemblage de train. </P> 


Si c'est la premi&#232;re fois que vous utilis&#233; un programme informatique pour cr&#233;er des mouvements de wagon, il est recommand&#233; que vous entriez un minimum de deux lieux de rassemblement pour vos op&#233;rations, et avoir votre train qui partira de l'une et pour  finir &#224; l'autre. Par exemple, supposons que votre trains circulent de l'est &#224; l'ouest. C'est mieux  si vous cr&#233;ez "Coulisse Est" et "Coulisse Ouest" et d'avoir votre trajet de trains pour dire &#224; la coulisse l'ouest, sur votre r&#233;seau, faire un peu de travail, puis terminer dans la coulisse est, et vice versa. Il est &#233;galement pr&#233;f&#233;rable de nommer votre coulisse apr&#232;s les emplacements r&#233;els. Ainsi, par exemple, vous pourriez vouloir mod&#233;liser les villes de Springfield et Worcester et avoir trains venus de New York et de Boston au service de votre r&#233;seau. Dans ce cas, New York et Boston sont respectivement les coulisse ouest et est. Notez que les voies de coulisse pour New York et Boston peuvent &#234;tre le m&#234;me emplacement physique sur votre r&#233;seau, nous avons juste besoin des deux noms de rassemblement afin que nos manifestes de train semblent plus prototypique. Notez que si vous utilisez un seul lieu de coulisse, le programme ne permet pas normalement aux wagons de se rendre de la coulisse et retourner au m&#234;me endroit de rassemblement. Si vous souhaitez que le programme permette ce type d'op&#233;ration, voir Param&#232;tres-> Outils-> <A
     Href = "#AllowCarsToReturnToStaging " > Options </A> 


   <P> 
    <img src="images/EditStaging.png"> 
   </P> 

   Une voie de coulisse vous permet d'avoir tous les wagons et les locomotives d'un train livr&#233;s sur une voie.
   En cas de r&#233;siliation d'un train dans la coulisse, le programme va rechercher une voie compl&#232;tement vide, une
   sans locomotives ou wagons. La voie en coulisse par <a HREF="#TypeRoadLoadRestrictionsStaging"> d&#233;faut </A> 
   doit &#233;galement desservir tous les types et les itin&#233;raires de wagon et de la locomotive du train. Les trains ne peuvent pas partagerles voies en coulisse, le programme ne fera que mettre un train par voie. Lorsque vous quittez un endroit avec une voie en
   coulisse, toutes les wagons et locomotives sur une voie seront affect&#233;s au train. Un emplacement
   peut avoir plusieurs voies de coulisse, mais ne peut pas avoir d'autres types de voies, des embranchements, des triages, etc.
   Les voies en coulisseT peuvent &#234;tre au d&#233;part d'un itin&#233;raire, l'extr&#233;mit&#233; de l'itin&#233;raire, ou les deux. les voies en coulisse au milieu d'un itin&#233;raire sont ignor&#233;es par le programme.

   <p> 
    Notez que si vous utilisez un train &#224; destination et &#224; partir du m&#234;me emplacement de coulisse en utilisant le <A
     Href = "#BuildOptions " > Mode d'Assemblage Normal </A> , vous devez d&#233;finir deux voies de coulisse pour le programme,
    une pour le d&#233;part et l'autre pour le retour. Physiquement, les deux voies de coulisse peuvent &#234;tre les m&#234;mes. Si
    vous voulez utiliser le m&#234;me nom pour vos voies de coulisse, le programme vous permet de nommer les voies de
    coulisse &#224; l'aide d'un trait d'union et un num&#233;ro comme suffixe. Le trait d'union et le num&#233;ro ne sont pas imprim&#233;s sur
    les listes de manoeuvres ou manifestes. Si vous utilisez <A  HREF="#BuildOptions"> Mode Agressif </A> pour assembler les  trains, vous pouvez <a HREF="#MakeDepartureTrackAvailable"> configurer </A> le programme pour
    permettre au train de revenir &#224; la m&#234;me voie de coulisse d'o&#249; le train est parti.
  </p> 

 <P> Si vous avez besoin d'un train en partance de la coulisse pour avoir un certain nombre
de locomotives, mod&#232;le de locomotive, ou le nom de la ligne, le programme va rechercher toutess les
voies en coulisse &#224; l'endroit de d&#233;part pour un train qui r&#233;ponde &#224; ces
exigences. Si vous d&#233;finissez les exigences de locomotive &#224; 0, le programme
s&#233;lectionnera le prochain train disponible depuis la coulisse; et ignore le nombre
de locomotives en laissant cette voie de coulisse. Voir <A HREF="#TrainRequires"> Train Conditions Optionnelles 
 </a> pour plus d'info. </P> 


 <P> Vous pouvez si vous le souhaitez, &#233;ventuellement contr&#244;ler les voies de coulisse sur laquelle un
train arrivera et partira. Notez que "Tous" par d&#233;faut permet &#224; tous
les trains d'arriver ou de partir sur la voie de coulisse, donc si vous voulez
restreindre les trains pour une voie sp&#233;cifique ou des voies, vous devez configurer toutes les voies de coulisses de cet endroit. </P> 

 <P> Vous pouvez en <A HREF="#PromptDepartureTrack"> option </A> , avoir
le programme qui vous demandera quelle voie vous souhaitez utiliser lors du d&#233;part de la coulisse. </P> 



 <A NAME="StagingAndCarLoads"> </A> 
 <H3> Coulisse et charges de Wagon </H3> 

Sur les voies de coulisse vous pouvez &#233;ventuellement permuter les charges par d&#233;faut de wagon de vide &#224;
charg&#233;, et charg&#233; &#224; vide. S&#233;lectionnez l'"Echange par d&#233;faut Charg&#233; et Vide"
si vous voulez que vos wagons charg&#233;s changent en arrivant sur la voie de coulisse. Vous pouvez si vous le souhaitez, demander au programme de vider les wagons car ils
sont entr&#233;s sur la coulisse. S&#233;lectionnez "Vider wagons avec des charges par d&#233;faut" pour changer un
&#233;tat de wagon de charg&#233; &#224; vide. Si vous utilisez des charges personnalis&#233;es, vous pouvez supprimer
la charge personnalis&#233;e lorsque les wagons arrivent &#224; la voie de coulisse. S&#233;lectionnez le
"vider Wagons avec des charges personnalis&#233;e" si vous voulez remplacer votre charge pesonnalis&#233;e avec la valeur vide par d&#233;faut .

 <P> Le programme offre trois options pour la mise en place de charges personnalis&#233;es dans
les wagons quand ils partent d'une coulisse. La premi&#232;re option est appel&#233;e "G&#233;n&#233;rer
charges personnalis&#233; pour embranchements desservis par ce train ". Si la premi&#232;re option est
s&#233;lectionn&#233;e, le programme va seulement v&#233;rifier les embranchements avec des Horaires le long de l'itin&#233;raire du train au d&#233;part
. Le programme ne fera que g&#233;n&#233;rer assez de charges de wagons 
pour remplir la voie de l'embranchement. Lorsque seule la premi&#232;re option est s&#233;lectionn&#233;e, le programme
ignore l'Horaire de "Pourcentage des charges personnalis&#233; g&#233;n&#233;r&#233; par la coulisse"
et la fonctionnalit&#233; optionnelle "Voie Alternative". </P> 

 <P> Si la deuxi&#232;me option est choisie, "G&#233;n&#233;rer des charges personnalis&#233;es pour tous les
embranchements (plusieurs trains) ", le programme va v&#233;rifier toutes les embranchements avec un
Horaire pour une demande. Maintenant le programme lors de la d&#233;termination de beaucoup de wagon charg&#233;s
&#224; g&#233;n&#233;rer, se penchera sur la valeur du pourcentage "des charges personnalis&#233;es
g&#233;n&#233;r&#233;s par la coulisse ". Aussi, si l'embranchement est plein ou va devenir plein, le
programme enverra les wagons &#224; la "voie Alternative", puis &#224; toutes les voies de triage
&#224; l'emplacement de l'embranchement. </P> 

 <P> Deux options fonctionnent de la m&#234;me mani&#232;re en ce qui concerne le placement de charges personnalis&#233;es dans les wagons vides, seul le nombre de wagons charg&#233;s et le nombre d'embranchements est consid&#233;r&#233; par les changements du programme. Si un Horaire exige un certains type de wagon, et ce type de wagon est au d&#233;part de la coulisse, et le wagon
charg&#233; est vide par d&#233;faut, le programme va placer la charge personnalis&#233;e dans ce
wagon si l'option appropri&#233;e est s&#233;lectionn&#233;e. </P> 

 <P> Si un embranchement demande une charge personnalis&#233;e, l'embranchement doit avoir un <A HREF= "#Schedules"> Horaire </A> . </P> 

 <P> Pour restreindre la charge que le programme placera dans vos wagons,
vous pouvez utiliser les voies de chargement en coulisse pour servir de fonction de contr&#244;le. Voir "S&#233;lectionner
charges desservies par cette voie "lors de l'&#233;dition la voie de coulisse. Vous pouvez
&#233;galement restreindre les types de charge que le programme placera en limitant
les types de charges dans le train au d&#233;part que la coulisse est autoris&#233;e &#224;
livrer. Voir "S&#233;lectionner des charges desservies par ce train" sous &#201;dition-> Train,
puis Outils-> <A HREF="#TrainBuildOptions"> Train Options d'assemblage </A> . </P> 

 <P> Le programme offre une autre option en ce qui concerne les charges de wagon. Si le train part de la coulisse et se termine &#233;galement dans la coulisse, le programme va g&#233;n&#233;rer automatiquement la charge appropri&#233; &#224; vos wagons vides qui partent et se terminent dans la coulisse. Pour utiliser cette fonction, l'un des deux "G&#233;n&#232;rer des charges personnalis&#233;s ... "dans la coulisse doit &#234;tre s&#233;lectionn&#233; pour la voie de d&#233;part. Utilisez le menu" Options de Charge "sous" Outils " pour contr&#244;ler quele charge le programme va g&#233;n&#233;rer pour vous. Vous pouvez &#233;galement utiliser les " Options de Charge " de la voie terminale de lacoulisse pour contr&#244;ler le type de charge le programme va g&#233;n&#233;rer &#224; partir de la voie de la coulisse de d&#233;part. </P> 

   <P> La troisi&#232;me option "G&#233;n&#233;rer des charges personnalis&#233;es pour toutes les voies de coulisse " va essayer et placer des charges personnalis&#233;es dans vos wagons vides par la recherche de destinations que sont les voies en coulisse. Tout d'abord, si le train en coulisse au d&#233;part est &#233;galement dissous avec la coulisse, le programme va essayer un endroit une charge personnalis&#233;e dans un wagon vide qui r&#233;pond aux exigences de charge du train, et le d&#233;part du train et les exigences de charge de voie de transit du terminal. S'il n'y a pas une voie terminal de la coulisse pour le train, ou le programme n'a pas r&#233;ussi &#224; ajouter une charge personnalis&#233;e pour le wagon qui r&#233;ponde aux exigences de la voie terminal en coulisse, le programme va alors rechercher d'autres voies de coulisse qui ne sont pas au d&#233;part ou &#224; l'emplacement terminal. Si le programme trouve une voie de coulisse qui n'est pas situ&#233;e &#224; l'emplacement de d&#233;part ou terminale, il attribuera al&#233;atoirement une charge personnalis&#233;e qui est desservi par le train, la voie de d&#233;part de la coulisse et une voie de coulisse de destination. Ensuite, le programme permettra de d&#233;terminer si le wagon peut &#234;tre achemin&#233; &#224; la voie de la coulisse de destination en utilisant la charge personnalis&#233;e affect&#233;e. Si la voie de la coulisse est accessible, le programme en plus de placer la charge personnalis&#233;e dans le wagon, d&#233;fini la destination finale du v&#233;hicule &#224; l'endroit o&#249; la voie de  coulisse r&#233;side. </P> 

 <A NAME="BlockingCarsFromStaging"> </A> 
   <H3> Bloc de Wagons en Coulisse </h3> 

   Le programme fournit un algorithme tr&#232;s simple pour former des blocs de wagons &#224; partir de la coulisse. Comme les wagons qui ont &#233;t&#233; envoy&#233;s &#224; la coulisse peuvent se trouver n'importe o&#249; dans le train, le programme utilise le dernier endroit o&#249; les wagonsont &#233;t&#233; ramass&#233;s pour former des blocs dans le train sortant de la coulisse. Ainsi, par exemple, si un train qui a pris fin dans la coulisse a eu trois arr&#234;ts, A, B et C, les wagons de A seraient en bloc quand le prochain train  quitte la coulisse. La m&#234;me chose vaut pour les ramassages pr&#233;c&#233;embranchements de B et C, ces wagons resteraient group&#233;s. Le programme en tentant de trouver des destinations pour les wagons au d&#233;part de la coulisse, commence avec le plus grand bloc de wagons, puis v&#233;rifie l'itin&#233;raire du train au d&#233;part, et tente d'envoyer le plus grand bloc de l'emplacement demandant le plus de mouvements. Apr&#232;s cela, le programme fait la m&#234;me chose avec le prochain bloc de wagons, il trouve le second emplacement sur la itin&#233;raire et envoie les wagons. Il s'agit d'une approche tr&#232;s simpliste de bloc de wagons, il suppose que les wagons d&#233;j&#224; ramass&#233;s &#224; un endroit ont &#233;t&#233; plac&#233;s dans le train en blocs. Cette fonctionnalit&#233; de mise en bloc ne consid&#232;re pas o&#249; sont les wagons dans le train, comme certains op&#233;rateurs lors de l'enl&#232;vement des wagons, ajouteront des wagons dans n'importe quelle partie du train. Donc, le premi&#232;r arr&#234;t dans l'itin&#233;raire de d&#233;part du train ne peut pas avoir les wagons en t&#234;te du train, mais ils devraient &#234;tre dans un groupe, quelque part dans le train. La premi&#232;re fois que vous partez d'une coulisse avec cette fonction, les wagons ne seront pas group&#233;s pour vous, vous devez d'abord mettre fin &#224; un nouveau train dans la coulisse, ces wagons auront les &#233;tiquettes de bloc qui leur sont assign&#233;s. Pour activer cette fonctionnalit&#233;, voir Modifier Voie Coulisse " Option  Groupage Wagons" dans le coin inf&#233;rieur droit de la fen&#234;tre. Il y a beaucoup de raisons pour lesquelles cette option ne va pas grouper correctement les wagons. Voir le rapport d'assemblage du train pour plus de d&#233;tails.

 <A NAME="LoopingTrainsThroughStaging"> </A> 
   <H3> Boucle des Trains &#224; Travers Coulisse </h3> 

   Parfois, pour l'exploitation un train entre coulisse &#224; un endroit (appelons-le A), puis quitte plus tard &#224; un autre endroit (appelons B). En vue d'une pr&#233;vision exploitation, les emplacements A et B sont des endroits qui ne sont pas directement reli&#233;s par des trains. Nous avons donc besoin de d&#233;m&#233;nager les locomotives et les wagons de l'emplacement A &#224; B ainsi le manifeste du train peut avoir un sens. Une fa&#231;on de le faire est de mettre fin au train dans la coulisse &#224; l'Emplacement B. Faire cela fait que le programme  "d&#233;placer" le train et ses wagons de A &#224; B qui est vraiment la m&#234;me voie physique. Plus tard, vous pouvez assembler un train qui s'&#233;loigne de l'emplacement B, et la manifeste montrera que le train provenaitde B et non A.

   <p> 
    Vous pouvez automatiser la reclassification d'un train en cr&#233;ant un <A HREF="#TrainScripts"> sc&#233;nario </A> qui est activ&#233; lorsque le train est arr&#234;t&#233; dans la coulisse .
  </P> 

 <p> un "Groupement" peut &#234;tre utilis&#233; pour partager l'espace de la voie avec deux ou plusieurs industries. Par exemple, disons que vous avez un embranchement qui dessert deux industries, et il peut contenir quatre wagons de 50 pieds, ou est d'environ 220 pieds de long. Maintenant, vous pouvez effectuer des op&#233;rations d'une longueur de voie de 110 pieds pour l'industrie 1, et un autre de 110' pour l'industrie 2. Le programme pourrait d&#233;finir jusqu'&#224; deux wagons sur chacune des voies desservant chaque industrie. </P> 

   <p> Mais disons que vous voulez avoir jusqu'&#224; quatre wagons livr&#233;s &#224; n'importe quelleindustrie. Si vous " Grouper" les deux voies de l'industrie, le programme peut emprunter l'espace de l'autre secteur si n&#233;cessaire. Alors maintenant, le programme pourrait d&#233;finir jusqu'&#224; quatre wagons &#224; chaque industrie, mais pas plus de quatre wagons au total. </P> 

   <p> Si vous ne d&#233;finissez pas un minimum, alors une industrie pourrait monopoliser toute la voie. En fixant un minimum de mot 55 pieds pour chaque industrie, cela signifie que pour le plus qu'une industrie pourra obtenir, c'est trois wagons. Il y aura toujours un espace disponible d'au moins un wagon &#224; chaque industrie. Notez que le nombre maximum de wagons dans tous les cas est de quatre. C'est seulement la fa&#231;on dont les wagons sont distribu&#233;s qui change lors de la configuration minimum. </P> 

   <p> L'utilisation des anth&#232;res d'un " Groupement" est en ce qui concerne les horaires. Pour l'utilisateur de puissance, vous trouverez peut-&#234;tre qu'un horaire unique attribu&#233; &#224; un embranchement ne fait pas exactement ce que vous voulez. Mais si la voie pouvait avoir plusieurs horaires, il ferait ce qui est n&#233;cessaire. En entrant plusieurs embranchements avec des horaires partag&#233;es via un  Groupement, vous pouvez cr&#233;er une s&#233;quence de wagon imaginables pour votre industrie. </P> 

   <A NAME="PlannedPickUps"> </A> 
   <H3> Ramassages Panifi&#233;s </h3> 
   Le programme pour la recherche de voies pour d&#233;poser des wagons, v&#233;rifie pour voir si il y a de l'espace disponible pour les nouveaux wagons. Parfois, en raison de l'ordre dans lequel vous assemblez vos trains, vous savez mieux que le programme que certains wagons seront ramass&#233;s au cours de votre session, dits par un train qui sera assembl&#233; plus tard. Cette fonction peut &#234;tre utile pour les voies de classification/&#233;change, surtout si vous voulez que les voies de classification/&#233;change soit plus  pleine que vide. Aussi, si vous manoeuvrez des wagons vers et depuis des voies qui sont essentiellement pleines, en utilisant cette option sur l'un ou plusieurs des voies en question peut augmenter les mouvements du wagon.

   <P> Si vous souhaitez que le programme ignore un certain nombre de wagons actuellement pr&#233;sent sur la voie, vous pouvez utiliser cette fonction pour sp&#233;cifier le nombre de wagons &#224; ignorer. Les choix sont 25%, 50 %, 75% et 100 %, ce qui signifie que vous pouvez dire au programme d'ignorer 25 &#224; 100 pour cent des wagons pr&#233;sents sur la voie. Par exemple, si vous choisissez 100%, le programme ignorera tous les wagons pr&#233;sent sur la voie, et &#233;tablira de nouveaux wagons &#224; la longueur de la voie. Cela signifie &#233;galement que le programme peut surcharger la voie jusqu'&#224; 100%. Donc, si la voie peut contenir 10 wagons, le programme pourrait envoyer 10 autres wagons sur la voie. Maintenant, la voie peut &#234;tre surcharg&#233;e jusqu'&#224; ce que ce train ou un train plus tard arrive et ramasse les 10 wagons d'origines. Par cons&#233;quent, vous devez avoir un peu d'espace disponible sur la voie temporaire  pour contenir les nouveaux wagons. Donc, si vous n'avez pas d'espace "extra" pour les wagons, ne pas utiliser cette fonctionnalit&#233;! Notez qu'il est de votre responsabilit&#233; et non de celle du programmes d'assembleret de terminer un train qui ramasse les wagons d'origine . </P> 

   <P> Garantir que les wagons seront ramass&#233;s &#224; partir d'une voie peut &#234;tre un peu difficile, il est donc recommand&#233; de ne pas utiliser cette fonction jusqu'&#224; ce que vous deveniez un expert en ce qui concerne l'utilisation de ce programme, sinon vous allez surcharger probablement vos voies lors de l'utilisationde cette fonction. </P> 

   <A NAME="ModifyLocationsByCarType"> </A> 
 <H3> Modifier des Lieux par Type de Wagon </H3> 

Cet outil peut &#234;tre trouv&#233; sous Emplacements-> Outils. Utilisez cet outil pour modifier rapidement
 le type de wagons que vos emplacements et les voies utiliseront. Tr&#232;s
utiles lors de l'ajout d'un nouveau type de wagon dans votre liste.

 <P> <img  Src="images/ModifyLocationsByCarType.png"> </P> 

 <P> D'abord s&#233;lectionner le type de wagon que vous d&#233;sirez modifier. La fen&#234;tre
 montrera alors les emplacements et les voies qui peuvent desservir ce type de wagon. S&#233;lectionnez
ou d&#233;s&#233;lectionner les lieux et les voies que vous voulez voir utilis&#233;es, et appuyez sur le
bouton "Enregistrer" pour modifier vos sites et les voies. Vous pouvez &#233;galement recopier la mani&#232;re dont
un wagon existant est utilis&#233; par vos emplacements et appliquer ces r&#232;gles &#224;
un autre wagon. Pour faire qu'un type de wagon se comporte comme un autre, s&#233;lectionnez d'abord
le wagon de votre souhaitez copier, puis s&#233;lectionnez la case option "Copier", le Type wagon
 appara&#238;tra maintenant &#224;  droite de la case, puis s&#233;lectionnez le type
de wagon que vous souhaitez modifier et appuyez sur "Enregistrer" pour avoir les deux types de wagon
utilis&#233;s par les m&#234;mes endroits et les voies. </P> 
 </P> 
 <A NAME="Cars"> </A> 
 <H2> Wagons </h2> 
La fen&#234;tre de wagons vous permet d'&#233;diter votre liste de wagons. Vous pouvez entrer un num&#233;ro de wagon, la ligne, type, longueur. Le programme calcule automatiquement le
poids des wagons qui est bas&#233; sur la longueur et l'&#233;chelle de votre mod&#233;lisation. Vous pouvez
facultativement ajouter la couleur du wagon, la date de Asssemblage, le chargement et le propri&#233;taire. Si vous voulez
un groupe de wagons pour &#234;tre man&#339;uvr&#233;s comme une unit&#233;, vous pouvez cr&#233;er un "noyau". Vous
pouvez attribuer n'importe quel nombre de wagons &#224; un noyau, mais le type du premier wagon
affect&#233; sera utilis&#233; par le programme afin de d&#233;terminer si le noyau est
permis &#224; un endroit. La longueur totale du noyau est utilis&#233; pour
d&#233;terminer si les wagons dans le noyau vont s'ins&#233;rer. Notez que le programme
comprend &#233;galement un espace pour les coupleurs du wagon lors du calcul de la longueur d'un
noyau.

 <P> 
 <img src="images/Cars.png"> 
 </P> 
 <H3> Ajouter, Enregistrer, trouver des boutons </H3> 

Il y a trois boutons situ&#233;s au bas de la fen&#234;tre de Wagons. Le
bouton "Ajouter" vous permet d'ajouter un wagon &#224; votre liste. Le bouton "Sauvegarder" enregistre
la liste des wagons sur le disque. Il sauve &#233;galement la position de la Fen&#234;tre wagons
et sa taille, et toutes les modifications apport&#233;es aux largeurs de tableau. Le bouton "Rechercher"
et la fen&#234;tre de texte adjacents peuvent &#234;tre utilis&#233;s pour trouver un wagon par son num&#233;ro de itin&#233;raire. Vous
pouvez utiliser le joker "*" en entrant un num&#233;ro de wagon. Par exemple si vous
vous voulez trouver toutes les wagons avec des num&#233;ro qui se termine par 345, entrez *345, et appuyez sur
trouver. Chaque fois que vous appuyez sur trouver, le prochain wagon avec un num&#233;ro se terminant par la ligne
"345" sera mis en surbrillance.

 <P> 
 <A NAME="ImportingCars"> </A> 
 </P> 
 <H3> Importation de Wagons &#224; partir d'un Fichier </H3> 

Si vous avez d&#233;j&#224; une liste de wagons dans une base de donn&#233;es, vous pouvez importer les
wagons dans le programme. La fonction d'importation n&#233;cessite un fichier texte ASCII,
avec une ligne pour chaque wagon. L'importation de wagons n&#233;cessite quatre attributs et
l'ordre est le num&#233;ro de wagon, nom de la ligne, le type et la longueur. Les quatre
attributs de wagon sont tous n&#233;cessaires pour que l'importation travaille correctement. Les lignes
suivantes montrent deux exemples de format correct:

 <P> 336 GCR plat 40
 <BR> 655578 UP Boxcar 40 </P> 

 <P> Chaque ligne peut commencer par un espace et des espaces multiples entre chaque
champs est correct. En option, vous pouvez inclure des attributs suppl&#233;mentaires dans l'
ordre suivant, poids, couleur, nom du propri&#233;taire, date de Asssemblage, et l'emplacement. L'emplacement peut avoir
deux domaines, le nom du lieu suivi de l'embranchement ou du triage
s&#233;par&#233;s par un tiret. Le tableau suivant montre deux exemples de
format correct: </P> 

 <P> 336 GCR Plat 40 3.8 Noire AT 1930 Home Town &#201;tats-Unis - Oil Terminal George
 <BR> 655578 UP Boxcar 40 3.8 jaune DB 1934 York - Fret York </P> 

 <P> Si vous pr&#233;f&#233;rez utiliser des d&#233;limiteurs virgules au lieu des espaces, utilisez un fichier avec
une extension .csv ou placer
le mot "comma" au d&#233;but de votre fichier d'importation et utiliser des virgules au lieu
des espaces. Voici deux exemples d'importation de wagons avec des virgules comme
d&#233;limiteurs. </P> 
 <P> comma <BR> 
336,GCR,Flat Car,40,3.8,Black,AT,1930,Home Town USA,-,George's Oil
Terminal <BR> 
655578,UP,Tank Car,40,3.8,Yellow,DB,1934,York,-,York Freight </P> 
 <P> Vous devez &#234;tre tr&#232;s pruembranchement avec les espaces lors de l'importation d'un fichie d&#233;limit&#233; par virgule. le
programme comprendra les espaces de arri&#232;re s'ils existent entre les virgules. </P> 

 <P> Si vous entrez 0 pour le poids de la wagon, le programme va automatiquement calculer le
poids des wagons pour vous en fonction de la longueur du wagon et de <A HREF="#Scale"> l'&#233;chelle </A> que vous avez s&#233;lectionn&#233;e. </P> 

 <P> Pour importer un fichier, utilisez le menu "Outils" dans le coin sup&#233;rieur gauche
 du menu Outils-> Op&#233;rations> wagons. Ensuite, s&#233;lectionnez
"Outils-> Liste-> Importer &#224; partir du fichier". Notez que le programme n'
ajoutera que les wagons qui n'existent pas dans liste de wagon du programme. Si le wagon
existe d&#233;j&#224;, l'importation sera ignor&#233;e par le programme. </P> 

 <P> Pendant l'importation, si l'emplacement d'un wagon ou d'une voie n'existe pas dans la
base de donn&#233;es du programme, le programme vous invite &#224; les cr&#233;er. Cet
ainsi, que non seulement vous importez vos wagons, mais aussi les endroits o&#249; se trouve le wagon
et les voies. Le programme mettra une nouvelle voie d'une longueur de 1000 ", et
va d&#233;finir le type de voie comme un garage. Apr&#232;s l'importation, vous pouvez &#233;diter la voie
et d&#233;finir sa longueur correcte et son <A HREF="#ChangeTrackType"> type </A> . </P> 

 <P> Pour am&#233;liorer la vitesse de l'importation de wagons, vous pouvez fermer la fen&#234;tre des wagons
. Il faut beaucoup plus de cycles de processeur pour mettre &#224; jour la fen&#234;tre des wagons
 que pour importer effectivement les wagons. </P> 

 <P> Apr&#232;s avoir import&#233; vos wagons, vous devez les enregistrer si vous souhaitez les conserver
 comme une partie de votre liste. Utilisez le bouton "Sauvegarder" Wagons ou s&#233;lectionnez un
wagon en appuyant sur le bouton Modifier, puis appuyez sur le bouton "Sauvegarder" qui
peut &#234;tre trouv&#233; au bas &#224; droite de la fen&#234;tre "Edition Wagon" . </P> 

 <A NAME="CarsEdit"> </A> 
 <H3> Ajout wagons &#224; votre liste </H3> 

Pour ajouter manuellement une wagon &#224; votre liste, appuyez sur le bouton "Ajouter" situ&#233; en
 bas de la fen&#234;tre "Outils-> Op&#233;rations> wagons" .

 <P> 
 <img src="images/EditCar.png"> 
 </P> 
 <P> 

S&#233;lectionnez ensuite l'itin&#233;raire
pour le wagon. Si l'itin&#233;raire d&#233;sir&#233; n'existe pas, appuyez sur le bouton "&#201;diter"
en face de la bo&#238;te de menu s&#233;lectionner itin&#233;raire. Cela vous permettra d'ajouter un nouvel 
itin&#233;raire ou de supprimer tout ce dont vous n'avez pas besoin. </P> 

 <H3> Num&#233;ro de Ligne </h3> 
Maintenant, entrez le num&#233;ro de ligne du wagon dans la zone de texte. Le programme exige un
nom de ligne unique et un num&#233;ro de ligne pour chaque wagon. Si vous avez des wagons avec
des lignes et des num&#233;ros iembranchementiques, il suffit d'ajouter un -1, -2, etc &#224; chacun des
num&#233;ros de wagons. Le programme lors de l'impression du manifeste ou de la liste de man&#339;uvre supprimera les les-1, -2, etc du num&#233;ro de ligne du wagon.

 <H3> Type de wagon, longueur, couleur, poids </H3> 

S&#233;lectionnez le type de wagon et sa longueur dans les bo&#238;tes de menu. Utilisez le
Bouton "Modifier"  &#224; droite de la bo&#238;te de menu pour ajouter ou supprimer des types de wagons ou des longueurs, que vous
souhaitez ajouter ou supprimer. Le poids des wagons est calcul&#233; automatiquement, mais
vous pouvez entrer un poids diff&#233;rent, si n&#233;cessaire. Lorsque vous entrez la longueur
d'un wagon, entrer dans la longueur de la caisse et non pas la longueur totale.
Par exemple, un wagon de quarante pieds a une longueur de 40 pieds. Le programme lorsqu'il 
 calcule la longueur, va ajouter deux pieds &#224; chaque extr&#233;mit&#233; du wagon pour les
coupleurs. Par cons&#233;quent, lorsque vous placez un wagon de quarante pieds sur un embranchement, il utilisera
 44 pieds de voie.

 <H3> Sous-Type de wagon </H3> 

 <P> Le programme offre la possibilit&#233; d'ajouter un sous-type de
 de wagon. L'ajout d'un "sous-type" &#224; votre type de wagon va cr&#233;er une nouveau
type de wagon. Le "sous-type" n'est pas imprim&#233; sur les listes manifeste ou de man&#339;uvres. Par exemple vous pourriez avoir des wagons &#224; charbon avec des chargement et des wagons de charbon
qui sont vides. Si vous entrez le type de wagon HopCoal-C pour vos wagon avec du charbon, et HopCoal-E pour le vide, le programme peut utiliser cette information pour attribuer et livrer des wagons &#224; leurs trains appropri&#233;s et
emplacements respectivement. </P> 

 <A NAME="CabooseFredHazardous"> </A> 
 <H3> Passagers, Caboose, FRED, case dangereux </H3> 

Si le wagon est utilis&#233; dans le service passager, cochez la case  passagers. Le
programme placera les wagons en particuliers vers l'arri&#232;re d'un train de service mixte
(combinaison de passagers et wagons de marchandises). Si le wagon est un
fourgon de queue, ou a un FRED (clignotant dispositif d'extr&#233;mit&#233; arri&#232;re), ou est dangereux, s&#233;lectionnez
la case appropri&#233;e. Le programme utilise les fonctions de fourgon de queue et Fred
pour placer le wagon &#224; la fin d'un train quand le train a besoin d'un fourgon de queue ou de
wagon avec Fred. La case &#224; cocher dangereux fera que le programme ajoutera une
note &#224; la liste de man&#339;uvres pour le wagon qui transporte des mat&#233;riaux dangereux
. Votre politique de chemins de fer au sujet des mati&#232;res dangereuses peut 
&#234;tre appliqu&#233;e &#224; ce wagon!

 <P> Lorsque la case utilitaire est s&#233;lectionn&#233;e, elle informe le programme lors de l'impression des manifestes et des listes de manoeuvresde ne pas afficher la ligne du wagon individuel et de le num&#233;ro de la ligne, mais plut&#244;t la quantit&#233; de wagons n&#233;cessaires de ce type. Par exemple, les trains de prototypes lors de l'exp&#233;dition du charbon ne liste pas normalement les wagons dans le train par le num&#233;ro de la ligne du wagon, mais indique plut&#244;t le nombre de wagons, le type de wagon, et la charge du wagon sur le manifeste du train. </P> 

 <P> Si vous utilisez la fonction d'utilit&#233;, il est fortement recommand&#233; que vous s&#233;lectionnez la fonction d'utilit&#233; pour toutes les wagons d'un type donn&#233;. Puisque la ligne et le num&#233;ro du wagon ne sont pas affich&#233;s sur les manifestes et la liste de manoeuvres, tous les wagons de ce type peuvent &#234;tre plac&#233;s dans un train. Plus tard, si vous essayez de trouver un wagon par son num&#233;ro de lifne, il pourrait tr&#232;s bien avoir &#233;t&#233; transport&#233; sur un train plus t&#244;t. Donc, vous avez &#224; d&#233;cider d'utilisez les num&#233;ros de ligne ou ou non pour un type donn&#233; de wagon. </P> 

 <H3> Emplacement wagon </H3> 

Maintenant d&#233;finir l'emplacement du wagon sur le r&#233;seau. Si le wagon est hors du r&#233;seau,
laisser l'emplacement blanc (espace vide).

 <A NAME="CarLoad"> </A> 
 <H3> Charge de wagon </H3> 

Vous pouvez &#233;ventuellement d&#233;finir l'&#233;tat de charge du wagon. S&#233;lectionnez E pour des vides ou L pour des charg&#233;s. Vous pouvez &#233;galement cr&#233;er vos propres <A HREF="#EditCarLoads"> charges wagon </A> ,
mais il y a des restrictions. Normalement les embranchements avec <A HREF="#Schedules"> Horaires </A> sont utilis&#233;s pour
charger ou d&#233;charger des wagons avec des charges personnalis&#233;es que vous avez cr&#233;&#233;es. Vous pouvez &#233;galement utiliser les
 <A HREF="#coulisseAndCarLoads"> Coulisses </A> pour charger ou d&#233;charger votre wagon avec des charges personnalis&#233;es.
Il est &#233;galement sugg&#233;r&#233;
que vous utilisiez un format similaire &#224; L(mati&#232;res premi&#232;res) pour d&#233;crire vos charges.
Par exemple une charge d'outils peut &#234;tre entr&#233; comme L(Outils).

 <A NAME="Kernel"> </A> 
 <H3> Noyau, ou groupe de wagons </H3> 

Si ce wagon souhaite faire partie d'un noyau qui est un groupe de wagons que
vous voulez passer comme une seule unit&#233;, appuyez sur "Modifier" en face du "Noyau" et
entrez un nom de noyau. S&#233;lectionnez ensuite le noyau de la bo&#238;te de menu.

 <H3> Champs facultatifs </H3> 

Enfin vous pouvez &#233;ventuellement entrer la couleur, la date de la Asssemblage, le propri&#233;taire et un commentaire pour
ce wagon. La date de Asssemblage peut &#234;tre saisie comme une ann&#233;e &#224; quatre chiffres, ou dans le format de
mois-ann&#233;e.

 <H3> Ajouter </h3> 

    Appuyez sur le bouton "Ajouter" pour entrer un nouveau wagon dans votre liste. Si vous avez des wagons semblables, vous pouvez choisir un wagon existant en utilisant le bouton "Modifier" dans la "fen&#234;tre" wagon, puis modifier le num&#233;ro de la ligne du wagon, et tous les autres attributs de wagons, suivis par l'appui sur le bouton" Ajouter "pour cr&#233;er un autre wagon pour votre liste. Appuyer sur le bouton "Ajouter" provoque &#233;galement la sauvegarde du nouveau wagon. Voir le bouton "Enregistrer" ci-dessous.

 <H3> Enregistrer </H3> 

Appuyez sur "Sauvegarder" pour stocker les param&#232;tres du wagon. Le programme va cr&#233;er un fichier
(OperationsCarRoster.xml) dans votre r&#233;pertoire JMRI dans un dossierl appel&#233;
"EOperations". Un fichier de sauvegarde avec les derniers r&#233;glages pour l'ensemble de vos wagons
est &#233;galement cr&#233;&#233; &#224; chaque fois que le bouton "Sauvegarder" est press&#233;.

 <A NAME="EditCarAttributes"> </A> 
 <H3> Modifier Attributs Wagon </h3> 

&#224; la droite de chacun des attributs de wagon (ligne, le type, Longueur, Couleur,
Noyau, Charge, Propri&#233;taire) il y a un bouton "&#201;diter". Utilisez cette fonction pour ajouter, supprimer ou remplacer
les attributs disponibles pour une wagon.

 <P> 
 <img src="images/EditCarAttribute.png"> 
 </P> 

 <H3> Ajouter Bouton </H3> 

Pour ajouter un attribut &#224; un nouveau wagon, saisissez le texte souhait&#233; dans la zone de texte et
appuyez sur le bouton "Ajouter". Lorsque vous entrez un attribut pour un nouveau wagon il 
apparaitra au d&#233;but de la liste. Plus tard, lorsque vous red&#233;marrerez le programme, ils
seront tri&#233;s dans l'ordre correct.

 <H3> Bouton Supprimer </H3> 

Pour supprimer un attribut de wagon, s&#233;lectionnez l'attribut que vous souhaitez supprimer dans la
la bo&#238;te du menu et appuyez sur le bouton "Supprimer".

 <H3> Remplacer le bouton </H3> 

Si vous avez besoin de changer un attribut sp&#233;cifique du wagon  (ligne, type, couleur, etc)
dans votre liste enti&#232;re de wagons, vous pouvez utiliser le bouton "Remplacer" qui se trouve en
bas &#224; droite de la fen&#234;tre d'&#233;dition d'attributs wagon. Par exemple, si vous  souhaitez
 changer l'attribut nom de ligne du wagon  "UP" &#224; "UPS" pour tous vos
 wagons. Appuyez sur le bouton "&#201;diter" pour chacun de vos wagons dans la fen&#234;tre de wagons,
puis appuyez sur le bouton "&#201;diter" en face de la ligne dans la fen&#234;tre "Modifier wagon"
. Entrez la nouvelle ligne "UPS" dans la bo&#238;te de texte, s&#233;lectionnez "UP" dans la bo&#238;te de menu
, et appuyez sur "Remplacer". Tous les wagons avec "UP" comme itin&#233;raire auront d&#233;sormais
"UPS" comme nom de ligne.

 <A NAME="EditCarLoads"> </A> 
 <H3> Modifier Charge Wagon </H3> 

Pour modifier la charge d'un wagon, appuyez sur le bouton "&#201;diter" charge dans la fen&#234;tre Modifier Wagon .

 <P> 
 <img src="images/EditCarLoads.png"> 
 </P> 
 <P> 
En plus de d'Ajouter, Supprimer et Remplacer les boutons et les champs d&#233;crits ci-dessus dans
 <A  HREF="#EditCarAttributes"> Modifier Attributs Wagon </A> , la fen&#234;tre modifier 
charges Wagon vous permet de d&#233;finir la priorit&#233; de la charge. La valeur par d&#233;faut de
la priorit&#233; est faible et vous pouvez changer la priorit&#233; &#224; &#233;lev&#233;e pour un type et une charge pour un wagon donn&#233;
. Des charges &#233;lev&#233;es de wagons prioritaires sont normalement desservies avant la faible priorit&#233;.
Utile si vous avez besoin  d'obtenir que votre frigorifique charg&#233; de fruits soit au march&#233; d&#232;s que possible!
 </P> 
Modifier
 <P> Vous pouvez &#233;galement fournir des messages en option pour vos op&#233;rateurs bas&#233;s sur
le type et la charge du wagon. Les messages peuvent &#234;tre utiles si vous avez des charges de wagon visibles
 qui doivent &#234;tre ajout&#233;s ou supprim&#233;s par vos op&#233;rateurs. </P> 

 <A NAME="CarsSet"> </A> 
 <H3> D&#233;finir Wagon </H3> 

Apr&#232;s la cr&#233;ation d'un wagon, vous pouvez d&#233;finir l'emplacement du wagon, et &#233;ventuellement la
destination du wagon et le train en utilisant le bouton "Param&#233;trage" trouv&#233; pour chaque wagon
dans la fen&#234;tre <A HREF="#Cars"> Wagon </A> . Normalement la destination du wagon et et le train affect&#233;
 sont g&#233;n&#233;r&#233;s par le programme, mais vous pouvez utiliser ces champs pour
forcer un wagon &#224; un endroit pr&#233;cis en utilisant un train sp&#233;cifi&#233;.

 <P> Vous pouvez &#233;galement supprimer un wagon qui a &#233;t&#233; attribu&#233; &#224; un train en
appuyant simplement sur le bouton "Sauvegarder". Vous pouvez &#233;galement ajouter un un wagon &#224; un train d&#233;j&#224; assembl&#233; qui n'a pas quitt&#233; son premier emplacement. S&#233;lectionnez une destination et le train pour le wagon, puis appuyez sur le bouton "Enregistrer".voie </P </P> 
 <P> 
 <img src="images/SetCarLocation.png"> 
 </P> 

 <P> Dans le coin sup&#233;rieur droit de la fen&#234;tre D&#233;finir Wagon il y a une case
"Lieu inconnu". Cocher la case lieu inconnu fait plusieurs 
choses. D'abord le programme ignorera le wagon lors de l'assemblage de nouveaux trains.
Deuxi&#232;mement, sur les manifestes et les listes de man&#339;uvres, le programme donnera la liste de tous les
wagons &#233;gar&#233;s. Maintenant, vos op&#233;rateurs peuvent vous aider &#224; trouver les wagons qui sont
 <A HREF="#MisplacedCarsComment"> &#233;gar&#233;s </A> . Et enfin, lorsque cette case est coch&#233;e, les autres champs de
la fen&#234;tre emplacement d&#233;fini du wagon sont d&#233;sactiv&#233;s. </P> 
 <P> La case "Hors service"  quand elle est s&#233;lectionn&#233;e indique au programme d'ignorer
le wagon lors de l'assemblage de nouveaux trains. De nombreux op&#233;rateurs ont une voie RIP (r&#233;paration sur Place)
et utilisent cette fonction pour maintenir le wagon l&#224; jusqu'&#224; ce que les r&#233;parations aient &#233;t&#233; faites. </P> 

 <P> Utilisez l'ensemble de champ "Lieu" pour placer la wagon sur le r&#233;seau. Utilisez la case "Auto" pour montrer les voies  valides pour un endroit donn&#233;. Vous pouvez &#233;galement entrer l'emplacement et la voie o&#249;vous voulez que le wagonrevienne quand l'&#233;tat de charge de la wagon est vide. Notez que le changement manuel de l'&#233;tat de charge &#224; vide ne provoque pas le retour Quand destination Vide (RWE) deviendra actif, seulement lorsque le wagon est d&#233;pos&#233; par le programme quandla destination RWE devient
active. </P> 

 <P> Vous pouvez &#233;galement modifier la charge du wagon ou cr&#233;&#233;er de nouvelles en utilisant le bouton "Editer". </P> 



 <P> Les trois prochains ensemble de champs sont normalement fix&#233;s par le programme lors de
l'assemblage des trains. Nous allons vous expliquer comment ils travaillent 
si vous &#234;tes int&#233;ress&#233;s par le fonctionnement du programme ou si vous voulez r&#233;&#233;crire
manuellement le programme. Le premier est l'ensemble "Destination" du menu d&#233;roulant
. Par d&#233;faut, les champs de destination sont d&#233;sactiv&#233;s. Dans "Outils" il ya une option pour activer les champs de destination. . </P> 

 <P> Le "Destination" est le prochain endroit o&#249; le wagon sera livr&#233;. La destination doit &#234;tre accessible par un seul train depuis l'emplacement actuel du wagon ou le wagon ne sera pas desservi. Normalement, nous vous recommandons de ne pas utiliser la "Destination" des menus d&#233;roulants pour transmettre un wagon &#224; un endroit, mais l'utilisation de la "destination finale", comme d&#233;crit ci-dessous. Toutefois, si vous ajoutez manuellement un wagon &#224; un train assembl&#233;, vous devez d&#233;finir la destination et la voie du wagon. </P> 

 <P> Le dernier champ est la mission du train. Si vous souhaitez sp&#233;cifier une
destination pour le wagon ou le train, il les placera avant que vous n'assembliez vos trains. </P> 

 <P> Lorsque du r&#233;glage manuel de la destination, vous n'avez pas &#224; sp&#233;cifier une
voie. Et quand vous choisissez manuellement une destination qui est une coulisse, vous
ne devez jamais choisir une voie de destination, laisser le programme le faire pour vous sauf si vous ajoutez un wagon &#224; un train d&#233;j&#224; assembl&#233;. </P> 

 <A NAME="SetCars"> </A> 
 <H3> D&#233;finition des wagons </H3> 

Si vous voulez changer l'emplacement, les destinations, le statut, ou le train
affect&#233; pour un groupe de wagons, utilisez l'outil "D&#233;finir Wagons" qui trouve sous
"Outils" dans la  fen&#234;tre <a HREF="#Cars"> Wagons </A> . L'outil fonctionne de la m&#234;me
mani&#232;re que l'emplacement <A HREF="#CarsSet"> D&#233;finir Wagon </A> comme d&#233;crit ci-dessus,
sauf que plusieurs wagons sont modifi&#233;s. S&#233;lectionnez les wagons que vous souhaitez
 changer dans le tableau, puis s&#233;lectionnez "D&#233;finition Auto". Le premier wagon s&#233;lectionn&#233;
devient la valeur par d&#233;faut, et si vous appuyez sur le bouton "Modifier", tous les
autres wagons s&#233;lectionn&#233;s auront les m&#234;mes param&#232;tres que le
wagon par d&#233;faut. Veillez &#224; appuyer sur "Sauvegarder" dans la fen&#234;tre de wagons si vous voulez
conserver vos modifications.

 <H3> Outils </H3> 

Le menu "Outils" wagons vous permet d'effectuer quelques fonctions utiles pour
votre liste de wagons. En plus de "Importer depuis un fichier" fonctionnalit&#233; d&#233;crite
pr&#233;c&#233;demment, vous pouvez &#233;galement exporter vos wagons dans un fichier de valeurs s&#233;par&#233;es par une virgule.
La fonction "Exporter vers un fichier"  cr&#233;e un fichier nomm&#233;
"ExportOperationsCarRoster.csv" dans le r&#233;pertoire JMRI-> operations. Vous
pouvez supprimer tous les wagons dans votre liste en utilisant le bouton option "Supprimer tous les wagons."

 <p> Le bouton "R&#233;initialiser compter mouvement tous les wagons" remets &#224; z&#233;ro le compteur de mouvements de tous les wagons. En utilisation normale, vous ne devriez jamais r&#233;initialise les compteurs de mouvements. Le programme utilise compteur pour d&#233;terminer quels wagons ont du mal &#224; trouver des voies de destination valides. Les wagons avec un faible nombre de mouvement finalement obtiennent une plus grande priorit&#233; sur les wagons avec un grand nombre de mouvements. En servant en premier les wagons avec le nombre le plus bas, les wagon se d&#233;placant difficilement finissent par &#234;tre d&#233;plac&#233;s par le programme. La R&#233;initialisation des mouvements du wagon  d&#233;joue cet algorithme. La seule raison valable pour la r&#233;initialisation de votre compteur, c'est quand vous ajoutez de nouveaux wagons &#224; votre liste et vous ne voulez pas que vos nouveaux wagons aient la priorit&#233; sur les wagons anciens. Cependant, dans la plupart des cas, les gens veulent voir les nouveaux wagons cieculer dans le premier train en dehors de la ville, aussi ne pas r&#233;initialiser lecompteur si vous voulez mettre vos nouveaux ajouts imm&#233;diatement au travail! </P> 

Vous pouvez &#233;galement pr&#233;visualiser et imprimer votre liste de wagon. L'aper&#231;u et les fonctions d'impression utilisent le m&#234;me boutons radio "Trier par"  la fen&#234;tre du wagon. L'un des tri les plus utiles, c'est par "Emplacement", ce qui vous permet de v&#233;rifier rapidement l'emplacements de vos wagon avant ou apr&#232;s une s&#233;ance d'exploitation.

    <p> Vous pouvez si vous le d&#233;sirez seulement avoir un aper&#231;u ou wagons d'imprer les wagons pour un emplacement ou une voie sp&#233;cifique. Dans les fen&#234;tres "Editer Emplacement" et "Editer Voie" le menu "Outils" offre une s&#233;lection "Montrer Wagons" qui fera appara&#238;tre la fen&#234;tre "Wagons", mais seulement la liste des wagons &#224; cet endroit ou sur la voie. Utilisez l'impression de la liste ou la fonctions de pr&#233;visualisation de la fen&#234;tre "wagons" pour imprimer une liste des wagons &#224; cet endroit ou sur la voie. </P> 

 <A NAME="Locomotives"> </A> 
 <H2> Locomotives </H2> 

La fen&#234;tre de locomotives vous permet d'&#233;diter votre liste de locomotive. Vous pouvez entrer
un num&#233;ro de locomotive, sa itin&#233;raire, son mod&#232;le, son type et sa longueur. Vous pouvez &#233;ventuellement
ajouter la date de la Asssemblage et le propri&#233;taire. Si vous voulez qu'un groupe de locomotives
soit assign&#233; comme une unit&#233;, vous pouvez cr&#233;er un "couplage". Le type de locomotive est
utilis&#233; par le programme afin de d&#233;terminer o&#249; les locomotives sont ramass&#233;es et/ou
stock&#233;es &#224; divers endroits sur votre r&#233;seau. Certaines locomotives sont par d&#233;faut
de types soit &#233;lectriques, diesel, turbine &#224; gaz ou &#224; vapeur.

 <P> 
 <img src="images/Locomotives.png"> 
 </P> 

 <A NAME="ImportLocomotives"> </A> 
 <H3> Importer Locomotives </H3> 

Si vous avez d&#233;j&#224; une liste de locomotives dans votre liste JMRI ou dans un
base de donn&#233;es, vous pouvez importer les locomotives dans le programme. Pour obtenir votre
locomotive &#224; partir de votre liste JMRI, s&#233;lectionnez "Importer &#224; partir de Liste JMRI" du menu Outils
Outils-> Exploitation> Locomotives-> . Seules les locomotives qui n'existent pas
seront ajout&#233;es &#224; la liste de locomotive du programme. De cette fa&#231;on, vous pouvez utiliser cet
outil tout moment vous ajoutez &#224; votre liste de locomotives des locomotives JMRI. La liste de locomotive JMRI
 n'a pas le champ de longueur, donc une longueur par d&#233;faut est entr&#233;e pour
vous. Vous devrez corriger la longueur de la locomotive si vous voulez que le programme
calcule correctement vos longueurs de train.

 <H3> Importer Locomotives partir d'un Fichier </H3> 

L'importation depuis la fonction fichier n&#233;cessite un fichier texte ASCII, avec une ligne
pour chaque locomotive. L'importation de locomotive n&#233;cessite quatre attributs et dans
l'ordre ,le num&#233;ro de la locomotive, le nom de ligne, le mod&#232;le, et la longueur. Ces quatre attributs
sont requis pour que l'importation  se fasse  correctement. Ce qui suit
montre deux exemples de bon format:

 <P> 236 UP RS4 40 <BR> 
5578 SP SW1200 42 </P> 
 <P> Chaque ligne peut commencer par un espace et des espaces multiples entre
champs est correct. En option, vous pouvez inclure des attributs suppl&#233;mentaires dans l'
ordre suivant, le nom du propri&#233;taire, date de Asssemblage, et l'emplacement. L'emplacement peut avoir
deux domaines, le nom du lieu suivi par un embranchement ou
triage &#224; l'emplacement s&#233;par&#233;s par un tiret. Le tableau suivant montre deux exemples de 
format correct: </P> 

 <BR> 
236 UP RS4 40 &#224; 1930 Home Town &#201;tats-Unis-Terminal Machines <BR> 
5578 SP SW1200 42 DB 1934 York-York Garage Machine

 <P> Si vous pr&#233;f&#233;rez utiliser des virgules comme d&#233;limiteurs au lieu des espaces, utilisez un fichier avec
une extension .csv ou placer
le mot "comma" au d&#233;but de votre fichier d'importation et utiliser des virgules au lieu
des espaces. Voici deux exemples d'importation de locomotives avec des virgules
comme d&#233;limiteurs . </P> 
 <BR> comma <P> 
236, UP, RS 4,40, AT, 1930, Home Town Etats-Unis,-, Terminal Machines <BR> 
5578, SP, SW 1200,42, DB, 1934, ville de York,-, York Garage Machine </P> 
 <P> Vous devez &#234;tre tr&#232;s pruembranchement avec les espaces lors de l'importation d'un fichier d&#233;limit&#233; par des virgules
. Le programme comprendra les espaces avant et arri&#232;re entre les virgules
si ils existent . </p > 
 <P> Pour importer un fichier, utilisez le menu "Outils" dans le coin sup&#233;rieur gauche 
du menu Outils-> Exploitation> Locomotives. S&#233;lectionnez
"Outils-> Liste-> Importer. Notez que le programme ne fera qu'ajouter des locomotives qui
n'existent pas dans liste de locomotive du programme. Si la locomotive 
existe d&#233;j&#224;, elle sera ignor&#233;e par le programme. </P> 

 <P> Apr&#232;s avoir import&#233; vos locomotives, vous devez les enregistrer si vous voulez
les garder comme partie de votre liste. Appuyez sur le bouton "Sauvegarder" situ&#233; au
bas de la fen&#234;tre Locomotives, ou s&#233;lectionnez une locomotive en appuyant sur le bouton &#201;dition
 et appuyez sur le bouton "Sauvegarder" qui peut &#234;tre trouv&#233; en bas &#224;
droite de la fen&#234;tre "&#201;dition Locomotive ". </P> 

 <A NAME="LocomotivesAdd"> </A> 
 <H3> Ajouter Locomotives &#224; votre liste </H3> 

Pour ajouter manuellement une locomotive &#224; votre liste, appuyez sur le bouton "Ajouter" situ&#233;
au bas de la fen&#234;tre "Locomotive". S&#233;lectionnez ensuite la ligne pour la
locomotive. Si la ligne d&#233;sir&#233;e n'existe pas, appuyez sur le bouton "&#201;diter"
en face de la bo&#238;te de menu  s&#233;lectionner ligne. Cela vous permettra d'ajouter une nouvelle
ligne ou de supprimer toutes celles dont vous n'avez pas besoin. Maintenant, entrez le num&#233;ro de la locomotive,
le mod&#232;le, le type, la longueur et la puissance. La puissance de la locomotive, le poids de la locomotive, et la pente de la voie qui sera utilis&#233;e par le programme pour calculer combien de
locomotives seront n&#233;cessaires lorsque vous utilisez l'option "automatique" lors de l'assemblage des trains.

 <p> Maintenant d&#233;finir l'emplacement de la locomotive sur le r&#233;seau. Si la locomotive n'est pas sur le r&#233;seau
, laisser l'emplacement vide. Si voulez que cette locomotive
fasse partie d'un couplage, appuyez sur "Modifier" en face de "couplage" et entrez le nom d'un couplage
. Ensuite, s&#233;lectionnez le nom du couplage dans la zone de menu. Enfin
vous pouvez &#233;ventuellement entrer la date de la Asssemblage, le propri&#233;taire et commentaires pour cette
locomotive. </P> 

 <A NAME="LocomotiveModels"> </A> 
 <H3> Mod&#232;les de locomotive </H3> 

Le programme vous permet d'organiser vos locomotives par mod&#232;le. Chaque mod&#232;le peut
n'avoir qu'un seul type de locomotive, longueur, poids et puissance nominale
qui lui sont associ&#233;s. Par exemple, si vous attribuez le nom de mod&#232;le "RS11" &#224;
un ensemble de locomotives, lorsque vous modifiez la longueur de l'un des "RS11", la
longueur sera &#233;galement changer pour les autres.

 <H3> Enregistrer </H3> 

Appuyez sur "Enregistrer" pour stocker les param&#232;tres de la locomotive. Le programme va cr&#233;er un
fichier (OperationsEngineRoster.xml) dans votre r&#233;pertoire JMRI dans un dossier
appel&#233; "Exploitationns". Un fichier de sauvegarde avec les derniers r&#233;glages pour toutes
vos locomotives est &#233;galement cr&#233;&#233; chaque fois que le bouton "Sauvegarder" est press&#233;. 

 <A NAME="LocomotivesSet"> </A> 
    <H3> D&#233;finir Locomotive </h3> 

    Apr&#232;s la cr&#233;ation d'une locomotive, vous pouvez d&#233;finir l'emplacement de la locomotive et, &#233;ventuellement, la destination et le train de la locomotive. Normalement, la destination de la locomotive et le train affect&#233;, sont g&#233;n&#233;r&#233;s par le programme, mais vous pouvez utiliser ces champs pour forcer une locomotive &#224; un endroit pr&#233;cis pour un train sp&#233;cifi&#233;.

 <a NAME="SynchronizeWithNCEConsists"> </A> 
    <H3> Synchroniser avec des Couplages NCE </h3> 

    Si vous utilisez une NCE comme centrale DCC, vous pouvez avec le programme synchroniser vos num&#233;ros de couplage avec vos locomotives. Le programme va lire toutes les couoplages du syst&#232;me NCE, puis va chercher les locomotives correspondantes dans votre liste Exploitation. Le programme attribuera le nom de couplage nce_xxx o&#249; xxx est le num&#233;rodu couplage. Pour synchroniser vos couplage, s&#233;lectionnez "Synchroniser avec couplage NCE" sous le menu "Outils".

 <A NAME="Routes"> </A> 
 <H2> Itin&#233;raires </H2> 

Un itin&#233;raire est une liste d'emplacement o&#249; le train va passer. Plus tard, vous pouvez
d&#233;cider si le train s'arr&#234;te &#224; un endroit pour man&#339;uvrer. Les itin&#233;raires peuvent &#234;tre de point &#224;
point ou aller et retour. Pour asssembler un itin&#233;raire, s&#233;lectionnez
"Outils-> Exploitation> Itin&#233;raires". La fen&#234;tre Itin&#233;raires fournit &#233;galement le statut de l'itin&#233;raire,
par exemple, "Orphelin" d&#233;signe un itin&#233;raire qui n'a pas &#233;t&#233; affect&#233; &#224; un train.


 <P> <img  Src="images/Routes.png"> </P> 

 <P> Puis appuyez sur la bouton "Ajouter" situ&#233; au bas de la fen&#234;tre. </P> 

 <P> <img  Src="images/EditRoute.png"> </P> 

 <P> Entrez le nom de l'itin&#233;raire et un commentaire facultatif. Ce commentaire est montr&#233; dans la fen&#234;tre itin&#233;raire et <A
     HREF="#ManifestComments"> optionnellemnt </a> sur votre manifeste. Chaque itin&#233;raire doit
avoir un nom unique. Puis appuyez sur le bouton "Ajouter Itin&#233;raire " situ&#233; au
bas de la fen&#234;tre. Maintenant, s&#233;lectionnez l'emplacement d'o&#249; le train partira en
s&#233;lectionnant l'emplacement dans la bo&#238;te de menu situ&#233;e sur le c&#244;t&#233; inf&#233;rieur gauche
de la fen&#234;tre. Appuyez sur "Ajouter un emplacement". Maintenant construisez votre itin&#233;raire en s&#233;lectionnant
l'emplacement suivant o&#249; le train va passer, s&#233;lectionnez tous les endroits o&#249; 
le train passera, m&#234;me si le train ne man&#339;uvre pas &#224; l'emplacement.
De cette fa&#231;on, le conducteur de votre train va savoir &#224; la lecture de son manifeste dans quelles villes il se rendra
. Chaque fois que vous ajoutez un emplacement sur l'
itin&#233;raire, le tableau montre l'ordre dans lequel le train va les visiter. Vous pouvez
d&#233;placer un emplacement, le monter ou le descendre dans la s&#233;quence si n&#233;cessaire. </P> 

 <A NAME="EditRoute"> </A> 
 <H3> Modifier l'itin&#233;raire </H3> 

Chaque emplacement a une direction pour le train au d&#233;part, le nombre de wagon qui
se d&#233;placent, et si lescollectes ou les livraisons de wagons sont autoris&#233;s &#224; cet
emplacement. Un mouvement de wagon peut &#234;tre un wagon collect&#233; ou un wagon livr&#233; &#224; cet endroit.
Par exemple, 5 mouvements peuvent &#234;tre 5 collectes, ou 5 livraisons, ou toute combinaison de
5 collectes ou de livraisons ensemble. Prendre ou d&#233;poser un groupe de wagons ou un
 <A HREF="#Kernel"> noyau </A> repr&#233;sente un mouvement.Pour modifier le nombre de mouvements pour un emplacement, cliquez directement sur la cellule dans la table de routage. Lorsque vous entrez le nombre d&#233;sir&#233; de wagon se d&#233;place, saisir des chiffres raisonnables qui refl&#232;tent ce que vous voulez que le programme fasse pour vous. Par exemple, si vous voulez que votre train  parte avec 15 wagons, alors 15 est la valeur correcte pour vos mouvements au d&#233;part de l'itin&#233;raire. A la fin de la itin&#233;raire, si vous voulez 12 wagons dans le train quand il s'arr&#234;te, puis 12 est la bonne valeur pour le nombre de mouvement pour le dernier emplacement dans la voie de votre train.

    <P> Si vous voulez retarder le d&#233;part du train &#224; partir d'un lieu ou 'augmenter le temps de parcours du train, entrez le nombre de minutes souhait&#233; dans la cellule "d'attente". Un autre choix est de pr&#233;ciser l'heure de d&#233;part du train &#224; partir d'un emplacement en s&#233;lectionnant le bouton radio "Heure de D&#233;part" dans le coin inf&#233;rieur droit de la fen&#234;tre de modification d'itin&#233;raire.voie </P> 


 <P> Vous pouvez &#233;galement ajuster <A HREF="#MaximumTrainLength"> la longueur maximale des trains </a> utilisant <A
     HREF="#UnitOfLength"> (Pieds ou M&#232;tres) </A> qui partent de chaque 
emplacement La pente est utilis&#233;e pour d&#233;terminer le nombre de locomotives dont le train a
besoin pour ce tron&#231;on. </P> 

 <P> Les X et Y sont les coordonn&#233;es sur le panneau de votre r&#233;partiteur pour
l'ic&#244;ne du Train en option. Vous pouvez d&#233;finir les coordonn&#233;es ici, en utilisant l'outil <A HREF= "#SetTrainIconCoordinates"> D&#233;finir Coordonn&#233;es de l'Ic&#244;ne du Train </A> , ou en
utilisant la fonction "d&#233;finir X & Y" de l'ic&#244;ne du train  du menu contextuel pour renseigner le programme o&#249; vous
voulez que l'ic&#244;ne du train soit plac&#233;e lorsque le train est &#224; l'emplacement sp&#233;cifi&#233;.
Laissez les coordonn&#233;es X et Y &#224; z&#233;ro si vous voulez d&#233;placer manuellement l'ic&#244;ne ou que vous n'utilisez pas la fonction de l'ic&#244;ne. </P> 

 <A NAME="RouteComment"> </A> 
 <p> Chaque lieu de l'itin&#233;raire peut aussi avoir un commentaire optionnel qui
appara&#238;tra sur le manifeste du train. Appuyez sur le bouton "Ajouter" sous la rubrique "Commentaire" pour ajouter un commentaire &#224; un emplacemen. </p> 

 <H3> Sauvegarde de l'Itin&#233;raire </H3> 

Appuyez sur "Sauvegarder l'itin&#233;raire" pour sauvegarder votre itin&#233;raire. Le programme va cr&#233;er un fichier
(Operationsitin&#233;raireRoster.xml) dans votre r&#233;pertoire JMRI dans un dossier appel&#233;
"operations". Un fichier de sauvegarde avec les derniers param&#232;tres de tous vos
itin&#233;raires est &#233;galement cr&#233;&#233; &#224; chaque fois que l'option "Enregistrer l'itin&#233;raire" est enfonc&#233;e.

 <A NAME="CopyRoute"> </A> 
 <H3> Copiez Itin&#233;raire </H3> 

Dans la fen&#234;tre Itin&#233;raire s&#233;lectionnez "Outils-> Copier Itin&#233;raire" pour faire une copie de votre
itin&#233;raire. Entrez le nom du nouvel itin&#233;raire et s&#233;lectionner l'itin&#233;raire que vous voulez
copier. Si vous souhaitiez que l'itin&#233;raire soit invers&#233; cocher la case "Inverser" .


 <A NAME="PassengerTrainRoute"> voie </A> 
    <H3> Itin&#233;raire Train Passager </h3> 

    Normalement, les trains de voyageurs fonctionnent sur un horaire bas&#233; sur les heures de d&#233;part. Si vous voulez que vos manifestes affichent les heures de d&#233;part de votre train, cr&#233;er un itin&#233;raire dans lequel vous sp&#233;cifiez l'heure de d&#233;part &#224; chaque emplacement. Dans le coin inf&#233;rieur droit de la fen&#234;tre "Editer itin&#233;raire", s&#233;lectionnez "Heure de d&#233;part" dans la zone d'affichage. Maintenant, s&#233;lectionnez l'heure de d&#233;part pour chaque emplacement dans l'itin&#233;raire du train. La d&#233;claration du manifeste "Pas de travail au xxx" n'est pas appropri&#233; pour un train de voyageurs. Pour &#233;liminer cette d&#233;claration, il suffit d'ajouter un commentaire &#224; chaque emplacement dans l'itin&#233;raire du train. Utilisez la fen&#234;tre de modification d'itin&#233;raire et, pour chaque emplacement, vous pouvez ajouter un commentaire ou modifier un existant.
 <A NAME="RouteFeatures"> </A> 

 <H3> Fonctionnalit&#233;s Itin&#233;raire </H3> 

Une fonctionnalit&#233; tr&#232;s puissante de itin&#233;raires est la possibilit&#233; de sp&#233;cifier les m&#234;mes
emplacements plus d'une fois. Lorsque le m&#234;me nom de lieu est utilis&#233; au
retour, le manifeste du train sera imprim&#233; comme si le train est seulement arriv&#233;
et reparti. Notez que les noms "Danville", "Danville-1", et
"Danville-2" sont tous les m&#234;mes en ce qui concerne l'impression des listes de manifeste et de man&#339;uvres
 mais le programme les traite comme s'ils &#233;taient
des endroits diff&#233;rents

 <P> Par exemple, vous pouvez contr&#244;ler s'il y a des d&#233;poses ou des ramassages &#224; tous les
emplacements dans l'itin&#233;raire. Par cons&#233;quent, si vous vouliez seulement livrer 3 wagons,
vous pouvez sp&#233;cifier une livraison et 3 mouvements. Mais que faire si vous vouliez
livr&#233;s 3 wagons et ramasser 7 wagons. Si vous sp&#233;cifiez 10 mouvements pour un
emplacement, ce peut &#234;tre n'importe quelle combinaison de 10 ramassages et et de livraisons ensemble. En utilisant
"Danville" comme notre emplacement, nous pouvons dans notre itin&#233;raire pr&#233;ciser deux "Danville"
, dos &#224; dos. Dans le premier "Danville", nous pouvons indiquer trois livraisons
uniquement. Dans le second "Danville" nous pouvons sp&#233;cifier 7 ramassages uniquement. Maintenant, le
programme va "essayer" et r&#233;pondre &#224; votre demande en ramassant jusqu'&#224; 7 wagons et
d&#233;posant jusqu'&#224; 3 wagons. </P> 

 <P> Autre exemple, le programme ne vous permettra pas d'avoir des voies de coulisse
 et d'autres types de voies (embranchements, chantiers, &#233;changes) au
m&#234;me endroit. Mais en utilisant les noms ci-dessus, on pourrait attribuer le chantier et
 l'embranchement &#224; "Danville", et puisque "Danville-1" est le
dernier emplacement ou le premier d'un itin&#233;raire, attribuer la coulisse &#224; "Danville-1".
Maintenant, quand le train s'arr&#234;te &#224; Danville, la cour et l'embranchements sont
desservis, et puis le train se termine en coulisse &#224; "Daville-1". </P> 

 <P> Autre exemple. Disons que nous avons un train grande ligne qui dessert
 Danville. &#224; Danville, nous avons un garage et plusieurs embranchements. Nous
voulons que le train grande ligne desserve le garage de Danville, mais pas les embranchements.
Nous ne voulons pas utiliser de loco de man&#339;uvre pour desservir les embranchements de
Danville. Cependant, nous voulons qu'un service local les desserve! Nous devons dire au 
programme quelles voies sont desservies et par quels trains &#224; Danville.

 <P> Solution, nous cr&#233;ons un triage &#224; "Danville", et cr&#233;ons les embranchements dans
"Danville-1". Le train de grande ligne a "Danville" dans son itin&#233;raire. La
section locale dessert  "Danville" et "Danville-1". Maintenant, le dilemme, faire la
desserte locale "Danville-1" ou "Danville" en premier? Pas de probl&#232;me, nous cr&#233;ons
un itin&#233;raire pour le service locale "Danville-1", puis "Danville", et
puis "Danville-1". Lors du premier "Danville-1", nous demandons seulement des ramassages dans les embranchements, &#224; "Danville", nous sp&#233;cifions &#224; la fois ramassages et livraisons dans le triage
, et lors de la deuxi&#232;me "Danville-1", nous pr&#233;cisons les d&#233;poses seules. </P> 

 <P> Une autre solution consiste &#224; utiliser simplement la capacit&#233; de l'embranchement pour s&#233;lectionner les trains qui peuvent desservir la voie. </P> 

 <A NAME="SetTrainIconCoordinates"> </A> 
 <H3> D&#233;finir les Coordonn&#233;es d'Ic&#244;ne de Train </H3> 

Utilisez cet outil pour d&#233;finir les coordonn&#233;es X et Y par d&#233;faut de vos ic&#244;nes de train
pour chaque emplacement. L'outil vous permet de sp&#233;cifier les coordonn&#233;es de l'ic&#244;ne
bas&#233;e sur l'orientation du train. Vous pouvez &#233;galement mettre &#224; jour tous vos itin&#233;raires existants
et lieux avec ces nouvelles coordonn&#233;es. Comme alternative, vous
pouvez utiliser un  "Outils-> D&#233;finir Coordonn&#233;es des Ic&#244;nes du Train pour cet itin&#233;raire" pour
cr&#233;er des coordonn&#233;es uniques pour un trajet pr&#233;cis.

 <A NAME="Trains"> </A> 
 <H2> Trains </H2> 

Maintenant que nous avons cr&#233;&#233; notre itin&#233;raire nous avons besoin que les trains bougent les wagons! Cr&#233;er un
train en s&#233;lectionnant "Outils-> Exploitation> Trains" dans le menu de premier niveau.
 <P> <img Src="images/Trains.png"> </P> 

 <P> La fen&#234;tre "Trains" affiche tous vos trains. Pour chaque train, il y a une case &#224; cocher dans la colonne "asssembler" utilis&#233;e pour s&#233;lectionner les trains &#224; asssembler, &#224; imprimer et terminer. Les boutons en bas de la page asssemberont, imprimeront ou de terminerons les trains s&#233;lectionn&#233;s. Vous pouvez &#233;galement modifier un train existant en utilisant le bouton "&#201;diter" pour ce train. Pour chaque train il y a aussi un bouton d'action. Vous pouvez s&#233;lectionner l'unE des quatre actions pour votre train. L'action "Mouvement" provoque le d&#233;part d'un train assembl&#233; &#224; partir de son emplacement actuel et passer &#224; l'emplacement suivant dans l'itin&#233;raire du train. L'action "Conducteur" ouvre une fen&#234;tre qui fournit le manifeste du train pour chaque emplacement dans l'itin&#233;raire du train. Les deux derni&#232;res actions sont "Terminer" et "R&#233;init", en appuyant sur "Terminer" d&#233;place un train assembl&#233; &#224; la derni&#232;re position dans le parcours du train, et ach&#232;ve le travail confi&#233; au train. "R&#233;init" est utilis&#233; pour lib&#233;rer tous les wagons attribu&#233;s &#224; un train assembl&#233;. Vous ne pouvez r&#233;initialiser un train qui n'a pas &#233;t&#233; d&#233;plac&#233;. </P> 

   <P> Il y a plusieurs cases &#224; cocher au bas de la fen&#234;tre des trains. La case "Tout afficher" s&#233;lectionn&#233;e, montre tous les trains dans votre liste. Lorsqu'elle est d&#233;sactiv&#233;e, seuls les trains qui ont la case "Asssembler" s&#233;lectionn&#233;e, sont affich&#233;s. La case &#224; cocher "Messages" lorsqu'elle est s&#233;lectionn&#233;e pr&#233;sentera une bo&#238;te de dialogue &#224; chaque &#233;chec d'un train &#224; asssembler pour expliquer pourquoi le train n'a pas assembl&#233;. La case "Rapport Assemblage"  lorsqu'elle est s&#233;lectionn&#233;e fournit un rapport d&#233;taillant comment le train a &#233;t&#233; assembl&#233; par le programme. Utilisez la fonction "Imprimer" ou le bouton "Aper&#231;u" pour un train assembl&#233; pour voir le rapport d'assemblage. Le programme pr&#233;voit toujours un bouton "Rapport" dans la colonne "Action" pour un train qui ne parvient pas &#224; &#234;tre asssembler. </P> 

 <P> La case "Aper&#231;u" lorsqu'elle est s&#233;lectionn&#233;e, vous permet de pr&#233;visualiser plut&#244;t que d'imprimer le manifeste de votre train ou le rapport d'assemblage. </P> 

    <P> Un des boutons les plus importants est le bouton "Sauver Assemblages". Une fois press&#233;, le programme enregistre tous les fichiers qui ont &#233;t&#233; modifi&#233;s par l'assemblage et le d&#233;placement de vos trainr vos trains. L'appui sur ce bouton vous permet d'arr&#234;ter le programme et de reprendre exactement l&#224; o&#249; vous avez quitt&#233; le programme. </P> 


 <P> Appuyez sur le bouton "Ajouter" pour cr&#233;er un train. </P> 
 <P> <img src="images/EditTrain.png"> </P> 
 <P> Entrez le nom du train et une description facultative, puis appuyez sur
le bouton "Ajouter Train". Les deux seront affich&#233;s sur le manifeste du train. Le
nom du train sera &#233;galement visible sur l'ic&#244;ne train, aussi les noms courts sont mieux. S&#233;lectionnez ensuite l'itin&#233;raire que ce train va suivre. Il y a un bouton &#201;dition &#224; droite de l'itin&#233;raire qui vous permet de modifier directement l'itin&#233;raire
s&#233;lectionn&#233;. Une fois qu'un itin&#233;raire est s&#233;lectionn&#233;, une liste de lieux que 
le train visitera devrait appara&#238;tre. Vous pouvez d&#233;s&#233;lectionner n'importe quel endroit o&#249;  vous
ne voulez pas que le train man&#339;uvre </P> 



 <H3> Mat&#233;riel Roulant Utilisable </H3> 

Vous pouvez d&#233;terminer quel type de wagons et de locomotives, le train va utiliser.
S&#233;lectionnez le mat&#233;riel roulant que le train utilisera en cliquant sur les
cases appropri&#233;es. Une case coch&#233;e signifie que le train va utiliser ce
type de mat&#233;riel roulant.

 <A NAME="TrainRequires"> </A> 
 <H3> Requ&#234;tes Optionnelles du Train </H3> 

Vous pouvez contr&#244;ler le nombre de locomotives qui seront assign&#233;es &#224; ce
train, et &#233;ventuellement, le mod&#232;le et le nom  de ligne de la locomotive. Si vous ne voulez pas que le programme affecte de locomotives &#224; votre train, selectionnez 0 comme nombre de locos requise. Si vous voulez que deux
ou plusieurs locomotives soient affect&#233;es &#224; un train, les locomotives doivent faire partie d'un <A
Href= "#LocomotivesAdd"> couplage </A> . Si vous s&#233;lectionnez "Auto", le programme
calculera le nombre de locomotives requises pour ce train sur la base des
poids du train, de la pente de la voie, et la puissance des locomotives.

 <P> Vous pouvez aussi exiger un fourgon de queue <A HREF="#CabooseFredHazardous"> 
ou un wagon avec Fred (dispositif clignotant d'extr&#233;mit&#233; arri&#232;re, non utilis&#233; en France) </A> comme dernier wagon dans le
train, et vous pouvez &#233;ventuellement sp&#233;cifier le nom de ligne pour le fourgon de queue ou le
wagon avec Fred. Si vous laissez le nom de la ligne vide, le programme va essayer
de trouver un fourgon de queue qui a le m&#234;me nom de ligne que la locomotive. </P> 

 <A NAME="TrainReset"> </A> 
 <H3> R&#233;initialiser le Train </H3> 

Le bouton "R&#233;init Train" vous permet de supprimer les locomotives et les wagons qui ont
&#233;t&#233; attribu&#233;s &#224; un train. Utile quand vous voulez essayer de diverses
options d'assemblage et de ne pas  d&#233;placer physiquement les locomotives et les wagons sur le
r&#233;seau.

 <H3> Enregistrer le Train </H3> 

Appuyez sur "Enregistrer Train" pour sauver votre train. Le programme va cr&#233;er un fichier
(OperationsTrainRoster.xml) dans votre r&#233;pertoire JMRI dans un dossier appel&#233;
"Op&#233;rations". Un fichier de sauvegarde avec les derniers param&#232;tres de tous vos
trains est &#233;galement cr&#233;&#233; &#224; chaque fois que le bouton "Enregistrer Train" est press&#233;. 

 <A NAME="TrainOptions"> </A> 
 <H3> Options du Train </H3> 

Vous pouvez &#233;ventuellement avoir un nom unique de compagnie et un logo pour chaque train
dans votre liste. Utilisez la fonction "&#201;diter Train-> Outils-> Options" pour saisir votre
Nom de Compagnie et son logo.

 <A NAME="TrainBuildOptions"> </A> 
 <H3> Train Options de Asssemblage </H3> 

Dans la fen&#234;tre de menu &#233;dition du train sous la rubrique "Outils-> Options d'Assemblage du Train"
se trouvent des options suppl&#233;mentaires pour l'asemblage d'un train. Vous pouvez contr&#244;ler les lignes des
wagon, les charge, les propri&#233;taires, et les dates de Asssemblage que le train utilisera.

 <P> Vous pouvez &#233;galement sp&#233;cifier un changement de locomotive en itin&#233;raire ou d'ajouter des locomotives d'assistance. </P> 
 
 <P> 
    <img src="images/TrainBuildOptions.png"> 
   </P> 

     <H3> Options </h3> 

   <H4> Utilisez le mode normal lors de l'assemblage de ce train </h4> 

   Vous pouvez demander &#224; ce que le programme utilise le mode normal lors de l'assemblage du train. Ceci est utile quand un train quitte la coulisse. En mode normal, toutes les wagons dans la coulisse sont d&#233;pos&#233;s d'abord, o&#249; en mode agressif, les wagons dans coulisse sont d&#233;pos&#233;s en dernier. En s&#233;lectionnant cette option lorsque vous avez des &#233;checs d'assemblage hors dela  coulisse, elle pourrait r&#233;parer la d&#233;faillance .

   <H4> Envoyer toutes les wagons collect&#233;s au terminus </h4> 

   Vous pouvez &#233;galement demander que tous les wagons ramass&#233;s soient envoy&#233;s au dernier emplacement de votre itin&#233;raire ( terminus). Utile si vous ne voulez pas que vos wagons ramass&#233;s et d&#233;pos&#233;s &#224; divers endroits sur le parcours de votre train.

   <H4> Permettre aux wagons de revenir &#224; la coulisse si n&#233;cessaire </h4> 

   Quand un train part et revient au m&#234;me emplacement de coulisse, c'est consid&#233;r&#233; comme un tour par le programme. Un tour, prend normalement les wagons &#224; partir de coulisse, les pr&#233;sente sur le trac&#233;, ramasse les wagons neufs et retourne en coulisse avec ces wagons. Normalement, le programme ne permet pas aux m&#234;mes wagons d'aller et revenir en coulisse. Toutefois, &#231;&#224; peut &#234;tre souhaitable pour permettre au train transporter les wagons plut&#244;t que d'avoir le rapport du programme disant que les wagons dans la coulisse ne pouvaient pas &#234;tre livr&#233;s &#224; destination sur le r&#233;seau. La s&#233;lection de cette option permet un tour pour le transport des wagons vers et &#224; partir du m&#234;me emplacement en coulisse. Notez que lorsque cette options est s&#233;lectionn&#233;e, que le programme retournera seulement les wagons &#224; coulisse lorsque les destinations ne sont pas disponibles sur le r&#233;seau. Vous pouvez &#233;galement d&#233;finir cette optionpour tous les tours, voir <A HREF="#SettingsOptions"> Options </A> .

   <H4> Autoriser les mouvements locaux quand un wagon a une charge personnalis&#233;e </h4> 

   Le programme lors de la g&#233;n&#233;ration des mouvements du wagon normalement ne cr&#233;e pas de mouvements locaux. Un mouvement local est un ramassage suivi d'une d&#233;pose d'un wagon au m&#234;me endroit. Lorsque vous utilisez des charges sur mesure, le programme peut cr&#233;er des mouvements locaux en fonction de la charge personnalis&#233;e du wagon. Donc, si vous aviez une wagon pr&#233;sent sur une voie avec une charge personnalis&#233;e, et vous avez aussi eu un embranchement avec un horaire au m&#234;me endroit demandant cette charge, le manifeste du train pourrait montrer la collecte et la d&#233;pose un mouvement local. C'est la m&#234;me chose pour un wagon avec une destination finale qui est &#224; l'emplacement actuel du wagon. Donc, si vous ne voulez pas que votre train effectue des mouvements locaux quand un wagon a une charge personnalis&#233;e ou une destination finale locale, d&#233;sactivez cette option .

   <H4> Permettre aux v&#233;hicules de voyager de l'origine au terminus </h4> 

   Normalement, le programme permet aux wagons de circuler entre l'emplacement de d&#233;part du train (origine) &#224; son dernier emplacement (terminus). D&#233;sactivez cette option si vous ne voulez pas que le train transporte des wagons de l'origine du train  au Terminus .
   
   <A NAME="TrainRoadNames"> </A> 
   <H3> Noms de Ligne de Train </h3> 

   Vous pouvez contr&#244;ler les noms de ligne que le train dessert. S&#233;lectionnez dans le menu " &#201;dition Train- > Outils", " Options Assemblage Train". Cela fera appara&#238;tre une nouvelle fen&#234;tre avec plusieurs options.

   <P> Si le train va desservir n'importe quel nom de ligne, s&#233;lectionnez le bouton radio "Tout Accepter". Si vous voulez accepter que certains noms de ligne, s&#233;lectionnez le bouton radio ""Accepter seulement". Ensuite, utilisez le menu des noms de ligne et le bouton "Ajouter Ligne" pour faire une liste de noms de ligne que le train dessert. Pour supprimer un nom de ligne de votre liste, s&#233;lectionnez le nom de la ligne dans le menu et cliquez sur le bouton "Supprimer Ligne" . </P> 

   <P> Pour construire une liste de noms de ligne que le train ne desservira pas, s&#233;lectionnez le bouton radio "Exclure". Utilisez le Menu des noms de ligne et le bouton "Ajouter Ligne" pour construire une liste de lignes que ce train ne desservira pas. </P> 

   <P> Appuyez sur le bouton "Enregistrer Train" pour mettre &#224; jour les options d'assemblage du train et fermer la fen&#234;tre lorsque votre avez termin&#233; . </P> 

   <H3> Trains Wagon et Charge </h3> 

   Vous pouvez d&#233;cider quel wagon charg&#233; le train va desservir. Il y a deux menus d&#233;roulants, le premier est le type de wagon, et le second le type de charge desservie par le type de wagon s&#233;lectionn&#233;. Utilisez le bouton "Ajouter Charge" pour construire une liste de charges que le train va soit desservir soit exclure. Le bouton "Supprimer tout" va supprimer toutes les charges de la liste. Vous pouvez &#233;galement associer une charge avec un type de wagon particuli&#232;r, cochez la case " Utiliser le type de wagon et charge" si vous souhaitez cette fonctionnalit&#233; .

   <H3> Propri&#233;taires et Train </h3> 

   Vous pouvez d&#233;cider quels mat&#233;riel roulant le train desservira par nom du propri&#233;taire. Le contr&#244;le est similaire &#224; <A HREF="#TrainRoadNames"> train noms de ligne </A> , voir ci-dessus .

   <H3> Train Dates de Asssemblage </h3> 

   Vous pouvez contr&#244;ler quel mat&#233;riel roulant le train desservira par leur date de Asssemblage. Si vous voulez que les locomotives et les wagons construits apr&#232;s une certaine ann&#233;e, s&#233;lectionnez le bouton radio "Apr&#232;s" et entrez une ann&#233;e &#224; quatre chiffres dans la zone de texte. Si vous  souhaitez les locomotives et les wagons construits avant une certaine ann&#233;e, s&#233;lectionnez le bouton radio " Avant " et entrez une ann&#233;e &#224; quatre chiffres dans la zone de texte. Et si vous voulez sp&#233;cifier une p&#233;riode, s&#233;lectionnez le bouton radio "Range" et entrez l'ann&#233;e avant et l'ann&#233;e apr&#232;s que vous voulez que le train desserve.

 <H3> Exigences de train option </h3> 

   Vous pouvez avoir jusqu'&#224; deux changements de locomotive pendant que le train est en voie . S&#233;lectionnez l'option " changement de locomotive " o&#249; vous voulez que le changement se produise dans votre itin&#233;raire, et combien de nouvelles locomotives devraient &#234;tre affect&#233;s &#224; la gare . Vous pouvez &#233;ventuellement s&#233;lectionner le nouveau mod&#232;le de locomotives et de la route . Au lieu du changement de locomotive, les locomotives pr&#233;c&#233;demment assign&#233;es seront retir&#233;s du train.

   <P> Le programme vous donne &#233;galement trois options en ce qui concerne le fourgon de queue du train. La premi&#232;re option, " Retirez caboose ", pr&#233;cisera le fourgon de queue si l'on a &#233;t&#233; affect&#233; au train. Le train quittera alors l'emplacement sp&#233;cifi&#233; sans fourgon de queue . La deuxi&#232;me option, " Aucun changement de caboose ", soit maintient le wagon de queue si l'on a &#233;t&#233; affect&#233; &#224; la gare, ou le quitte sans fourgon de queue s'il n'y avait pas un seul affect&#233; au train. La troisi&#232;me option, "Changement caboose ", pr&#233;cisera le fourgon de queue si l'on a &#233;t&#233; affect&#233; &#224; la gare, puis ajouter un nouveau pour le train. Cette derni&#232;re option devient " Ajouter caboose " si le train roulait sans fourgon de queue .
   <P> Vous pouvez &#233;galement demander des locomotives d'appoint pour les longues batailles jusqu'&#224; la colline que votre train peut rencontrer . Le code actuel ne fait qu'ajouter un commentaire au manifeste demandant un service d'aide &#224; partir de l'emplacement que vous choisissez, et supprime le service d'assistance au second emplacement sp&#233;cifi&#233; par vous. </P> 

   <A NAME="TrainManifestOptions"> </A> 
   <H3> Train options  manifeste </h3> 

   Vous pouvez &#233;ventuellement avoir un nom de Cie et un logo unique pour chaque train de votre liste. Vous pouvez &#233;galement d&#233;cider si vos manifestes montrent les heures de d&#233;part et d'arriv&#233;e du train. Utilisez "&#201;dition Train- > Outils-> Options Manifeste" pour d&#233;finir ces options .
   
   <a NAME="TrainScripts"> ' </A > 
   <H3> Scripts </h3> 

   Si vous voulez lancer un <a HREF="../../../../html/tools/scripting/index.shtml"> script </a> quand un train est assembl&#233;, se d&#233;place ou se termine, s&#233;lectionnez sous le "&#201;diter Train-> Outils-> Scripts" . Cela fera appara&#238;tre une nouvelle fen&#234;tre avec plusieurs options de script.
   <p> 
   Plusieurs exemples d'op&#233;rations orient&#233;es scripts sont Inclus dans le <a HREF="http://jmri.org/jython/operations"> r&#233;pertoire jython </a> .
  </P> 

 
   <A NAME="TrainShowCarTypesServiced"> </A> 
   <H3> Voir les types de wagons desservis </h3> 

   <P> Cet outil de diagnostic peut vous aider &#224; d&#233;terminer pourquoi un train ne va pas desservir un type de v&#233;hicule particulier. Vous pouvez s&#233;lectionner un type de wagons et de voir comment le train va desservir ce type de wgons. Vous pouvez &#233;galement s&#233;lectionner une wagons sp&#233;cifique pour voir comment ce wagon serait desservi. </P> 

   <P> 
    <img src="images/ShowCarTypesServicedTrain.png"> 
  </P> 
   <P> La fen&#234;tre affiche l'itin&#233;raire du train  avec tous les emplacement et une voies pouvant &#234;tre desservis par le train. A droite de chaque voie est le statutn actuel pour ce type de wagons actuellement s&#233;lectionn&#233; dans le menu d&#233;roulant. Si l'&#233;tat est "OK", puis ce train peut ramasser et d&#233;poser ce type de wagons sur cette voie sp&#233;cifique. Si l'&#233;tat est "collecte" ou " D&#233;pose ", alorss le train ne peut que prendre ou laisser des wagons &#224; cette voie particuli&#232;re . Un statut qui commence par un "X" signifie que le train ne desservira pas la voie. Le tableau suivant pr&#233;sente un r&#233;sum&#233; des diff&#233;rents statuts. </P> 

   <table> 
 <tr> <th> Statut </th> </tr> 
 <tr> 
 <td width="20%"> OK </td> 
 <td> Type de wagon s&#233;lectionn&#233; pouvant &#234;tre collect&#233; et d&#233;pos&#233; </td> 
 </tr> 
 <tr> 
 <td> Collecter </td> 
 <td> Type wagon choisi qui peut seulement &#234;tre collect&#233; sur cette voie </td> 
 </tr> 
 <tr> 
 <td> D&#233;poser </td> 
 <td> Type de wagon choisi qui peut seulement &#234;tre d&#233;pos&#233; sur cette voie </td> 
 </tr> 
 <tr> 
 <td> X (Train et Asssemblage) </td> 
 <td> La Date de Asssemblage du wagon s&#233;lectionn&#233; n'est pas utilis&#233; par ce train </td> 
 </tr> 
 <tr> 
 <td> X (Chargement et Trains) </td> 
 <td> Le wagon charg&#233; s&#233;lectionn&#233; n'est pas utilis&#233; par ce train </td> 
 </tr> 
 <tr> 
 <td> X (Propri&#233;taire et Train) </td> 
 <td> Le wagon du propri&#233;taire s&#233;lectionn&#233; n'est pas utilis&#233; par ce train </td> 
 </tr> 
 <tr> 
 <td> X (Ligne et  du Train ) </td> 
 <td> Le wagon de la ligne choisie n'est pas utilis&#233; par ce train </td> 
 </tr> 
 <tr> 
 <td> X (Type et Train) </td> 
 <td> Le Type de wagon choisi n'est pas utilis&#233; par ce train </td> 
 </tr> 
 <tr> 
 <td> X (Train Direct ) </td> 
 <td> Le train ne dessert pas cet endroit </td> 
 </tr> 
 <tr> 
 <td> X (Train de Collecte) </td> 
 <td> Le train ne peut que collecter les wagons sur cette voie </td> 
 </tr> 
 <tr> 
 <td> X (Train de Livraison) </td> 
 <td> Le train ne peut que livrer des wagons sur cette voie </td> 
 </tr> 
 <tr> 
 <td> X (Itin&#233;raire) </td> 
 <td> L'itin&#233;raire ne permet pas de collecte ou de livraison pour cet endroit </td> 
 </tr> 
 <tr> 
 <td> X (Mouvements sur l'itin&#233;raire) </td> 
 <td> Le nombre de mouvements de wagon demand&#233; pour cet endroit est nul </td> 
 </tr> 
 <tr> 
 <td> X (Type par Lieu) </td> 
 <td> L'emplacement n'utilise pas le type de wagon s&#233;lectionn&#233;e </td> 
 </tr> 
 <tr> 
 <td> X (Voie et Ligne) </td> 
 <td> La voie n'utilise pas le wagon de la ligne s&#233;lectionn&#233;e </td> 
 </tr> 
 <tr> 
 <td> X (Voie et Type) </td> 
 <td> La voie n 'utilise pas le type de wagon s&#233;lectionn&#233;e </td> 
 </tr> 
 <tr> 
 <td> X (Dir et Lieu) </td> 
 <td> Bas&#233; sur la direction de d&#233;part du train, l'emplacement
ne permet pas de livraison et de collecte </td> 
 </tr> 
 <tr> 
 <td> X (horaire annexe) </td> 
      <td> La s&#233;lection de l'horaire du <A HREF="#Schedules"> programme de l'embranchement </A> emp&#234;che la wagon d'&#234;tre utilis&#233;e.
     </td> 
    </tr> 
     <tr> 
      <td> X (Annexe type) </td> 
      <td> Le programme de l'embranchement ne permet pas au type de wagon d'&#234;tre utilis&#233;. </td> 
    </tr> 
     <tr> 
      <td> X (annexe Charge) </td> 
      <td> Le programme de l'embranchement ne permet pas l'utilisation de la charge du wagon. </td> 
    </tr> 
     <tr> 
      <td> X (annexe Ligne) </td> 
      <td> Le programme de l'embranchement ne permet pas &#224; cette ligne d'utiliser le wagon . </td> 
    </tr> 
     <tr> 
      <td> X (annexe) </td> 
      <td> Le programme de l'embranchement ne permet pas la combinaison du type de charge, et de lligne du wagon. </td> 
    </tr> 
   </table> 

 <A NAME="ModifyTrainsByCarType"> </A> 
 <H3> Modifier les trains par type de wagon </H3> 

Cet outil peut &#234;tre trouv&#233; sous Trains-> Outils. Utilisez cet outil pour 
modifier rapidement le type de wagons que votre trains utilisera. Tr&#232;s utile quand on veut
ajouter un type nouveau de wagon &#224; votre liste. 

 <P> <img src="images/ModifyTrainsByCarType.png"> </P> 


 <P> D'abord s&#233;lectionner le type de wagon que vous d&#233;sirez modifier. La fen&#234;tre
 montre alors o&#249; les trains peuvent utiliser ce type de wagon. Cochez ou d&#233;cochez 
les trains que vous voulez utiliser, et appuyez sur le bouton "Sauvegarder" pour modifier vos
 trains. Vous pouvez &#233;galement copier la fa&#231;on dont un wagon existant est utilis&#233; par vos trains 
et appliquer ces r&#232;gles &#224; un autre wagon. Pour faire qu'un type de wagon se comporte comme un 
autre, d'abord s&#233;lectionner le wagon que votre souhaitez copier, puis cochez la case
"Copie", le type de wagon appara&#238;t maintenant &#224; droite de la 
case &#224; cocher, puis s&#233;lectionnez le type de wagon que vous souhaitez modifier, puis appuyez sur
"Enregistrer" pour avoir les deux types de wagon utilis&#233;s par les m&#234;mes trains. </P> 

 <A NAME="SwitcherService"> </a> 
 <H3> Service de Man&#339;uvre </H3> 

De nombreux op&#233;rateurs attribuent une locomotive &#224; un emplacement pour faire les man&#339;uvres locales.
Utiliser la liste de man&#339;uvres de l'emplacement permet &#224; la personne affect&#233;e &#224; ce lieu 
d'utiliser tous les trains qui s'arr&#234;tent &#224; cet endroit. Toutefois,
il peut y avoir des endroits qui ne re&#231;oivent pas assez de travail suppl&#233;mentaire ou de trains locaux et il serait bon de cr&#233;er un travail suppl&#233;mentaire pour l'
op&#233;rateur affect&#233; &#224; cet endroit. Pour cr&#233;er un emploi de "charg&#233; de man&#339;uvres",cr&#233;er un
itin&#233;raire avec un seul emplacement, l'emplacement que le charg&#233; de man&#339;uvres utilisera,
et attribuer cet itin&#233;raire &#224; un train. Le "train" devient maintenant un train de man&#339;uvres
qui n'utilisera que cet emplacement. R&#233;glez le compteur "Mouvement" dans l'itin&#233;raire 
pour contr&#244;ler le nombre de wagons que le charg&#233; de man&#339;uvres utilisera.

 <P> Des op&#233;rateurs peuvent produire un manifeste de train qui ne montre que les livraisons ou les collectes
 d'un garage ou d'un &#233;change, et ensuite avoir une liste de man&#339;uvres
qui montre les mouvements entre le garage et des embranchement. Pour &#233;liminer les voies qui
apparaissent sur le manifeste du train, d&#233;cochez toutes les cases de direction
pour cette voie. Seul une "man&#339;uvre" desservira une voie qui n'a pas
toutes les bo&#238;tes de direction s&#233;lectionn&#233;es. </P> 

 <H3> Restrictions de Man&#339;uvres </H3> 

Le programme lors de la g&#233;n&#233;ration d'un manifeste pour un charg&#233; de man&#339;uvres (un train avec un seul
emplacement dans son parcours) sera par d&#233;faut de ne jamais d&#233;placez un wagon &#224; partir d'un embranchement
vers un embranchement ou d'un garage vers un autre garage, seulement d'un garage vers un embranchement ou d'un embranchement vers un garage .
Cette r&#232;gle s'applique &#233;galement aux &#233;changeurs. Cette restriction permet d'&#233;viter des
mouvements de wagon non r&#233;aliste entre les embranchements (industries). Si vous voulez un mouvement d'un embranchement vers un embranchement, utilisez un Horaire <A HREF="#Schedules"> </a> pour
forcer le mouvement du wagon. Vous pouvez &#233;galement d&#233;sactiver cette restriction voir
Options de <A HREF="#SettingsOptions"> . </a> 

 <A NAME="BuildingTrains"> </a> 
 <h2> Assemblage de Trains </h2> 

Pour asssembler un train, appuyez sur le bouton "Assemblage" dans la rang&#233;e pour le 
le train d&#233;sir&#233; dans la fen&#234;tre <A HREF="#Trains"> trains </a> . Le bouton deviendra
"Imprimer" ou "Pr&#233;visualiser" apr&#232;s que le train ait &#233;t&#233; assembler. Si vous voulez revoir la mani&#232;re dont
le train a &#233;t&#233; assembl&#233;, s&#233;lectionnez l'option "Cr&#233;er des rapports" avant d'appuyer sur le bouton
"Imprimer" ou  "Aper&#231;u" pour le train d&#233;sir&#233;. Si l'aper&#231;u "
Manifeste "est coch&#233;, le programme va g&#233;n&#233;rer le rapport d'assemblage
 et le manifeste et les pr&#233;senter dans des fen&#234;tres de pr&#233;visualisation. Si vous voulez
asssembler plusieurs trains sans avoir &#224; appuyer sur les boutons pour chaque
train, s&#233;lectionner les trains que vous voulez asssembler et appuyez sur le bouton "Assemblage"
 situ&#233; au bas de la fen&#234;tre des trains. Le programme va alors
asssembler des manifestes pour tous les trains choisis.

 <P> Si la Asssemblage d'un train &#233;choue, le bouton "D&#233;placer" va changer son texte
en "Rapport". Appuyer sur "Rapport" permet d'imprimer ou de pr&#233;visualiser le rapport d'assemblage
pour ce train. Chaque fois qu'un train ne peut pas &#234;tre assembl&#233;, un message d'&#233;chec Assemblage
appara&#238;tra. Si vous souhaitez d&#233;sactiver cette fonctionnalit&#233; d&#233;s&#233;lectionner la case
"Messages d'assemblage". </p> 
 <P> Vous pouvez &#233;galement contr&#244;ler quels trains sont affich&#233;s dans la fen&#234;tre Trains.
Lorsque la case "Tout Montrer" est d&#233;coch&#233;e, seuls les trains qui ont la case
"Assemblage" s&#233;lectionn&#233;e sont affich&#233;s. </p> 

 <A NAME="Timetable"> </a> 
 <H3> Horaires </h3> 

L'outil Horaire vous permet de d&#233;finir quels trains circuleront un
jour donn&#233;, et peut &#234;tre trouv&#233; sous Trains-> Outils. Pour chaque jour de
la semaine, s&#233;lectionnez les trains que vous voulez asssembler. S&#233;lectionnez ensuite le jour
vous souhaitez en s&#233;lectionnant le bouton radio appropri&#233;. Puis appuyez sur le
Bouton "Appliquer" pour mettre &#224; jour les trains dont la cases "Assemblage" est coch&#233;e. Utilisez le bouton "Enregistrer"
 pour enregistrer toutes les modifications apport&#233;es &#224; l'horaire.

 <A NAME="TroubleShootingBuildingTrains"> </a> 
 <H2> Probl&#232;mes de Asssemblage de Trains </h2> 

Si vous voulez examiner comment un train a &#233;t&#233; assembl&#233;, vous pouvez s&#233;lectionner la case "rapports d'assemblage" au bas de la fen&#234;tre du train, puis appuyez sur la touche "Imprimer" ou le bouton "Aper&#231;u" pour ce train. Le programme fournira alors le manifeste du train et le rapport d'assemblage pour que vous puissiez l'examiner.

    <p> 
     Quand la g&#233;n&#233;ration d'un train &#233;choue pour une raison quelconque, le bouton d'action de train devient "Rapport" qui vous permet d'acc&#233;der au rapport pour d'assemblage de ce train. Le programme enverra le rapport &#224; votre imprimante si le "Aper&#231;u" n'est pas s&#233;lectionn&#233;, ou &#224; une fen&#234;tre de pr&#233;visualisation ou un &#233;diteur de texte si le "Aper&#231;u" est s&#233;lectionn&#233;. Le rapport d'assemblage peut imprimer sur diff&#233;rents niveaux de d&#233;tail, de minimum &#224; tr&#232;s d&#233;taill&#233;e. Voir la section Param&#232;tres <a HREF="#BuildReportDetails"> Construire des options de rapport </A> pour plus d'informations sur la fa&#231;on de modifier le niveau de d&#233;tail du rapport d'assemblage n.

 <P> <img src="images/BuildReport.png"> </P> 

 <H3> Lecture du rapport de Asssemblage </h3> 

Le programme lors de l' Asssemblage d'un train cr&#233;e un rapport d'Asssemblage et l'enregistre sur
le disque. Normalement vous pouvez acc&#233;der au rapport d'assemblage depuis la fen&#234;tre <A HREF="#BuildingTrains"> Trains </A> ou depuis le menu Outils Train. Les fichiers textes peuvent &#234;tre trouv&#233;s dans le r&#233;pertoire JMRI-> op&#233;rations-> r&#233;pertoire buildstatus. Le rapport d'Asssemblage montre
les &#233;tapes du programme pendant les op&#233;rations d'Asssemblage d'un train.
La premi&#232;re page donne l'itin&#233;raire du train  et le nombre
de mouvements de wagons demand&#233; pour chaque emplacement. Le rapport montre ensuite les types de wagon
et de locomotives  et quel train sera utilis&#233;. En lisant les
divers commentaires figurant dans le rapport vous pouvez avoir une id&#233;e des &#233;tapes du
programme d'Exploitationns utilis&#233;s pour asssembler un train. Quand il y a un probl&#232;me
que l'Op&#233;ration d'Asssemblage ne peut pas r&#233;soudre, l'Asssemblage &#233;chouera. Pour
comprendre pourquoi un Asssemblage a &#233;chou&#233;, passez &#224; la derni&#232;re page du rapport d'Asssemblage
et en remontant le rapport &#224; partir de la derni&#232;re ligne, vous devriez &#234;tre en mesure de
comprendre pourquoi l'Asssemblage du train a &#233;chou&#233; .

 <H3> Plus de D&#233;tails du Rapport de Asssemblage </h3> 

Pour ceux qui veulent comprendre comment le programme construit les trains voici
les d&#233;tails. Si le train n&#233;cessite une locomotive ou plusieurs locomotives,
le programme va chercher des locomotives au d&#233;but de l'itin&#233;raire et ensuite
d&#233;termine si l'emplacement de destination les accepte. Notez que si
deux ou plusieurs locomotives sont n&#233;cessaires pour le train les locomotives
doivent &#234;tre dans un <A HREF="#LocomotivesAdd"> couplage </a> . Le programme attribue
au mat&#233;riel roulant (locomotives et wagons), le nombre de mouvements qui
qu'ils subissent lors de chaque session. Le compteur de mouvement est incr&#233;ment&#233; &#224; chaque
fois qu'un mat&#233;riel roulant est livr&#233; sur une voie d'un nouvel emplacement &#224; suivre un nouvel emplacement, ou si
le mat&#233;riel roulant a &#233;t&#233; affect&#233; &#224; un train et le train a &#233;t&#233; r&#233;initialis&#233;.
 Le programme trie le mat&#233;riel roulant, par le nombre de mouvement, puis tente d'
attribuer les locomotives et les wagons avec le moins de mouvements pour le train.
Lorsque de l'Asssemblage d'un seul train roulant &#224; des endroits qui font partie de
l'itin&#233;raire du train sont utilis&#233;s. En ce qui concerne les wagons, en plus du
nombre de mouvements connu d'un wagon, la priorit&#233; de chargement du wagon est &#233;galement
consid&#233;r&#233;e. Le programme va essayer de trouver les destinations pour les wagons avec
charges haute priorit&#233;, avant les charges de faible priorit&#233;.

 <P> L'&#233;tape suivante consiste &#224; attribuer une option fourgon de queue ou un wagon avec Fred au
train. Si le programme trouve le fourgon de queue n&#233;cessaire ou en wagon avec Fred au
d&#233;part de l'itin&#233;raire, le programme tente de trouver une voie au lieu de destination qui l'accepte
. En cas de succ&#232;s, tous les autres wagons de queue et les wagons
avec FRED sont retir&#233;s de la liste des wagons disponibles. </P> 

 <P> Ensuite le programme attribuera les wagons pour le train partant du
lieu de d&#233;part. Chaque wagon passe par le processus de trouver une voie le
long de l'itin&#233;raire qui va accepter le wagon. Un autre compteur affect&#233; &#224; une
voie est utilis&#233;e pour d&#233;terminer si la voie a &#233;t&#233; utilis&#233;e r&#233;cemment.
Les voies avec l'utilisation la plus faible sont prioritaires. Un wagon peut avoir
plusieurs choix de voies et celle avec la plus haute priorit&#233; sera
affect&#233;e en tant que destination du wagon. Le processus se poursuit jusqu'&#224; ce que le
nombre de d&#233;placements de wagon demand&#233; par un emplacement soit atteint, ou que les  
wagons disponibles trait&#233;es par le programme soient utilis&#233;s. Une fois que le wagon qui se d&#233;place
atteint l'emplacement requis, le prochain emplacement de l'itin&#233;raire est
trait&#233;. Cela continue jusqu'&#224; ce tous les lieux dans l'itin&#233;raire d'un train aient
&#233;t&#233; trait&#233;s. </p> 

 <P> En mode <A HREF="#SettingsOptions"> agressif </a> , le programme au
moment de d&#233;terminer la destinations des wagons, va faire deux passes pour
d&#233;terminer o&#249; placer les wagons. La premi&#232;re passe fait 50% des 
mouvements disponibles pour chaque emplacement, et la seconde passe le
restant. En faisant deux passes, le programme peut rendre "libre" quelques embranchements
qui ont d&#233;j&#224; les wagons, augmentant ainsi le nombre de wagons que
le train peut utiliser. Une fois qu'un wagon a &#233;t&#233; affect&#233; &#224; une destination en
mode agressif, l'espace du wagon sur la voie en cours est disponible pour d'autres
trains. </p> 

 <P> Si un wagon a une destination finale qui a &#233;t&#233; fix&#233;e par un horaire, le
programme va essayer de d&#233;placer le wagon vers cette destination, ou si ce n'est pas
possible, il va essayer de d&#233;placer le wagon le plus proche de celui de la destination finale. </p> 

Si une wagon a une charge personnalis&#233;e sans destination, le programme va rechercher un embranchement avec un horaire exigeant ce type de wagon et la charge, le programme va alors "router"  le wagon pour cette destination. Le programme va utiliser jusqu'&#224; cinq trains pour sortir la wagon vers une destination. Le programme pour d&#233;terminer combien de wagons qu'une industrie peut utiliser consid&#232;re la longueur de l'embranchement de service de l'industrie, et la longueur de la voie alternative si elle est sp&#233;cifi&#233;e. Si la wagon est au d&#233;part de la coulissel avec une charge personnalis&#233;e, le "Pourcentage des charges personnalis&#233;es g&#233;n&#233;r&#233;s par la coulisse" est utilis&#233; pour d&#233;terminer si le wagon doit &#234;tre envoy&#233; &#224; cette industrie. Voir les <a HREF="#Schedules"> horaires </A> pour plus de d&#233;tails.
 </p> 

 <P> Parfois la lecture du rapport d'Asssemblage peut &#234;tre fastidieuse. SUn &#233;diteur de texte vous permetde chercher le rapport, vous pouvez s&#233;lectionner cette option depuis  <A HREF="#BuildReportDetails"> Options Rapport D'Assemblage </A> sous Outils dans le menu de d&#233;marrage ou la fen&#234;tre Trains

 <H3> Impression Manifestes </H3> 

Apr&#232;s la Asssemblage d'un train, le bouton "Construire"  deviendra "Imprimer" ou
"Aper&#231;u" en fonction de l'&#233;tat de la case &#224; cocher appel&#233;e "Aper&#231;u
Manifestes "situ&#233;e dans le coin inf&#233;rieur droit de la fen&#234;tre de trains.
Appuyer sur la touche "Imprimer" permet d'imprimer le manifeste pour ce train.
Appuyer sur la bouton "Aper&#231;u" va produire une fen&#234;tre dans laquelle vous pouvez
examiner le manifeste. Si vous souhaitez imprimer des manifestes pour plusieurs trains,
s&#233;lectionner les trains que vous voulez dans la colonne d'Asssemblage et puis appuyez sur le bouton
"Imprimer" ou "Aper&#231;u" qui se trouve au bas de la fen&#234;tre des trains.
Le programme va alors imprimer ou pr&#233;visualiser les manifestes pour tous les trains s&#233;lectionn&#233;s. Vous pouvez modifier l'aparence de vos manifestes depuis la fen&#234;tre  <A HREF="#PrintOptions"> Options d'Impression Manifeste </A> .
 <p> Vous pouvez &#233;galement acc&#233;der &#224; un manifeste de train et construire le rapport dans le menu Outils dans la fen&#234;tre &#233;dition du train. L'option Outils du menu vous permet de r&#233;cup&#233;rer le manifeste et de construire le rapport d'un train qui a &#233;t&#233; termin&#233;. Utile si vous avez accidentellement r&#233;sili&#233; un train avant d'imprimer le manifeste du train. </P>.

 <P> <img Src="images/Manifest.png"> </p> 

 <A NAME="SwitchList"> </a> 
 <H3> Listes de Man&#339;uvres </H3> 

Une liste de man&#339;uvres montre les manoeuvres n&#233;cessaires &#224; effectuer pour tous les trains
passant &#224; cet emplacement. Normalement, une liste de man&#339;uvres est donn&#233;e &#224; la personne
responsable d'un triage ou dans un emplacement avec des embranchement nombreux ou des raccordements industriels. Vous pouvez modifier l'aparence de vos listes de man&#339;uvres depuis la fen&#234;tre <A HREF="#PrintOptions"> Options d'Impression Manifeste</a>

 <P> Appuyez sur le bouton "Imprimer la liste de Man&#339;uvres" qui se rouve au bas de la fen&#234;tre "Trains" si vous voulez une liste
de Man&#339;uvres pour un emplacement donn&#233;. Un menu appara&#238;tra qui vous permet de s&#233;lectionner les
lieux &#224; pr&#233;visualiser ou &#224; imprimer. Une fois que vous avez d&#233;termin&#233; quels endroits
vous souhaitez imprimer ou pr&#233;visualiser, appuyez sur le bouton "Sauvegarder" pour garder votre
s&#233;lections. </p> Options d'Impression Manifeste 
 <P> Le menu de la liste de Man&#339;uvres permet &#233;galement d'ajouter un commentaire &#224; la liste de Man&#339;uvres pour un emplacement et s&#233;lectionnez l'imprimante &#224; utiliser lors de l'impression de la liste de Man&#339;uvres. Notez que le programme lors de l'impression du manifeste utilise &#233;galement l'imprimante associ&#233;e &#224; l'emplacement de d&#233;part du train. </P> 

    <P> 
     Vous pouvez &#233;galement obtenir une version d&#233;mat&#233;rialis&#233;e d'une liste de  Man&#339;uvres  &#233;galement par l'activation de la fen&#234;tre de Chef de Triage appropri&#233;e pour un <A HREF="#Locations"> emplacement </a> 
   </P> 
 <P> <img Src="images/SwitchList.png"> </p> 

 <H3> Switch List Options </H3> 

Il existe trois options pour r&#233;gler les listes de manoeuvres &#224; votre go&#251;t. La premi&#232;re case d'option lorsqu'elle est s&#233;lectionn&#233;e indique au programme d'imprimer tous les trains qui passent &#224; un emplacement, m&#234;me si le train n'a pas de manoeuvre. Si vous d&#233;sactivez cette option, le programme imprime uniquement les trains qui ont des manoeuvres &#224; cet endroit.

   <P> L'option suivante quand elle est s&#233;lectionn&#233;e demande au programme d'imprimer la liste de manoeuvres d'un train sur une nouvelle page pour chaque train. De cette fa&#231;on, vos op&#233;rateurs lors de l'ach&#232;vement des manoeuvres pour un train, peuvent tout simplement jeter la paperasse pour ce train. Ce mode est &#233;galement utile si vous avez plus d'un op&#233;rateur au travail &#224; un emplacement, de cette fa&#231;on ils peuvent facilement distribuer le travail par train. </P> 

   <P> La derni&#232;re option est de savoir si vous voulez que vos listes de manoeuvres en temps r&#233;el ou en mode de consolidation. Normalement, vous devriez cr&#233;er vos listes de manoeuvres en temps r&#233;el. Dans ce mode, la liste de manoeuvres pour un emplacement montre les manoeuvres pr&#233;vues pour les trains qui sont Assembl&#233;ss et non encore termin&#233;s. </P> 

   <P> Si vous souhaitez uniquement imprimer des travaux pour les nouveaux trains, alors d&#233;sactivez l'option en temps r&#233;el. Une fois que vous avez imprim&#233; la liste de manoeuvres pour un emplacement, o&#249; la nouvelle activit&#233; est cr&#233;&#233;e par l'assemblage des trains, les anciens travaux pour les trains les plus &#226;g&#233;s sont supprim&#233;s. Notez que vous pouvez utiliser l'aper&#231;u pour voir les manoeuvrespour un emplacement, mais jusqu'&#224; ce que vous l'imprimiez, de nouvelles activit&#233;s pourront &#234;tre ajout&#233;e au travail qui est actuellement pr&#233;vu. Alors s'il vous pla&#238;t comprenez que pr&#233;visualiser et imprimer travaille diff&#233;remment en mode consolidation. </P> 
   <P> Une autre utilisation pour le mode de consolidation est de cr&#233;er de grandes listes de manoeuvrespour un emplacement en construisant et en terminant plusieurs trains . Par exemple, si vous avez un petit r&#233;seau, vous pourriez avoir &#224; construire et &#224; mettre fin &#224; bon nombre de trains afin de g&#233;n&#233;rer suffisamment de travail pour vos op&#233;rateurs .
    Si vous utilisez des listes de manoeuvresen temps r&#233;el que vous avez &#224; les imprimer avant de vous r&#233;siliez vos trains . Maintenant, si il n'ya pas beaucoup de travailler votre liste de manoeuvre va &#234;tre assez courte . En d&#233;cochant la case " en temps r&#233;el ", vous pouvez regrouper plusieurs petites listes de manoeuvres pour en faire une une plus grande. Utilisez ce mode si vous voulez &#233;conomiser du papier, sinon pas la peine, car il peut &#234;tre difficile &#224; utiliser. C'est un peu compliqu&#233;, alors voici l'ordre dans lequel faire les  choses : </P> 
   <ul> 
    <li> Appuyez sur la touche "Liste de manoeuvres" se trouve au bas de la fen&#234;tre "Trains" . </li> 
    <li> S&#233;lectionnez pour quels emplacements vous voulez des listes de manoeuvres dans la fen&#234;tre "listes de manoeuvres par emplacement " fen&#234;tre. </li> 
    <li> D&#233;cochez la case "Temps r&#233;el" et appuyez sur "Enregistrer" .
    <li> Maintenant Assembler les trains pour lesquels vous voulez des listes de manoeuvres consolid&#233;s . </li> 
    <li> Appuyez sur le bouton "&#201;changer des listes" &#224; nouveau si vous avez ferm&#233; la fen&#234;tre de liste de manoeuvres . </li> 
    <li> puis appuyez sur "Aper&#231;u Changer les listes " ou le bouton "Mise &#224; jour des listes de manoeuvres" . </li> 
    <li> Maintenant imprimer vos manifestes de train et r&#233;silier les trains que vous voulez r&#233;silier. </li> 
    <li> poursuivre l'assemblage, la mise &#224; jour des listes de manoeuvres, et terminer les trains jusqu'&#224; ce que votre soyez satisfait de la quantit&#233; de travail produite . </li> 
    <li> Enfin, imprimer vos listes de manoeuvres. </li> 
  </ul> 

   <P> L'Impression de la liste de manoeuvres pour un emplacement indique au programme que vous avez termin&#233; la consolidation de vos trains &#224; cet endroit. Le programme effacera la liste de manoeuvres lorse du prochain changement survenant &#224; cet endroit. Si il n'y a aucun changement &#224; un endroit, alors la liste de manoeuvre est une copie de la derni&#232;re impression. Cela vous permet d'imprimer plus d'une copie de la liste de manoeuvre si n&#233;cessaire. </P> 
 <P> 
    <img src="images/SwitchList.png"> 
   </P> 

  <A NAME="TrainMove"></A>
 <H3> Mouvement de Trains </H3> 

Apr&#232;s avoir fourni &#224; vos op&#233;rateurs un manifeste imprim&#233; ou
Listes de Man&#339;uvres &#224; l'emplacement, vous devez garder la base de donn&#233;es synchronis&#233;e avec le programme de
mouvement r&#233;el des trains sur votre r&#233;seau. Cela se fait par le boutons 
"D&#233;placer" train situ&#233; sur le c&#244;t&#233; droit de la fen&#234;tre <A HREF="#Trains"> Trains </a> 
. Appuyer sur la bouton "D&#233;placer" va provoquer le d&#233;part du train de son
 l'emplacement actuel vers l'emplacement suivant dans l'itin&#233;raire. Les locomotives et les
wagons affect&#233;s au train se rendront &#224; l'emplacement suivant sur la
ligne. &#224; chaque endroit, les wagons peuvent &#234;tre ramass&#233;s ou livr&#233;s. Vous
pouvez &#233;galement d&#233;placer un train en s&#233;lectionnant l'ic&#244;ne du train et en s&#233;lectionnant "D&#233;placer"
&#224; partir du menu contextuel de l'ic&#244;ne. Chaque pression sur le bouton "D&#233;placer" d&#233;place le
le train vers l'emplacement suivant en direction de la destination finale. Lorsque le train arrive au
dernier emplacement de l'itin&#233;raire, la derni&#232;re pression du bouton "D&#233;placer" 
r&#233;silie le train. Une fois qu'un train est termin&#233;e, vous pouvez l'asssembler &#224; nouveau.

 <P> Chaque fois qu'une locomotive ou qu'un wagon est d&#233;plac&#233; un compteur qui leur sont associ&#233;s
est incr&#233;ment&#233;. Le programme l'utilise pour d&#233;terminer quels wagons n'ont pas
boug&#233; r&#233;cemment et essaie de s&#233;lectionner les wagons avec le moins de mouvements
lors de l'Asssemblage de nouveaux trains. Chaque fois qu'un emplacement a un wagon
livr&#233;, le programme incr&#233;mente un compteur associ&#233; &#224; cet endroit.
Le programme tente de d&#233;placer les wagons &#224; des endroits qui ont connu le moins
d'Exploitationns de wagon. </p> .

 <P> <img src="images/Manifest.png"> </P> 

<A NAME="TerminateTrain"></A>
 <H3> Terminer Trains </H3> 

Lorsque vous terminez un train, vous demandez au programme pour d&#233;placer le train
&#224; partir de son emplacement actuel vers sa destination finale. Les wagons et les locomotives
associ&#233;s avec le train seront collect&#233;s et remis au
emplacements indiqu&#233;s dans le manifeste de train. Apr&#232;s la fin d'un train, les
locomotives et les wagons associ&#233;s &#224; ce train deviennent disponibles pour d'autres
trains. C'est pourquoi vous devez mettre fin &#224; un train uniquement apr&#232;s l'avoir fait
arriver &#224; la destination finale dans l'itin&#233;raire du train. Pour mettre fin &#224;
plusieurs trains, s&#233;lectionnez les trains auxquels vous souhaitez mettre fin dans la colonne Asssemblage
et appuyez sur le bouton "Terminer" au bas de la fen&#234;tre Trains

 <A NAME="SaveBuilds"> </A> 
 <H3> Enregistrer Asssemblages </H3> 

Appuyer sur le bouton "Enregistrer Asssemblages" provoque la mise &#224; jour des fichiers .xml de train, wagon, locmotives et emplacement par le programme. Chaque fois que vous "D&#233;placer" un train
le programme de'Exploitation apportera des modifications aux bases de donn&#233;es train, wagon, locomotive, et
 emplacement. Ces bases de donn&#233;es doivent &#234;tre sauvegard&#233;es avant d'arr&#234;ter
JMRI, sinon vous allez perdre toutes les modifications que le programme  Exploitation
aura fait pour d&#233;placer un train &#224; l'emplacement suivant. En appuyant sur le bouton "Enregistrer Asssemblages"
 avant de quitter JMRI permet au programme d'Exploitation de reprendre exactement au point o&#249; vous &#233;tiez quand vous avez appuy&#233; sur le  bouton "Enregistrer Asssemblages".

 <A NAME="BuildingMultipleTrainsSession"> </A> 
 <H2> Asssemblages de Multiple Trains pour une Session </H2> 

La plupart des s&#233;ances d'exploitation n&#233;cessitent plus d'un train pour garder vos
op&#233;rateurs occup&#233;s. La mani&#232;re correcte de le faire est d'asssembler et d'imprimer l'ensemble des
 trains n&#233;cessaires avant de les terminer. Donc, si vous avez besoin d'une douzaine de trains
pour une session, vous devez asssembler douze trains avant de  mettre fin &#224; un
train.La fin d'une formation indique au programme que les locomotives et les wagons
dans ce train particulier, ont &#233;t&#233; livr&#233;s &#224; leur emplacement final
et peuvent &#234;tre utilis&#233;s &#224; nouveau lors de l'Asssemblage de nouveaux trains. Il faut donc toujours tout asssembler ,
tout imprimer, PUIS r&#233;silier chaque train apr&#232;s avoir termin&#233; sa course! Il est
ok pour asssembler tous les trains, d'imprimer tous les trains, puis utilisez la fonction "Enregistrer Asssemblage"
"et arr&#234;ter le programme. Plus tard, vous pouvez red&#233;marrer le
programme et r&#233;silier les trains qui ont termin&#233; leurs courses.

 <p> Le bon moment pour mettre fin &#224; un train est quand le train 
arrive &#224; sa destination. Terminer un train avant qu'il compl&#232;te son parcours
 signifie que la base de donn&#233;es estime que les locomotives et les wagons
ont &#233;t&#233; livr&#233;s. Il est pr&#233;f&#233;rable d'asssembler et d'imprimer douze trains et
puis plus tard apprendre que seulement neuf trains ont termin&#233; leur ex&#233;cution. Vous
aurez alors &#224; r&#233;silier neuf trains, et laisser les trois autres pour la prochaine session
. Ou si vous le souhaitez vous pouvez r&#233;initialiser tous les trains qui ne s'&#233;carte pas de
leur terminal. La r&#233;initialisation des trains n'est pas vraiment n&#233;cessaire, les trains qui
ne pas circulent pas durant cette session pourraientt circuler au cours de la prochaine session. </P> 
 <p> Une autre m&#233;thode consiste &#224; asssembler, imprimer et utiliser le bouton "D&#233;placer"
pour chaque train pour suivre le mouvement r&#233;el des trains au cours de votre
session. Aussi longtemps que les trains sur le r&#233;seau correspondent &#224; l'emplacement dans le
programme vous pouvez asssembler un nouveau train. </P> 
 
 <A NAME="OperationWindows"> </A> 
 <H2> Fonctionnement des Fen&#234;tres </H2> 

Toutes les fen&#234;tres Exploitations peuvent &#234;tre redimensionn&#233;es et plac&#233;es &#224; votre convenance.
Lorsque vous fermez la fen&#234;tre, la taille et l'emplacement des fen&#234;tres sur votre &#233;cran
sont enregistr&#233;s.

 <P> Le programme vous permet &#233;galement de redimensionner les wagons, locomotives, trains
et l'horaire, les largeurs de colonne du tableau. Ajuster la largeur des colonnes &#224; votre
go&#251;t et appuyez ensuite sur la fen&#234;tre "Enregistrer" ou "Enregistrer Asssemblages" pour enregistrer vos
pr&#233;f&#233;rences. </P> 

 <P> La fin de l'aide Exploitation. </P> </DIV> 
 <!-- closes #mainContent--> </DIV> 
 <!-- closes #mBody--> 
 </BODY> 
 </HTML> 


 <!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01//EN" "http://www.w3.org/TR/html4/strict.dtd"> 
 <!-- $Id$ --> 
 <!-- Translated  by Blorec Herv&#233; le 2011-11-24--> 
 <HTML LANG="fr"> 
 <HEAD> 
 <TITLE> Operations </TITLE> 
 <META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=utf-8"> 
 <META CONTENT="Dan Boudreau" NAME="Author"> 
 <META NAME="keywords" CONTENT="JMRI Help Operations Setup Settings Cars Engines Locomotives Trains itin&#233;raires Locations Schedules"> 

 <!-- Style --> 
 <META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=utf-8"> 
 <LINK REL="stylesheet" TYPE="text/css" HREF="/css/default.css"
	MEDIA="screen"> 
 <LINK REL="stylesheet" TYPE="text/css" HREF="/css/print.css"
	MEDIA="print"> 
 <LINK REL="icon" HREF="/images/jmri.ico" TYPE="image/png"> 
