# SignallingBundle_fr.properties
#
# French properties for the jmri.jmrit.signalling
# Updated by BLOREC Herv\u00e9 <bzh56420@yahoo.fr> 2016-06-07

SignallingPairs = Paires de Signalisation
UpdateLogicButton = Mise \u00e0 jour Logique Signal
UpdateButtonToolTip = Changer cette Logique de M\u00e0t et quitter le mode \u009dition
ApplyButtonToolTip = Change this Signal Mast Logic and leave Edit mode
AddLogic = Ajouter une Logique Signal
UseLayoutEditorPaths = utiliser les Chemins de l'\u00c9diteur de R\u00e9seau
UseTurnoutDetails = Utiliser les d\u00e9tails des Aiguillages depuis l'\u00c9diteur de R\u00e9seau
UseBlockDetails = Utiliser les d\u00e9tails du Canton depuis l'\u00c9diteur de R\u00e9seau
AllowAutomaticSignalMast = Autoriser la logique \u00e0 d\u00e9terminer automatiquement les conflits de M\u00e2ts de Signalisation
LockTurnouts = Verrouiller Aiguillages quand la Logique M\u00e2t de Signalisation est active
PathSpeed = Vitesse pour le chemin
NoneSet = Non D\u00e9fini

ErrorUnReachableDestination = Le M\u00e2t de destination n'est pas directement accessible depuis le M\u00e2t origine
WarningUnableToValidate = Il n'a pas \u00e9t\u00e9 possible de valider le chemin entre les deux M\u00e2ts de Signalisation

EnableLayoutBlockRouting = Le Dispositif de routage de Canton du R\u00e9seau n'est pas activ\u00e9.\nVoulez-vous l'activer?
LayoutBlockRoutingEnabled = Le dispositif de routage de Canton du R\u00e9seau a \u00e9t\u00e9 activ\u00e9.\nVeuillez fermer et r\u00e9ouvrir cette fen\u00eatre pour que les modifications prennent effet.
LayoutBlockRoutingEnabledShort = Le dispositif de Routage des Cantons du R\u00e9seau  a \u00e9t\u00e9 activ\u00e9.
SignalMastCriteriaOwn = L'\u00e9tat du M\u00e2t de Signalisation devant \u00eatre v\u00e9rifi\u00e9 par rapport  "{0}" est soit cette source de logiques ou M\u00e2t de destination.\nCeci peut entrainer un fonctionnement incorrect de cette logique.\n\u00eates-vous s\u00fbr de vouloir voulez l'utiliser?
SignalMastCriteriaOwnTitle = Erreur M\u00e2t de Signalisationl
ErrorSignalMastIdentical = Destination Signal Mast should differ from Source Mast.\nSelect and configure a different Destination Mast.
WarningExistingPair = The Destination Mast was already defined with this Source Mast.\nDo you want to overwrite its former definition?
DiscoverMastsTitle = Discover Signal Mast Pairs
DiscoveringMasts = Discovering Signal Masts
GenComplete = Generation of Signalling Pairs Completed
GenSkipped = Cannot search for Pairs as there are\nno Layout Editor panels available.

UnOccupied = Inoccup\u00e9
Occupied= Occup\u00e9
AnyState = Tout \u00e9tat

ColumnPermissive = Permissive
ColumnAspect = Aspect

ButtonDiscover = Trouver

LabelSelectChecked = <html>Select {0}<br>to be checked:</html>
LabelAutogenerated = <html>These {0} are<br>auto generated<br>and can't be<br>changed:</html>
SourceMast = M\u00e0t Origine
DestMast =  M\u00e0t Destination

LeaveButton = Quitter
RemoveButton = Annuler
UpdateLogicTitle = Mise \u00e0 Jour Logique
RemoveLogicTitle = Annuler Logique
SwapLogic = Le M\u00e2t de Signalisation {0} et {1}\n ont \u00e9t\u00e9 perrmut\u00e9s \ndVoulez-vous mettre \u00e0 jour toutes les logiques pour refl\u00e9ter ceci?
RemoveLogic =  Le M\u00e2t de Signalisation {0} a \u00e9t\u00e9 enlev\u00e9,\n voulez-vous enlever la logique associ\u00e9e?
RemoveAlreadyAssignedLogic = Le M\u00e2t de Signalisation {0} est d\u00e9j\u00e0 affect\u00e9 avec les logiques \n voulez-vous enlever la logique associ\u00e9e?
UpdateLogic = Le M\u00e2t de Signalisation {0} a \u00e9t\u00e9 remplac\u00e9 par {1}\n Voulez-vous mettre \u00e0 jour toutes les logiques pour refl\u00e9ter ceci?
