 SignallingBundle_fr.properties
#
# Revision $Revision$
#
# French properties for the jmri.jmrit.signalling GUI elements

# Updated by BLOREC Herv\u00e9 <bzh56420@yahoo.fr> 2019-01-18

SignallingPairs = Paires de Signalisation
UpdateLogic = Mise à jour Logique Signal
UpdateButtonToolTip = Changer cette Logique de M\u00e0t et quitter le mode \u009dition
ApplyButtonToolTip = Modifier la logique de ce mât et quitter le mode Édition
AddLogic = Ajouter une Logique Signal
UseLayoutEditorPaths = utiliser les Chemins de l'\u00c9diteur de R\u00e9seau
UseTurnoutDetails = Utiliser les d\u00e9tails des Aiguillages depuis l'\u00c9diteur de R\u00e9seau
UseBlockDetails = Utiliser les d\u00e9tails du Canton depuis l'\u00c9diteur de R\u00e9seau
AllowAutomaticSignalMast = Autoriser la logique \u00e0 d\u00e9terminer automatiquement les conflits de M\u00e2ts de Signalisation
LockTurnouts = Verrouiller Aiguillages quand la Logique M\u00e2t de Signalisation est active
PathSpeed = Vitesse pour le chemin
NoneSet = Non Défini

ErrorUnReachableDestination = Le M\u00e2t de destination n'est pas directement accessible depuis le M\u00e2t origine
WarningUnabletoValidate = Il n'a pas \u00e9t\u00e9 possible de valider le chemin entre les deux M\u00e2ts de Signalisation

EnableLayoutBlockRouting = Le Dispositif de routage de Canton du R\u00e9seau n'est pas activ\u00e9.\nVoulez-vous l'activer?
LayoutBlockRoutingEnabled = Le dispositif de routage de Canton du R\u00e9seau a \u00e9t\u00e9 activ\u00e9.\nVeuillez fermer et r\u00e9ouvrir cette fen\u00eatre pour que les modifications prennent effet.
LayoutBlockRoutingEnabledShort = Le dispositif de Routage des Cantons du R\u00e9seau  a \u00e9t\u00e9 activ\u00e9.
SignalMastCriteriaOwn = L'\u00e9tat du M\u00e2t de Signalisation devant \u00eatre v\u00e9rifi\u00e9 par rapport  "{0}" est soit cette source de logiques ou M\u00e2t de destination.\nCeci peut entrainer un fonctionnement incorrect de cette logique.\n\u00eates-vous s\u00fbr de vouloir voulez l'utiliser?
SignalMastCriteriaOwnTitle = Erreur M\u00e2t de Signalisationl
ErrorSignalMastIdentical = Le Mât de Destination doit être différent du Mât Source.\nSélectionnez et configurez un Mât de Destination différent.
WarningExistingPair = Le Mât de Destination a déjà été défini avec ceMât Source.\NVoulez-vous écraser sa définition précédente?
DiscoverMastsTitle = Découvrez les Paires de Mâts de Signaux
DiscoveringMasts = Découverte des Mâts de Signaux
GenComplete = Génération de Paires de Signalisation Terminée
GenSkipped = Impossible de rechercher des Paires car il n'y a pas\N de Panneaux disponibles dans l'Éditeur de Réseau

UnOccupied = Inoccup\u00e9
Occupied= Occup\u00e9
AnyState = Tout \u00e9tat

ColumnState = \u00c9tat
ColumnSpeed = Vitesse
ColumnPermissive = Permissive
ColumnAspect = Aspect

ButtonDiscover = Trouver
ButtonAdd = Ajt Logique

# Properties for jmri.jmrit.signalling NX elements
# Original file:  EntryExitBundle_fr.properties

SelectPanel = S\u00e9lectionnez le Panneau

FromLocation = Point d'Entr\u00e9e
ToLocation = Point de Sortie
AddPair = Ajoutez une Paire
AddEntryExitPoints = Ajouter des Points d'Entrée et de Sortie
AutoGenerate = G\u00e9n\u00e9ration Automatique des Paires Entr\u00e9e Sortie
AutoGenEntryExitTitle =  G\u00e9n\u00e9ration Automatique des Paires Entr\u00e9e Sortie
AutoGenEntryExitMessage = Voulez-vous g\u00e9n\u00e9rerautomatiquement \nles Paires d'Entr\u00e9e Sortie et la Logique bas\u00e9e \nsur le plan de voiedans l'\u00e9diteur de r\u00e9seau?

SettingDuration = Dur\u00e9e de la mise en couleur (ms)
ValueBeNumber = La dur\u00e9e de la mise en couleur doit \u00eatre un nombre!
RouteSetColour = Couleur initiale du chemin tandis que l'itin\u00e9raire est install\u00e9
OptionsTitle = Options Entr\u00e9e Sortie
Reselection = Option Nouvelle s\u00e9lection Itin\u00e9raire 
ReselectionTip = Définit l'action pour quand les boutons NX(Entrée/Sortie) sont resélectionnés

EndBumperPoint = L'empacement de destination est un Heurtoir, il n'est pas possible de faire les "Deux Chemins NX" \u00e0 cet endroit

SetTurnoutsOnly = Définir les Aiguillages Seulement
SetTurnoutsAndSignalMasts = Définir les Aiguillages et les Mâts de Signaux
FullInterlock = Verrouillage Complet
NXType = Type E/S
DiscoverEntryExitPairs = Découvrir les Paires de E/S
DiscoveringEntryExitPairs = Découverte des Paires de E/S ...
AutoGenComplete = La génération des Paires E/S est terminée


LabelSelectChecked = <html> Sélectionnez {0} <br> à vérifier: </html>
LabelAutogenerated = <html> Ces {0} sont générés <br> automatiquement et ne peuvent pas être modifiés: </html>

BothWayTurnoutOnly = Les Op\u00e9ration Bidirectionnelles ne peuvent pas \u00eatre utilis\u00e9es si un Signal est pr\u00e9sent \u00e0 la fois aux points d'Entr\u00e9e et de Sortie

ColumnFrom = Entr\u00e9e
ColumnTo = Sortie
ColumnBoth = Les Deux Sens
DispatcherInt = Int\u00e9grer avec le Dispatcheur
WindowTitleStackRoutes = Itin\u00e9raires Superpos\u00e9s

PromptUser = Invite Utilisateut
ClearRoute = Effacer l'Itinéraire
CancelRoute = Annuler l'Itinéraire
StackRoute = Pile d'Itinéraire


# colors use jmrit.Bundle

# Properties for jmri.jmrit.signalling GUI Tools elements
# Original file:  None

LeaveButton = QuitterSupprimerRemove
UpdateLogicTitle = Mise à Jour Logique
RemoveLogicTitle = Supprimer la Logique
SwapLogic = Les Mâts {0} et {1}\n ont été échangés.\nVoulez-vous mettre à jour toutes les logiques pour refléter cela?
RemoveLogic = Le Mât {0} a été supprimé.\nVoulez-vous supprimer la logique qui lui est associée?
RemoveAlreadyAssignedLogic = Mât {0} est déjà affecté dans la logique.\nVoulez-vous supprimer la logique qui lui est associée?
UpdateLogic = Mât {0} a été remplacé par {1}.\NVoulez-vous mettre à jour toutes les logiques en conséquence?
