<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//FR
"http://www.w3.org/TR/html4/loose.dtd">
<html lang="fr">
< head>
  <meta name="generator" content=
  "HTML Tidy for Mac OS X" (vers 31 octobre 2006 - Apple Inc. build 15.17), voir www.w3.org">

  <titre>Support mat&#233;riel IRMJ - R&#233;seau CAN</titre>
  <!-- Style -->
  <meta http-equiv="Content-Type" content=
  "text/html ; charset=utf-8">
  <link rel="stylesheet" type="text/css" href="/css/default.css"
  media="screen">
  <link rel="stylesheet" type="text/css" href="/css/print.css"
  media="print">
  <link rel="icon" href="/images/jmri.ico" type="image/png">
  <link rel="home" title="Home" href="/">
  <!-- /Style -->
</head>

<body>
  <!--#include virtual="/Header.shtml" -->
  <div id="mBody">
      <!--#include virtual="Sidebar.shtml" -->
    <div id="mainContent">

      <h1>Assistance mat&#233;riel : CAN : R&#233;seaux de Contr&#244;leurs de Zone</h1>

      <ul class="snav">
        <!-- TOC -->

        <li><a href="#hardware">Mat&#233;riel</a></li>

        <li><a href="#connect">Connexion</a><</li>

        <li><a href="#tools">Outils CAN JMRI</a></li>

        <li><a href="#documentation">Documentation</a></li>
      </ul>

      <p>Une nouvelle tendance se dessine pour le d&#233;veloppement des syst&#232;mes de commande du mod&#233;lisme ferroviaire
       bas&#233;s sur des normes 
      <a href="https://en.wikipedia.org/wiki/CAN_bus">CAN</a>
      technologie. JMRI fournit une assistance pour le d&#233;veloppement et l'utilisation
      de ceux-ci. Deux syst&#232;mes sont d&#233;crits ci-dessous.</p>

      <h2>Mise en &#156;uvre de CAN</h2>

      <h3><a href="../openlcb/index.shtml">OpenLCB</a></h3>
      <img src=
      "http://www.openlcb.org/trunk/web/logo-ajs-dph.png" align=
      "right" alt="Logo OpenLCB" height="43" width="104">
      <p>OpenLCB est un groupe d'amateurs et de fabricants qui se sont
      r&#233;uni pour produire un bus de contr&#244;le de r&#233;seau orient&#233; vers l'avenir
      , &#233;galement appel&#233; <a href=
      "http://openlcb.org">OpenLCB</a>.<br>
      JMRI inclut <a href="../openlcb/index.shtml">support de base
      pour OpenLCB</a>, et d'autres sont en cours de d&#233;veloppement en m&#234;me temps que
      OpenLCB lui-m&#234;me.</p>
      <img src=
      "http://www.nmra.org/common/nmra_logo.jpg" align="right" alt=
      "Logo de l'ARNM" height="45" width="55">

      <p>Le <a href="http://www.nmra.org">NMRA</a> has <a href=
      "http://www.nmra.org/news/proposed-standard-layout-command-control-lcc-published-comments#">
      a d&#233;cid&#233;</a> d'adopter OpenLCB et de le normaliser en tant que <a href=
      "http://www.nmra.org/index-nmra-standards-and-recommended-practices#node-171">
      Contr&#244;le et Commande du R&#233;seau (LCC, anciennement
      NMRAnet)</a>.</p>

      <h3><a href="cbus/index.shtml">CBUS MERG</a><</h3>

        <img src="http://mergcbus.sourceforge.net/cbus.png" align=
      "right" alt="MERG CBUS logo" height="45" width="90">
      
        <img src=
      "https://www.merg.org.uk/merg_images/merg_logo.png" align=
      "right" alt="MERG logo" height="50" width="106">

      <p>
      Le CBUS MERG est un projet "open source" ou de domaine public h&#233;berg&#233; par le
      Groupe de travail sur le mod&#232;le de chemin de fer &#233;lectronique (<a href=
      "https://www.merg.org.uk/">MERG</a>), apr&#232;s des ann&#233;es de 
      d&#233;veloppement par les membres du MERG Mike Bolton et Gil Fuchs.
      <br >
      Leur intention &#233;tait de d&#233;velopper un syst&#232;me de 
      contr&#244;le du r&#233;seau bas&#233; sur un bus de contr&#244;le du r&#233;seau (LCB) &#224; usage g&#233;n&#233;ral.
      </p>

      
      <p>Ils ont adopt&#233; le sch&#233;ma Gridconnect mais avec une l&#233;g&#232;re modification. 
      <br>L'en-t&#234;te est toujours en octets HEX et correspond directement aux registres CAN du PIC, justifi&#233;s &#224; gauche.</p>
      
      <p>
      JMRI <a href="cbus/index.shtml">MERG CBUS</a> Une assistance est disponible pour relier JMRI avec CBUS MERG.
      <br>De nombreux d&#233;tails sur le protocole CBUS du MERG sont &#224; la disposition des d&#233;veloppeurs, voir le <a href="cbus/index.shtml#thirdparty">Wiki CBUS du MERG</a>.
      
      <p>Il existe de nombreux kits de modules MERG disponibles pour aider &#224; faire fonctionner un r&#233;seau.
      <br>
      Les modules peuvent &#234;tre consid&#233;r&#233;s comme
      </p>
      
      <ul>
      <li>Consommateurs, par exemple un module sol&#233;noïde CANSOL &#224; l'&#233;coute sur le CANBUS pour 
      un action enseign&#233; pour devier un aiguillage </li>
      <li>Producteurs, par exemple un module de d&#233;tection CANACE3 Control Panel Switch,
      envoi d'un action lorsqu'un bouton du panneau de contr&#244;le physique 
      ou un interrupteur &#224; bascule est chang&#233; ( le multiplexage permet 128 bouton 
      sur 1 module)</li>
      <li>Ou les deux, par exemple un module d'&#233;coute CANMIO Servo  
      pour modifier les positions de l'aiguillage, puis envoyer ses propres 
      actions sur le servo qui commencent &#224; se d&#233;placer, le servo est &#224; mi-chemin, envoyant &#233;galement une 
      action lors de l'ach&#232;vement du d&#233;placement du servo vers sa position finale.</li>
      </ul>      

      <p>
      Les 3 000 membres du MERG sont encourag&#233;s &#224; construire et &#224; concevoir leur propres modules
      et avec le MERG qui a plus de 50 ans, le CBUS MERG est soumis &#224; un processus d'&#233;valuation tr&#232;s rigoureux.
      <br>
      Les mises &#224; jour du micrologiciel des modules peuvent &#234;tre effectu&#233;es via le r&#233;seau CBUS du MERG 
      </p>

      
 <p>JMRI comprend un assistance pour
      <a href="cbus/index.shtml#cbusevents">actions CBUS MERG</a>, aussi <a 
      href="cbus/index.shtml#dcc">DCC 
      sur MERG CBUS</a> via un kit CANCMD 
      (une centrale DCC compl&#232;te, un mini booster et
      programmeur de voie). Il s'interface avec lJMRI et/ou 
      des contr&#244;leurs portables MERG sur un r&#233;seau CBUS MERG.
      </p>
      
      <p>Les actions CBUS MERG sont envoy&#233;es de un &#224; plusieurs, ce qui permet &#224; plusieurs modules d'&#233;couter et de changer de statut sur un seul action. eg.</p>
      <ul>
        <li>Action envoy&#233;e par un aiguillage ( UK - pointe ), envoyant un "&#233;v&#232;nement off" lorsque l'aiguille est d&#233;vi&#233;e, un "&#233;v&#232;nement on" lorsqu'elle est directe.</li>
        <li>Cette action est reçue par un module de relais, qui change la polarit&#233; du c&#156;eur d'aiguille.</li>
        <li>Action &#233;galement reçue par un module LED, changeant les LED sur un panneau optique repr&#233;sentant la position de l'aiguille.</li>
        <li>Action &#233;galement reçue par JMRI pour &#234;tre utilis&#233;e dans Panneau du r&#233;seau.</li>
      </ul>

      <p>JMRI peut envoyer et recevoir des actions pour tout n&#156;ud de module et tout action de module.</p>

      <h2><a name="hardware" id="hardware">Mat&#233;riel pris en charge</a></h2>
      <h3>Interfaces informatiques</h3>

      <h4>Plusieurs adaptateurs CAN-USB sont disponibles:</h4>

      <dl>
       

        <dt>grid connect</dt>

        <dd><a href=
        "https://gridconnect.com/pcan/can-adapters.html">GridConnect</a> </dd>

        <dt>lawicell</dt>

        <dd><a href="http://canusb.com/">LAWICEL AB</a> CANUSB et
        Adaptateurs CAN232.</dd>
        
        <dt>MERG CANUSB4</dt>
        
        <dd><a href="https://www.merg.org.uk/kits.php">MERG CANUSB4</a>
        Une interface CBUS MERG vers USB, disponible sous forme de kit pour les membres du MERG.
        
      </dl>
      
      <h4>Autres interfaces mat&#233;rielles CAN</h4>
      
            <dl>
            <dt>Rocrail </dt>
            <dd> Le <a href="https://wiki.rocrail.net/doku.php?id=can-gca1e-en">
            Module Ethernet CAN-GC1e</a>
            peut se connecter au JMRI via l'interface r&#233;seau du MERG</dd>
            </dl>
      
            <dl>
            <dt>MERG CANPiCap</dt>        
            <dd>Le <a href="https://www.merg.org.uk/kits.php">CANPICAP</a>
            permet la connexion directe du CBUS MERG &#224; un Raspberry Pi via son 
            Connecteur E/S 40 broches, disponible sous forme de kit pour les membres du MERG.</dd>
            </dl>
            
            <dl>
            <dt>MERG CANPiWi/CANPiZero</dt>
            <dd>Le <a href="https://www.merg.org.uk/kits.php">CANPiWi</a> est bas&#233;
            sur le Raspberry Pi Zero W, et est une interface
            entre Engine Driver/WiThrottle et CBUS MERG.</dd>
            </dl>

      <h2><a name="connect" id="connect">Connexion</a><</h2>

      <p>JMRI peut fournir les fonctions habituelles de capteur et d'aiguillage,
      une fois configur&#233; pour <a href=
      "../openlcb/index.shtml">OpenLCB</a> ou <a href=
      "cbus/index.shtml">CBUS</a> "Actions".</p>
      
      <p>Exemple de d&#233;nomination de syst&#232;me : </p>
      
      <table border="1">
      <tr>
      <th></th>
      <th>Capteur</th>
      <th>Aiguillage </th>
      <th>Lumi&#232;re</th>
      </tr>
      <tr>
      <td>OpenLCB</td>
      <td></td>
      <td></td>
      <td></td>
      </tr>
      <tr>
      <td>CBUS MERG</td>
      <td><code>MS18</code>
      <br>( Action 18 Actif/Inactif )</td>
      <td><code>MT+N2E18;-N2E18</code>
      <br> ( N&#156;ud 2 Action 18 d&#233;vi&#233;e/directe )</td>
      <td><code>ML18</code>
      <br> ( Action 18 On/Off )</td>
      </tr>
      </table>

      <p>JMRI peut se connecter aux r&#233;seaux CAN de plusieurs façons:</p>

      <h3>Via USB</h3>

      <p>Pour utiliser l'un des adaptateurs ci-dessus, s&#233;lectionnez le
      type de dispositif/connexion dans les pr&#233;f&#233;rences JMRI. 
      
      Si vous utilisez un
      GridConnect ou Lawicel, assurez-vous de r&#233;gler la vitesse en baud sous Pr&#233;f&#233;rences avanc&#233;es.<br>
      
      </p>
      
      <p>
      Pour <a href="cbus/Details.shtml#c1">connecter &#224; un CANUSB4</a>, s&#233;lectionner "MERG" comme fabricant du syst&#232;me,
      puis "CAN via MERG CAN-RS ou CAN-USB" comme connexion au syst&#232;me.
      </p>

      <h3>R&#233;seau TCP/IP</h3>

      <p>Il est &#233;galement possible de s'attacher via une connexion TCP/IP
      (EtherNet ou WiFi). Cela peut soit aller &#224; une autre JMRI
      qui fonctionne par exemple sur un hub OpenLCB, directement vers une
      Un adaptateur IP-CAN ou un serveur CAN. Pour configurer l'un d'entre eux, ouvrez le
      Onglet Connexions dans les pr&#233;f&#233;rences JMRI.</p>
      
     <h4>OpenLCB</h4>

      <ul>
        <li>S&#233;lectionner comme fabricant du syst&#232;me "OpenLCB"</li>

        <li>Pour la connexion au syst&#232;me, s&#233;lectionnez "CAN via Interface r&#233;seau GridConnect"</li>


 <li>Dans les param&#232;tres, entrez l'adresse IP et le port TCP/UDP
        pour la destination.
          <p>Les adaptateurs CAN OpenLCB s'annoncent sous mDNS/Bonjour, donc
          vous pouvez l'utiliser pour sp&#233;cifier l'adresse IP si JMRI est sur
          le m&#234;me segment de r&#233;seau que votre adaptateur. Dans ce cas,
          mettre "openlcbcan.local". (notez la p&#233;riode de suivi !) dans champ d'adresse l'IP
         .</p>
          <p>Le num&#233;ro de port pour les adaptateurs OpenLCB est 23 par
          d&#233;fault.</p>
        </li>

        <li>R&#233;glez le protocole de connexion comme vous le souhaitez, par exemple "OpenLCB",
        le pr&#233;fixe de connexion (g&#233;n&#233;ralement "M") et le nom de la connexion comme
        n&#233;cessaire.</li>
        <li>Cliquez sur Sauvegarder, et red&#233;marrez.</li>
      </ul>
      
     <h4>CBUS MERG</h4> 
      <ul>
      <li>S&#233;lectionner comme fabricant du syst&#232;me MERG.</li>
      <li>Pour la connexion au syst&#232;me, s&#233;lectionnez CAN via l'interface r&#233;seau du MERG</li>
      <li>Dans les param&#232;tres, entrez l'adresse IP ou le nom d'h&#244;te de l'appareil avec
      la connexion physique &#224; votre r&#233;seau CBUS  MERG, par exemple "192.168.0.5" ou "localhost".
      <br>Le CANPi a un IP par d&#233;faut de 192.168.45.1 .
      </li>
      <li>Le port TCP est le 5550 ( TCP 5550 est r&#233;serv&#233; &#224; l'utilisation du CBUS MERG CBUS par l'IANA ).</li>
      <li>Protocole de connexion -CBUS MERG</li>
      <li>Le pr&#233;fixe de connexion est normalement "M" pour CBUS MERG.</li>
      <li>Cliquez sur Sauvegarder, et red&#233;marrez.</li>
      </ul>
      
      <p>
        <a href="cbus/index.shtml#thirdparty">Serveur CBUS MERG</a> est
        a <a href="https://nodejs.org/en/">Node.js</a> 
        sous licence du MIT pour permettre de multiples connexions r&#233;seau &#224; un CANUSB4 MERG .
        </p>

      <h2><a name="tools" id="tools">Outils CAN JMRI</a><</h2>
      <ul>
        <li>JMRI fournit un outil<a href= "../../../package/jmri/jmrix/AbstractMonFrame.shtml">Moniteur basique
        </a> pour surveiller le trafic sur un bus CAN.</li>
        
        <li>Pour le d&#233;veloppement, il y a <a href=
        "scripting.shtml">outil script CAN </a> pour l'envoi et la
        la r&#233;ception de trames CAN. Celles-ci peuvent &#234;tre tr&#232;s utiles pour tester
        le mat&#233;riel, etc.</li>

        <li>OpenLCB
        <a href="../../../package/jmri/jmrix/openlcb/swing/send/OpenLcbCanSendFrame.shtml">
        Outil "Envoyer une trame"</a> L'outil "Envoyer une trame OpenLCB" vous permet d'envoyer directement des trames 
        CAN, et certains types de messages OpenLCB, par exemple "V&#233;rifier N&#156;ud" et 
        "Envoyer la demande aux consommateurs"
        </li>
        
        
        <li><img src=
      "images/MERG_Menu.png" alt="MERG menu" align="right"
      height="134" width="188">Le menu du MERG contient 5 outils :
        <ul>
        <li>Console</li>
        <li>Envoyer la trame</li>
        <li>Outil de Capture d'Action</li>
        <li>Tableau des Actions</li>
        <li>Outil de Configuration des N&#156;uds</li>
        </ul>
        </li>
        
        <li>MERG CBUS <a href=
        "../../../package/jmri/jmrix/can/swing/send/CanSendFrame.shtml">
        L'outil Envoyer Trame </a> peut &#234;tre utilis&#233; pour envoyer des actions CAN &#224; la fois manuellement et de mani&#232;re r&#233;p&#233;t&#233;e, 
        ce qui est id&#233;al pour les tests.
        
      </ul>
      
      <a name="documentation" id="documentation"></a>

      <h2>Documentation</h2>

      <h3>Aide JMRI</h3>

      <p><a href="../openlcb/index.shtml">OpenLCB</a> Aide</p>

      <p><a href="cbus/index.shtml">CBUS MERG/a> Assistance</p>
      
      <p><a href="scripting.shtml">Script JMRI</a> pour les trames CAN.</p>
      
      
      <h3>Information sur les tiers</h3>

      <p><a href="http://www.openlcb.org">OpenLCB.org</a><</p>
      <p><a href="https://www.merg.org.uk">merg.org.uk</a><</p>
      <p><a href="https://en.wikipedia.org/wiki/CAN_bus">wikipedia.org/wiki/CAN_bus</a><</p>
      
      <!--#include virtual="/Footer.shtml" -->
    </div><!-- closes #mainContent-->
  </div><!-- closes #mBody-->
</body>
</html>
