# BeanEditBundle_cs.properties
#
# Czech properties for the jmri.jmrit.beantable.beanedit GUI elements
# Translation: Petr Sidlo

Properties = Vlastnosti

Basic = Z\u00e1kladn\u00ed
Usage = Pou\u017eit\u00ed
UsageText = Poskytuje \u00fadaje o tom kde je {0} pou\u017eito ve va\u0161em panelu.

NamedBeanPropertiesTableDescription = P\u0159izp\u016fsoben\u00ed t\u011bchto vlastnost\u00ed (pro odstran\u011bn\u00ed z\u00e1znamu vyma\u017ete n\u00e1zev) (pokud nev\u00edte co d\u011bl\u00e1te tak NED\u011aLEJTE \u017d\u00c1DN\u00c9 ZM\u011aNY)
NamedBeanPropertyName = N\u00e1zev
NamedBeanPropertyValue = Hodnota

BlockPhysicalProperties = Re\u00e1ln\u00e9 podrobnosti
BlockUseCurrentText = Pou\u017eijte aktu\u00e1ln\u00ed zpr\u00e1vu z Reporter jako hodnotu pro blok
BlockReporterText = Nastavte Reporter pro rozpozn\u00e1n\u00ed vlaku v bloku
BlockPropertiesText = Pou\u017eijte tuto kartu pro aktualizaci re\u00e1ln\u00fdch informac\u00ed o bloku
BlockLengthUnits = Jednotky
BlockLengthUnitsText = Vyberte d\u00e9lkov\u00e9 jednotky
BlockLengthText = D\u00e9lka bloku
BlockMaxSpeedText = Nastavte maxim\u00e1ln\u00ed rychlost v bloku
BlockPermissiveText = M\u016f\u017ee jin\u00fd vlak vjet do bloku kdy\u017e ten je obsazen\u00fd

BlockAssignSensorText = Nastavte sn\u00edma\u010d kter\u00fd je pou\u017eit k ur\u010den\u00ed stavu obsazen\u00ed dan\u00e9ho bloku
SensorDebounceText = Nastavte prodlevu \u010dasova\u010de pro sn\u00edma\u010d \n Prodleva \u010dasova\u010de p\u0159id\u00e1 zpo\u017ed\u011bn\u00ed p\u0159ed zpr\u00e1vu sn\u00edma\u010de o zm\u011bn\u011b stavu, toto pom\u016f\u017ee zabr\u00e1nit fale\u0161n\u00fdm zpr\u00e1v\u00e1m z d\u016fvodu ne\u010distot na kolech a pod.
SensorInActiveDebounceText = Zpo\u017ed\u011bn\u00ed v milisekund\u00e1ch p\u0159ed zpr\u00e1vou ze sn\u00edma\u010d je neaktivn\u00ed
SensorActiveDebounceText = Zpo\u017ed\u011bn\u00ed v milisekund\u00e1ch p\u0159ed zpr\u00e1vou \u017e\u011b sn\u00edma\u010d je aktivn\u00ed
SensorDebounceUseGlobalText = Pou\u017eit\u00ed glob\u00e1ln\u00edch hodnot prodlevy
SensorPullUpText = N\u011bkter\u00e9 typy syst\u00e9m\u016f umo\u017e\u0148uj\u00ed u\u017eivateli zvolit, zda vstupy sn\u00edma\u010d\u016f jsou na n\u00edzk\u00e9 \u00farovni (pull-down) nebo \u017ee jsou na vysok\u00e9 \u00farovni (pull-up) nebo ne.\nNa t\u011bchto syst\u00e9mech nastavte tento rozbalovac\u00ed seznam podle p\u0159ipojen\u00e9ho hardwaru.

# Used with the turnout edit
ConnectionHint = (na p\u0159ipojen\u00ed: {0})
InvertedToolTip = Kdy\u017e je za\u0161krtnuto tak povel pro v\u00fdhybku \n a stav v koleji\u0161ti je obr\u00e1cen\u00fd.

FeedbackToolTip = Tento panel umo\u017e\u0148uje konfiguraci zp\u016fsobu zp\u011btn\u00e9ho ohlasu pou\u017eit\u00e9 pro \u0159\u00edzen\u00ed a ur\u010dov\u00e1n\u00ed stavu v\u00fdhybek
Feedback = Zp\u011btn\u00fd ohlas
FeedbackMode = Re\u017eim zp\u011btn\u00e9ho ohlasu
FeedbackModeToolTip = Vyberte zp\u016fsob provozu v\u00fdhybek
FeedbackSensor1 = Zp\u011btn\u00fd ohlas sn\u00edma\u010de 1
FeedbackSensor2 = Zp\u011btn\u00fd ohlas sn\u00edma\u010de 2
FeedbackSensorToolTip = Voliteln\u00fd sn\u00edma\u010d kter\u00fd poskytuje zp\u011btn\u00fd ohlas pro stav v\u00fdhybky
FeedbackNameSet = N\u00e1zev zp\u011btn\u00e9ho ohlasu
FeedbackNameSetToolTip = Nastavte n\u00e1zev na nastaven\u00ed zp\u011btn\u00e9ho ohlasu
FeedbackOperation = Provoz
FeedbackOperationToolTip = Vyberte jak mnoho pokus\u016f ud\u011bl\u00e1 JMRI pro nastaven\u00ed v\u00fdhybky \n spolu s intervalem mezi pokusy

Lock = Z\u00e1mek
Speed = Rychlost

TurnoutAutomation = Automatizace v\u00fdhybky 
TurnoutAutomationToolTip = Zp\u016fsob pou\u017eit\u00ed pokusu o nastaven\u00ed v\u00fdhybky

ClosedSpeed = Rychlost p\u0159\u00edmo
ClosedSpeedToolTip = Maxim\u00e1ln\u00ed povolen\u00e1 rychlost vlaku pro j\u00edzdu p\u0159es v\u00fdhybku rovn\u011b
ThrownSpeed = Rychlost do odbo\u010dky
ThrownSpeedToolTip = Maxim\u00e1ln\u00ed povolen\u00e1 rychlost vlaku pro j\u00edzdu p\u0159es v\u00fdhybku do odbo\u010dky

LockToolTip = Vlastnost z\u00e1mek v\u00fdhybky v\u00e1m umo\u017e\u0148uje selektivn\u011b zak\u00e1zat p\u0159\u00edslu\u0161enstv\u00ed (v\u00fdhybky) p\u0159\u00edkazy ze stanovi\u0161t\u011b a/nebo m\u00edstn\u011b p\u0159ipojen\u00fdmi tla\u010d\u00edtka.\n Z\u00e1mek m\u016f\u017ee b\u00fdt nastaven (zam\u010den) nebo odstaven (odem\u010den) ze za\u0161krt\u00e1v\u00e1tka z tabulky v\u00fdhybek, z tabulky tras nebo Logix, nebo ze skript\u016f.
LockModeUnavailable = Vlastnost z\u00e1mek v\u00fdhybky nen\u00ed k dispozici pro tento typ v\u00fdhybky.
LockModeToolTip = vyberze typ z\u00e1mku kter\u00fd bude pou\u017eit
LockModeDecoder = Dekod\u00e9r p\u0159\u00edslu\u0161enstv\u00ed
LockModeDecoderToolTip = JMRI pot\u0159ebuje v\u011bd\u011bt jak\u00fd typ DDC dekod\u00e9ru je pou\u017eit aby mohlo b\u00fdt zach\u00e1zeno se z\u00e1mkem spr\u00e1vn\u011b.

SpeedTabToolTip = Pro pou\u017eit\u00ed s n\u00e1v\u011bstidly nastavte maxim\u00e1ln\u00ed rychlost dovolenou pro j\u00edzdu p\u0159es v\u00fdhybku.

# Used with the sensor edit
SensorInvertedToolTip = Kdy\u017e za\u0161krtnuto tak p\u0159\u00edkaz \n ze stavu sn\u00edma\u010de z koleji\u0161t\u011b je obr\u00e1cen\u00fd.
SensorDebounce = Z\u00e1chv\u011bvy sn\u00edma\u010de
EditBean=Upravit {0} {1}
