# BeanEditBundle_fr.properties
#
# Revision $Revision$
#
# Default properties for the jmri.jmrit.beantable.beanedit GUI elements

# This file is part of JMRI.
#
# JMRI is free software; you can redistribute it and/or modify it under
# the terms of version 2 of the GNU General Public License as published
# by the Free Software Foundation. See the "COPYING" file for a copy
# of this license.
#
# JMRI is distributed in the hope that it will be useful, but WITHOUT
# ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or
# FITNESS FOR A PARTICULAR PURPOSE.  See the GNU General Public License
# for more details.
#
#Updated by BLOREC Herv\u00e9 <bzh56420@yahoo.fr> 2016-06-07

Properties = Propri\u00e9t\u00e9

Basic = Basique
Usage = Usage
UsageText = Fournit une indication de l'endroit o\u00f9 {0} est utilis\u00e9 dans votre panneau.

NamedBeanPropertiesTableDescription = Ce sont des propri\u00e9t\u00e9s personnalis\u00e9es (effacer le Nom supprime l'entr\u00e9e) (NE PAS CHANGER sans savoir ce que vous faites)
NamedBeanPropertyName = Nom
NamedBeanPropertyValue = Valeur

BlockPhysicalProperties = D\u00e9tails physiques
BlockUseCurrentText = Utiliser le report actuel depuis le rapport comme valeur pour le canton.
BlockReporterText = D\u00e9finir le report utilis\u00e9 pour identifier les trains dans le canton
BlockPropertiesText = Utiliser cet onglet pour mettre \u00e0 jour les informations physiques au sujet du canton
BlockLengthUnits = Unit\u00e9s
BlockLengthUnitsText = S\u00e9lectionner les mesures de longueur
BlockLengthText = Longueur des cantons
BlockMaxSpeedText = D\u00e9finir la vitesse maximum \u00e0 travers le canton
BlockPermissiveText = Un autre train peut entrer quand le canton est occup\u00e9

BlockAssignSensorText = D\u00e9finir le capteur qui est utilis\u00e9 pour d\u00e9terminer l'\u00e9tat d'occupation du canton
SensorDebounceText = D\u00e9finir les temporisations Antirebond pour le capteur \n Les temporisations Antirebond ajoute un d\u00e9lai avant que le changement d'\u00e9tat du capteur soit rapport\u00e9, ceci \u00e9vite les mauvaises informations d\u00fbes aux roues encrass\u00e9es etc
SensorInActiveDebounceText = Le d\u00e9lai en millisecondes avant de reporter le capteur comme D\u00e9sactiv\u00e9
SensorActiveDebounceText = Le d\u00e9lai en millisecondes avant de reporter le capteur comme Activ\u00e9
SensorDebounceUseGlobalText = Utilisation G\u00e9n\u00e9rale des Valeurs d'Antirebond

#  Used with the turnout edit
InvertedToolTip = Quand coch\u00e9e, la commande de l'aiguillage \n et son \u00e9tat depuis et vers le r\u00e9seau sont invers\u00e9s.

FeedbackToolTip = Ce panneau vous permet de configurer les m\u00e9thodes de r\u00e9trosignalisation utilis\u00e9es pour contr\u00f4ler et d\u00e9terminer l'\u00e9tat d'un aiguillage.
Feedback = R\u00e9trosignalisation
FeedbackMode = Mode de R\u00e9trosignalisation
FeedbackModeToolTip = S\u00e9lectionner la m\u00e9thode op\u00e9rationnelle pour un aiguillage
FeedbackSensor1 = R\u00e9trosignalisation capteur 1
FeedbackSensor2 = R\u00e9trosignalisation capteur 2
FeedbackSensorToolTip = Capteur optionnel qui fournit la r\u00e9trosignalisation pour l'\u00e9tat d'un aiguillage
FeedbackNameSet = Nom R\u00e9trosignalisation
FeedbackNameSetToolTip = D\u00e9finir un nom pour les r\u00e9glages de R\u00e9trosignalisation
FeedbackOperation = Op\u00e9ration
FeedbackOperationToolTip = S\u00e9lectionner le nombre d'essais que JMRI devra faire pour basculer l'aiguillage \n avec un la dur\u00e9e de l'intervalle entre chaque essai

Lock = Verrouiller
Speed = Vitesse

TurnoutAutomation = Automatisation Aiguillage
TurnoutAutomationToolTip = M\u00e9thode utilis\u00e9e pour r\u00e9essayer les r\u00e9glages de l'aiguillage

ClosedSpeed = Vitesse Direct
ClosedSpeedToolTip = La vitesse maximale \u00e0 laquelle le train est autoris\u00e9 \u00e0 rouler quand l'aiguillage est direct
ThrownSpeed = Vitesse D\u00e9vi\u00e9
ThrownSpeedToolTip = La vitesse maximale \u00e0 laquelle le train est autoris\u00e9 \u00e0 rouler quand l'aiguillage est d\u00e9vi\u00e9

LockToolTip = La fonction de verrouillage de l'aiguillage vous permet de de d\u00e9sactiver s\u00e9lectivement les commandes d'accessoire (aiguillage) depuis un pupitre et/ou un bouton c\u00e2bl\u00e9 .\n Le verrouillage peut \u00eatre activ\u00e9 ou d\u00e9sactiv\u00e9 depuis une case \u00e0 cocher dans la Table Aiguillage, depuis un Itin\u00e9raire ou un Logix ou des scripts.
LockModeToolTip = S\u00e9lectionner le type de Verrouillage \u00e0 utiliser
LockModeDecoder = D\u00e9codeur Accessoire
LockModeDecoderToolTip = JMRI a besoin de savoir quel type de d\u00e9codeur DCC est en service pour pouvoir activer le verrou proprement.

SpeedTabToolTip = Pour utilsation avec la Signalisation, d\u00e9fini la vitesse maximum autoris\u00e9e sur l'aiguillage

#   Used with the sensor edit
SensorInvertedToolTip = Quand coch\u00e9e, la commande du capteur\n et son \u00e9tat de et vers le r\u00e9seau sont invers\u00e9s.
SensorDebounce = Antirebond
