# BeanEditBundle_da.properties
#
# Danish translation by Sonny Hansen
# Danish properties for the jmri.jmrit.beantable.beanedit GUI elements

Properties = Egenskaber
EditBean = Rediger {0} {1}

Basic = Basic
Usage = Brugt af
UsageText = Giver en indikation om hvor {0} bliver brugt i dit panel.

NamedBeanPropertiesTableDescription = Disse er brugerdefinerede indstillinge (slet Navn for at fjerne adgang)\n- (\u00c6NDRE DET IKKE medmindre du ved hvad du laver)
NamedBeanPropertyName = Navn
NamedBeanPropertyValue = V\u00e6rdi

BlockPhysicalProperties = Fysiske Detaljer
BlockUseCurrentText = Brug Aktuelle Report fra Reporteren som v\u00e6rdi for hele blokken
BlockReporterText = S\u00e6t den Reporter der skal bruges for at identificere tog i blokken
BlockPropertiesText = Brug denne fane for at opdaterer de fysiske informationer om blokken
BlockLengthUnits = Enheder
BlockLengthUnitsText = V\u00e6lg m\u00e5le enheder
BlockLengthText = Blokkens l\u00e6ngde
BlockMaxSpeedText = S\u00e6t maksimum hastighed gennem blokken
BlockPermissiveText = Kan et andet tog k\u00f8re ind i blokken n\u00e5r blokken er optaget

BlockAssignSensorText = S\u00e6t den sensor, der skal bruges for at bestemme optaget tilstand af blokken
SensorDebounceText = S\u00e6t Debounce tider for sensoren.\nDebounce tiden tilf\u00f8jer en forsinkelse f\u00f8r sensorens \u00e6ndring bliver rapporteret, dette forhindre falsk rapportering af f.eks snavsede hjul og ligende
SensorInActiveDebounceText = Forsinkelsen i millisekunder f\u00f8r sensoren bliver sat til Inaktiv
SensorActiveDebounceText = Forsinkelsen i millisekunder f\u00f8r sensoren bliver sat til Aktiv
SensorDebounceUseGlobalText = Brug Global Debounce V\u00e6rdier

# Used with the turnout edit
InvertedToolTip = Hvis checked, er sporskifte kommandoen \n og status til og fra layoutet omvendt.

FeedbackToolTip = Dette panel tillader dig at konfigurere metoden for feedback som bruges til at styre og bestemme tilstanden af et sporskifte
Feedback = Feedback
FeedbackMode = Feedback Tilstand
FeedbackModeToolTip = V\u00e6lg operations metoden for et sporskifte
FeedbackSensor1 = Feedback Sensor 1
FeedbackSensor2 = Feedback Sensor 2
FeedbackSensorToolTip = Valgfri sensor der bestemmer feedback for et sporskiftes tilstand
FeedbackNameSet = Feedback navn
FeedbackNameSetToolTip = S\u00e6t et navn der angiver Feedback indstillingerne
FeedbackOperation = Operation
FeedbackOperationToolTip = V\u00e6lg hvor mange fors\u00f8g JMRI skal udf\u00f8rer for at indstille sporskiftet\n sammen med intervalget mellem hvert fors\u00f8g

Lock = L\u00e5s
Speed = Speed

TurnoutAutomation = Sporskifte Automation
TurnoutAutomationToolTip = Anvendt metode for at gentage indstillingen af sporskiftet

ClosedSpeed = Ret Hastighed
ClosedSpeedToolTip = Den maksimale hastighed et tog er tilladt at k\u00f8re n\u00e5r sporskiftet er indstillet til ret
ThrownSpeed = Afvigende Hastighed
ThrownSpeedToolTip = Den maksimale hastighed et tog er tilladt at k\u00f8re n\u00e5r sporskiftet er indstillet til afvigende

LockToolTip = The turnout lock feature allows you to selectively disable accessory (turnouts) commands from cabs and/or locally-wired pushbuttons.\n The lock can be set (locked) or unset (unlocked) from a checkbox in the Turnout Table, from a Route or Logix, or from scripts.
LockModeToolTip = V\u00e6lg den type l\u00e5s der skal bruges
LockModeDecoder = Accessory Dekoder
LockModeDecoderToolTip = JMRI har brug for at vide hvilken type af DCC dekoder der er i brug, s\u00e5 det kan h\u00e5ndterer l\u00e5sen korrekt.

SpeedTabToolTip = Bruges i forbindelse med signaler, og indstiller den maksimale tilladte hastighed gennem et sporskifte.

# Used with the sensor edit
SensorInvertedToolTip = Hvis checked, er sensor kommandoen \n og status til og fra layoutet omvendt.
SensorDebounce = Debounce Delays
