# BeanEditBundle_ca.properties
#
# Catalan properties for the jmri.jmrit.beantable.beanedit GUI elements
# Traducci\u00f3: Joan de Castro (joan276dca@yahoo.es) \u0096 20/09/2016
# Translation Luis Zamora (eldelinux) <eldelinux@yahoo.es> 2018/05/12

Properties = Propietats
EditBean = Edita {0} {1}

Basic = B\u00e0sic
Usage = \u00das
UsageText = D\u00f3na indicaci\u00f3 d'on s'ha d'usar {0} en el panell.

NamedBeanPropertiesTableDescription = Aquestes s\u00f3n propietats personalitzades (esborrar Nom per eliminar l'entrada) (no ho canvi\u00efs a menys que s\u00e0pigues el que est\u00e0s fent)
NamedBeanPropertyName = Nom
NamedBeanPropertyValue = Valor

BlockPhysicalProperties = Detalls f\u00edsics
BlockUseCurrentText = Usa l'informe actual com a valor per al Bloc
BlockReporterText = Estableix l'informe que s'utilitza per a identificar trens en el bloc
BlockPropertiesText = Usa la pestanya per actualitzar la informaci\u00f3 f\u00edsica del Bloc
BlockLengthUnits = Unitats
BlockLengthUnitsText = Selecciona mesurament de longituds
BlockLengthText = Longitud del Bloc
BlockMaxSpeedText = Estableix la m\u00e0xima velocitat de pas pel Bloc
BlockPermissiveText = Un alte tren pot entrar al bloc quan \u00e9s ocupat

BlockAssignSensorText = Ajusta el sensor usat per determinar l'ocupaci\u00f3 del Bloc
SensorDebounceText = Ajusta els temporitzadors de supressi\u00f3 de rebots per al sensor \n Els temporitzadors de rebot afegeixen un retard abans d'informar del canvi d'estat del sensor, aix\u00f2 prev\u00e9 falsos informes, per rodes brutes, etc
SensorInActiveDebounceText = El retard en mil\u00b7lisegons abans d'informar que un sensor \u00e9s Inactiu
SensorActiveDebounceText = El retard en mil\u00b7lisegons abans d'informar que un sensor \u00e9s Actiu
SensorDebounceUseGlobalText = Usa valors de rebot Globals
SensorPullUpText = Alguns tipus de sistema permeten a l'usuari triar si les entrades del sensor s'extreuen (baixes) o s'incorporen (altes) o cap d'elles.\nEn aquests sistemes, estableii aquesta llista desplegable per coincidir amb el maquinari adjunt.

# Used with the turnout edit
ConnectionHint = (en la connexi\u00f3: {0})
InvertedToolTip = Quan marcat, la comanda de l'Agulla\ni l'estat s'inverteixen.

FeedbackToolTip = Aquest panell permet configurar els m\u00e8todes de retroalimentaci\u00f3 utilitzats per controlar i determinar l'estat d'una Agulla
Feedback = Retroalimentaci\u00f3
FeedbackMode =  Mode de retroalimentaci\u00f3
FeedbackModeToolTip = Selecciona el m\u00e8tode d'opreraci\u00f3 d'una Agulla
FeedbackSensor1 = Sensor de retroalimentaci\u00f3 1
FeedbackSensor2 = Sensor de retroalimentaci\u00f3 2
FeedbackSensorToolTip = Sensor opcional que d\u00f3na retroalimentaci\u00f3 de l'estat d'una Agulla
FeedbackNameSet = Nom de retroalimentaci\u00f3
FeedbackNameSetToolTip = Estableix el nom de l'ajust de retroalimentaci\u00f3
FeedbackOperation = Operacions
FeedbackOperationToolTip = Selecciona quants intents far\u00e0 el JMRI per moure l'agulla\namb un interval de temps entre intents

Lock = Bloquejat
Speed = Velocitat

TurnoutAutomation = Automatitzaci\u00f3 d'Agulles
TurnoutAutomationToolTip = M\u00e8tode utilitzat per tornar a intentar el moviment de canvi

ClosedSpeed = Velocitat de l'Agulla en Directe
ClosedSpeedToolTip = La velocitat m\u00e0xima del tren quan l'Agulla est\u00e0 en directe
ThrownSpeed = Velocitat de l'Agulla en Desviada
ThrownSpeedToolTip = La velocitat m\u00e0xima del tren quan l'Agulla est\u00e0 en desviada

LockToolTip = La funci\u00f3 de bloqueig permet deshabilitar les ordres dels accessoris (agulles) dels reguladors o TCO.\n El bloqueig es pot establir (bloquejat) o deshabilitat (desbloquejat) des d'una casella de verificaci\u00f3 a la Taula d'Agulles, Itinerari o L\u00f2gica, o des de un script.
LockModeUnavailable = La funci\u00f3 de boqueig de l'agulla no est\u00e0 disponible per aquesta agulla.
LockModeToolTip = Selecciona el tipus de locomotora a utilitzar
LockModeDecoder = Decoder d'accessoris
LockModeDecoderToolTip = El JMRI necessita saber quin tipus de decoder DCC est\u00e0 en \u00fas per poder gestionar el bloqueig. 

SpeedTabToolTip = Per a l'\u00fas amb senyalitzaci\u00f3. Estableix la velocitat m\u00e0xima permesa a trav\u00e9s del desviament. 

# Used with the sensor edit
SensorInvertedToolTip = Quan est\u00e0 marcat, s'inverteix l'ordre del sensor\ni l'estat des de i cap a de la maqueta s'inverteix. 
SensorDebounce = Retard d'entrada
