<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01//EN"
"http://www.w3.org/TR/html4/strict.dtd">
<!-- Translated by Herv&#233; Blorec le 2012/01/19-->
<html lang="fr">
<head>
<meta name="generator" content=
"HTML Tidy for Mac OS X (vers 31 October 2006 - Apple Inc. build 15.17), see www.w3.org">
<!-- Copyright Bob Jacobsen 2008 -->
<!--  $Id$ -->
<title>JMRI: Decoder Programmer Error Messages</title>
<!-- Style -->
<meta http-equiv="Content-Type" content=
"text/html; charset=us-ascii">
<link rel="stylesheet" type="text/css" href="/css/default.css"
media="screen">
<link rel="stylesheet" type="text/css" href="/css/print.css" media=
"print">
<link rel="icon" href="/images/jmri.ico" type="image/png">
<link rel="home" title="Home" href="/"><!-- /Style -->
</head>
<body>
<!--#include virtual="/Header" -->
<div id="mBody"><!--#include virtual="Sidebar" -->
<div id="mainContent">
<h2>JMRI: Messages d'Erreur du Programmateur de
D&eacute;codeur</h2>
Diverses choses peuvent mal se passer lorsque JMRI essaie de
travailler avec votre centrale de commande DCC pour programmer un
d&eacute;codeur DCC. Cette page liste les message d'erreur qui
peuvent en r&eacute;sulter, le num&eacute;ro qui les identifie, et
les d&eacute;crit leurs significations.
<dl>
<dt>d&eacute;lai de r&eacute;ponse d&eacute;pass&eacute; 306</dt>
<dd>Le programme n'a pas de r&eacute;ponse de la centrale de
commande lorsque l'on en attend une.
<p>C'est de loin le message d'erreur le plus courant quand les gens
commencent &agrave; utiliser JMRI. Dans ce cas, cela signifie
g&eacute;n&eacute;ralement que la connexion &agrave; la centrale de
commande n'est pas correcte. Cela pourrait &ecirc;tre un
probl&egrave;me avec le c&acirc;ble (s) de liaison, ou un
probl&egrave;me avec la fa&ccedil;on dont les
pr&eacute;f&eacute;rences sont d&eacute;finies. Choisir le mauvais
port s&eacute;rie est particuli&egrave;rement fr&eacute;quent.</p>
<p>Une fois que JMRI fonctionne correctement, cette erreur peut
parfois arriver &agrave; cause d'une erreur passag&egrave;re.
DecoderPro g&eacute;n&eacute;ralement va r&eacute;essayer avec
succ&egrave;s, dans ce cas.</p>
</dd>
<dt>Pas de locomotive d&eacute;tect&eacute;e 301</dt>
<dd>La centrale de commande a indiqu&eacute; qu'elle ne voit pas de
locomotive sur la voie de programmation.
<p>Cela peut arriver si les contacts entre la voie et la locomotive
ne sont pas bons ou s'il y a un d&eacute;faut de c&acirc;blage dans
la locomotive.</p>
</dd>
<dt>Pas d'acquittement de la locomotive 308</dt>
<dd>A la fin d'une lecture ou d'&eacute;criture d'un CV, la
locomotive r&eacute;pond ("reconna&icirc;t") &agrave; la centrale
de commande en utilisant une impulsion de courant.
<p>Si cette impulsion ne se voit pas, certaines centrales de
commande fournissent ce message d'erreur. Elle pourrait &ecirc;tre
due &agrave; de mauvaises connexions &eacute;lectriques &agrave;
sur la voie de programmation ou au sein de la locomotive. Il se
pourrait aussi que le d&eacute;codeur ne supporte pas la
relecture.</p>
<p>Certains d&eacute;codeurs sonores particuli&egrave;rement
certains d&eacute;codeurs, sont tellement gourmand en courant que
l'impulsion r&eacute;ponse n'est pas d&eacute;tect&eacute;e par la
centrale de commande. Dans ce cas, un "booster de programmation"
diff&eacute;rent peut r&eacute;soudre le probl&egrave;me.</p>
</dd>
<dt>court-circuit sur voie de programmation 309</dt>
<dd>La centrale de commande a rapport&eacute; avoir vu un
court-circuit sur la voie de programmation. Cela emp&ecirc;che les
op&eacute;rations de programmation .
<p>V&eacute;rifiez les connexions &eacute;lectriques &agrave; la
voie de programmation, et &eacute;galement au sein de la
locomotive.</p>
</dd>
<dt>programmateur occup&eacute; 302</dt>
<dd>La centrale de commande a indiqu&eacute; qu'il est
occup&eacute; &agrave; faire autre chose, et ne peut pas faire de
programmation en ce moment. Cela signifie
g&eacute;n&eacute;ralement que toute autre partie du syst&egrave;me
DCC fait une op&eacute;ration de programmation, par exemple un
r&eacute;gulateur &agrave; main.
<p>Certains syst&egrave;mes de DCC ne peut pas faire de
programmation ops mode (programmation sur la voie principale) tout
en utilisant aussi la voie de programmation en mode de service,
auquel cas ils retournent ce message d'erreur.</p>
</dd>
<dt>demande ne peut pas &ecirc;tre mise en oeuvre dans la centrale
de commande 303</dt>
<dd>Cela signifie que JMRI a demand&eacute; &agrave; la centrale de
commande de faire quelque chose qu'elle ne prend pas en charge.
<p>Ce n'est pas cens&eacute; se produire, comme JMRI doit
d&eacute;sactiver les modes de programmation que la centrale de
commande ne peut pas fournir. Si vous voyez ce message, s'il vous
pla&icirc;t signaler les circonstances &agrave; la liste de
diffusion jmriusers.</p>
</dd>
<dt>Interrompu par l'utilisateur 304</dt>
<dd>L'utilisateur a demand&eacute; que la lecture ou
l'&eacute;criture s'arr&ecirc;te au plus t&ocirc;t.
<p>Ceci est consid&eacute;r&eacute; comme une erreur, car la
programme ne sais pas si le d&eacute;codeur a vu r&eacute;ellement
l' op&eacute;ration compl&egrave;te ou non.</p>
</dd>
<dt>&Eacute;chec confirm&eacute; 305</dt>
<dd>Certaines centrales de commande vous permettent de "confirmer"
le contenu d' un CV, plut&ocirc;t que de lire sa valeur. En
g&eacute;n&eacute;ral, cela est plus rapide que faire une lecture
compl&egrave;te. Si la valeur dans le CV ne correspond pas &agrave;
la valeur attendue, ce message est &eacute;mis. Il est
consid&eacute;r&eacute; comme une erreur parce que si les valeurs
ne correspondent pas, nous savons que nous ne savons pas la valeur
correcte pour le contenu CV.</dd>
<dt>Erreur inconnue 307</dt>
<dd>Une erreur s'est produite, mais JMRI n'en sait pas assez sur ce
sujet pour &ecirc;tre en mesure de rendre compte plus en
d&eacute;tail.
<p>En g&eacute;n&eacute;ral, JMRI est assez bon pour
d&eacute;chiffrer ce qui ne va pas, et Ce message n'est pas
tr&egrave;s commun. Si vous ne voyez ce message, s'il vous
pla&icirc;t signaler les circonstances &agrave; la liste de
diffusion jmriusers.</p>
</dd>
</dl>
<!--#include virtual="/Footer" --></div>
</div>
</body>
</html>
