# ControlPanelBundle_fr.properties
#
## French properties for the jmrit.display.controlPanel package
## Updated by BLOREC Herv\u00e9 <bzh56420@yahoo.fr> 2016-01-09

#Title         = Commande \u00c9diteur de Panneau
AboutWarrant    = A propos des Bulletins
AboutOBlock     = A propos des OCantons & Portails
OpenCircuitMenu = Ouvrir le Constructeur de Circuit

# \u00e9l\u00e9ments du menu CircuitBuilder
CircuitBuilder  = Constructeur de Circuit
newCircuitItem  = Ajouter un Circuit D\u00e9tecteur
editCircuitItem = \u00c9diter Circuit OCanton
OpenCircuitItem = \u00c9diter Voie "{0}"
OpenPortalTitle = \u00c9diter "{0}" Portails
OpenDirectionTitle = Editer "{0}" Portail Fl\u00eaches Direction
OpenPortalTitle2= Ajouter/\u00c9diter Portails entre "{0}" et "{1}"
OpenPathTitle   = Ajouter/\u00c9diter "{0}" Chemins
noCircuitsItem = Pas de circuits de d\u00e9tection de d\u00e9finis
editCircuitPathsItem = Modifier Circuit Chemins
editPortalsItem = Modifier Circuit Portails
editDirectionItem = Modifier Ic\u00f4nes Portail de Direction
circuitErrorsItem = V\u00e9rifications des erreurs
blockNeedsIconsItem = Circuits sans ic\u00f4nes
iconsNeedConversionItem = Mise en \u00e9vidence des ic\u00f4nes de voie n\u00e9cessitant une conversion
iconsNeedsBlocksItem = Mise en \u00e9vidence des indicateurs de voie sans circuits
blocksNeedConversionItem = Circuits dont les ic\u00f4nes ont besoin de conversion
portalsMisplaced = Circuits avec des ic\u00f4nes Portail mal plac\u00e9es
portalsInPlace = Positionnement ic\u00f4nes Portail OK
CheckPortalPaths =  V\u00e9rifiez erreurs Portail & Chemin
noTrackCircuits = Pas de circuits de voie (OCantons) de d\u00e9finis
circuitsHaveIcons = Tous les Circuits (OCantons) sont repr\u00e9sent\u00e9s par des ic\u00f4nes
IconsHaveCircuits = Chaque ic\u00f4ne indicateur de Voie appartient \u00ee un circuit de Voie
circuitIconsConverted = Tous les Circuits (OCantons) sont repr\u00e9sent\u00e9s par des ic\u00f4nes Indicateur de Voie
ArrowIconsTitle = Entr\u00e9 Ic\u00f4ne

SelectType      = S\u00e9lectionner le Type
SelectLevel     = S\u00e9lectionner le Niveau
selectLevel     = Niveau {0} \u00e9l\u00e9ments
MemoryInput     = Entr\u00e9e M\u00e9moire
Shape           = Forme

# \u00c9l\u00e9ments du menu ShapeDrawer
drawShapes = Dessiner des Formes
drawSth = Dessiner {0}...
lineWidth = Epaisseur de ligne
thin = mince
thick = \u00e9pais
lineColor = Couleur de Ligne
fillColor = Couleur de remplissage
transparency = Transparence du remplissage
transparent = Transparent
opaque = Opaque
cornerRadius = Rayon
circleRadius = Rayon du Cercle
editShape = Modifier Forme "{0}"...
newShape = "{0}" Nouvelle Forme
Polygon = Polyg\u00f4ne
Rectangle = Rectangle
roundRect = Rectangle Angles Arrondis
disableShapeSelect= D\u00e9sactiver la S\u00e9lection des Formes

drawInstructions1 = D\u00e9finir les attributs de la forme. Ensuite, faire une
drawInstructions2 = "selection rectangle" dans le panneau pour maintenir la forme
drawInstructions2a = clic de souris sur les sommets pour cr\u00e9er la polyligne.
drawInstructions2b = Double-cliquez sur un sommet pour terminer la polyligne.
drawInstructions3a = (Facultatif) Pour contr\u00f4ler la visibilit\u00e9 de la polyligne,
drawInstructions3b = entrez le nom d'un capteur dans la zone de texte [{0}] ci-dessous.
VisibleSensor = Commande de visibilit\u00e9
SensorMsg       = Le capteur actif peut soit cacher la forme soit changer son niveau d'affichage
HideOnSensor    = Masquer Forme
ChangeLevel     = Changer Niveau
SameLevel       = M\u00eame Niveau

TitleCircuitDialog = Nouveau Circuit voie (Oblock)
ButtonAddCircuit = Ajouter OCanton Circuit
ButtonOpenCircuit = Afficher OCanton
ButtonConvertIcon = Convertir des Ic\u00f4nes
ButtonDelete = Supprimer Circuit OCanton
buttonAddPath = Sauvegarder le Chemin
buttonDeletePath = Supprimer Chemin
buttonClearSelection = Effacer la s\u00e9lection
buttonChangeName = Modifier le nom
buttonDeletePortal = Supprimer  Portail
ButtonNextCircuit = Circuit Suivant
OpenSensorPicklist = Ouvrir La Liste de Choix des Capteurs

# \u00c9tiquettes
createOBlock = Cr\u00e9er un circuit de voie OCanton
sysnameOBlock   = Nom Syst\u00e8me OCantan doit commencer par "OB"
selectOBlock = S\u00e9lectionnez un circuit de voie OCanton:
numTrackElements = nombre d'ic\u00f4nes de voie dans le Circuit:
Segments = Segments
ErrorSensor = Capteur d''Erreurs
ErrorPortal = Erreur Portail
blockState = \u00c9tat Circuit (OCanton):
AddRemoveIcons = Cochez (ou d\u00e9cochez) toutes les ic\u00f4nes de voie qui affichent ce circuit de voie OCanton
blockName = Nom du Circuit:
portalName = Nom du Portail
makePortal = Faire un Portail
PortalTitle = Portails dans et hors du circuit "{0}" 
selectPortal = Pour faire une ic\u00f4ne pour un Portail dans la liste, s\u00e9lectionnez-la dans la liste,
dragIcon = puis faites glisser l'ic\u00f4ne ci-dessous vers sa position entre les circuits sur le panneau.
portalIconPosition = Une ic\u00f4ne de portail doit toucher les deux Cantons du Portail.
placeIconOnGap  = Faites glisser l'ic\u00f4ne en surbrillance sur une position \u00e0 cheval sur les deux circuits Canton en surbrillance
enterNameToDrag = Pour faire un nouveau Portail, entrez du texte dans la zone Nom du portail,
dragNewIcon = Puis faites glisser l'ic\u00f4ne ci-dessous vers le panneau pour cr\u00e9er \u00e0 la fois le Portail et son ic\u00f4ne.
PathTitle = Chemins \u00e0 travers le circuit de voie "{0}" 
pathName = Nom du chemin
enterNewPath = Faire un nouveau Chemin, entrez du texte dans la Bo\u00eete Nom du chemin
selectPathIcons = Puis s\u00e9lectionner la voie et les ic\u00f4nes portail indiquant le chemin.
pressAddButton = Puis appuyez sur le bouton {0}.
selectPath = Pour modifier un chemin dans la liste, s\u00e9lectionnez-le dans la liste
editPathIcons = Puis s\u00e9lectionner ou d\u00e9s\u00e9lectionner le portail et les ic\u00f4nes de voie.
throwPathTO = Pour obtenir la position correcte de l'aiguillage pour un chemin,
holdShiftDown = Cliquez sur l'Aiguillage avec la touche Maj enfonc\u00e9e.
makePath = Faire un Chemin.
#DragOccupancyName = Glisser le nom du Capteur qui peut d\u00e9tecter l'occupation vers le champ du {0}.
editCiruit      = \u00c9diter le Circuit
PortalDirection1 = D\u00e9finir les ic\u00f4nes qui indiquent l'entr\u00e9e dans le bloc "{0}" .
PortalDirection2 = L'ic\u00f4ne indique la direction du mouvement
PortalDirection3 = Lorsqu'une Autorisation Restrictive est attribu\u00e9e .
PortalDirection4 = Choisir un Portail de montrer son sens de l'entr\u00e9e dans le Canton.
PortalDirection5 = S\u00e9lectionnez l'ic\u00f4ne ci-dessous pour changer l'ic\u00f4ne de direction.
noIcon = Pas Ic\u00f4ne
parallelPortal = "{0}" et "{1}" sont tous deux Portails entre "{2}" et "{3}" .\nSi c'est incorrect, supprimez l'un d'eux.

detectorSensorName = Entrer le nom du capteur qui peut d\u00e9tecter l'occupation pour ce circuit de voie 
detectorErrorName = Entrer le nom du capteur qui indique des probl\u00e8mes d'alimentation pour ce circuit de voie

selectAdjacentCircuit = S\u00e9lectionnez un circuit de voie adjacent \u00e0 "{0}" pour faire un Portail entre eux.

ToolTipConvertIcon = Convertir ic\u00f4nes circuit en des ic\u00f4nes Indicateur de Voie (R\u00e9orientation ou positionnement peuvent \u00eatre n\u00e9cessaires)
ToolTipDeleteCircuit = Supprimer ce circuit de voie, mais garder ses ic\u00f4nes, le cas \u00e9ch\u00e9ant.
TooltipBlockName = Entrez un nom pour modifier le Nom Utilisateur du OCanton pour ce Circuit.
TooltipBlockLength= Entrez une longueur pour les Chemins dans ce OCanton.
TooltipPathLength= Entrez une longueur pour le chemin nomm\u00e9 ci-dessus.
ToolTipAddPath = Entrez un nom, puis s\u00e9lectionner les ic\u00f4nes qui montrent\nla voie et les portails de la voie. Ensuite, appuyez sur ce bouton.
ToolTipDeletePath = Supprimer le chemin s\u00e9lectionn\u00e9 dans la liste depuis le circuit de voie.
# ToolTipEditPath = S\u00e9lectionnez un chemin dans la liste pour l'afficher. Ensuite, ajouter ou supprimer les ic\u00f4nes du chemin.
ToolTipClearList = Effacer les s\u00e9lections dans la liste.
TooltipPathName = Entrez le nom du Chemin \u00e0 travers ce Circuit de voie.
TooltipPortalName = Entrez un nom pour cr\u00e9er un nouveau portail pour le OCanton "{0}" .
ToolTipChangeName = Entrer un autre nom pour modifier le nom d'une s\u00e9lection dans la liste ci-dessus.
ToolTipDeletePortal = Supprimer le portail s\u00e9lectionn\u00e9 et son ic\u00f4ne.
ToolTipPickLists = Le tableau de la liste de s\u00e9lection affiche un choix de capteurs pour faire la d\u00e9tection.

# Messages d'erreur/d'avertissement
NeedDataTitle = Veuillez entrer des donn\u00e9es
# EnterOBlockName
AskTitle = Que ferons-nous?
blockExists = Circuit "{0}" \u00f2u "{1}" existe d\u00e9j\u00e0. Voulez-vous modifier?
AlreadyEditing = Modification d'un circuit de d\u00e9tection en cours. S'il vous pla\u00eet Terminez avant de commencer une nouvelle \u00e9dition.
whichCircuit = Quel Circuit de Voie pour l'Ic\u00f4ne?
iconBlockConflict = Cette ic\u00f4ne affiche le circuit de voie "{0}". Voulez-vous changer pour afficher le circuit "{1}"?
incompleteCircuit = Circuit de Voie incomplet
notIndicatorIcon = Les ic\u00f4nes de voie ne sont pas des ic\u00f4nes indicateur. Voulez-vous convertir?
noSensor = Pas de Capteur de D\u00e9tection
noDetecterSensor = Pas de capteur de d\u00e9tecteur sp\u00e9cifi\u00e9. Ce sera un Canton \u00c9teint et ne peut \u00eatre inclus dans un dispositif de verrouillage.
badSensorName = "{0}" ne peut pas \u00eatre utilis\u00e9 comme un nom de Capteur.
mixedSensors = Pas de Capteur de d\u00e9tection sp\u00e9cifi\u00e9. Voulez-vous utiliser le Capteur d'Erreur pour occupation?
makePaths = Chemin Exig\u00e9
pathsNeedConversion = Toutes les ic\u00f4nes doivent \u00eatre des ic\u00f4nes Indicateur pour faire les Chemins. Vous voulez convertir en ic\u00f4nes Indicateur?
noIcons = Pas d''Ic\u00f4nes
needIcons = Le circuit de voie "{0}" a besoin d'au moins une ic\u00f4ne Indicateur de voie.\nUtilisez le menu "{1}" pour ajouter ou convertir des ic\u00f4nes de voie.
needConversion  = Le Circuit Canton "{0}" a besoin de convertir des ic\u00f4nes voie en ic\u00f4ne Indicateur de Voie.\nUtilisez son m\u00e9nu "{1}" > [{2}] pour convertir les ic\u00f4nes.
iconNotOnAdjacent = Ic\u00f4ne Portail "{0}" ne rejoint pas le Circuit "{1}" \u00e0 un Circuit adjacent.
badPath = Chemin Invalide
iconNotInCircuit = Cette ic\u00f4ne ne fait pas partie du circuit de voie "{0}" .
portalNotInCircuit = Ce portail fait pas partie du circuit de voie "{0}" .
portalNeedsBlock = Le portail "{0}" a besoin d'avoir un OCanton de chaque c\u00f4t\u00e9
needPortalName = Entrez le nom d'un nouveau portail ou s\u00e9lectionner un portail dans la liste ci-dessus.
needPathName    =Entrez le nom d'un nouveau chemin  ou s\u00e9lectionner un chemin dans la liste ci-dessus.
iconNotOnBlock = Ic\u00f4ne Portail "{0}" \nmal positionn\u00e9e entre les circuits "{1}" et "{2}" .
repositionPortal= Voulez-vous changer les connexions du Portail "{0}" pour \u00eatre entre les circuits "{1}" et "{2}"?
portalIconExists =  Portail "{0}"  est d\u00e9fini. Voir ic\u00f4ne en surbrillance.
portalExists =  Portail nomm\u00e9 "{0}"  d\u00e9j\u00e0 existant entre OCantons "{1}"  et "{2}" .
changeBlockName = Entrez un nom d'utilisateur pour le circuit du OCanton .
changePortalName = S\u00e9lectionnez un portail dans la liste ci-dessus. Entrez le changement de nom et appuyez sur "{0}".
changePathName = S\u00e9lectionnez un chemin dans la liste ci-dessus. Entrez le changement de nom et appuyez sur "{0}".
confirmBlockDelete = \u00eates-vous s\u00fbr de vouloir effacer le circuit et tous ses chemins et ses portails?
confirmPortalDelete = Supprimer portail "{0}"  et son ic\u00f4ne?
duplicatePathName = Chemin "{0}"  est le nom d'un autre chemin dans le circuit "{1}" .
noSuchPortal    = Il n'y a pas de portail appel\u00e9 "{0}".
portalHasIcon =  Portail "{0}"  a une ic\u00f4ne. Il est maintenant en surbrillance.
invalidPortal   = Le Portail "{0}" li\u00e9 au OCanton "{1}" invalide - seulement un canton. 
noPathIcons = Pour afficher un chemin dans un circuit au moins une ic\u00f4ne de la voie doit \u00eatre s\u00e9lectionn\u00e9e.
turnoutNotSet = L'Aiguillage "{0}"  doit \u00eatre r\u00e9gl\u00e9 soit "Droit (C)" soit "D\u00e9vi\u00e9 (T)".
tooManyPortals = Un chemin ne peut pas avoir plus de deux ic\u00f4nes portail.
tooFewPortals = Un chemin doit avoir au moins un portail.
balloonTrack = Est le chemin "{0}"  une voie boucl\u00e9e?\n( "{1}" est \u00e0 la fois un portail d'entr\u00e9e et un portail de sortie)
sensorFail = Capteur a \u00e9chou\u00e9 pour "{0}"  en raison de "{1}" .
noPortalIcon =  Portail "{0}"  n'a pas d'ic\u00f4ne.
portalIconMisplaced = Une ic\u00f4ne  Portail "{0}"  est mal positionn\u00e9e ou\nson circuit adjacent a des ic\u00f4nes non converties.
blocksEtcOK = OCantons, Portails et chemins  actuellement d\u00e9finis sont coupl\u00e9s sans erreurs.
cantSaveIcon = Note: l'information de l'ic\u00f4ne circuit  pour les ic\u00f4nes non converties ne peut pas \u00eatre sauv\u00e9e.
replacePortalBlock = Remplacer la connexion  portail de "{0}" \u00e0 "{1}" avec "{0}" \u00e0 "{2}" ?\nSi l'action est prise, "{0}" \les chemins de "{1}" iront d\u00e9sormais \u00e0 "{2}" .
savePath = Voulez-vous enregistrer le chemin "{0}" ?
changePath      = Le Chemin "{0}" a \u00e9t\u00e9 chang\u00e9. Voulez-vous faire ce changement?
samePath        = Le Chemin est le m\u00eame que le chemin "{0}".\nVoulez-vous changerle nom pour "{1}"?
noPortalIcons   = Le chemin a des portails, mais les icu00f4nes de portail ne sont pas d\u00e9finies
samePathName    = Le chemin "{0}" est d\u00e9j\u00e0 d\u00e9fini. Choisissez un autre nom
hasPathErrors   = Le Circuit Canton a des d\u00e9finitions de Chemin incompl\u00e8tes. Voulez-vous quitter?
noPaths         = Le Circuit Canton "{0}" n'a pas de chemin.
waitForPalette = S''il vous pla\u00eet patienter pendant que la palette \u00e9l\u00e9ment se charge...
multipleBlockSelections= Choisissez quel canton surlign\u00e9 du portail doit \u00eatre connect\u00e9 \u00e0 "{0}".
multipleSelections = Les ic\u00f4nes sont empil\u00e9es les unes sur les autres. \n Choisissez celle que vous voulez.
multipleBlocks  = Choisissez quel canton adjacent pour le Portail {0}
MustBeFloat     = {0} est un nombre invalide. Ce doit \u00eatre un nombre d\u00e9cimal positif
