<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01//EN"
"http://www.w3.org/TR/html4/strict.dtd">
<!--Translated by Herv&#233; Blorec bzh56420@yahoo.fr 2013/11/11 -->

<html lang="fr">
<head>
  <meta name="generator" content=
  "HTML Tidy for Mac OS X (vers 31 October 2006 - Apple Inc. build 15.17), see www.w3.org">

  <title>JMRI: Power Control</title>
  <meta name="author" content="Kevin Dickerson">
  <meta name="keywords" content="JMRI help Roster Speed Profiling">
  <!--Style -->
  <meta http-equiv="Content-Type" content=
  "text/html; charset=us-ascii">
  <link rel="stylesheet" type="text/css" href="/css/default.css"
  media="screen">
  <link rel="stylesheet" type="text/css" href="/css/print.css"
  media="print">
  <link rel="icon" href="/images/jmri.ico" type="image/png">
  <link rel="home" title="Home" href="/"><!--/Style -->
</head>

<body>
  <!--#include virtual="/Header" -->
<div class="nomenu" id="mBody">
    <div id="mainContent">

      <h1>Liste profils de vitesse</h1>

      <p>L'outil est con&ccedil;u pour cr&eacute;er le profil d'une
      loco &agrave; divers crans de vitesse pour aider &agrave;
      l'ex&eacute;cution automatique d'une loco au sein de JMRI.
      Principalement pour aider avec le principe d'obtenir qu'une
      loco s'arr&ecirc;te &agrave; une distance sp&eacute;cifique
      &agrave; partir d'un r&eacute;glage de r&eacute;gulateur
      connu .</p>

      <p>L'outil fonctionne sur le principe de chronom&eacute;trer
      une loco sur une distance connue &agrave; une cran de vitesse
      donn&eacute;e, &agrave; la fois dans les direction avant et
      arri&egrave;re. Actuellement, il n&eacute;cessite trois
      capteurs qui surveillent l'occupation d'une section de voie.
      Id&eacute;alement, la section de la voie o&ugrave; les essais
      chronom&eacute;tr&eacute;s sont effectu&eacute;s doit
      &ecirc;tre droite, et un minimum de 1m de long, plus la
      longueur est grande, meilleur est le r&eacute;sultat. Pour
      que ce profilage fonctionne correctement les rampes
      d'acc&eacute;l&eacute;ration/d&eacute;cc&eacute;l&eacute;ration
      doivent &ecirc;tre d&eacute;sactiv&eacute;es sur le
      d&eacute;codeur loco.</p><b>Exigences</b>

      <ul>
        <li><b>Longueur du canton</b>-C'est la longueur en
        millim&egrave;tres de la section du milieu o&ugrave; la
        course sera mesur&eacute;e</li>

        <li><b>Capteur de d&eacute;but</b>-C'est la premi&egrave;re
        section de la voie o&ugrave; la locomotive d&eacute;marre
        sa course initiale</li>

        <li><b>Capteur canton</b>-Il s'agit du capteur li&eacute;
        &agrave; la section de la voie o&ugrave; le
        chronom&eacute;trage sera r&eacute;alis&eacute;</li>

        <li><b>Capteur Terminer</b>-Ce capteur li&eacute; au
        tron&ccedil;on de voie imm&eacute;diatement apr&egrave;s la
        section chronom&eacute;tr&eacute;e</li>

        <li><b>Entr&eacute;e Roster</b>-S&eacute;lectionnez la loco
        sur laquelle le profilage doit &ecirc;tre
        effectu&eacute;e</li>

        <li><b>Annuler</b>-Annule le profilage ou le test</li>

        <li><b>profil</b>-D&eacute;marre le profilage</li>
      </ul>Pour le profil de la loco, remplissez les d&eacute;tails
      ci-dessus dans la fen&ecirc;tre, placez la locomotive dans la
      section de d&eacute;part vers l'avant vers (mais pas sur ) la
      section de la voie o&ugrave; le chronom&eacute;trage sera
      fait, puis appuyez sur le bouton "profil".

      <p>Ce qui arrive est que l'outil va r&eacute;gler la loco
      pour rouler vers l'avant au cran 1, lorsqu'il active le
      capteur du secteur chronom&eacute;tr&eacute;, il
      d&eacute;marre une minuterie. Une fois que le capteur de la
      section d'arriv&eacute;e est activ&eacute;, le
      chronom&egrave;trage est arr&ecirc;t&eacute;, et la vitesse
      est calcul&eacute;e en millim&egrave;tres par seconde, et est
      ensuite enregistr&eacute;e dans la liste. L'outil va alors
      faire en sorte que la locomotive est lib&eacute;r&eacute;e du
      capteur du secteur chronom&eacute;tr&eacute;, puis
      r&eacute;p&eacute;tez la proc&eacute;dure &agrave; nouveau,
      mais dans le sens inverse. Une fois que la locomotive est de
      retour &agrave; la section de d&eacute;marrage initial, toute
      la proc&eacute;dure se r&eacute;p&egrave;te pour cran suivant
      de la vitesse, cela se produit jusqu'&agrave; ce qu'un profil
      avec toutes les mesures de vitesse soit achev&eacute;.</p>

      <h3>Test</h3>

      <p>Apr&egrave;s avoir termin&eacute; le profil, il est
      possible de tester le profil. Placez la locomotive dans la
      section pour repartir vers l'avant en direction de la section
      chronom&eacute;tr&eacute;e, id&eacute;alement &agrave; une
      certaine distance d'elle pour que la machine ait le temps de
      se lancer. Entrez un certain nombre de pas de vitesse
      &agrave; partir de la bo&icirc;te &agrave; c&ocirc;t&eacute;
      du bouton de test, puis appuyez test. Que se passera-t-il,
      l'outil va r&eacute;gler la loco pour rouler au cran de
      vitesse donn&eacute;, puis il va tenter d'arr&ecirc;ter
      progressivement la locomotive avant qu'elle n'atteigne
      l'extr&eacute;mit&eacute;. Les r&eacute;sultats peuvent
      varier en particulier aux vitesses plus
      &eacute;lev&eacute;es, o&ugrave; vous aurez plus de chances
      de constater un d&eacute;passement.</p>Ceci est la page
      d'aide
      help/fr/package/jmri/jmrit/roster/swing/speedprofile/speedProfileFrame.shtml
      <!--#include virtual="/Footer" -->
    </div>
  </div>
</body>
</html>
