<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01//EN"
"http://www.w3.org/TR/html4/strict.dtd">

<html lang="fr">
<head>
  <meta name="generator" content=
  "HTML Tidy for Mac OS X (vers 31 October 2006 - Apple Inc. build 15.17), see www.w3.org">
  <!-- Copyright ($Author$) 2008 -->
  <!-- $Id$ -->
  <!-- UpDated by Herv&#233; Blorec  2013-09-18-->

  <title>JMRI: RFID Reader Support</title><!-- Style -->
  <meta http-equiv="Content-Type" content=
  "text/html; charset=us-ascii">
  <link rel="stylesheet" type="text/css" href="/css/default.css"
  media="screen">
  <link rel="stylesheet" type="text/css" href="/css/print.css"
  media="print">
  <link rel="icon" href="/images/jmri.ico" type="image/png">
  <link rel="home" title="Home" href="/"><!-- /Style -->
</head>

<body>
  <!--#include virtual="/Header" -->

  <div class="nomenu" id="mBody">
    <div id="mainContent">
      <h1>JMRI: Support Lecteur RFID</h1><em>Le support sur cette
      page est en rapide &eacute;volution; le code actuel peut
      &ecirc;tre en avance ou en retard sur la documentation pour
      un jour donn&eacute;.</em>

      <p>JMRI fournit un support pour les <a href=
      "../../../html/tools/Sensors.shtml">Capteurs</a> JMRI en
      g&eacute;n&eacute;ral et <a href=
      "../../../html/tools/Reporters.shtml">Rapports</a> en termes
      "d'&eacute;v&egrave;nements" du Lecteur RFID.</p>

      <h2>D&eacute;signation</h2>La <a href=
      "../../../html/doc/Technical/Names.shtml">lettre du
      syst&egrave;me</a> pour les connexions RFID est "F". Les
      d&eacute;tails de la RFID des noms d'&eacute;v&eacute;nement
      et d'objets sont d&eacute;crits ci-dessous.

      <p>JMRI associe les &eacute;v&eacute;nements RFID avec des
      Objets individuels JMRI (Capteurs, Rapports, etc) via le Noms
      syst&egrave;me JMRI. Un nom syst&egrave;me comme le
      "<code>FSA</code>" d&eacute;finit un capteur qui suit le
      lecteur "A" , tandis qu'un nom syst&egrave;me comme "
      <code>FRB</code> " d&eacute;finit un Rapport qui suit le
      lecteur "B" .</p>

      <h2>Capteurs</h2>Les lectures RFID dans les applications
      &agrave; venir de JMRI peuvent &ecirc;tre accessibles via des
      objets Capteur JMRI. Le nom syst&egrave;me du capteur
      d&eacute;termine &agrave; quel lecteur RFID il correspond.

      <p>Un capteur est d&eacute;fini par deux
      &eacute;v&eacute;nements: Celui qui l'ACTIVE, et celui qui le
      D&Eacute;SACTIVE. Quand une &eacute;tiquette RFID se trouve
      &agrave; proximit&eacute; d'un Lecteur RFID, le capteur
      associ&eacute; est ACTIF; en dehors de ces moments, il est
      INACTIF. Vous cr&eacute;ez les capteurs en utilisant le
      bouton <a href=
      "../../../../fr/package/jmri/jmrit/beantable/SensorAddEdit.shtml">
      Ajouter...</a> sur la <a href=
      "../../../../fr/package/jmri/jmrit/beantable/SensorTable.shtml">
      Table Capteur</a>.</p>

      <h2>Rapports</h2>Les lectures RFID &agrave; venir dans les
      applications JMRI sont &eacute;galement accessibles via les
      Objets Rapports JMRI. Le nom syst&egrave;me 
      <!-- <a Href="Names.shtml"> du Rapport </a> --> du Rapport
      d&eacute;termine quel lecteur RFID il correspond.

      <p>Un Rapport peut contenir des informations arbitraires,
      contrairement &agrave; un capteur qui n'est qu'actif ou
      inactif. Chaque Rapport est associ&eacute; &agrave; une
      source d'information sp&eacute;cifique sur le r&eacute;seau,
      et fait que les informations sur les appareils sont
      disponibles dans le reste de JMRI.</p>

      <p>Quand un Lecteur RFID rapporte qu'une &eacute;tiquette
      sp&eacute;cifique a &eacute;t&eacute; vue, le Rapport
      correspondant contiendra des informations sur l' <a href=
      "../../tools/IdTags.shtml">IdTag</a> sp&eacute;cifique vue.
      Ceci permet alors &agrave; d'autres outils JMRI de
      r&eacute;agir &agrave; cette information</p>

      <h2>Tableau Rapport</h2>Le <a href=
      "../../../package/jmri/jmrit/beantable/ReporterTable.shtml">tableau
      Rapport</a> offre un acc&egrave;s facile au contenu de tous
      les Rapports que JMRI conna&icirc;t. Il ya aussi une touche
      <a href=
      "../../../package/jmri/jmrit/beantable/ReporterAddEdit.shtml">
      "Ajouter ..."</a> pour cr&eacute;er vos propres Rapports
      internes; JMRI cr&eacute;e automatiquement des Objets Rapport
      pour les p&eacute;riph&eacute;riques sur le r&eacute;seau.

      <h2>affichage des Valeurs du Rapport sur des Panneaux</h2>La
      valeur d'un Rapport peut &ecirc;tre affich&eacute;e sur un
      panneau par l'interm&eacute;diaire d'une ic&ocirc;ne. Pour ce
      faire:

      <ul>
        <li>Sur la fen&ecirc;tre de l'&Eacute;diteur du Panneau
        pour votre panneau, trouver le bouton "Ajouter Rapport"
        .</li>

        <li>Dans la zone de texte &agrave; c&ocirc;t&eacute; de ce
        bouton, tapez le nom utilisateur ou le nom syst&egrave;me
        du Rapport d&eacute;sir&eacute;.</li>

        <li>Cliquez sur le bouton. L'ic&ocirc;ne Rapport sera
        plac&eacute;e sur le panneau. Si elle n'est pas visible,
        cela pourrait &ecirc;tre parce que la valeur est
        actuellement vide; utiliser le tableau de Rapport pour
        changer la valeur &agrave; quelque chose qui sera
        visible.</li>

        <li>Vous pouvez faire glisser l'ic&ocirc;ne &agrave;
        l'endroit o&ugrave; vous voulez de la mani&egrave;re
        habituelle.</li>

        <li>Le menu contextuelle sur l'ic&ocirc;ne vous permettra
        de changer la mise en forme.</li>
      </ul><!--#include virtual="/Footer" -->
    </div>
  </div>
</body>
</html>
