# DisplayBundle.properties
#
# Catalan properties for the jmrit.display.controlPanel package
#
# Catalan Translation: Joan de Castro Alemany (joan276dca@yahoo.es) 30/08/2016
# Catalan Translation: Luis Zamora (eldelinux) <eldelinux@yahoo.es> 2018/05/11

#Title           = Editor del Panell de Control
AboutWarrant    = Sobre les Advert\u00e8ncies
AboutOBlock     = Sobre els Blocs Ocupats i Portals
OpenCircuitMenu = Obre el Constructor de Circuits

#CircuitBuilder menu items
CircuitBuilder  = Constructor de Circuits
newCircuitItem  = Afegir un Circuit Detector
editCircuitItem = Edita Circuit de Blocs Ocupats
OpenCircuitItem = Edita la Via "{0}"
OpenPortalTitle = Edita el Portal "{0}"
OpenDirectionTitle= Edita les fletxes de sentit del Portal "{0}"
OpenPortalTitle2= Afegeix/Edita els portals entre "{0}" i "{1}"
OpenPathTitle   = Afegeix/Edita "{0}" Camins
noCircuitsItem  = No s'han definit circuits Detectors
editCircuitPathsItem= Afegeix/Edita Camins de Circuit
editPortalsItem = Afegeix/Edita Portals
editDirectionItem = Edita la Icona de Sentit del Portal
circuitErrorsItem= Verificant Errors...
blockNeedsIconsItem = Circuit sense icones
iconsNeedConversionItem = Les Icones que ressalten el circuit necessiten una conversi\u00f3
iconsNeedsBlocksItem = Icones que ressalten la via sense circuits
blocksNeedConversionItem = Circuits que necessiten reconvertir les icones
portalsMisplaced  = Portals sense icones o mal col\u00b7locades
portalsInPlace  = Icones del Portal posicionades correctament
CheckPortalPaths  = Revisa Errors de Portals i Camins
noTrackCircuits = No s'han definit Circuits de Via (Blocs Ocupats) 
circuitsHaveIcons = Tots els circuits (Blocs Ocupats) estan representats amb icones
IconsHaveCircuits = Cada Icona Indicadora de Via pertany a un circuit de Via
circuitIconsConverted = Tots els circuits (Blocs Ocupats) estan representats per una Icona Indicadora de Via
ArrowIconsTitle = Icona d'Entrada

SelectType      = Selecciona el tipus...
SelectLevel     = Selecciona el nivell...
selectLevel     = Nivell {0} elements
MemoryInput     = Entrada de Mem\u00f2ria
Shape           = Forma

#ShapeDrawer menu items
drawShapes      = Dibuixa formes
drawSth         = Dibuixa {0}...
#drawRectangle   = etc. replaced by drawSth{}...
lineWidth       = Gruix de la L\u00ednia
thin            = Estreta
thick           = Gruixuda
lineColor       = Color de la L\u00ednia
fillColor       = Color de Farciment
transparency    = Transpar\u00e8ncia del Color
transparent     = Transparent
opaque          = Opac
cornerRadius    = Radi de Cantonada
circleRadius    = Radi del Cercle
editShape       = Edita la forma {0} 
newShape        = Nova forma {0} 
Polygon         = Pol\u00edgon
Rectangle       = Rectangle
roundRect       = Rectangle Arrodonit
disableShapeSelect= Deshabilita seleccionar Formes

attributeTab	= Colors i Tamanys
advancedTab		= Control de visibilitat
drawInstructions1 = Estableix els atributs per a la forma.  Despr\u00e9s fes 
drawInstructions2 =  Arrossega "selecciona rectangle" per a mantenir la forma.
drawInstructions2a = clic del ratol\u00ed per a crear els v\u00e8rtexs del pol\u00edgon.
drawInstructions2b = Clic doble en un v\u00e8rtex per a completar el pol\u00edgon.
drawInstructions2c = Use Add or Delete keys to add or delete a vertex.
drawInstructions3a = (Opcional) Per a controlar la visibilitat d'una forma,
#drawInstructions3b = entra el nom d'un sensor a la casella de text.
VisibleSensor   = Control de Visibilitat/Nivell
SensorMsg       = Un sensor Actiu pot amagar una forma o canviar el nivell de visibilitat
HideOnSensor    = Amaga la forma
ChangeLevel     = Canvia el nivell
SameLevel       = Mateix nivell
ButtonAddVertex = Afegeig V\u00e8rtex
ButtonDeleteVertex = Esborra V\u00e8rtex

TitleCircuitDialog = Nou circuit de Via (Bloc Ocupat)
ButtonAddCircuit = Afegeix Circuit de Bloc Ocupat
ButtonOpenCircuit = Mostra Bloc Ocupat
ButtonConvertIcon= Converteix les icones
ButtonDelete    = Elimina Circuit de Bloc Ocupat
buttonAddPath   = Desa el Cam\u00ed
buttonDeletePath= Elimina el Cam\u00ed
buttonClearSelection = Neteja Selecci\u00f3
buttonChangeName = Canvia el Nom
buttonDeletePortal= Elimina el  Portal
ButtonNextCircuit = Seg\u00fcent Circuit
OpenSensorPicklist= Obre llista de selecci\u00f3 de Sensor

#labels
createOBlock    = Crea un circuit de Via de Bloc Ocupat
sysnameOBlock   = El Nom de Sistema de Bloc Ocupat ha de comen\u00e7ar per "OB"
selectOBlock    = Selecciona un circuit de via de Bloc Ocupat
numTrackElements= Nombre d'icones de via en el circuit
Segments        = Segments
ErrorSensor     = Error Sensor
#ErrorSensorMsg  = Error Sensor:
ErrorPortal     = Error Portal
blockState      = Estat del Circuit (Bloc Ocupat) 
AddRemoveIcons  = Selecciona (o deselecciona) totes les icones de via que mosten aquest circuit de Via de Bloc ocupat
blockName       = Nom del Circuit
portalName      = Nom del Portal
makePortal      = Crea un Portal
PortalTitle     = Portals d'entrada i sortida del circuit {0}
selectPortal    = Per crear la icona d'un portal a la llista, selecciona'l de la llista,
dragIcon        = despr\u00e9s arrosega la icona a la seva posici\u00f3 en els circuits del Panell.
portalIconPosition=La icona d'un portal ha de tocar els dos blocs del Portal.
placeIconOnGap  = Arrossega la icona ressaltada a una posici\u00f3 a cavall entre els dos circuits de blocs ressaltats.
enterNameToDrag = Per a fer un nou portal, entra text a la casella Nom de Portal,
dragNewIcon     = despr\u00e9s arrosega la icona al panell per a crear el portal i la seva icona
PathTitle       = Camins a trav\u00e9s del circuit de vies {0}
pathName        = Nom del Cam\u00ed
enterNewPath    = Per a fer un Nou Cam\u00ed, entra text a la casella Nom de Cam\u00ed
selectPathIcons = despr\u00e9s selecciona les icones de via i portal que mostren el cam\u00ed.
pressAddButton  = DESPR\u00c9S prem el bot\u00f3 [Desa el Cam\u00ed].
selectPath      = Per a editar un Cam\u00ed de la llista, selecciona'l a la llsita
editPathIcons   = despr\u00e9s selecciona o deselecciona les icones de portal i via.
throwPathTO     = Per obtenir la posici\u00f3 correcte d'una agulla per a un cam\u00ed, 
holdShiftDown   = prem l'agulla amb la tecla Shift premuda.
makePath        = Fes un cam\u00ed
#DragOccupancyName = Drag name of Sensor that can detect occupancy to the {0} field.
editCiruit      = Edita Circuit
PortalDirection1= Estableix la icona que indiqui l'entrada en un bloc "{0}".
PortalDirection2= La icona mostra el sentit del moviment
PortalDirection3= quan una ADVERT\u00c8NCIA \u00e9s assignada i establerta.
PortalDirection4= Selecciona un portal per a mostrar el seu sentit d'entrada en el bloc.
PortalDirection5= Selecciona la icona desitjada per canviar la ico0na de sentit.
noIcon          = Cap Icona
parallelPortal  = {0} i {1} s\u00f3n Portals entre {2} i {3}.\nSi \u00e9s incorrecte, elimina'n un dels dos.
NoSensorManager = No SensorManager for this protocol, shape cannot acquire a sensor.

detectorSensorName = Entra el nom del sensor que detecta ocupaci\u00f3 per a aquest circuit de via
detectorErrorName = Entra el nom del sensor que indica problemes d'alimentaci\u00f3 en aquest circuit de via

selectAdjacentCircuit = Selecciona un circuit de via adjacent a "{0}" per a crear un portal entre ells.

ToolTipConvertIcon = Converteix icones de circuit a icones d'Indicaci\u00f3 de Circuit.  (potser cal reposicionar o reorientar)
ToolTipDeleteCircuit= Elimina aquest circuit de via per\u00f2 manten les icones, si n'hi han.
TooltipBlockName = Entra un nom per a a canviar el nom d'usuari del Bloc Ocupat per a aquest circuit.
TooltipBlockLength=Entra una longitut pel cam\u00ed en aquest Bloc Ocupat.
TooltipPathLength=Entra una longitut pel cam\u00ed anomenat.
TooltipPathUnitButton = Click to switch the unit of length between metric and imperial.
ToolTipAddPath  = Entra un nom, despr\u00e9s selecciona les icones que mostren\nla via i els portals del cam\u00ed. Despr\u00e9s prem aquest bot\u00f3.
ToolTipDeletePath = Elimina el cam\u00ed seleccionat a la llista del circuit de vies. 
#ToolTipEditPath = Select a path from the list to display it.  Then add or delete the icons of the path. 
ToolTipClearList = Neteja les seleccions de la llsita.
TooltipPathName = Entra el nom dels camins a trav\u00e9s d'aquest circuit de vies.
TooltipPortalName= Entra un nom per a crear un nou portal al Bloc Ocupat "{0}".
ToolTipChangeName= Entra un altre nom per a canviar el nom d'una selecci\u00e7o de la llista.
ToolTipDeletePortal= Elimina el portal seleccionat i la seva icona.
ToolTipPickLists = La llista mostra una selecci\u00f3  de sensors per a fer detecci\u00f3

# error/warning messages
NeedDataTitle   = Si us plau entra informaci\u00f3
#enterOBlockName
AskTitle        = Qu\u00e8 cal fer?
blockExists     = El Circuit "{0}" o "{1}" ja existeixen. Els vols editar?
AlreadyEditing  = Edici\u00f3 d'un Circuit de Detecci\u00f3 en progr\u00e9s. Si us plau acaba l'edici\u00f3 abans d'inicar una nova edici\u00f3.
whichCircuit    = Quin Circuit de Via per a la Icona
iconBlockConflict = Aquesta icona mostra el circuit de via "{0}".  Vols canviar per a mostrar el circuit "{1}"?
incompleteCircuit = Circuit de Via Incomplet
notIndicatorIcon = No totes les icones de via s\u00f3n icones indicadores. Les vols convertir?
noSensor        = Cap sensor de detecci\u00f3
noDetecterSensor = Cap sensor de detecci\u00f3 especificat. Aquest ser\u00e0 un bloc sense detecci\u00f3 i no es podr\u00e0 usar en interlock.
badSensorName   = "{0}" no \u00e9s un nom de sensor v\u00e0lid.
mixedSensors    =  No s'ha especificat cap sensor de detecci\u00f3.  Vols utilitzar el sensor d'error per ocupaci\u00f3?
makePaths       = Cam\u00ed necessari
pathsNeedConversion = Totes les icones han de ser indicadores per a fer un cam\u00ed.  Les vols convertir a indicadores?
noIcons         = Cap Icona
needIcons       = El circuit de Bloc "{0}" necessita com a m\u00ednim  una icona de via.\nUtilitza "Edita Circuit de Via" per afegir icones d'Indicador de Via.
needConversion  = El circuit de Bloc "{0}" necessita convertir les icones de via a icones d'indicador de via\nUtilitza "Edita Circuit de Via" per convertir.
iconNotOnAdjacent = Icona de Portal "{0}" no s'ajusta al circuit "{1}" a un circuit adjacent.
badPath         = Cam\u00ed Inv\u00e0lid
iconNotInCircuit = Aquesta icona no \u00e9s part del circuit de via {0}.
portalNotInCircuit =  Aquest portal no \u00e9s part del circuit de via {0}.
portalNeedsBlock = El Portal "{0}" necessita tenir un Bloc Ocupat a cada costat.
needPortalName  = Entra el nom per a un nou portal o selecciona un portal de la llista.
needPathName    = Entra el nom per a un nou cam\u00ed o selecciona un cam\u00ed de la llista.
iconNotOnBlock  = La icona del  Portal no connecta amb el circuit "{0}".\n{1}.\nReposiciona per connectar blocs o escull una altra icona.  
repositionPortal= Vols canviar el Portal "{0}" i establir connexions entre els circuits "{1}" i "{2}"?.
portalIconExists= El Portal "{0}" est\u00e0 definit.  Mira la icona resaltada.
portalExists    = El Portal anomenat "{0}" ja existeix entre Blocs Ocupat "{1}" i "{2}".
changeBlockName = Entra un nom d'usuari per el circuit de Bloc Ocupat.
changePortalName= Selecciona un portal de la llista. Entra el canvi de nom. Prem el bot\u00f3 [Canvia el Nom].
changePathName  = Selecciona el cam\u00ed de la llista. Entra el canvi de nom. Prem el bot\u00f3 [Canvia el nom].
confirmBlockDelete = Est\u00e0s segur d'eliminar el circuit i totes els camins i portals?
confirmPortalDelete = Elimina el portal "{0}" i les seves icones?
duplicatePathName = El cam\u00ed "{0}" \u00e9s el nom d'un altre cam\u00ed en el circuit {1}.
noSuchPortal    = No hi ha cap portal anomenat "{0}".
portalHasIcon   = El Portal "{0}" t\u00e9 una icona. Ara est\u00e0 ressaltat.
invalidPortal   = El Portal "{0}" enlla\u00e7at al Bloc d'Ocupaci\u00f3 "{1}" \u00e9s inv\u00e0lid - nom\u00e9s un bloc. 
noPathIcons     = Per visualitzar el cam\u00ed d'un circuit com a m\u00ednim cal seleccionar una icona.
turnoutNotSet   = L'agulla "{0}" cal selceccionar-la desviada o directa.
tooManyPortals  = Un cam\u00ed no pot tenir m\u00e9s de dues icones de portal.       
tooFewPortals   = Un cam\u00ed ha de tenir com a m\u00ednim un portal.
balloonTrack    = El cam\u00ed "{0}" \u00e9s un bucle?\n({1} \u00e9s un portal d'entrada i de sortida)
sensorFail      = El sensor ha fallat per "{0}" degut a {1}.
noPortalIcon    = El Portal "{0}" no t\u00e9 una icona.  Vols afegir una icona de portal?
portalIconMisplaced = La icona de portal "{0}" est\u00e0 posicionada incorrectament o\nel seu circuit adjacent t\u00e9 icones sense convertir.
blocksEtcOK     = Els Blocs Ocupats, Portals i Camins actuals s\u00f3n consistents i sense errors.
cantSaveIcon    = Nota: La informaci\u00f3 d'icones no convertides del circuit no es pot desar.
replacePortalBlock = Canvia les connexions de portal de {0} a {1} amb {0} a {2}?\nSi l'acci\u00f3 ja est\u00e0 presa, {0}\ camins de {1} aniran cap a {2}.
savePath        = Vols desar el cam\u00ed "{0}"?
changePath      = El cam\u00ed "{0}" ha canviat. Vols canviar-ho?
samePath        = El cam\u00ed \u00e9s el mateix que el cam\u00ed "{0}".\nVols canviar el nom a "{1}"?
noPortalIcons   = El cam\u00ed t\u00e9 portals per\u00f2 s'han definit icones de portal.
samePathName    = El cam\u00ed "{0}" ja est\u00e0 definit. Escull un altre nom.
hasPathErrors   = El Circuit de Bloc t\u00e9 definicions de cam\u00ed incompletes.  Vols sortir?
noPaths         = El bloc de circuit "{0}" no t\u00e9 camins.
waitForPalette  = Si us plau espera mentre es carrega la paleta d'elements...
multipleBlockSelections=Escull quin portal de bloc marcat s'ha de connectar amb "{0}".
multipleSelections = Les icones estan superposades.\nSelecciona quina vols.
multipleBlocks  = Escull quin bloc adjacent per usar en el Portal {0}
MustBeFloat     = {0} \u00e9s un nombre inv\u00e0lid.  Ha de ser un nombre decimal positiu.
