# ControlPanelBundle_fr.properties
#
## French properties for the jmrit.display.controlPanel package
## Updated by BLOREC Herv\u00e9 <bzh56420@yahoo.fr> 2020-11-22

#Title         = Commande \u00c9diteur de Panneau
AboutWarrant    = A propos des Bulletins
AboutOCanton     = A propos des OCantons & Portails
AboutCircuitMenu = A propos du Constructeur de Circuits
OpenCircuitMenu = Ouvrir le Constructeur de Circuit

# \u00e9l\u00e9ments du menu CircuitBuilder
CircuitBuilder  = Constructeur de Circuit
newCircuitItem  = Ajouter un Circuit D\u00e9tecteur
editCircuitItem = \u00c9diter Circuit OCanton
OpenCircuitItem = \u00c9diter Voie "{0}"
OpenPortalTitle = \u00c9diter "{0}" Portails
OpenDirectionTitle = Editer "{0}" Portail Fl\u00eaches Direction
OpenSignalsTitle= Modifier "{0}" M\u00e2ts de signalisation
OpenPortalTitle2= Ajouter/\u00c9diter Portails entre "{0}" et "{1}"
OpenPathTitle   = Ajouter/\u00c9diter "{0}" Chemins
noCircuitsItem = Pas de circuits de d\u00e9tection de d\u00e9finis
editCircuitPathsItem = Modifier Circuit Chemins
editPortalsItem = Modifier Circuit Portails
editSignalItem = Ajouter/Modifier les M\u00e2ts de Signalisation
editDirectionItem = Modifier Ic\u00f4nes Portail de Direction
circuitErrorsItem = V\u00e9rifications des erreurs
blockNeedsIconsItem = Circuits sans ic\u00f4nes
iconsNeedConversionItem = Mise en \u00e9vidence des ic\u00f4nes de voie n\u00e9cessitant une conversion
iconsNeedsblocksItem = Mise en \u00e9vidence des indicateurs de voie sans circuits
blocksNeedConversionItem = Circuits dont les ic\u00f4nes ont besoin de conversion
blockNeedsPortals= Circuits ayant besoin de portails
blockNeedsPaths = Circuits ayant besoin de chemins
blockNeedLength = Circuits n\u00e9cessitant une longueur de canton
portailsMisplaced = Circuits avec des ic\u00f4nes de portail mal plac\u00e9es
iconesNeedPositioning = Mettre en \u00e9vidence les ic\u00f4nes de portail mal plac\u00e9es
UnattachedMasts = Mettre en \u00e9vidence les ic\u00f4nes des signaux qui ne sont pas r\u00e9gl\u00e9s pour prot\u00e9ger 
UnprotectingMasts= Signaux non r\u00e9gl\u00e9s pour prot\u00e9ger les cantons
portalNeedsIcon = Portails sans ic\u00f4nes sur ce panneau
portalsHaveIcons= Tous les portails ont des ic\u00f4nes de portail
portalsInPlace = Toutes les ic\u00f4nes du portail sont bien positionn\u00e9es
circuitsHavePortalsPaths= Tous les circuits ont des portails et des chemins
blocksHaveLength= Tous les circuits ont une longueur de canton
mastsInPlace = Tous les signaux sont configur\u00e9s pour prot\u00e9ger les cantons
CheckPortalPaths = V\u00e9rifier les erreurs de portail et de chemin
noTrackCircuits = Aucun circuit de Voie (OCantons) n'est d\u00e9fini
circuitsHaveIcons = Tous les circuits (OCantons) ont des ic\u00f4nes de Voie
IconsHaveCircuits = Chaque ic\u00f4ne de Indicateur de Voie appartient \u00e0 un circuit de Voie
noIndicatorTrackIcon=  Pas d'ic\u00f4nes d'indicateurs de Voie sur le panneau
circuitIconsConverti = Les circuits avec Voie sont repr\u00e9sent\u00e9s par des ic\u00f4nes Indicateurs de Voie 
noneNeedConversion= Aucune ic\u00f4ne de Voie n'a besoin d'\u00eatre convertie
ArrowIconsTitle = Ic\u00f4ne d'Entr\u00e9e
AboutCircuitBuilder= Aide CircuitBuilder 
signal = signal

SelectType      = S\u00e9lectionner le Type
SelectLevel     = S\u00e9lectionner le Niveau
selectLevel     = Niveau {0} \u00e9l\u00e9ments
MemoryInput     = Entr\u00e9e M\u00e9moire
Shape           = Forme

# \u00c9l\u00e9ments du menu ShapeDrawer
drawShapes = Dessiner des Formes
drawSth = Dessiner {0}...
#drawRectangle   = etc. replaced by drawSth{}...lineWidth = Epaisseur de ligne
lineWidth       = \u00C9 paisseur de Ligne
thin = mince
thick = \u00e9pais
lineColor = Couleur de Ligne
fillColor = Couleur de remplissage
transparency = Transparence du remplissage
transparent = Transparent
opaque = Opaque
cornerRadius = Rayon
circleRadius = Rayon du Cercle
editShape = Modifier Forme "{0}"...
newShape = "{0}" Nouvelle Forme
Polygon = Polyg\u00f4ne
Rectangle = Rectangle
roundRect = Rectangle Angles Arrondis
disableShapeSelect= D\u00e9sactiver la S\u00e9lection des Formes
cancelFrame = Voulez-vous annuler le changement sur la trame {0} ? 

attributTab = Couleurs et Tailles
advancedTab = Contr\u00f4le de la Visibilit\u00e9
drawInstructions1 = D\u00e9finir les attributs de la forme. Ensuite, faire une
drawInstructions2 = "selection rectangle" dans le panneau pour maintenir la forme
drawInstructions2a = clic de souris sur les sommets pour cr\u00e9er la polyligne.
drawInstructions2b = Double-cliquez sur un sommet pour terminer la polyligne.
drawInstructions2c = Utilisez les touches Ajouter ou Supprimer pour ajouter ou supprimer un sommet.
drawInstructions3a = (Facultatif) Pour contr\u00f4ler la visibilit\u00e9 de la polyligne,
#drawInstructions3b = Entrez le nom d'un capteur dans le champ [{0}] ci-dessous.
VisibleSensor = Commande de visibilit\u00e9
SensorMsg       = Le capteur actif peut soit cacher la forme soit changer son niveau d'affichage
NoSensorManager = Pas de SensorManager pour ce protocole, la forme ne peut pas acqu\u00e9rir un capteur.
HideOnSensor    = Masquer Forme
ChangeLevel     = Changer Niveau
SameLevel       = M\u00eame Niveau
ButtonAddVertex = Ajouter un Sommet
BoutonDeleteVertex = Supprimer un Sommet

ButtonAddCircuit = Ajouter OCanton Circuit
ButtonOpenCircuit = Afficher OCanton
ButtonConvertIcon = Convertir des Ic\u00f4nes
ButtonDelete = Supprimer Circuit OCanton
buttonAddPath = Sauvegarder le Chemin
buttonDeletePath = Supprimer Chemin
buttonClearSelection = Effacer la s\u00e9lection
buttonChangeName = Modifier le nom
buttonCreate	= Cr\u00e9er OCanton
buttonDeletePortal = Supprimer  Portail
ButtonNextCircuit = Circuit Suivant
ButtonAddMast = Configurer le Feu
ButtonRemoveMast= Supprimer le Feu
OpenSensorPicklist = Ouvrir La Liste de Choix des Capteurs
ButtonCreateMast= Ouvrir Tableau des M\u00e2ts de Signalisation 
ButtonCreateHead= Ouvrir Tableau des Feux

# \u00c9tiquettes
createOBlock = Cr\u00e9er un circuit de voie OCanton
sysnameOBlock   = Nom Syst\u00e8me OCantan doit commencer par "OB"
blankUserName = Il est recommand\u00e9 d'utiliser un nom utilisateur qui ne soit pas vide.
selectOBlock = S\u00e9lectionnez un circuit de voie OCanton:
numTrackElements = nombre d'ic\u00f4nes de voie dans le Circuit:
Segments = Segments
ErrorSensor = Capteur d'Erreurs
ErrorPortal = Erreur Portail
cantonkState = \u00c9tat Circuit (OCanton):
editCiruit = Modifier Circuit 
DragOccupancySensor = D\u00e9placez le nom d'un capteur qui peut d\u00e9tecter l'occupation vers le champ "{0}".
detectorSensorName = Entrez le nom du capteur qui d\u00e9tecte l'occupation pour ce circuit de voie
detectorErrorName = Saisissez le nom du capteur qui indique les probl\u00e8mes d'alimentation de ce circuit de voie
AddRemoveIcons = Cochez (ou d\u00e9cochez) toutes les ic\u00f4nes de voie qui affichent ce circuit de voie OCanton
BlockName = Nom du Circuit:
BlockLength		= Longueur Canton

makePortal = Faire un Portail
PortalTitle = Portails dans et hors du circuit "{0}" 
portalName = Nom du Portail
PortalDirection1 = D\u00e9finir les ic\u00f4nes qui indiquent l'entr\u00e9e dans le canton "{0}" .
PortalDirection2 = L'ic\u00f4ne indique la direction du mouvement
PortalDirection3 = Lorsqu'une Autorisation Restrictive est attribu\u00e9e .
PortalDirection4 = Choisir un Portail de montrer son sens de l'entr\u00e9e dans le Canton.
PortalDirection5 = S\u00e9lectionnez l'ic\u00f4ne ci-dessous pour changer l'ic\u00f4ne de direction.
selectPortal = Pour cr\u00e9er une ic\u00f4ne pour un Portail dans la liste, s\u00e9lectionnez-le et faites glisser l'ic\u00f4ne.
noIcon = Pas Ic\u00f4ne
dragIcon = Faites glisser l'ic\u00f4ne ci-dessous jusqu'\u00e0 sa position sur le panneau.
portIconPosition1=Une ic\u00f4ne de portail doit toucher les ic\u00f4nes des cantons de chaque c\u00f4t\u00e9 du portail.
portIconPosition2=Si les cantons ne sont pas adjacents, faites glisser une deuxi\u00e8me ic\u00f4ne vers l'autre canton.
enterNameToDrag = Pour cr\u00e9er un nouveau portail, entrez du texte dans la case Nom du portail,
dragNewIcon = puis faites glisser l'ic\u00f4ne ci-dessous vers le panneau pour cr\u00e9er \u00e0 la fois le portail et son ic\u00f4ne.

PathTitle = Chemins \u00e0 travers le circuit de la voie {0}
pathName = Nom du chemin
enterNewPath = Pour cr\u00e9er un nouveau chemin, entrez le texte dans le champ Path Name
selectPathIcons = s\u00e9lectionnez ensuite les ic\u00f4nes de voie et de portail indiquant le chemin.
pressAddButton = Appuyez sur le bouton {0}.
selectPath = Pour modifier un chemin dans la liste, s\u00e9lectionnez-le dans la liste
editPathIcons = puis s\u00e9lectionnez ou d\u00e9s\u00e9lectionnez le portail et les ic\u00f4nes de suivi.
throwPathTO = pour obtenir la position correcte d'un chemin, 
holdShiftDown = S\u00e9lectionner, puis cliquez sur le participant avec la touche Majuscule vers le bas.
makePath = Cr\u00e9er un chemin
pathLength = Longueur du chemin
convert = Ic\u00f4ne de conversion
skip = Continuer

SignalTitle = Circuit de protection des signaux {0}
signalDescription=Signal {0} sur le portail "{1}"
mastName = Nom du Feu
configureSignal = Configure Feu
recomendMasts = Les Feux peuvent \u00eatre utilis\u00e9es comme signaux, mais les m\u00e2ts sont recommand\u00e9s.
addSignalConfig = Pour configurer un Feul : S\u00e9lectionnez d'abord un portail d'entr\u00e9e dans la liste ci-dessus.
selectPortalProtection= S\u00e9lectionnez un portail pour configurer un Feu pour la protection de {0}.
selectSignalMast= Tapez un nom de Feu ou faites-le glisser depuis une liste de s\u00e9lection dans le champ Nom Feu.
pressConfigure = Cliquez sur [{0}] pour d\u00e9finir le Feu de protection au niveau du portail.
addSignalIcon = Pour ajouter une ic\u00f4ne pour un Feu de protection, faites glisser l'ic\u00f4ne ci-dessous
positionMast = \u00e0 une position o\u00f9 le portail prot\u00e8ge le Canton.
modifySignal = pour cr\u00e9er, modifier le nom ou supprimer un signal, ouvrez la table des feux.
entranceSpace = Ajustement de l'espace d'entr\u00e9e
noMast = Aucun signal ne prot\u00e8ge {1} au portail "{0}".
setSignal = Le Feu "{0}" prot\u00e8ge-t-il ?
spaceChanged = Le r\u00e9glage de l'entr\u00e9e pour le Feul "{0}" au portail "{1}" est modifi\u00e9.
unattachedMast = Le Feu "{0}" n'est pas r\u00e9gl\u00e9 pour prot\u00e9ger un Canton.
attachMast = Voulez-vous que le m\u00e2t {0} prot\u00e8ge le Canton {1} au Portail "{2}" ?
replaceSignalMast = Voulez-vous remplacer le Feu {0} par le Feu {1} au niveau du Portail "{2}" ?
mastProtectsPortal=Le M\u00e2t de Signalisation {0} prot\u00e8ge le Canton {1} au niveau du Portail "{2}".
removeSignalMast=Voulez-vous supprimer le Feu {0} au niveau du Portail "{1}" ?
noPortalProtection=Il n'y a pas de Feu configur\u00e9 pour prot\u00e9ger le Canton {0} au Portail "{1}".
DragMast = Faites glisser le nom d'un Feul vers le champ {0}.
NotFound = Feu nomm\u00e9 "{0}" non trouv\u00e9.

ToolTipAddToTable = Ouvrir la fen\u00eatre pour cr\u00e9er un nouveau Feu
ToolTipConvertIcon = Convertir ic\u00f4nes circuit en des ic\u00f4nes Indicateur de Voie (R\u00e9orientation ou positionnement peuvent \u00eatre n\u00e9cessaires)
ToolTipDeleteCircuit = Supprimer ce circuit de voie, mais garder ses ic\u00f4nes, le cas \u00e9ch\u00e9ant.
TooltipCantonName = Entrez un nom pour modifier le Nom Utilisateur du OCanton pour ce Circuit.
TooltipCantonLength= Entrez une longueur pour les Chemins dans ce OCanton.
TooltipPathLength= Entrez une longueur pour le chemin nomm\u00e9 ci-dessus.
TooltipPathUnitButton = Cliquez pour changer l'unit\u00e9  de longueur entre m\u00e9 trique et anglaise.
ToolTipAddPath = Entrez un nom, puis s\u00e9lectionner les ic\u00f4nes qui montrent\nla voie et les portails de la voie. Ensuite, appuyez sur ce bouton.
ToolTipDeletePath = Supprimer le chemin s\u00e9lectionn\u00e9 dans la liste depuis le circuit de voie.
ToolTipClearList = Effacer les s\u00e9lections dans la liste.
TooltipPathName = Entrez le nom du Chemin \u00e0 travers ce Circuit de voie.
ToolTipMastName	=  Entrez le nom pour configurer un M\u00e2t de Signalisation pour prot\u00e9ger le canton "{0}".
TooltipPortalName = Entrez un nom pour cr\u00e9er un nouveau portail pour le OCanton "{0}" .
ToolTipChangeName = Entrer un autre nom pour modifier le nom d'une s\u00e9lection dans la liste ci-dessus.
ToolTipDeletePortal = Supprimer le portail s\u00e9lectionn\u00e9 et son ic\u00f4ne.
ToolTipPickLists = Le tableau de la liste de s\u00e9lection affiche un choix de capteurs pour faire la d\u00e9tection.
ToolTipAddMast = Configure le m\u00e2t de signalisation pour prot\u00e9ger {0} au niveau du portail s\u00e9lectionn\u00e9. (N'ajoute pas son ic\u00f4ne)
ToolTipRemoveMast=Supprime la protection du signal au portail s\u00e9lectionn\u00e9 de {0}. (Ne supprime pas le signal

# Messages d'erreur/d'avertissement
NeedDataTitle = Veuillez entrer des donn\u00e9es
cannotEditCB = Impossible de modifier pendant l'ex\u00e9cution ou l'affichage d'un Bulletin.\n (bulletint "{0}")
AskTitle = Que ferons-nous?
duplicateName	= "{0}" est un nom en double pour le circuit {1}.
AlreadyEditing = Modification d'un circuit de d\u00e9tection en cours. S'il vous pla\u00eet Terminez avant de commencer une nouvelle \u00e9dition.
whichCircuit = Quel Circuit de Voie pour l'Ic\u00f4ne?
iconBlockConflict = Cette ic\u00f4ne affiche le circuit de voie "{0}". Voulez-vous changer pour afficher le circuit "{1}"?
incompleteCircuit = Circuit de Voie incomplet
notIndicatorIcon = Les ic\u00f4nes de voie ne sont pas des ic\u00f4nes indicateur. Voulez-vous convertir?
noSensor = Pas de Capteur de D\u00e9tection
noDetecterSensor = Pas de capteur de d\u00e9tecteur sp\u00e9cifi\u00e9. Ce sera un Canton \u00c9teint et ne peut \u00eatre inclus dans un dispositif de verrouillage.
badSensorName = "{0}" ne peut pas \u00eatre utilis\u00e9 comme un nom de Capteur.
DuplSensorRemoved= Erreur du Capteur( en double) de voie {0} supprim\u00e9.
mixedSensors = Pas de Capteur de d\u00e9tection sp\u00e9cifi\u00e9. Voulez-vous utiliser le Capteur d'Erreur pour occupation?
makePaths = Chemin Exig\u00e9
noIcons = Pas d''Ic\u00f4nes
needIcons = Le circuit de voie "{0}" a besoin d'au moins une ic\u00f4ne Indicateur de voie.\nUtilisez le menu "{1}" pour ajouter ou convertir des ic\u00f4nes de voie.
#needConversion  = Le Circuit Canton "{0}" a besoin de convertir des ic\u00f4nes voie en ic\u00f4ne Indicateur de Voie.\nUtilisez son m\u00e9nu "{1}" > [{2}] pour convertir les ic\u00f4nes.
cantSaveIcon = Les ic\u00f4nes de voie dans le circuit (OCanton) "{0}" doivent \u00eatre converties avant d'enregistrer le fichier de panneau.
needPortal =  circuit de Canton (OCanton) "{0}" n'a pas de portails.\nLes portails sont n\u00e9cessaires pour ajouter un {1} dans CircuitBuilder.
needPortalIcons = circuit de Canton "{0}" a besoin d'ic\u00f4nes de portail.\nLes ic\u00f4nes de portail sont n\u00e9cessaires pour ajouter un {1} dans CircuitBuilder.
noPortalIcon = Le portail "{0}" n'a pas d'ic\u00f4ne.\nDes ic\u00f4nes de portail sont n\u00e9cessaires pour ajouter un {1} dans CircuitBuilder.
noBlockLength = Les circuits de Canton doivent avoir une longueur par d\u00e9faut pour que leurs chemins aient des longueurs.
BlockPaths = Chemin de Canton
BlockPortals = Portail de Canton
BlockSignal = Sgnal de Canton
DirectionArrow = Fl\u00e8che de direction
PortalOrPath = Portail ou chemin
badPath = Chemin invalide
iconNotInCircuit = Cette ic\u00f4ne ne fait pas partie du circuit de voie "{0}" .
portalNotInCircuit = Ce portail fait pas partie du circuit de voie "{0}" .
portalHasNoIcon	= Le Portail {0} a besoin d'une ic\u00f4ne pour indiquer la direction des Bulletins.
portalNeedsBlock = Le portail "{0}" a besoin d'avoir un OCanton de chaque c\u00f4t\u00e9
needPortalName = Entrez le nom d'un nouveau portail ou s\u00e9lectionner un portail dans la liste ci-dessus.
needPathName    =Entrez le nom d'un nouveau chemin  ou s\u00e9lectionner un chemin dans la liste ci-dessus.
duplicatePortalIcon=Double ic\u00f4ne de portail. Voir l'ic\u00f4ne en surbrillance.
iconNotOnBlock = Ic\u00f4ne Portail "{0}" \nmal positionn\u00e9e entre les circuits "{1}" et "{2}" .
icondNeedsAdjacent= Ic\u00f4ne pour {0} non positionn\u00e9 sur un canton adjacent.
moveOffBlock = Ic\u00f4ne pour {1} ne peut pas \u00eatre d\u00e9plac\u00e9 hors du canton "{0}".
repositionPortal= Voulez-vous changer les connexions du portail "{0}" pour qu'elles soient entre les circuits "{1}" et "{2}" ?
portalIconExists= Le portail "{0}" est d\u00e9fini.  Voir l'ic\u00f4ne en surbrillance.
portalExists = Le portail "{0}" existe d\u00e9j\u00e0 entre les OCantons "{1}" et "{2}".
signalExists = Le signal nomm\u00e9 "{0}" existe d\u00e9j\u00e0. Ne peut pas \u00eatre renomm\u00e9 "{1}".
portalWant2Icons=Portal "{0}" a une ic\u00f4ne.\nVous voulez ajouter une autre ic\u00f4ne pour le connecter \u00e0 un canton non adjacent ?
changeBlockName = Le nom utilisateur "{0}" pour le circuit {1} n'a pas \u00e9t\u00e9 enregistr\u00e9.
changePortalName= S\u00e9lectionnez un portail dans la liste ci-dessus. Saisissez le changement de nom et appuyez sur "{0}".
changeOrCancel = Voulez-vous changer le nom "{0}" du circuit {2} en "{1}" ?
changePathName = S\u00e9lectionnez un chemin dans la liste ci-dessus. Saisissez le changement de nom et appuyez sur "{0}".
confirmBlockDelete = Êtes-vous sûr de vouloir supprimer le circuit et tous ses chemins ainsi que tous ses portails ?
confirmPortalDelete = Supprimer le portail "{0}" et son ic\u00f4ne ? La suppression d'un portail modifie tous les chemins utilisant ce dernier.
duplicatePathName = Le chemin "{0}" est le nom d'un autre chemin dans le circuit {1}.
turnoutNotSet = Le chemin "{0}" doit \u00eatre r\u00e9gl\u00e9 sur "Direct" ou "D\u00e9vi\u00e9".
tooManyPortals = Un chemin ne peut pas avoir plus de deux portails.       
tooFewPortals = Un chemin doit avoir au moins un portail.
portalIconMisplaced = Une ic\u00f4ne de portail "{0}" est mal positionn\u00e9e ou son circuit adjacent a des ic\u00f4nes non converties.
BlocksEtcOK = Les OCantons, Portails et Cheminss actuellement d\u00e9finis sont coh\u00e9rents et sans erreur.
pathIconsChanged = Les ic\u00f4nes qui affichent le chemin "{0}" sont modifi\u00e9es.
pathlengthChanged= La longueur du chemin "{0}" est modifi\u00e9e.
saveIcons = Les ic\u00f4nes qui affichent le chemin ont \u00e9t\u00e9 modifi\u00e9es.
saveChanges = Effectuer et enregistrer les modifications ?
changePath = Le chemin "{0}" a \u00e9t\u00e9 modifi\u00e9. Voulez-vous effectuer ce changement ?
samePath = Le chemin "{1}" est le m\u00eame que le chemin "{0}", mais affiche des ic\u00f4nes diff\u00e9rentes.
changeName = Le chemin "{0}" est nomm\u00e9 "{1}". Changer le nom en "{0}" ?
noPortalIconsForPath= Le chemin "{0}" n'a pas d'ic\u00f4nes de portail s\u00e9lectionn\u00e9es. Il en faut au moins une.
noTrackIconsForPath= Chemin "{0}" n'a pas d'ic\u00f4nes de voie s\u00e9lectionn\u00e9es. Il en faut au moins une.
noPortalIcons= Il n'y a pas d'ic\u00f4nes pour les portails.
NoMastIcons = Il n'y a pas d'ic\u00f4nes pour les m\u00e2ts de signalisation.
pathDefined = Le chemin choisi est d\u00e9j\u00e0 d\u00e9fini. Il est "{0}" dans la liste des chemins.
noPaths = Le canton de circuits "{0}" n'a pas de chemins.
noPathIcons = Le chemin "{0}" n'a pas d'ic\u00f4nes pour l'afficher. S\u00e9lectionnez les ic\u00f4nes de chemin et de portail pour l'afficher.
waitForPalette = Veuillez patienter pendant le chargement de la palette d'\u00e9l\u00e9ments...
multipleBlockSelections=Choisissez \u00e0 quel canton le portail mis en \u00e9vidence doit se connecter \u00e0 "{0}".
multipleSelections = Les ic\u00f4nes sont empil\u00e9es les unes sur les autres.\nS\u00e9lectionnez celle que vous voulez.
MustBeFloat = {0} est un nombre non valide. Doit \u00eatre un nombre d\u00e9cimal positif.
notCreated = Le circuit OCanton "{0}" n'a pas \u00e9t\u00e9 cr\u00e9\u00e9.
exitQuestion = \nIgnore message et Quitter ?
continue = Continue ou Quitter ?
portalIconSet = Changer l'ensemble des ic\u00f4nes du portail
