



<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01//FR"
"http://www.w3.org/TR/html4/strict.dtd">

<html lang="fr">
<head>
  <meta name="generator" content=
  "HTML Tidy for Mac OS X (vers 31 October 2006 - Apple Inc. build 15.17), see www.w3.org">

  <title>JMRI Hardware Support - SPROG</title>
  <meta name="author" content="Bob Jacobsen">
  <meta name="keywords" content=
  "SPROG java model railroad JMRI install windows linux mac osx">
  <!--#include virtual="/Style.shtml" -->
</head>

<body>
  <!--#include virtual="/Header.shtml" -->
  <div id="mBody">
    <!--#include virtual="../SidebarUp.shtml" -->
    <div id="mainContent">

      <h1>Support mat&#233;riel : SPROG</h1>

      <ul class="snav">
        <!-- TOC -->

        <li><a href="#hardware">Mat&#233;riel</a></li>

        <li><a href="#limitations">Limitations</a></li>

        <li><a href="#connecting">Connexions</a></li>

        <li><a href="#tools">Outils</a></li>

        <li><a href="#documentation">Documentation</a></li>
      </ul>

      <a name="hardware" id="hardware"></a>
      <h2>Mat&#233;riel support&#233;</h2>

      <h3>Interfaces informatiques</h3>
      JMRI soutient le SPROG &#224; la fois en tant que
      Programmeur de d&#233;codeur, et comme mini-station de commande. Pour en savoir plus
       ces capacit&#233;s, voir le <a href=
      "http://www.sprog-dcc.co.uk/downloads/SprogIIUserGuide.pdf">Manuel SPROG
     </a> sur le <a href="http://www.sprog-dcc.co.uk/"> site web SPROG</a>.

      <p>Notez qu'il existe plusieurs versions diff&#233;rentes du
      mat&#233;riel SPROG, et encore plus de versions du software SPROG
      software.<br>
      Les mod&#232;les SPROG suivants fonctionnent avec la version actuelle de JMRI:</p>
      <ul>
        <li>SPROG II</li>
        <li>SPROG II USB</li>
        <li>SPROG 3 (USB)</li>
        <li>SPROG Nano (uniquement en tant que centrale, en utilisant un booster externe)</li>
        <li>Pi SPROG One</li>
        <li>Pi SPROG Nano</li>
      </ul>

      <a name="connecting" id="connecting"></a>
      <h2>Connexion</h2>

      <h3>C&#226;blage</h3>

      <p>Les SPROG originaux &#233;taient connect&#233;s par un c&#226;ble s&#233;rie &#224; 9 broches.<br>
      Les SPROG actuels ne sont disponibles qu'en USB.<br>
      Connectez votre SPROG &#224; l'aide du c&#226;ble appropri&#233; et mettez-le sous tension.</p>

      <h3>R&#233;glages</h3>

      <ol>
        <li>Drivers USB
        <ul>
          <li>Sur Windows 10, les SPROG connect&#233;s par USB fonctionneront en utilisant les
          Pilotes USB install&#233;s dans le syst&#232;me d'exploitation. Lorsque vous branchez le SPROG,
          il appara&#238;tra sous Mat&#233;riel comme ceci:<br>
          <img src="images/SprogWin10Devices.png" width="244" height="112"><br>
          Si vous avez d&#233;j&#224; install&#233; un pilote USB sp&#233;cial, d&#233;sinstallez-le sous Windows 10
          avant de poursuivre.</li>

          <li>Sur Windows 7 et les versions ant&#233;rieures, les utilisateurs peuvent avoir besoin d'un driver
          install&#233;. Pour plus d'informations &#224; ce sujet, voir le
          <a href=
          "http://www.sprog-dcc.co.uk/downloads/SprogIIUserGuide.pdf">
          Manuel SPROG</a> sur le <a href=
          "http://www.sprog-dcc.co.uk/">Site web de SPROG</a>.<br>
          Les utilisateurs de Windows 7 peuvent &#233;galement &#234;tre int&#233;ress&#233;s par <a href=
          "https://www.youtube.com/watch?v=JUG7dsXi2cI">cette video</a>.</li>

          <li>Sur MacOS, aucun pilote USB pour SPROG ne doit &#234;tre install&#233; pour utiliser SPROG IIv3, SPROG IIv4, SPROG3 ou
          SPROG Nano.
          Ils sont conformes &#224; la norme USB CDC (Communications Class Device) et utilisent les pilotes par d&#233;faut
          inclus avec macOS.</li>

          <li>Pour Linux, il existe de nombreuses variantes d'installation du syst&#232;me Linux, et des variations dans l'installation
          du support USB peut &#234;tre rencontr&#233;, mais en g&#233;n&#233;ral les dispositifs USB CDC sont support&#233;s directement.</li>
        </ul>

        <li>Assurez-vous d'avoir la derni&#232;re version de JMRI. D&#233;marrez
        une des applications JMRI.</li>

        <li>Aller &#224; l'onglet <b>Connexions</b> des pr&#233;f&#233;rences JMRI
        . Il s'ouvre automatiquement la premi&#232;re fois qu'un programme est
        ou vous pouvez le s&#233;lectionner dans le menu "Edition".

        <li>S&#233;lectionnez "SPROG DCC" dans la liste comme syst&#232;me
        Fabricant.
        <img src="images/SprogConnectOptions.png" width="272" height="157" align="right">
        </li>

        <li>Suivant, s&#233;lectionnez l'une des options de connexion au syst&#232;me disponibles;<br>
        SPROG peut soit fonctionner comme un programmeur d&#233;codeur autonome
        ou il peut &#234;tre configur&#233; pour agir comme une mini-centrale
         pour la circulation des trains.<br>
        Une fois votre choix s&#233;lectionn&#233; et enregistr&#233;, JMRI configure les options n&#233;cessaires dans le SPROG.

          <ul>
            <li>Pour le fonctionnement du programmeur, s&#233;lectionnez soit "SPROG", soit "Pi-SPROG One programmeur".
            commeSyst&#232;me de Connexion, comme illustr&#233;:<br>
            <a href="images/SprogPreferences.jpg">
            <img src="images/SprogPreferences.jpg" width="322" height="203">
            </a>
            <p>Dans ce mode, la barre d'&#233;tat en bas du Volet de l'Inventaire DecoderPro
             la fonction inactive en rouge, comme ceci:<br>
            <a href="images/SprogDPStatusbar.png">
            <img src="images/SprogDPStatusbar.png" width="332" height="24"></a></p>
            <p>Si les deux champs de gauche s'affichent en rouge, vous avez peut-&#234;tre
           s&#233;lectionn&#233; la mauvaise connexion au syst&#232;me SPROG.</p>
            </li>

            <li>Pour le fonctionnement de la centrale , s&#233;lectionnez un des choiw "... Centrales".
            .</li>


		<li>Pour utiliser JMRI sans SPROG physique connect&#233;, s&#233;lectionnez "SPROG Simulator".
            Le simulateur imitera le fonctionnement de base en tant que programmeur (par d&#233;faut)
            ou une Centrale. Vous pouvez r&#233;gler le mode sous Param&#232;tres Connexion suppl&#233;mentaire
            .</li>
          </ul>
        </li>

        <li>Ensuite, sous Param&#232;tres, s&#233;lectionnez le port s&#233;rie appropri&#233;, sauf pour le Simulateur.
        Notez que les pilotes USB SPROG appara&#238;tront dans la liste comme un port s&#233;rie,
        comme <tt>cu.usbmodem1411</tt>.</li>

        <li> Acceptez le pr&#233;fixe et le nom de connexion sugg&#233;r&#233;s,
        ou le remplacer par un autre plus adapt&#233;. Veillez &#224; ce qu'il soit unique.</li>

        <li>Cliquez sur "Sauvegarder". On vous demandera si vous voulez le faire 
        pour red&#233;marrer le programme, cliquez sur "Red&#233;marrer" ou "Plus tard".</li>

        <li>Apr&#232;s le red&#233;marrage de JMRI, vous devriez &#234;tre op&#233;rationnel avec la nouvelle connexion.</li>
      </ol>

      <h4>Configuration de SPROG</h4>

      <p>SPROG utilise un "Mot Mode" pour d&#233;finir un certain nombre de
      modes de fonctionnement.</p>

      <p>Dans tous les SPROGs r&#233;cents, la valeur par d&#233;faut du Mot Mode
      est correcte pour les modes "programmeur" et "centrale". Pour
      les SPROG plus anciens, vous pouvez v&#233;rifier ou modifier le mot mode comme
      suit:</p>

      <p>Ouvrir le <fort>Moniteur de commande</fort> et lui
      <strong>Envoyer la commande</strong> outils du menu SPROG. Envoyer
      une commande "M" utilisant  <strong>Envoyer Commande</strong> dans le panneau de commande
      .<br>
      Vous devriez voir une r&#233;ponse dans la fen&#234;tre du moniteur de commande,
      quelque chose comme:<br></p>

      <div style="margin-left : 2em">
        <tt>P&gt;M=h800<br></tt>
      </div>

      <p>Le pr&#233;fixe <tt>h</tt> indique une valeur hexad&#233;cimale. Si le pr&#233;fixe
      valeur que vous voyez est diff&#233;rente, alors il faut le changer en envoyant
      la commande "M h800". Faites suivre cette commande de la commande "W" pour
      enregistrer le changement dans la m&#233;moire EEPROM de SPROG afin qu'il soit
      efficace &#224; chaque fois que vous mettez le SPROG sous tension. Sinon, 
      la nouvelle valeur sera perdue lorsque vous &#233;teignez le SPROG.<br>
      Ne soyez pas tent&#233;s d'exp&#233;rimenter avec d'autres valeurs de Mode Word
      car cela pourrait entra&#238;ner un comportement erratique de votre SPROG.</p>

      <h4>Identification de la version du micrologiciel de votre SPROG</h4>

      <p>Ouvrir le panneau d'outils de la console SPROG &#224; partir du
      SPROG et envoyer une commande " ?
      Vous devriez voir une r&#233;ponse appara&#238;tre dans l'historique des commandes,
      quelque chose comme:<br></p>

      <div style="margin-left : 2em">
        <tt>SPROG II USB Ver 2.3<br>
        P&gt;<br></tt>
      </div>

      <a name="tools" id="tools"></a>
      <h2>Outils JMRI SPROG </h2>
      <img src="images/SprogMenu.png" width="267" height="181" align="right">

      <p>Les outils suivants sont disponibles dans le menu SPROG lorsque 
      la connexion est active:</p>

      <h4><a href=
      "../../../package/jmri/jmrix/sprog/sprogslotmon/SprogSlotMonFrame.shtml">
      Moniteur de Slots Sprog</a></h4>
      (Le moniteur de Slot n'est pas disponible lorsque le SPROG fonctionne en tant que programmeur).

      <h4><a href=
      "../../../package/jmri/jmrix/sprog/sprogmon/SprogMonFrame.shtml">
      Moniteur de Commande Sprog</a></h4>

      <h4><a href=
      "../../../package/jmri/jmrix/sprog/packetgen/SprogPacketGenFrame.shtml">
      Envoyer la commande</a></h4>

      <h4><a href=
      "../../../package/jmri/jmrix/sprog/console/SprogConsoleFrame.shtml">
      Console SPROG</a></h4>

      <h4><a href=
      "../../../package/jmri/jmrix/sprog/update/SprogVersionFrame.shtml">
      Version du micrologiciel SPROG</a></h4>

      <a name="update" id="update"></a>
      <h4>Mise &#224; jour du firmware</h4>

      <p>SPROG comprend un outil de "mise &#224; jour du microprogramme" qui permet 
      au micrologiciel du SPROG (le logiciel interne qui fait fonctionner le SPROG) 
      d'&#234;tre mis &#224; jour par l'utilisateur. L'<a href="../../../package/jmri/jmrix/sprog/update/SprogIIUpdateFrame.shtml">
      outil de mise &#224; jour</a>.<br> prend en charge USB SPROG II (&#224; partir de la version 2.2), SPROG 3 (toutes les versions)
	  et Pi-SPROG One (&#224; partir de la version 2.5). Pour plus d'informations, contactez le fabricant
	  <a href="http://www.sprog-dcc.co.uk/">SPROG DCC</a>

      <a name="documentation" id="documentation"></a>
      <h2>Documentation</h2>

      <h3>Information sur les tiers</h3>

      <p>Pour plus d'informations sur le SPROG, voir <a href=
      "http://www.sprog-dcc.co.uk/index.shtml">le site web de SPROG
      site</a>.<br>
      Ils ont un <a href=
      "http://www.sprog-dcc.co.uk/faq.shtml#General">page FAQ 
      </a> utile.</p>

      <p>Il y a un groupe d'utilisateurs SPROG en<a href="https://groups.io/g/sprog-dcc/topics"></a>.</p>
      <p>langue n&#233;erlandaise <a
      href="https://in03.hostcontrol.com/resources/510743ee26f0d6/cd00fcd9b6/file-object/Handleiding%20Sprog%20v2-2017.pdf">
        Le Manuel du d&#233;butant SPROG</a> est disponible en format PDF &#224; l'adresse suivante
      <a href="https://domburgtrainsupport.nl/informatie/dts-producten">Soutien aux trains de Bombourg</a>.</p>      
      <p>Traduction 2021-02-05</p>
      <!--#include virtual="/Footer.shtml" -->
    </div><!-- closes #mainContent-->
  </div><!-- closes #mBody-->
</body>
</html>

    



   

</html>
