<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01//EN"
"http://www.w3.org/TR/html4/strict.dtd">
<!-- Updated by Herv&#233; Blorec <bzh56420@yahoo.fr>  2013-10-23-->

<html lang="fr">
<head>
  <meta name="generator" content=
  "HTML Tidy for Mac OS X (vers 31 October 2006 - Apple Inc. build 15.17), see www.w3.org">

  <title>JMRI: Modifier l'Aiguillage</title>
  <meta name="author" content="Bob Jacobsen">
  <meta name="keywords" content="JMRI help Layout Editor Turnout">
  <!-- Style -->
  <meta http-equiv="Content-Type" content=
  "text/html; charset=us-ascii">
  <link rel="stylesheet" type="text/css" href="/css/default.css"
  media="screen">
  <link rel="stylesheet" type="text/css" href="/css/print.css"
  media="print">
  <link rel="icon" href="/images/jmri.ico" type="image/png">
  <link rel="home" title="Home" href="/">
  <!-- /Style -->
</head>

<body>
  <!--#include virtual="/Header" -->
<div class="nomenu" id="mBody">
    <div id="mainContent">

      <h1>Modifier l'Aiguillage</h1>

      <h2>Aiguillages</h2>L'&eacute;diteur de R&eacute;seau prend
      en charge six types diff&eacute;rents d'appareils de voie
      (aiguillages): HR (<b>Droit</b>), LH (<b>Gauche</b> ), WYE (
      <b>Sym&eacute;trique</b>),Double Xover( <b>Bretelle
      Double</b>), RH Xover (<b>Bretelle Droite</b>), et Xover
      <b>Bretelle Gauche</b>). L' Les deux autres types d'appareils
      de voie, parfois utilis&eacute;s dans des r&eacute;eaux de
      trains miniatures sont: la jonction double et l'aiguillage
      trois voies, on peut les r&eacute;aliser en utilisant deux
      aiguillages LH ou RH. Une Jonction Double peut &ecirc;tre
      repr&eacute;sent&eacute;e par deux aiguillages droit ou
      gauche avec leurs pointes r&eacute;unies par un court segment
      de voie Une fois qu'un aiguillage a &eacute;t&eacute;
      cr&eacute;&eacute;, son type ne peut pas &ecirc;tre
      chang&eacute;. Changer le type d'un aiguillage
      n&eacute;cessite de le retirer et de recr&eacute;er
      l'aiguillage.

      <h2>Lier Des Dessins d'Aiguillages &agrave; Des Aiguillage
      R&eacute;els</h2>Les dessins d'Aiguillage dans un
      sch&eacute;ma de voies sont dessin&eacute;s en utilisant les
      lignes pleines pour les deux voies directes et divergentes
      jusqu'&agrave; ce que les dessins des Aiguillage soient
      li&eacute;s aux aiguillages dans le Tableau Aiguillage. Une
      fois li&eacute;s aux aiguillages r&eacute;els, les dessins
      d'aiguillages montrent les &laquo;&eacute;tats connus" des
      Aiguillages qu'ils repr&eacute;sentent. Cette
      fonctionnalit&eacute; peut &ecirc;tre
      d&eacute;sactiv&eacute;e en d&eacute;cochant <b>Autoriser
      Animation des Aiguillage</b> dans le menu Options.
      Apr&egrave;s la liaison, vous pouvez basculer chaque
      Aiguillage de votre r&eacute;seau en cliquant sur le point
      central de son dessin (&agrave; condition que <b>Autoriser
      Commandee du R&eacute;seau</b> soit coch&eacute; dans le Menu
      Options, et votre syst&egrave;me DCC met en oeuvre la
      commandele informatique des aiguillages). L' capacit&eacute;
      de basculer en cliquant peut &ecirc;tre
      d&eacute;sactiv&eacute;e en cochant
      <b>D&eacute;sactiv&eacute;</b> dans le menu contextuel
      Aiguillage.

      <p>Vous pouvez lier chaque dessin d'aiguillage avec un
      aiguillage r&eacute;el(interne ou mat&eacute;riel) dans le
      Table Aiguillage quand les dessins d'aiguillage sont
      cr&eacute;&eacute;s, en entrant son nom de le Tableau
      Aiguillage (soit nom syst&egrave;me soit nom utilisateur)
      dans le champs <b>Aiguillage : Nom</b> (Rang&eacute;e du haut
      de la barre d'outils) avant de cliquer pour cr&eacute;er cet
      aiguillage. Alternativement, vous pouvez cr&eacute;er vos
      dessins d'aiguillage d'abord, puis s&eacute;lectionnez
      <b>Modifier...</b> dans chaque menu contextuel d'aiguillage
      &agrave; l'ouverture d'un dialogue <b>Modifier Aiguillage</b>
      qui permet la saisie du nom de l'aiguillage.</p>

      <p>Il est &eacute;galement possible de relier un
      deuxi&egrave;me aigullage pour qu'il fonctionne en m&ecirc;me
      temps que celui sp&eacute;cifi&eacute; pour cet aiguillage.
      Lorsque l'aiguillage est une bretelle, une deuxi&egrave;me
      adresse aiguillage peut &ecirc;tre sp&eacute;cifi&eacute;e,
      de sorte que si la bretelle est command&eacute;e par deux
      adresses aiguillages DCC diff&eacute;rentes Les deux
      aiguillages seront d&eacute;vi&eacute;s.<br>
      O&ugrave; l'aiguillage est soit un D, G ou Y, et deux
      aiguillages physiquesl sont contr&ocirc;l&eacute;s par la
      m&ecirc;me adresse DCC vous pouvez ajouter un aigullage au
      panneau en utilisant l'adresse r&eacute;elle et le
      deuxi&egrave;me aiguillage utilisant un aiguillage "Interne",
      vous pouvez ensuite lier les deux ensemble de sorte que si un
      aiguillage est d&eacute;vi&eacute;, l'autre suivra.</p>

      <h2>Param&eacute;trage de l'Aiguillage d'un Canton</h2>

      <p>En option, vous pouvez d&eacute;signer de quel
      <b>Canton</b> un Aiguillage fait partie soit en entrant un
      nom de canton dans le champs <b>Canton: Nom</b> de la barre
      d'outil avant la cr&eacute;ation de chaque dessin
      d'aiguillage, ou en entrant un nom de canton dans le dialogue
      Edition Aiguillage &agrave; un moment ult&eacute;rieur. La
      bo&icirc;te de dialogue Modifier Aiguillage permet
      &eacute;galement un dialogue Cr&eacute;er/Modifier un Canton,
      o&ugrave; l'information du canton pour l'aiguillage peut
      &ecirc;tre entr&eacute; ou modifi&eacute;e. Les cantons sont
      discut&eacute;s plus en d&eacute;tail sur la page d'aide de
      l'option Cr&eacute;ation/Edition de Canton.</p>

      <h2>Poursuite d'Itin&eacute;raires Suivant l'&eacute;tat de
      l'Aiguillage</h2>

      <p>Quand une voie se branche &agrave; une voie principale
      &agrave; un Aiguillage Droit ou Gauche, la Voie Principale
      continue normalement &agrave; travers l'aiguillage en suivant
      la voie droite. Parfois, cependant, la ligne principale suit
      la voie divergente. Pour permettre l'entr&eacute;e de cette
      information, le dialogue &eacute;dition Aiguillage contient
      une entr&eacute;e appel&eacute;e <b>Itin&eacute;raire
      continue Suivant l'Etat de l'Aiguillage</b> Par
      d&eacute;faut, l'itin&eacute;raire se poursuit par la voie
      droite de l'aiguillage quand un dessin d'aiguillage est
      cr&eacute;&eacute;. Vous devrez le changer pour
      D&eacute;vi&eacute; si la Ligne Principale suit la chemin
      Devi&eacute; &agrave; travers l'aiguillage. Pour un
      aiguillage triple, vous devrez toujours v&eacute;rifier pour
      voir si la Continuit&eacute; de l'Itin&eacute;raire pour
      l'&eacute;tat de l'Aiguillage est correctement
      r&eacute;gl&eacute;, v&eacute;rifiez l'&eacute;tat de
      l'aiguillage dans le Tableau Aiguillage quand l'aiguillage
      est correctement r&eacute;gler pour effacer la ligne
      principale. L'&eacute;tat du Tableau Aiguillage doit
      correspondre &agrave; l'&eacute;tat de Continuit&eacute; de
      l'Itin&eacute;raire &agrave; travers l'aiguillage qui a
      &eacute;t&eacute; choisi dans le dialogue Modifer Aiguillage.
      D&eacute;finir la voie principale est facultatif; si vous
      n'avez pas d&eacute;fini de voie principale, ce point peut
      &ecirc;tre ignor&eacute;</p>

      <h2>Bretelles</h2>

      <p>Les Bretelles doubles diff&egrave;rent des autres
      aiguillages de fa&ccedil;ons importantes. Comme d'autres
      aiguillages, Les bretelle doubles ont deux &eacute;tats -
      crois&eacute; et droit. Pour le changement d'&eacute;tat
      d'une bretelle, cependant, cela n&eacute;cessite deux ou
      quatre aiguillages pour le changement &agrave; l'unisson.
      Ceci peut &ecirc;tre accompli en utilisant un &agrave; quatre
      moteurs. Normalement, une bretelle est affect&eacute;e
      &agrave; une entr&eacute;e aiguillage unique dans le Tableau
      Aiguillage, mais il peut y en avoir plusieurs si les
      commandes des moteurs sont contr&ocirc;l&eacute;s par
      diff&eacute;rents d&eacute;codeurs stationnaires. (Vous
      pouvez utiliser deux itin&eacute;raires JMRI
      contr&ocirc;l&eacute;s par le m&ecirc;me aiguillage interne
      pour faire travailler de multiples moteurs ensembles. Dans ce
      cas, entrez l'aiguillage interne comme un aiguillage
      li&eacute; au dessin de la bretelle double. Avec les
      bretelles doubles, les voies de la bretelle sont toujours
      consid&eacute;r&eacute;es comme des voie d'&eacute;vitement ,
      et toute voie principale entrant dans la bretelle, la quitte
      sur le m&ecirc;me axe que son entr&eacute;e. Donc il n'y a
      pas de d'entr&eacute;e &eacute;tat de Continuation
      d'itin&eacute;raire sur la Bretelle Double dans la boite de
      dialogue &eacute;dition bretelle double.</p>

      <p>Si vous d&eacute;finissez des Cantons comprenant des
      bretells doubles, notez que la bretelle double a quatre
      points de connexions , dont chacun peut &ecirc;tre
      connect&eacute; &agrave; un autre canton. Ainsi les
      &eacute;l&eacute;ments d'une bretelle double, peuvent
      &ecirc;tre dans un, deux, trois ou quatre Cantons
      diff&eacute;rents. La bo&icirc;te de dialogue Modifier
      bretelle double permet l'entr&eacute;e d'un maximum de quatre
      Cantons, chacun li&eacute; &agrave; un des quatre points de
      connexion. Le premier Canton entr&eacute; doit &ecirc;tre le
      <b>Canton : Nom</b> sur le terrain; ce Canton est li&eacute;
      au point de connexion situ&eacute; &agrave; la partie
      sup&eacute;rieure gauche (si la bretelle n'a pas
      &eacute;t&eacute; tourn&eacute;e), et sert de Canton par
      d&eacute;faut pour la bretelle. Si les entr&eacute;es des
      <b>Cantons 2</b>, <b>Canton 3</b>, ou <b>Canton 4</b> sont
      vides, le Canton par d&eacute;faut est utilis&eacute;. Les
      points de connexions des Cantons sont num&eacute;rot&eacute;s
      1, 2, 3 et 4, partant de la connexion en haut &agrave; gauche
      dans le sens horaire.</p><!--#include virtual="/Footer" -->
    </div>
  </div>
</body>
</html>
