<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<!-- Updated by Herv&#233; Blorec <bzh56420@yahoo.fr> 2013-10-31-->

<html lang="fr">
<head>
  <meta name="generator" content=
  "HTML Tidy for Mac OS X (vers 31 October 2006 - Apple Inc. build 15.17), see www.w3.org">

  <title>JMRI: L'&Eacute;diteur de R&eacute;seau</title>
  <meta name="author" content="Dave Duchamp">
  <meta name="keywords" content="JMRI help Layout Editor panel">
  <!-- Style -->
  <meta http-equiv="Content-Type" content=
  "text/html; charset=us-ascii">
  <link rel="stylesheet" type="text/css" href="/css/default.css"
  media="screen">
  <link rel="stylesheet" type="text/css" href="/css/print.css"
  media="print">
  <link rel="icon" href="/images/jmri.ico" type="image/png">
  <link rel="home" title="Home" href="/">
  <!-- /Style -->
</head>

<body>
  <!--#include virtual="/Header" -->
<div class="nomenu" id="mBody">
    <div id="mainContent">

      <h1>L'&Eacute;diteur de R&eacute;seau</h1><a name="contents"
      id="contents"></a>

      <h2>Contenu</h2>Ce document d&eacute;crit L'&Eacute;diteur de
      R&eacute;seau et comment l'utiliser pour faire des panneaux
      PanelPro. Le document est divis&eacute; en sections; cliquez
      ci-dessous pour sauter &agrave; la section nomm&eacute;e. La
      lecture minimum pour commencer est <a href=
      "#intro">Pr&eacute;sentation du panneau &Eacute;diteur de
      R&eacute;seau</a> et <a href="#start">D&eacute;buter avec
      L'&Eacute;diteur de R&eacute;seau</a>. Ensuite, vous voudrez
      peut-&ecirc;tre sauter &agrave; <a href="#finish">Apportant
      la Touche de Finale &agrave; votre Panneau</a> pour voir plus
      de ce qui est possible avant de lire les diff&eacute;rents
      sections en d&eacute;tail.

      <ul>
        <li><a href="#intro">Introduction au panneau &Eacute;diteur
        de R&eacute;seau</a></li>

        <li><a href="#start">D&eacute;buter avec L'&Eacute;diteur
        de R&eacute;seau</a></li>

        <li><a href="#toolbar">Utilisation de la barre d'outils de
        L'&Eacute;diteur de R&eacute;seau</a></li>

        <li><a href="#filemenu">Utilisation du menu fichier d'un
        Panneau</a></li>

        <li><a href="#option">Utilisation du menu Options de
        L'&Eacute;diteur de R&eacute;seau</a></li>

        <li><a href="#toolsmenu">Utilisation du menu Outils de
        L'&Eacute;diteur de R&eacute;seau</a></li>

        <li><a href="#zoommenu">Utilisation du menu Zoom de de
        L'&Eacute;diteur de R&eacute;seau</a></li>

        <li><a href="#markermenu">Utilisation du menu Marqueur de
        L'&Eacute;diteur de R&eacute;seau</a></li>

        <li><a href="#editing">&Eacute;diter et Supprimer des
        &Eacute;l&eacute;ments</a></li>

        <li><a href="#turnouts">Aiguillage</a></li>

        <li><a href="#track">Segments de Voie et Points de
        Connexion</a></li>

        <li><a href="#xing">Croisement</a></li>

        <li><a href="#turn">Pont Tournant</a></li>

        <li><a href="#background">Arri&egrave;re Plan</a></li>

        <li><a href="#block">Cantons</a></li>

        <li><a href="#tracking">Cantons, &Eacute;tiquettes de
        M&eacute;moire, et Suivi de Train</a></li>

        <li><a href="#tips">Conseils</a></li>

        <li><a href="#finish">Mettre la Touche Finale &agrave;
        votre Panneau</a></li>
      </ul><a name="intro" id="intro"></a>

      <h2>Introduction &agrave; L'&Eacute;diteur de Panneau
      R&eacute;seau</h2><b>Le panneau &Eacute;diteur de
      R&eacute;seau</b> soutient la construction et l'affichage des
      panneaux PanelPro. <b>L'&Eacute;diteur de R&eacute;seau</b>
      est similaire &agrave; <b>l'&Eacute;diteur traditionnel
      Panneau PanelPro</b>, sauf qu'il soutient un sch&eacute;ma de
      suivi &eacute;tabli au lieu d'ic&ocirc;nes bas&eacute;es sur
      un diagramme de voie. En raison de la fa&ccedil;on dont il
      fonctionne, <b>L'&Eacute;diteur de R&eacute;seau</b> capte
      les connectivit&eacute;s compl&egrave;tes de votre
      trac&eacute; comme vous le dessiner. Plusieurs outils
      automatis&eacute;s sont disponibles pour faire une mise en
      place plus ais&eacute;e de votre R&eacute;seau.

      <p><b>L'&Eacute;diteur de R&eacute;seau</b> est
      impl&eacute;ment&eacute; en utilisant une barre d'outils en
      haut de votre panneau. Cette barre d'outils peut &ecirc;tre
      activ&eacute;e et d&eacute;sactiv&eacute;e en utilisant
      l'&eacute;l&eacute;ment <b>Mode &Eacute;diter</b> dans le
      menu <b>Options</b>de votre panneau. Lorsque vous
      cr&eacute;ez un nouveau panneau &Eacute;dtion de
      R&eacute;seau, votre nouveau panneau appara&icirc;t avec la
      barre d'outil et met le Mode &Eacute;diter affich&eacute; en
      haut de votre panneau, et avec une barre de d'aide
      syst&egrave;me sp&eacute;cifique qui s'affiche au bas du
      panneau. La barre d'aide d&eacute;crit comment utiliser
      l'interface utilisateur de <b>l'&Eacute;diteur de
      R&eacute;seau</b>. La barre d'aide devrait probablement
      &ecirc;tre d&eacute;sactiv&eacute;e (en utilisant le menu
      Options) une fois que vous &ecirc;tes familiariser avec
      l'interface utilisateur.</p>

      <p><b>&Eacute;diteur de R&eacute;seau&gt;</b> offre plusieurs
      options que vous pouvez ou non choisir d'utiliser lorsque
      vous dessinez votre sch&eacute;ma de voie. Les sections de
      voie peuvent &ecirc;tre d&eacute;sign&eacute;es comme <i>voie
      principale</i> pour les diff&eacute;rencier de la <i>voie
      d'&eacute;vitement</i> (par d&eacute;faut). La voie
      principale et la voie d'&eacute;vitement peuvent &ecirc;tre
      &eacute;tablies avec des lignes de diff&eacute;rentes
      largeurs. Vous pouvez diviser votre trac&eacute; en
      <i>cantons</i>, chaque canton ayant un capteur d'occupation
      et chacun dessin&eacute; avec des couleurs diff&eacute;rentes
      pour suivre les &eacute;tats occup&eacute;s et
      inoccup&eacute;s, permettant &agrave; la voie dans un canton
      de changer de couleur quand un train y p&eacute;n&egrave;tre
      et quitte ce canton. Normalement les tron&ccedil;ons de voie
      sont dessin&eacute;s en traits pleins, mais vous peut
      d&eacute;signer des segments choisis en
      <i>pointill&eacute;s</i> pour montrer les tunnels ou les
      voies traversant &agrave; diff&eacute;rents niveaux. Vous
      pouvez aussi d&eacute;signer un segment de voie
      <i>cach&eacute;</i> qui est affich&eacute;e uniquement
      lorsque la barre d'outils est affich&eacute;e. Ces options
      peuvent &ecirc;tre mises en place pendant que vous dessinez
      votre R&eacute;seau, ou vous pouvez les ajouter plus
      tard.</p>

      <p>JMRI supporte plusieurs panneaux, soit de type
      &Eacute;diteur de R&eacute;seau ou le type Editeur de
      panneau. Tous les panneaux qui ont &eacute;t&eacute;
      cr&eacute;&eacute;s ou charg&eacute;s sont
      r&eacute;pertori&eacute;s dans le sous-menu <b>Montrer
      Panneau</b> dans le menu Panneaux. Vous pouvez r&eacute;duire
      ou fermer une fen&ecirc;tre panneau, et apporter la
      fen&ecirc;tre la plus en avant en la s&eacute;lectionnant
      dans ce menu. Plusieurs moniteurs sont g&eacute;r&eacute;s
      dans la mesure o&ugrave; le syst&egrave;me d'exploitation le
      permet, et un seul panneau peut &ecirc;tre
      &eacute;tir&eacute; pour occuper plus d'un moniteur.</p>

      <p>Pour enregistrer votre panneau R&eacute;seau,
      s&eacute;lectionner <b>Sauvegarder Panneau...</b> dans le
      menu <b>Fichier</b> de votre panneau de R&eacute;seau, ou
      dans le menu Panneaux. Quand vous faites cela, tous les
      panneaux figurant dans le sous-menu <b>Afficher Panneau</b>
      sont enregistr&eacute;s, ainsi que tous les
      &eacute;l&eacute;ments de configuration partag&eacute;s
      (capteurs, aiguillages, les t&ecirc;tes de signaux, etc.)
      Pour faciliter la sauvegarde fr&eacute;quente de votre
      panneau, l'&Eacute;diteur de R&eacute;seau fournit
      l'&eacute;l&eacute;ment de menu, <b>Enregistrer Lieu et la
      Taille</b>, dans le menu <b>Options</b>. Une fois que vous
      avez dimensionn&eacute;s et positionn&eacute;s votre panneau
      exactement comme vous voulez qu'il vienne quand il est
      charg&eacute;e, s&eacute;lectionnez cet &eacute;l&eacute;ment
      et enregistrez votre panneau. Vous ne devez pas &ecirc;tre
      pr&eacute;occup&eacute; par les changements de position et de
      taille de votre panneau au cours de sauvegarde
      ult&eacute;rieurement! La position et la taille de votre
      panneau ne changera que lorsque vous s&eacute;lectionnez
      <b>Enregistrer Emplacement et Taille</b>. Alors enregistrez
      souvent votre R&eacute;seau pour pr&eacute;server votre
      travail.</p>

      <p>Voici un petit tutoriel sur les bases de l'utilisation de
      l'&Eacute;diteur de R&eacute;seau. Un tutoriel plus complet
      est disponible en t&eacute;l&eacute;chargement en format pdf
      sur le site Web JMRI. Voir <a href=
      "http://jmri.org/community/clinics/NMRA2008/index.html"><b>Utilisation
      de l'&Eacute;diteur de R&eacute;seau JMRI/PanelPro</b></a> et
      ses deux fichiers .xml de d&eacute;monstration
      associ&eacute;s.</p>

      <h2><a name="start" id="start">D&eacute;buter avec
      l'&Eacute;diteur de R&eacute;seau</a></h2>

      <p>Pour vous familiariser avec l'interface utilisateur de
      l'&Eacute;diteur de R&eacute;seau, essayez ce qui suit:</p>

      <p>1. S&eacute;lectionnez <b>Nouveau panneau...</b>, puis
      <b>&Eacute;diteur R&eacute;seau</b> dans le menu Panneaux.
      Vous devriez voir une fen&ecirc;tre blanche avec une barre
      d'outils en haut, et une barre d'aide &agrave; la base.</p>

      <p>2. D&eacute;placez le curseur sur l'int&eacute;rieur du
      panneau vierge. Notez que lorsque vous vous d&eacute;placez,
      les coordonn&eacute;es sont affich&eacute;es en haut &agrave;
      gauche de la barre d'outil - <i>x</i> (horizontale) et
      <i>y</i> (Verticale). (Ceci pour faciliter l'alignement des
      &eacute;l&eacute;ments quand vous les dessinez.)
      D&eacute;placez le curseur sur les cases &agrave; cocher et
      les champs d'entr&eacute;e dans la barre d'outils, en notant
      que chacun a une bulle d'aide.</p>

      <p>3. Pour ajouter un aiguillage droit, d'abord, cochez D
      pour le type d'aiguillage dans la rang&eacute;e
      sup&eacute;rieure de la barre d'outils. Puis, tout en
      appuyant sur la touche Maj, cliquez sur la souris (clic
      gauche sur une souris &agrave; deux boutons ) sur un point
      bas d'environ un tiers et &agrave; un tiers du coin
      sup&eacute;rieure gauche de votre panneau. Un aiguillage
      droit devrait appara&icirc;tre. Les trois carr&eacute;s
      rouges aux extr&eacute;mit&eacute;s de la pointe et des voies
      directe et d&eacute;vi&eacute;e de l'aiguillage sont des
      points de connexions pour les <b>Tron&ccedil;ons de Voie</b>.
      Le cercle rond au centre de l'aiguillage est le point
      o&ugrave; vous devriez obtenir le menu contextuel de
      l'aiguillage.</p>

      <p>4. Pour ajouter un aiguillage gauche, d'abord, cochez G
      pour le type de aiguillage. (Notez que le D est
      automatiquement d&eacute;sactiv&eacute;e.) Tapez "180" dans
      la zone Rotation en en haut &agrave; droite de la barre
      d'outil, pour faire pivoter l'aiguillage de nouveau. Tout en
      appuyant la touche Maj , cliquez avec la souris sur un point
      &agrave; la m&ecirc;me hauteur que l'autre aiguillage, mais
      pour le droit &agrave; environ deux ou trois pouces. Un
      aiguillage gauche devrait appara&icirc;tre avec sa pointe
      &agrave; l'oppos&eacute; de l'aiguillage droit.</p>

      <p>5. Pour ajouter des segments de voies pour relier les deux
      aiguillages, cochez le segment de voie sur la deuxi&egrave;me
      ligne de la barre d'outils. Tout en maintenant la touche Maj
      enfonc&eacute;e tout le temps, appuyez le bouton de la souris
      sur le point de connexion de la branche divergente d'un
      aiguillage, et glissez vers la point de connexion de la
      branche divergente de l'autre aiguillage , et rel&acirc;chez
      le bouton de la souris lorsque la forme du curseur change.
      Vous devriez voir un segment de voie reliant les deux
      aiguillages, et les deux points de connexion devrait changer
      de couleur et passer au vert, indiquant qu'ils sont
      <i>complets</i>, c'est qu'ils ont le nombre maximal de
      connexions autoris&eacute;es. De m&ecirc;me presser et
      glisser avec Maj enfonc&eacute;e pour ajouter un segment de
      la voie reliant la branche directe des deux aiguillages. Vous
      avez &eacute;tabli une voie d'&eacute;vitement.</p>

      <p>6. Pour ajouter un aiguillage pour un embranchement
      industriel, cochez G pour un aiguillage gauche, et saisissez
      0 dans la rotation. Puis, avec Maj enfonc&eacute;e, cliquez
      sur un point un couple de pouces ci-dessous et
      l&eacute;g&egrave;rement &agrave; droite de l'aiguillage sur
      votre gauche.</p>

      <p>7. Pour relier cet aiguillage avec la voie passante
      sup&eacute;rieure et former une voie ovale simple, cochez
      Point d'Ancrage sur la troisi&egrave;me rang&eacute;e de la
      barre d'outils. Un <b>Point d'Ancrage</b> est un n&oelig;ud
      dans un diagramme de voie qui peut accepter le raccordement
      de deux tron&ccedil;ons de voie; il est utilis&eacute; pour
      placer des segments de voie connect&eacute;s de sorte qu'ils
      semblent assez bien (et aussi utilis&eacute; pour diviser les
      cantons). Tout en maintenant Maj enfonc&eacute;e, cliquez sur
      un point exactement &agrave; la gauche de l'aiguillage
      sup&eacute;rieur, et encore sur un point juste en dessous de
      celui-ci, mais exactement &agrave; ' gauche de l'aiguillage
      inf&eacute;rieur. Ensuite cliquez sur un point environ 1/2
      pouce vers la gauche et 1/2 pouces en dessous du point
      d'ancrage sup&eacute;rieur, et encore sur un point 1/2 pouce
      vers la gauche et 1/2 pouce au-dessus du point bas d'ancrage.
      Vous devriez maintenant avoir quatre points d'ancrage
      soulignant le c&ocirc;t&eacute; gauche de l'ovale. Connectez
      ces quatre points et la pointe de l'aiguillage avec les
      tron&ccedil;ons de voie - cochez segment de voie, puis avec
      Maj enfonc&eacute;e, cliquez et faites glisser pour
      cr&eacute;er chacun des cinq segments de voie
      n&eacute;cessaires. Notez que le point d'ancrage va changer
      du rouge au vert quand il a deux connexions. De m&ecirc;me
      r&eacute;p&eacute;ter cette proc&eacute;dure pour tracer la
      partie droite de l'ovale.</p>

      <p>8. La position des aiguillage et des point d'ancrage peut
      &ecirc;tre ajust&eacute;e pour que le Sch&eacute;ma de la
      voie ait une belle apparence en maintenant enfonc&eacute;e la
      touche Meta (v&eacute;rifier la barre d'aide pour voir quelle
      touche est la cl&eacute; m&eacute;ta), et en faisant glisser
      chaque point d'ancrage ou d'aiguillage. Pour ajuster la
      position d'un aiguillage, faites glisser le point central de
      l'aiguillage avec la touche m&eacute;ta press&eacute;.(Touche
      droite pour une souris &agrave; 3 touches en Linux)</p>

      <p>9. Ensuite compl&eacute;ter l'embranchement industriel. Le
      point de connexion de la voie divergente de l'aiguillage
      inf&eacute;rieur devrait &ecirc;tre la seule case
      n&eacute;cessitant une connexion (couleur rouge). Cochez
      Heurtoir dans la barre d'outils. Un <b>Heurtoir</b> est un
      n&oelig;uds dans un diagramme de la voie qui peut accepter
      une seule connexion. <b>Avec Maj enfonc&eacute;e</b> ,
      cliquez sur un point exactement &agrave; la droite du point
      de connexion divergent de l'aiguillage. Connectez votre
      heurtoir au point de connexion divergent en gardant Maj
      enfonc&eacute;e, tout en appuyant sur la bouton droit de la
      souris sur le point de connexion divergents et en le faisant
      glisser vers le Heurtoir. Votre diagramme de voie doit
      ressembler &agrave; ceci:</p>

      <p><a href="./images/OvalLayoutEditMode.gif"><img src=
      "./images/OvalLayoutEditMode.gif" width="563"
      height="169" hspace="0" vspace="0"></a></p>

      <p>10. S&eacute;lectionnez <b>Mode &Eacute;diter</b> dans le
      menu Options pour masquer la barre d'outil (et la barre
      d'aide) et voir &agrave; quoi ressemblerait votre diagramme
      de voie d'un dessin d'un simple ovale dans un panneau final.
      Vous devriez voir les points de connexion et les cercles
      disparaitre. Notez &eacute;galement que, lorsqu'il est dans
      le mode &Eacute;diter, les &eacute;l&eacute;ments ne peuvent
      &ecirc;tre repositionn&eacute;s et les menus contextuels ne
      sont pas actifs.</p>

      <p>Les &eacute;tapes ci-dessus ont d&eacute;montr&eacute; les
      &eacute;tapes de bases n&eacute;cessaires pour dessiner un
      diagramme de voie. Vous pouvez effacer ce panneau de
      d&eacute;monstration en s&eacute;lectionnant <b>Supprimer ce
      panneau...</b> dans le menu Fichier du Panneau, et commencer
      &agrave; construire le diagramme de voie de votre
      r&eacute;seau. Lire les articles ci-dessous pour en apprendre
      davantage sur la fa&ccedil;on d'ajouter du contenu aux
      &eacute;l&eacute;ments du diagramme de voies et comment
      ajouter des &eacute;l&eacute;ments ic&ocirc;ne &agrave; votre
      panneau.</p>

      <p>Remarque <b>: L'outil &Eacute;diteur de R&eacute;seau pour
      placer les t&ecirc;tes de signalisation et pour une
      configuration automatique de la logique signal exige que les
      aiguillages et les limites de bloc (voir ci-dessous) soient
      orient&eacute;s verticalement ou horizontalement sur votre
      panneau.</b> Pour faire une utilisation maximale de ces
      outils, concevez votre panneau avec les aiguillages
      orient&eacute;s verticalement ou horizontalement
      (l'orientation n'a pas besoin d'&ecirc;tre exacte, juste la
      plus verticale ou la plus horizontale possible).</p>

      <h2><a name="toolbar" id="toolbar">Utilisation de la barre
      d'outils &Eacute;diteur de R&eacute;seau</a></h2>La barre
      d'outil est utilis&eacute;e pour ajouter des
      &eacute;l&eacute;ments &agrave; un panneau, et de fournir des
      informations pour les &eacute;l&eacute;ments ajout&eacute;s.
      L'&eacute;l&eacute;ment &agrave; ajouter est
      s&eacute;lectionn&eacute; en utilisant l'une des cases
      suivantes dans la barre d'outils:

      <ul>
        <li><b>D</b> - s&eacute;lectionne un aiguillage droit</li>

        <li><b>G</b> - s&eacute;lectionne un aiguillage gauche</li>

        <li><b>Y</b> - s&eacute;lectionne un aiguillage
        sym&eacute;trique</li>

        <li><b>Bret double</b> - s&eacute;lectionne une bretelle
        double</li>

        <li><b>Bret Droie</b> - s&eacute;lectionne une bretelle
        simple &agrave; droite</li>

        <li><b>Bret Gauche</b> - s&eacute;lectionne une bretelle
        simple &agrave; gauche</li>

        <li><b>Croisement</b> - s&eacute;lectionne une voie au
        croisement</li>

        <li><b>Segment de Voie</b>-s&eacute;lectionne un morceau de
        voie droite</li>

        <li><b>Heutoir&gt;</b>-s&eacute;lectionne un point de
        connexion &agrave; l'extr&eacute;mit&eacute; d'une
        voie</li>

        <li><b>Point d'Ancrage</b>-s&eacute;lectionne un point de
        connexion entre deux segments de voies</li>

        <li><b>&Eacute;tiquette de Texte</b>-s&eacute;lectionne une
        &eacute;tiquette indiquant le contenu du champ de
        saisie</li>

        <li><b>&Eacute;tiquette
        M&eacute;moire</b>-s&eacute;lectionne une &eacute;tiquette
        indiquant le contenu de la m&eacute;moire dont le nom est
        inscrit sur la droite</li>

        <li><b>Multi-Capteur</b>-s&eacute;lectionne un
        multi-capteurs-Une bo&icirc;te de dialogue est
        affich&eacute;e permettant de d&eacute;finir
        multi-capteurs. Avant de cr&eacute;er le multi-capteur, un
        nom doit &ecirc;tre inscrit pour chaque capteur pour
        d&eacute;finir le multi-capteurs compl&egrave;tement.</li>

        <li><b>Ic&ocirc;ne Capteur</b>-s&eacute;lectionne une
        ic&ocirc;ne du capteur montrant le capteur dont le nom est
        inscrit sur la droite.</li>

        <li><b>Ic&ocirc;ne Signal</b>-s&eacute;lectionne une
        ic&ocirc;ne t&ecirc;te de signalisation montrant la
        t&ecirc;te du signal dont le nom est inscrit sur la
        droite</li>

        <li><b>Ic&ocirc;ne &eacute;tiquette</b>-s&eacute;lectionne
        une ic&ocirc;ne &agrave; usage g&eacute;n&eacute;ral</li>
      </ul>

      <p>Les dix premiers articles sont utilis&eacute;s pour
      cr&eacute;er un diagramme de voie, et sont nouveaux avec
      l'&Eacute;diteur de R&eacute;seau. Les six autres articles
      sont &agrave; base d'ic&ocirc;nes et sont similaires aux
      articles ic&ocirc;ne correspondante dans l'&Eacute;diteur de
      Panneaux.</p>

      <p>Pour ajouter tous les &eacute;l&eacute;ments sauf segment
      de voie:</p>

      <ol>
        <li>S&eacute;lectionnez la case &agrave; cocher (les cases
        &agrave; cocher des autres articles seront automatiquement
        d&eacute;ss&eacute;lectionn&eacute;es).</li>

        <li>Entrez toute autre information n&eacute;cessaire (voir
        ci-dessous).</li>

        <li>D&eacute;placez le curseur de la souris pour le point
        sur le panneau o&ugrave; vous souhaitez que
        l'&eacute;l&eacute;ment apparaisse.</li>

        <li>Maintenez enfonc&eacute;e la touche Maj.</li>

        <li>Cliquez sur la souris (clic gauche).</li>

        <li>Rel&acirc;chez la souris, puis rel&acirc;chez la touche
        Maj.</li>
      </ol>

      <p>Un segment de voie est un morceau de voie droite reliant
      deux points de connexion (carr&eacute;s rouges sur un
      aiguillage, point d'ancrage, heurtoir, ou croisement). Avant
      que vous puissiez ajouter un segment de voie, deux points de
      connexion rouge doivent &ecirc;tre visibles sur le panneau.
      Pour ajouter un segment de voie reliant deux points de
      connexion rouge:</p>

      <ol>
        <li>S&eacute;lectionnez la case Segment de Voie dans la
        barre d'outils.</li>

        <li>Entrez toute autre information -. tous optionnels (voir
        ci-dessous)</li>

        <li>Maintenez enfonc&eacute;e la touche Maj.</li>

        <li>Appuyez et maintenez enfonc&eacute; la souris sur l'un
        des points de connexion.</li>

        <li>Glisser la souris vers l'autre point de connexion. La
        forme du curseur change quand vous &ecirc;tes
        l&agrave;.</li>

        <li>Rel&acirc;chez la souris, puis rel&acirc;chez la touche
        Maj.</li>
      </ol>

      <p>Les cases &agrave; cocher et les champs de la barre
      d'outils autres que les quatorze
      &eacute;num&eacute;r&eacute;s ci-dessus sont pour la saisie
      des informations qui seront appliqu&eacute;s &agrave; des
      &eacute;l&eacute;ments cr&eacute;&eacute;s tels qu'ils sont
      cr&eacute;&eacute;s. Certaines informations sont
      n&eacute;cessaires, et certaines sont facultatives. Les
      choses en option peuvent &ecirc;tre ajout&eacute;es ou
      modifi&eacute;es ult&eacute;rieurement en utilisant le menu
      contextuel d'un &eacute;l&eacute;ment, mais il est parfois
      plus facile dus ajouter quand les &eacute;l&eacute;ments sont
      cr&eacute;&eacute;s. Les &eacute;l&eacute;ments requis sont
      &eacute;troitement li&eacute;s pour cr&eacute;er des
      &eacute;l&eacute;ments et ne peuvent pas &ecirc;tre
      modifi&eacute;s ult&eacute;rieurement sans avoir &agrave;
      retirer et &agrave; recr&eacute;er l'&eacute;l&eacute;ment.
      Chaque saisie d'information a une bulle d'aide qui explique
      ce qu'elle fait; survolez avec la souris sur un champ ou une
      case &agrave; cocher pour voir l'info-bulle. Les
      entr&eacute;es des information sont d&eacute;crites
      ci-dessous, &agrave; quel &eacute;l&eacute;ments elles
      s'appliquent et si elles sont facultatives ou
      obligatoires.</p>

      <ul>
        <li><b>Aiguillage: Nom</b> (champ)-s'applique &agrave; D,
        G, Y, Bret 2, Bret D, Bret G - entr&eacute;e est
        facultative. Si un nom est inscrit, il doit correspondent
        &agrave; un aiguillage du Tableau Aiguillage.</li>

        <li><b>Rotation</b> (champ)-s'applique &agrave; D, G, Y,
        Bret 2, Bret D, Bret G - L'entr&eacute;e est facultative.
        S'il n'y a pas d'entr&eacute;e, l'aiguillage n'est pas
        tourn&eacute; quand il est cr&eacute;&eacute;. N'oubliez
        pas d'essayer de garder vos aiguillages orient&eacute;s
        verticalement ou horizontalement.</li>

        <li><b>Canton: Nom</b> (champ)-s'applique &agrave; D, G, Y,
        Bret 2, Bret D, Bret G, Segment de Voie, croisement -
        L'entr&eacute;e est facultative. Si un nom est inscrit,
        l'&eacute;l&eacute;ment cr&eacute;&eacute; est
        attribu&eacute; au canton nomm&eacute;. Si un nom est
        inscrit et que le canton n'existe pas, un nouveau canton
        avec ce nom est cr&eacute;&eacute;. Un nom de canton peut
        &ecirc;tre n'importe quel caract&egrave;res
        alphab&eacute;tiques ou num&eacute;riques qui permettent
        d'identifier le canton.</li>

        <li><b>Capteur d'Occupation</b> (champ)-s'applique au
        canton nomm&eacute; dans l'entr&eacute;e ci-dessus
        -L'entr&eacute;e est facultative. Une entr&eacute;e doit
        correspondre &agrave; un capteur dans le Tableau Capteur .
        Si le bloc nomm&eacute; a d&eacute;j&agrave; un capteur
        d'occupation, ce capteur remplace le capteur d'occupation
        pr&eacute;c&eacute;dent.</li>

        <li><b>Pointill&eacute;s</b> (case &agrave;
        cocher)-s'applique au Segment de Voie - Un Segment de Voie
        peut &ecirc;tre trac&eacute; comme une ligne continue ou
        une ligne pointill&eacute;e. Solide est le choix par
        d&eacute;faut si pointill&eacute; n'est pas coch&eacute;e.
        Pointill&eacute;s est utile pour des tunnels ou des voies
        traversant &agrave; diff&eacute;rentes niveaux.</li>

        <li><b>Voie Principale</b> (case &agrave;
        cocher)-s'applique au Segment de Voie - un Segment de Voie
        peut &ecirc;tre soit une <i>voie principale</i> ou une
        <i>voie d'&eacute;vitement</i> . La voie d'&eacute;vitement
        est le choix par d&eacute;faut si la voie principale n'est
        pas coch&eacute;e. D&eacute;signer une partie de votre
        piste comme <i>voie principale</i> est facultatif.</li>

        <li>&Eacute;tiquette de Texte (champs)-s'applique &agrave;
        l'&eacute;tiquette de texte - L'entr&eacute;e est
        n&eacute;cessaire si quelque chose doit &ecirc;tre
        affich&eacute;e dans l'&eacute;tiquette de texte &agrave;
        nouveau.</li>

        <li><b>Label M&eacute;moire</b> (champ)-s'applique &agrave;
        l'&eacute;tiquette de la m&eacute;moire - L'entr&eacute;e
        est n&eacute;cessaire. Si le nom saisi ne correspond pas
        &agrave; une variable en m&eacute;moire dans le Tableau
        M&eacute;moire, une variable de m&eacute;moire sera
        cr&eacute;&eacute;, en utilisant le nom entr&eacute; comme
        nom syst&egrave;me JMRI (avec le pr&eacute;fixe IM si
        n&eacute;cessaire).</li>

        <li><b>Ic&ocirc;ne Capteur</b> (champ)-s'applique &agrave;
        une Ic&ocirc;ne du capteur - L'entr&eacute;e est
        n&eacute;cessaire. Si un capteur avec le nom entr&eacute;
        n'existe pas, il sera cr&eacute;&eacute; en utilisant le
        nom entr&eacute; comme le nom syst&egrave;me JMRI (avec un
        pr&eacute;fixe appropri&eacute; si n&eacute;cessaire).</li>

        <li><b>Ic&ocirc;ne Signal</b> (champ)-s'applique &agrave;
        Ic&ocirc;ne Signal - L'entr&eacute;e est n&eacute;cessaire.
        Si le nom d'une t&ecirc;te de signalisation ne figure pas
        dans le tableau t&ecirc;te de signalisation, il en
        r&eacute;sultera un message d'erreur et l'ic&ocirc;ne de
        signal ne sera pas cr&eacute;&eacute;e. Remarque <b>: Pour
        associer automatiquement des t&ecirc;tes de signalisation
        avec des aiguillages et limites des cantons, vous devez
        utiliser les outils automatis&eacute;s dans le menu Outils
        pour placer des ic&ocirc;nes de signal.</b> Cet
        &eacute;l&eacute;ment est pr&eacute;vu pour les cas
        o&ugrave; ces outils automatis&eacute;s ne peuvent pas
        placer une ic&ocirc;ne de signal en cas de besoin.</li>
      </ul>

      <p>Lorsqu'il est enfonc&eacute;, le bouton <b>Changer les
      Ic&ocirc;nes...</b> sur la barre d'outils fait
      appara&icirc;tre un &eacute;diteur d'ic&ocirc;nes pour soit
      les ic&ocirc;nes du capteur soit, des ic&ocirc;nes de signal,
      ou des ic&ocirc;nes &agrave; usage g&eacute;n&eacute;ral,
      selon que <b>Ic&ocirc;ne Capteur</b>, <b>Ic&ocirc;ne
      Signal</b>, <b>Ic&ocirc;ne Label</b> est coch&eacute;. Si
      aucun de ces &eacute;l&eacute;ments n'est coch&eacute;, la
      pression sur le bouton est ignor&eacute;e. Pour les
      Ic&ocirc;nes Signal, l'&Eacute;diteur de R&eacute;seau par
      d&eacute;faut pour les ic&ocirc;nes face &agrave; gauche se
      trouv&eacute; &agrave;
      "Ressources/icons/smallschematics/projecteurs/". Si vous
      utilisez un fond noir, vous pouvez avoir besoin de passer
      &agrave; des ic&ocirc;nes blanches qui sont disponibles dans
      les m&ecirc;mes domaine, puisque les ic&ocirc;nes par
      d&eacute;faut ont des bordures noires.</p><a name="filemenu"
      id="filemenu"></a>

      <h2>Utilisation d'un Menu Fichier de Panneau</h2>

      <p>Le menu Fichier permet de sauvegarder et d'effacer des
      panneaux.</p>

      <ul>
        <li><b>Sauvegarder Panneau...</b>-Lorsque cette option est
        s&eacute;lectionn&eacute;e, une bo&icirc;te de dialogue
        Enregistrer est montr&eacute;. Lorsque Enregistrer est
        s&eacute;lectionn&eacute; dans la bo&icirc;te de dialogue
        Enregistrer, toute les informations de configuration du
        R&eacute;seau sont &eacute;crites sur le disque, y compris
        des renseignements pour tous les panneaux, les deux
        &Eacute;diteur de R&eacute;seaux et l'&Eacute;diteur de
        Panneau, et tous les &eacute;l&eacute;ments
        non-sp&eacute;cifiques &agrave; une configuration de
        R&eacute;seaux (par exemple, les aiguillages, les capteurs,
        les lumi&egrave;res, les t&ecirc;tes de signalisation,
        itin&eacute;raires, logixs, cantons, etc) <b>Sauvegarer
        Panneaux...</b> est disponible dans le menu Fichier de
        chaque panneau, et dans le menu Panneaux. Il peut
        &eacute;galement &ecirc;tre atteint en s&eacute;lectionnant
        <b>Sauvegarder Configuration Et les Panneaux dans le
        Fichier fichiers...</b> dans le sous - menu de Sauvegarde
        du menu Fichier de n'importe quel tableau.</li>

        <li><b>Supprimer ce panneau...</b>-Cet article supprime le
        panneau le plus en avant. Une dialogue de confirmation
        s'affiche, permettant le choix d'annuler avant suppression.
        La suppression supprime le panneau du programme. Pour
        supprimer d&eacute;finitivement un panneau &agrave; partir
        de votre fichier de panneau, <b>Sauvegarder Panneaux...</b>
        doit &ecirc;tre s&eacute;lectionn&eacute; apr&egrave;s
        suppression de ce panneau <b>Il n'y a pas d'annulation pour
        la suppression.</b> A moins que le panneau n'ait
        &eacute;t&eacute; enregistr&eacute; sur le disque, il est
        parti apr&egrave;s sa suppression.</li>
      </ul><a name="option" id="option"></a>

      <h2>Utilisation du Menu Options de l'&Eacute;diteur de
      R&eacute;seau</h2>

      <p>Le menu Options est utilis&eacute; pour d&eacute;finir les
      options, ajouter des &eacute;l&eacute;ments au panneau, et
      effectuer des op&eacute;rations qui ne surviennent pas
      tr&egrave;s souvent lors de la cr&eacute;ation du panneau.
      Chaque s&eacute;lection du menu Option est d&eacute;crite
      ci-dessous.</p>

      <ul>
        <li><b>Mode &Eacute;dition</b> - Lorsque cette option est
        coch&eacute;e, la barre d'outils est affich&eacute;e au
        sommet du panneau, et le diagramme de voie affiche les
        points de connexion et &eacute;dite les cercles.
        D&eacute;cochez le Mode &Eacute;diteur pour masquer la
        barre d'outils et la barre d'aide si elles sont
        affich&eacute;e.</li>

        <li><b>Permettre le Repositionnement</b> - Lorsque cette
        option est coch&eacute;e, les &eacute;l&eacute;ments sur le
        panneau peuvent &ecirc;tre repositionn&eacute;s en tirant
        sur l'&eacute;l&eacute;ment avec la Touche m&eacute;ta
        press&eacute;e (bouton droit sur la souris en Linux). La
        Voie, les &eacute;l&eacute;ments de dessin et les articles
        &agrave; base d'ic&ocirc;nes ne peuvent pas &ecirc;tre
        repositionn&eacute;s lorsque le mode &Eacute;diteur est
        coch&eacute;. Les marqueurs sont une exception; les
        marqueurs peuvent &ecirc;tre repositionn&eacute;s &agrave;
        tout moments ind&eacute;pendamment du fait que le Mode
        &Eacute;diteur et/ou Permettre le Repositionnement soient
        coch&eacute;s.</li>

        <li><b>Autoriser Contr&ocirc;le du R&eacute;seau</b> -
        Lorsque cette option est coch&eacute;e, cliquez sur
        l'&eacute;l&eacute;ment aiguillage actif dans le
        R&eacute;seau ou sur l'ic&ocirc;ne des
        &eacute;l&eacute;ments actifs, tels que ic&ocirc;nes du
        capteur, et des ic&ocirc;nes de signal, permet de basculer
        l'&eacute;tat de repr&eacute;sentation de
        l'&eacute;l&eacute;ment.</li>

        <li><b>Autoriser Animation Aiguillage</b> - Lorsque cette
        option est coch&eacute;e, les aiguillages sur le
        R&eacute;seau vont changer pour montrer l'&eacute;tat de
        aiguillage. Si cet &eacute;l&eacute;ment n'est pas
        coch&eacute;e, l'aiguillage sera dessin&eacute; montrant la
        position Ferm&eacute;e &agrave; tout moment.</li>

        <li><b>Montrer Barre d'Aide en mode &Eacute;diteur</b> - Si
        cette option est coch&eacute;e, la barre d'aide est
        affich&eacute;e lorsque la barre d'outils est
        affich&eacute;e.</li>

        <li><b>Afficher Grille dans le Mode &Eacute;diteur</b> - Si
        cette option est coch&eacute;e, une grille est
        affich&eacute;e en mode &eacute;dition.</li>

        <li><b>Aligner sur la Grille lors de l'Ajout</b> - Si cette
        option est coch&eacute;e, quand un &eacute;l&eacute;ment
        est ajout&eacute; dans le panneau, ses coordonn&eacute;es
        sont accroch&eacute;s sur un point de la grille. Pour des
        &eacute;l&eacute;ments de R&eacute;seau (aiguillages, des
        points d'ancrage, heurtoirs, et les croisements, les
        coordonn&eacute;es des points centraux sont limit&eacute;s
        aux points de grille. Pour les ic&ocirc;nes et les
        &eacute;tiquettes, les coordonn&eacute;es du coin
        sup&eacute;rieur gauche sont forc&eacute;s sur un point de
        la grille.</li>

        <li><b>Aligner sur la Grille lors du D&eacute;placement</b>
        - Si cette option est coch&eacute;e, quand un
        &eacute;l&eacute;ment est d&eacute;plac&eacute; sur le
        panneau, ses coordonn&eacute;es sont accroch&eacute;s sur
        les points de la grille. Pour les &eacute;l&eacute;ments du
        R&eacute;seau (aiguillages, des points d'ancrage,
        heurtoirs, et les croisements), les coordonn&eacute;es des
        points centraux sont limit&eacute;s aux points de grille.
        Si les points de connexion des aiguillages ou croisements
        sont d&eacute;plac&eacute;s, leurs coordonn&eacute;es sont
        &eacute;galement accroch&eacute;s aux points de la grille.
        Pour les ic&ocirc;nes et les &eacute;tiquettes, les
        coordonn&eacute;es du coin sup&eacute;rieur gauche sont
        accroch&eacute;es aux points de grille.</li>

        <li><b>Voir Barre de D&eacute;filements</b> - Ce sous -
        menu vous permet de choisir les barres de d&eacute;filement
        &agrave; afficher. Vous pouvez d&eacute;placer
        l'&eacute;cran en maintenant enfonc&eacute; le bouton
        gauche de la souris et en faisant glisser hors de la
        fen&ecirc;tre dans le direction o&ugrave; vous voulez. Les
        barres de d&eacute;filement sont toujours activ&eacute;es
        en mode &eacute;dition.</li>

        <li><b>Afficher les Infobulles Ic&ocirc;ne</b> - Ce sous -
        menu vous permet de choisir si infobulles des ic&ocirc;nes
        sont affich&eacute;es en mode &eacute;dition et quand non
        en mode &Eacute;dition. Lorsque la souris passe sur une
        ic&ocirc;ne, les infobulles sont activ&eacute;es, et le nom
        de l'ic&ocirc;ne est affich&eacute;e tandis que la souris
        reste sur l'ic&ocirc;ne. Les dessins
        d'&eacute;l&eacute;ments de voie n'ont pas
        d'infobulles.</li>

        <li><b>Activer l'Anticr&eacute;nelage (Lissage des
        lignes)</b> - Si cet &eacute;l&eacute;ment est
        s&eacute;lectionn&eacute;, le panneau est affich&eacute;
        (rendu) avec l'anticr&eacute;nelage autoris&eacute;.
        L'Anticr&eacute;nelage lisse les lignes dans le panneau de
        dessin, mais il prendra plus de temps pour rafra&icirc;chir
        le panneau. Cochez l'anticr&eacute;nelage pour avoir un
        panneau plus beau. D&eacute;cochez l'anticr&eacute;nelage
        pour acc&eacute;l&eacute;rer le
        rafra&icirc;chissement.</li>

        <li><b>Nouveau Titre...</b> - La s&eacute;lection de cet
        &eacute;l&eacute;ment fait appara&icirc;tre une petite
        fen&ecirc;tre qui permet l'entr&eacute;e d'un nouveau titre
        pour la fen&ecirc;tre du panneau.</li>

        <li><b>Ajouter Image de Fond...</b> - La s&eacute;lection
        de cet &eacute;l&eacute;ment affiche une boite de dialogue
        qui permetd'ajouter une image de fond dans le panneau. Voir
        <a href="#background">Fonds</a> ci-dessous pour plus
        d'informations.</li>

        <li><b>Ajouter Horloge Rapide</b> - La s&eacute;lection de
        cet &eacute;l&eacute;ment ajoute une horloge analogique
        rapide en haut &agrave; gauche. Vous pouvez ensuite faire
        glisser avec la touche m&eacute;ta press&eacute;e pour tout
        emplacement sur le panneau.</li>

        <li><b>Ajouter Pont Tournant</b> - La s&eacute;lection de
        cet &eacute;l&eacute;ment ajoute une plaque tournante pour
        le R&eacute;seau au centre du panneau. Vous pouvez ensuite
        le faire glisser avec la touche m&eacute;ta press&eacute;e
        &agrave; n'importe quel endroit sur le panneau.</li>

        <li><b>Ajouter &Eacute;tiquette Rapport...</b> - La
        s&eacute;lection de cet &eacute;l&eacute;ment affiche une
        boite de dialogue qui permet l'entr&eacute;e d'un nom de
        Rapport (nom syst&egrave;me ou nom utilisateur) et les
        coordonn&eacute;es x, y o&ugrave; l'&eacute;tiquette doit
        &ecirc;tre plac&eacute;e initialement. Les
        coordonn&eacute;es x, y s'appliquent au coin
        sup&eacute;rieur gauche de l'&eacute;tiquette. Pour
        cr&eacute;er une &eacute;tiquette Rapport, entrez le nom et
        les coordonn&eacute;es, puis cliquez sur <b>Ajouter
        Nouvelle &Eacute;tiquette</b>. Apr&egrave;s qu'une
        &eacute;tiquette ait &eacute;t&eacute; ajout&eacute;e la
        fen&ecirc;tre Ajouter une &Eacute;tiquette rapport reste
        ouverte pour permettre l'entr&eacute;e de plus
        d'&eacute;tiquettes Rapport. Pour fermer la fen&ecirc;tre,
        cliquez sur <b>Annuler</b> ou utilisez le bouton Fermer en
        haut.</li>

        <li><b>Enregistrer l'Emplacement et la Taille</b> - Lorsque
        cette option est s&eacute;lectionn&eacute;e, la taille de
        la fen&ecirc;tre du panneau courant et son emplacement
        remplace la taille par d&eacute;faut et l'emplacement de la
        fen&ecirc;tre du panneau. Si le panneau est
        sauvegard&eacute; sur le disque apr&egrave;s que cet
        &eacute;l&eacute;ment ait &eacute;t&eacute;
        s&eacute;lectionn&eacute;, quand le panneau est
        recharg&eacute; sa fen&ecirc;tre aura la taille et
        l'emplacement enregistr&eacute;s lorsque cet article a
        &eacute;t&eacute; s&eacute;lectionn&eacute;e, &agrave;
        condition que le syst&egrave;me d'exploitation informatique
        permette une fen&ecirc;tre avec cette taille et
        l'emplacement.</li>

        <li><b>Parm&eacute;trage de Largeurs voies...</b> - La
        s&eacute;lection de cet &eacute;l&eacute;ment affiche une
        boite de dialogue qui permet l'entr&eacute;e d'une largeur
        pour la voie principale et d'une largeur pour la voie
        d'&eacute;vitement. Toutes les voies principales et de
        toutes les voies secondaires dans le R&eacute;seau vont
        utiliser les nouvelles valeurs. (Voir ci-dessous pour plus
        d'informations sur les types de voie.)</li>

        <li><b>Param&eacute;trage Couleur de Voie par
        D&eacute;faut</b> - Le sous - menu de cet objet permet de
        s&eacute;lectionner la couleur de la voie par d&eacute;faut
        parmi un choix de treize couleurs. Si une partie de la voie
        est dans un canton, la couleur d&eacute;finie par le canton
        est utilis&eacute;e au lieu de la couleur de la voie par
        d&eacute;faut lors du dessin de cette voie. Cette couleur
        est aussi utilis&eacute;e pour les lignes du le rectangle
        de s&eacute;lection.</li>

        <li><b>R&eacute;glage de la couleur par D&eacute;faut du
        Texte</b> - Le sous - menu de cet objet permet de
        s&eacute;lectionn&eacute; une couleurs parmi treize pour
        &ecirc;tre la couleur du texte par d&eacute;faut.</li>

        <li>
          <b>Options Aiguillage</b> - Ce sous-menu permet de
          contr&ocirc;ler l'apparence des aiguillages sur le
          panneau. Il contient:

          <ul>
            <li><b>Afficher les cercles des Aiguillages</b> -
            Lorsque cette option est coch&eacute;e, les cercles au
            centre des aiguillages sont affich&eacute;s lorsqu'il
            n'est pas en mode &Eacute;dition. Les cercles des
            Aiguillages sont toujours montr&eacute;s dans le mode
            &Eacute;dition. Quand il n'est pas en mode
            &Eacute;dition, les cercles Aiguillage peuvent
            &ecirc;tre utiles Si vousvoulez basculer les
            aiguillages en cliquant sur eux.</li>

            <li><b>Couleurs Cercle Aiguillage</b> - Fixe la couleur
            du cercle de l'aiguillage. Par D&eacute;faut il utilise
            la couleur dela voie par d&eacute;faut.</li>

            <li><b>Taille Cercle Aiguillage</b> - D&eacute;finit la
            taille relative du cercle de l'aiguillage</li>

            <li><b>Dessiner la Branche Inutilis&eacute;e de
            l'Aiguillage</b> - Lorsqu'elle est activ&eacute;e,
            dessine la voie non s&eacute;lectionn&eacute;e de
            chaque aiguillage. Lorsqu'elle est
            d&eacute;sactiv&eacute;e, cette voie n'est pas
            dessin&eacute;e. Cela rend la position des aiguillages
            plus visibles lorsque l'angle de divergence est
            faible.</li>
          </ul>
        </li>
      </ul><a name="toolsmenu" id="toolsmenu"></a>

      <h2>Utilisation du Menu Outil de l'&Eacute;diteur de
      R&eacute;seau</h2>

      <p>Le menu Outils offre des outils d'aide &agrave; la
      cr&eacute;ation et &agrave; l'&eacute;dition de Panneaux
      d'&Eacute;dition de R&eacute;seau. L'utilisation de ces
      proc&eacute;dures automatis&eacute;es devrait r&eacute;duire
      le temps et les efforts n&eacute;cessaires pour cr&eacute;er
      votre panneau. Remarque: L'outil <b>Jeux Signaux</b> ne
      fonctionnera correctement que si les aiguillages et les
      limites des cantons sont orient&eacute;s essentiellement
      verticalement ou horizontalement la plupart du temps.</p>

      <ul>
        <li><b>&Eacute;chelle/Traduire Diagramme...</b> - La
        s&eacute;lection de cet &eacute;l&eacute;ment vous apporte
        une boite de dialogue qui permet la mise &agrave;
        l'&eacute;chelle et la traduction du diagramme de la voie.
        (Pour plus d'informations sur ce point, voir la page d'aide
        pour ce dialogue.)</li>

        <li><b>Translater S&eacute;lection...</b> - Avant de
        s&eacute;lectionner cet &eacute;l&eacute;ment,
        l'utilisateur doit s&eacute;lectionner une zone sur le
        panneau. Pour s&eacute;lectionner une zone, appuyez sur le
        bouton de la souris (Bouton gauche) avec le curseur en haut
        &agrave; gauche de la zone, et glissez vers la en bas
        &agrave; droite de la zone. Avec une s&eacute;lection
        active, la s&eacute;lection de ce point ouvre une boite de
        dialogue qui permet la translation de la zone
        s&eacute;lectionn&eacute;e. (Pour plus informations sur ce
        point, voir la page d'aide pour ce dialogue.)</li>

        <li><b>Annuler Translater S&eacute;lection</b> - La
        S&eacute;lection automatique de ce point inverse la
        s&eacute;lection pr&eacute;c&eacute;dente <b>Translater
        S&eacute;lection...</b>. Un seul niveau d'annulation est
        pris en charge. Si une s&eacute;lection n'a pas
        &eacute;t&eacute; translater, ce point est
        ignor&eacute;.</li>

        <li><b>Utilisation de la Taille par D&eacute;faut de
        l'aiguillage</b> - La s&eacute;lection de cette option
        permet de d&eacute;finir par d&eacute;faut les tailles de
        nouveaux Aiguillages par d&eacute;faut pour le programme
        &Eacute;dition de R&eacute;seau, annulation de tous les
        changements de taille par d&eacute;faut des aiguillage qui
        peuvent avoir &eacute;t&eacute; faits. Voir <a href=
        "#turnouts">Aiguillages</a> pour plus d'informations sur
        les formats d'aiguillage.</li>

        <li><b>Passer Aiguillages Internes non Signal&eacute;s</b>
        - Lorsque la mise en place de signaux logiques, L'outil
        <b>D&eacute;finition des Signaux...</b> de l'&Eacute;diteur
        de R&eacute;seau (d&eacute;crits ci-dessous) suivra la voie
        &agrave; l'int&eacute;rieur d'un canton jusqu'&agrave; ce
        qu'il trouve un signal ou un endroit o&ugrave; il s'attend
        &agrave; trouver un signal. Si le signal attendu est
        absent, un message est envoy&eacute; et la logique n'est
        pas mise en place. Si un canton a un aiguillage interne
        (l'aiguillage, et le tron&ccedil;on de voie &agrave; sa
        pointe et sa voie directe sont au sein du canton), les
        outils attendent des signaux &agrave; cette aiguillage,
        m&ecirc;me si ce n'est pas &agrave; la fin du canton.
        Cependant, parfois, l'utilisateur peut ne pas vouloir
        signaler un aiguillage rarement utilis&eacute; dans un
        canton. En suivant la voie &agrave; travers un canton, le
        programme va sauter l'aiguillage interne non signal&eacute;
        si cet &eacute;l&eacute;ment, <b>Passer Aiguillage Interne
        non Signal&eacute;</b>, est v&eacute;rifi&eacute;. Il
        avertira cependant toujours de ce qu'il fait. <b>Utilisez
        cette option avec prudence.</b> Il n'y a pas de signal de
        protection contre un aiguillage saut&eacute; car mal
        r&eacute;gl&eacute;, ainsi un aiguillage interne non
        signal&eacute; n'est pas d&eacute;fini correctement, un
        d&eacute;raillement des trains pourrait en
        r&eacute;sulter.</li>

        <li>R&eacute;gler les Signaux &agrave; l'Aiguillage... -
        Cet article propose une proc&eacute;dure automatis&eacute;e
        d'attribution des signaux &agrave; un aiguillage. les
        aiguillages droits, gauches et sym&eacute;triques sont pris
        en charge. Avant d'acc&eacute;der &agrave; ce point,
        l'aiguillage doit &ecirc;tre sur le panneau, et les
        t&ecirc;tes de signalisation n&eacute;cessaires doivent
        &ecirc;tre dans le Tableauau t&ecirc;te de signalisation.
        Lorsque cet &eacute;l&eacute;ment est
        s&eacute;lectionn&eacute;, une bo&icirc;te de dialogue est
        montr&eacute;e pour l'inscription du nom de l'aiguillage
        (syst&egrave;me ou utilisateur), et les noms des trois ou
        quatre t&ecirc;tes de signalisation pour &ecirc;tre
        plac&eacute; autour de l'aiguillage. Pour chaque t&ecirc;te
        de signalisation, des cases &agrave; cocher sont
        disponibles pour la s&eacute;lection si une ic&ocirc;ne
        doit &ecirc;tre plac&eacute; sur le panneau, et si la
        logique simple signal doit &ecirc;tre cr&eacute;&eacute;
        pour la t&ecirc;te de signalisation. Peu importe si les
        ic&ocirc;nes sont plac&eacute;es ou une logique est
        cr&eacute;&eacute;e, l'&Eacute;diteur de R&eacute;seau
        enregistre que les t&ecirc;tes de signaux entr&eacute;es
        sont attribu&eacute;es &agrave; l'aiguillage entr&eacute;.
        Cet outil peut ne pas avoir suffisamment d'informations
        pour cr&eacute;er des logique quand il est invoqu&eacute;
        pour la premi&egrave;re fois, donc vous pouvez avoir
        &agrave; y revenir plus tard, apr&egrave;s que tous les
        signaux aient &eacute;t&eacute; assign&eacute;s et,
        apr&egrave;s que les cantons aient &eacute;t&eacute;
        d&eacute;finis pour des zones de voie signal&eacute;es sur
        le panneau. Apr&egrave;s qu'un aiguillage ait
        &eacute;t&eacute; attribu&eacute; au dessin de
        l'aiguillage, cet outil peut &ecirc;tre atteint en
        s&eacute;lectionnant <b>R&eacute;gler Signaux...</b> dans
        le menu contextuel de cet aiguillage. (Pour plus
        d'informations, consultez la page d'aide pour le
        R&eacute;glage des Signaux situ&eacute; dans la boite de
        Dialogue Aiguillage).</li>

        <li><b>R&eacute;glages des Signaux &agrave; la
        Fronti&egrave;re du Canton...</b> - Cet
        &eacute;l&eacute;ment propose une proc&eacute;dure
        automatis&eacute;e d'attribution des signaux &agrave; une
        fronti&egrave;re de canton qui n'est pas associ&eacute;e
        &agrave; un aiguillage ou un croisement. Avant
        d'acc&eacute;der &agrave; cet article, les cantons doivent
        &ecirc;tre d&eacute;finis pour signaler les r&eacute;gions
        de la voie sur le panneau, et les t&ecirc;tes de
        signalisation requises doivent &ecirc;tre dans le Tableau
        t&ecirc;tes de signalisation. Lorsque cet
        &eacute;l&eacute;ment est s&eacute;lectionn&eacute;, une
        bo&icirc;te de dialogue est affich&eacute;e pour
        l'entr&eacute;e des noms des deux cantons dont la limite
        est signal&eacute;e, et pour l'entr&eacute;e des noms
        (syst&egrave;me ou utilisateur) d'une ou deux t&ecirc;tes
        de signalisation pour &ecirc;tre affect&eacute;es &agrave;
        la fronti&egrave;re du canton. Pour chaque t&ecirc;te de
        signalisation, des cases &agrave; cocher sont disponibles
        pour s&eacute;lection si une ic&ocirc;ne doit &ecirc;tre
        plac&eacute;e sur le panneau, et si une Logique Simple
        Signal doit &ecirc;tre cr&eacute;&eacute; pour la
        t&ecirc;te de signalisation. Peu importe si les
        ic&ocirc;nes sont plac&eacute;es ou de la logique est
        cr&eacute;&eacute;e, l'&Eacute;diteur de R&eacute;seau va
        enregistrer que les t&ecirc;tes de signalisation
        entr&eacute;es sont affect&eacute;es &agrave; la limite de
        canton sp&eacute;cifi&eacute;e. Si la cr&eacute;ation d'une
        logique est demand&eacute;e et l'outil n'a pas assez
        d'information disponible pour la mis en place la logique,
        vous pourriez avoir &agrave; revenir plus tard,
        apr&egrave;s que plusieurs signaux aient &eacute;t&eacute;
        attribu&eacute;s. Apr&egrave;s qu'un point d'ancrage ait
        &eacute;t&eacute; reconnu comme une limite de canton, cet
        outil peut &ecirc;tre atteint en s&eacute;lectionnant
        <b>D&eacute;finir Signaux...</b> dans le menu contextuel du
        point d'ancrage. (Pour plus d'informations, consultez la
        page d'aide pour le dialogue D&eacute;finitions de Signaux
        aux Fronti&egrave;res des Cantons.)</li>

        <li><b>D&eacute;finir Signaux aux Bretelles...</b> - Cet
        article propose une proc&eacute;dure automatis&eacute;e
        d'attribution des signaux &agrave; une bretelle. Il fournit
        &eacute;galement le placement des t&ecirc;tes de
        signalisation autour d'une bretelle et la mise en place
        d'une logique pour les signaux. Avant d'acc&eacute;der
        &agrave; cet &eacute;l&eacute;ment, les cantons doivent
        &ecirc;tre d&eacute;finis dans les r&eacute;gions de la
        voie signal&eacute;e sur le panneau, et les t&ecirc;tes de
        signalisation requises doivent &ecirc;tres dans le Tableau
        t&ecirc;te de signalisation. Lorsque cet
        &eacute;l&eacute;ment est s&eacute;lectionn&eacute;, une
        petite bo&icirc;te de dialogue est affich&eacute;e pour
        l'inscription du nom (syst&egrave;me ou utilisateur) de la
        bretelle &agrave; prot&eacute;ger. Le nom entr&eacute; doit
        correspondre &agrave; une bretelle double, une bretelle D,
        ou une bretelle G. (Si cet outil est accessible en
        s&eacute;lectionnant <b>D&eacute;finir Signaux...</b> dans
        le menu contextuel aiguillage, le nom de l'aiguillage est
        entr&eacute;e automatiquement.) Apr&egrave;s que la
        bretelle ait &eacute;t&eacute; identifi&eacute;e, une boite
        de dialogue est affich&eacute;e pour l'entr&eacute;e de
        noms (syst&egrave;me ou utilisateur) pour quatre &agrave;
        huit t&ecirc;tes de signaux pour &ecirc;tre
        affect&eacute;es &agrave; la bretelle. Pour chaque
        t&ecirc;te de signalisation, des cases &agrave; cocher sont
        disponibles pour la s&eacute;lection si une ic&ocirc;ne
        doit &ecirc;tre plac&eacute;e sur le panneau, et si la
        logique du signal doit &ecirc;tre cr&eacute;&eacute;e pour
        la t&ecirc;te de signalisation. Peu importe si les
        ic&ocirc;nes sont plac&eacute;es ou logique est
        cr&eacute;&eacute;e, l'&Eacute;diteur de R&eacute;seau
        retiendra que les t&ecirc;tes de signalisation
        entr&eacute;es sont affect&eacute;es &agrave; l'aiguillage
        d&eacute;termin&eacute;. Si cr&eacute;er une logique est
        demand&eacute;e et que l'outil n'a pas assez d'information
        disponible pour la mise en place de la logique, vous
        pourriez avoir &agrave; revenir plus tard, apr&egrave;s que
        plusieurs signaux aient &eacute;t&eacute; attribu&eacute;s.
        Apr&egrave;s qu'un aiguillage du Tableau aiguillage ait
        &eacute;t&eacute; attribu&eacute; &agrave; une bretelle,
        cet outil peut &ecirc;tre atteint en s&eacute;lectionnant
        <b>D&eacute;finir Signaux...</b> dans le menu contextuel de
        l'aiguillage. (Pour plus d'informations, consultez la page
        d'aide pour la mise en place des T&ecirc;tes de Signaux
        Situ&eacute;es aux Bretelles.)</li>

        <li><b>D&eacute;finir Signaux au croisement...</b> - Cet
        &eacute;l&eacute;ment propose une proc&eacute;dure
        automatis&eacute;e d'attribution des signaux &agrave; un
        croisement. Il fournit &eacute;galement le placement des
        t&ecirc;tes de signalisation autour du croisement et la
        mise en place d'une logique pour les signaux. Avant
        d'acc&eacute;der &agrave; cet outil, les cantons doivent
        &ecirc;tre d&eacute;finis pour la zone de voie
        signal&eacute;e sur le panneau, et les t&ecirc;tes de
        signalisation requises doivent &ecirc;tre dans le Tableau
        t&ecirc;tes de signalisation. Cet outil fonctionne mieux si
        le croisement est aussi la fronti&egrave;re entre les deux
        cantons dans chaque direction signal&eacute;e. Lorsque cet
        &eacute;l&eacute;ment est s&eacute;lectionn&eacute;, une
        bo&icirc;te de dialogue appara&icirc;t pour entrer un ou
        deux noms de cantons pour identifier le croisement qui doit
        &ecirc;tre signal&eacute;, et pour l'entr&eacute;e de noms
        (syst&egrave;me ou utilisateur) de deux ou quatre
        t&ecirc;tes de signalisation &agrave; dispos&eacute;es
        autour du croisement. Pour chaque t&ecirc;te de
        signalisation, des cases &agrave; cocher sont disponibles
        pour s&eacute;lectionner si une ic&ocirc;ne doit &ecirc;tre
        plac&eacute; sur le panneau, et si une simple logique
        Signal doit &ecirc;tre cr&eacute;&eacute;e pour la
        t&ecirc;te de signalisation. Peu importe si les
        ic&ocirc;nes sont plac&eacute;es ou la logique est
        cr&eacute;&eacute;, l'&Eacute;diteur de R&eacute;seau va
        enregistrer que les t&ecirc;tes de signalisation
        entr&eacute;es sont affect&eacute;es au croisement
        sp&eacute;cifi&eacute;. S'il est demand&eacute;e de
        cr&eacute;er une logique et que l'outil n'a pas assez
        d'information disponible pour la mise en place de la
        logique, vous pourriez avoir &agrave; revenir plus tard,
        apr&egrave;s que plusieurs signaux aient &eacute;t&eacute;
        attribu&eacute;s. Apr&egrave;s que les cantons aient
        &eacute;t&eacute; attribu&eacute;s &agrave; des voies de
        croisement, cet outil peut &ecirc;tre atteint en
        s&eacute;lectionnant <b>D&eacute;finir Signaux...</b>
        &agrave; ce niveau de menu contextuel croisement. (Pour
        plus d'informations, consultez la page d'aide pour
        D&eacute;finir Signaux Situ&eacute; au Croisement.)</li>

        <li><b>D&eacute;finir Signaux Aiguillages Pointe &agrave;
        Pointe...</b> - Cet article propose une proc&eacute;dure
        automatis&eacute;e pour l'attribution des signaux &agrave;
        deux aiguillages proches orient&eacute;s pointe &agrave;
        pointe, avec les pointes reli&eacute;s par un segment de
        voie unique. Cette disposition est utilis&eacute;e,
        o&ugrave; quatre voies se rejoignent dans une petite zone,
        donc 'aucun signal ne peut &ecirc;tre plac&eacute;s
        &agrave; la pointe de l'aiguillage. Une telle configuration
        est utilis&eacute;e pour mod&eacute;liser une
        travers&eacute;e - jonction double, par exemple, mais peut
        aussi survenir dans d'autres contextes. Chacun des deux
        aiguillages peut &ecirc;tre soit &agrave; droite (D),
        gauche (G), ou sym&eacute;trique (Y). Cet outil fournit le
        placement des t&ecirc;tes de signalisation sur les voies
        directes et divergentes des deux aiguillages. Il
        pr&eacute;voit &eacute;galement la mise en place d'une
        logique pour les signaux. Avant d'acc&eacute;der &agrave;
        cet article, les cantons doivent &ecirc;tre d&eacute;finis
        pourles r&eacute;gions de la voie signal&eacute;e sur le
        panneau, et les t&ecirc;tes de signalisation requises
        doivent &ecirc;tre dans le Tableau T&ecirc;tes de
        signalisation. Lorsque cet &eacute;l&eacute;ment est
        s&eacute;lectionn&eacute;, une bo&icirc;te de dialogue est
        affich&eacute;e pour l'entr&eacute;e des noms
        (syst&egrave;me ou utilisateur) des deux aiguillages
        &agrave; prot&eacute;g&eacute;, et pour l'entr&eacute;e des
        noms (syst&egrave;me ou utilisateur) des quatre &agrave;
        huit t&ecirc;tes de signalisation pour y &ecirc;tre
        affect&eacute;es. Pour chaque t&ecirc;te de signalisation,
        les cases &agrave; cocher sont disponibles pour la
        s&eacute;lection d'une ic&ocirc;ne T&ecirc;te de
        signalisation qui doit &ecirc;tre plac&eacute;e sur le
        R&eacute;seau, et la logique du signal si elle doit
        &ecirc;tre cr&eacute;&eacute; pour la t&ecirc;te de
        signalisation. Peu importe si les ic&ocirc;nes sont
        plac&eacute;es ou la logique est cr&eacute;&eacute;e,
        l'&Eacute;diteur de R&eacute;seau va enregistrer que les
        entr&eacute;es t&ecirc;tes de signalisation sont
        affect&eacute;es aux aiguillages sp&eacute;cifi&eacute;s,
        et que les deux aiguillages sont li&eacute;s dans une
        configuration sp&eacute;ciale pointe &agrave; pointe. Si la
        cr&eacute;ation d'une logique est demand&eacute;e et
        l'outil n'a pas assez d'information disponible pour la mise
        en place la logique, vous pourriez avoir &agrave; revenir
        plus tard, apr&egrave;s que plusieurs signaux aient
        &eacute;t&eacute; attribu&eacute;s. La premi&egrave;re fois
        qu'il est utilis&eacute; pour chaque configuration
        t&ecirc;te-b&ecirc;che, cet outil doit &ecirc;tre
        invoqu&eacute; &agrave; partir du menu Outils. Apr&egrave;s
        que l'&Eacute;diteur de R&eacute;seau ait enregistr&eacute;
        que les deux aiguillages sont li&eacute;s dans
        configuration, sp&eacute;ciale t&ecirc;te-b&ecirc;che,
        s&eacute;lectionnez <b>D&eacute;finir Signaux...</b> dans
        le menu contextuel l'un ou l'autre des aiguillages
        apportera cet outil avec les deux aiguillages
        identifi&eacute;s. (Pour plus d'informations, consultez la
        page d'aide pour la D&eacute;finition des Signaux pour
        Aiguillage T&ecirc;te - B&ecirc;ches.)</li>

        <li><b>D&eacute;terminer les Signaux pour une
        Travers&eacute;e Jonction</b> - Cet &eacute;l&eacute;ment
        fournit une proc&eacute;dure automatis&eacute;e pour
        attribuer des signaux &agrave; une TJ simple ou double, Il
        pr&eacute;voit &eacute;galement de placer les T&ecirc;tes
        de signal autour du croisement et pour la cr&eacute;ation
        d'une logique pour ces signaux. Avant d'acc&eacute;der
        &agrave; ce point, les cantonss doivent &ecirc;tre
        d&eacute;finis pour la zone de voie signal&eacute;e sur le
        panneau, et les T&ecirc;tes de signaux n&eacute;cessaires
        doivent &ecirc;tre dans le Tableau T&ecirc;te de signal.
        Lorsque cette option est s&eacute;lectionn&eacute;e, un
        menu d&eacute;roulant appara&icirc;t qui listes les
        Travers&eacute;es Jonction qui ont &eacute;t&eacute;
        d&eacute;finies sur le panneau pour &ecirc;tre
        signal&eacute;es , et les bo&icirc;tes de dialogue
        d'entr&eacute;e de noms (syst&egrave;me ou utilisateur) de
        signaux de quatre &agrave; huit t&ecirc;tes pour &ecirc;tre
        affect&eacute;s. Pour chaque t&ecirc;te de signal, des
        cases &agrave; cocher sont disponibles pour la
        s&eacute;lection si une ic&ocirc;ne T&ecirc;te de signal
        doit &ecirc;tre plac&eacute;e sur le panneau, et que la
        logique de signal doit &ecirc;tre cr&eacute;&eacute;e pour
        la t&ecirc;te de signal. Peu importe si les ic&ocirc;nes
        sont plac&eacute;es ou si la logique est
        cr&eacute;&eacute;e , l'&Eacute;diteur de circuits
        retiendra que les entr&eacute;es t&ecirc;tes de signal sont
        attribu&eacute;s aux aiguillages sp&eacute;cifi&eacute;s.
        Si la logique est demand&eacute;e et l'outil n'a pas
        suffisamment d'informations disponibles pour mettre en
        place la logique, vous pourriez avoir &agrave; revenir plus
        tard, apr&egrave;s que plus de signaux aient
        &eacute;t&eacute; attribu&eacute;s. Apr&egrave;s que les
        Cantons ont &eacute;t&eacute; attribu&eacute;s &agrave; une
        Travers&eacute;e Jonction, cet outil peut &ecirc;tre
        atteint en s&eacute;lectionnant <b>D&eacute;terminer des
        signaux...</b> dans le menu contextuel de la
        Travers&eacute;e jonction. (Pour plus d' informations,
        consultez la page d'aide pour l'ensemble des signaux d'une
        Travers&eacute;e Jonction.)</li>

        <li><b>D&eacute;finir Signaux pour Aiguillage 3
        voies...</b> - Cet article propose une proc&eacute;dure
        automatis&eacute;e pour l'attribution des signaux &agrave;
        deux aiguillages utilis&eacute;s pour mod&eacute;liser un
        un aiguillage 3 voies dans l'&Eacute;diteur de
        R&eacute;seau. Un aiguillage &agrave; 3 voies est
        mod&eacute;lis&eacute; en utilisant deux aiguillages,
        habituellement un droite et un gauche, orient&eacute; de
        sorte que la pointe du second aiguillage soit reli&eacute;e
        &agrave; la voie directe du premier aiguillage par un
        segment de voie tr&egrave;s court. Cet outil fournit une
        proc&eacute;dure automatis&eacute;e pour assigner des
        t&ecirc;tes de signalisation, en les pla&ccedil;ant sur le
        R&eacute;seau, et en cr&eacute;ant automatiquement la
        logique de signal pour un aiguillage &agrave; 3 voies
        mod&eacute;lis&eacute;s de cette mani&egrave;re. Cet outil
        peut &eacute;galement &ecirc;tre utilis&eacute; pour placer
        les t&ecirc;tes de signalisation et mettre la logique pour
        deux aiguillages r&eacute;els qui sont configur&eacute;s
        comme d&eacute;crit ci-dessus, o&ugrave; l'utilisateur ne
        veut pas mettre des signaux entre les deux aiguillages -
        essentiellement deux vrais aiguillages gauches ou droites
        qui simulent un aiguillage &agrave; 3 voies. Chacun des
        deux aiguillages peut &ecirc;tre soit de droite (D) ou
        gauche (G). Avant d'acc&eacute;der &agrave; cet article,
        les &eacute;l&eacute;ments cantons doivent &ecirc;tre
        d&eacute;finis pour les zones de voie signal&eacute;es sur
        le panneau, et les t&ecirc;tes de signalisation
        n&eacute;cessaires doivent &ecirc;tre dans le Tableau
        t&ecirc;te de signalisation. Lorsque cet
        &eacute;l&eacute;ment est s&eacute;lectionn&eacute;, une
        bo&icirc;te de dialogue est montr&eacute; pour entrer les
        noms (syst&egrave;me ou utilisateur) des deux aiguillages
        formant l'aiguillage &agrave; 3 voies &agrave;
        prot&eacute;ger, et pour entrer les noms (syst&egrave;me ou
        de l'utilisateur) de six (ou quatre) de t&ecirc;tes de
        signaux &agrave; affecter. Pour chaque t&ecirc;te de
        signalisation, des cases &agrave; cocher sont disponibles
        pour la s&eacute;lection si une ic&ocirc;ne t&ecirc;te de
        signalisation doit &ecirc;tre plac&eacute;e sur la panneau,
        et si la logique du signal doit &ecirc;tre
        cr&eacute;&eacute;e pour la t&ecirc;te de signalisation.
        Peu importe si les ic&ocirc;nes sont plac&eacute;es ou si
        la logique est cr&eacute;&eacute;e, l'&Eacute;diteur de
        R&eacute;seau enregistrera que les t&ecirc;tes de
        signalisation entr&eacute;s sont affect&eacute;es &agrave;
        l'aiguillage sp&eacute;cifi&eacute;, et que les deux
        aiguillages sont "li&eacute;s" pour simuler un aiguillage
        &agrave; 3 voies. Si cr&eacute;er de la logique est
        demand&eacute;e et que l'outil n'a pas assez d'information
        disponible pour mettre en place cette logique, vous
        pourriez avoir &agrave; revenir plus tard, apr&egrave;s que
        plusieurs signaux aient &eacute;t&eacute; attribu&eacute;s
        . La premi&egrave;re fois qu'il est utilis&eacute; pour
        chaque aiguillage &agrave; 3 voies, cet outil doit
        &ecirc;tre invoqu&eacute; &agrave; partir du menu Outils.
        Apr&egrave;s l'&Eacute;diteur de R&eacute;seau enregistre
        que les deux aiguillages sont li&eacute;s pour simuler une
        aiguillage &agrave; 3 voies, en s&eacute;lectionnant
        <b>D&eacute;finir Signaux...</b> dans le menu contextuel
        soit l'aiguillage fera appara&icirc;tre cet outil avec les
        deux aiguillages identifi&eacute;s. (Pour plus
        d'informations, consultez la page d'aide pour la
        fen&ecirc;tre D&eacute;finir Signals pour un aiguillage
        3-voies).</li>
      </ul><a name="zoommenu" id="zoommenu"></a>

      <h2>Utilisation du Menu Zoom de l'&Eacute;diteur de
      R&eacute;seau</h2>

      <p>Le menu de zoom permet d'agrandir temporairement un
      panneau. Le menu offre une choix de plusieurs facteurs de
      grossissement, et un &eacute;l&eacute;ment <b>Pas de zoom</b>
      pour revenir &agrave; la taille normale. Quand un facteur
      agrandissement est s&eacute;lectionn&eacute;, le panneau est
      amplifi&eacute; par ce facteur. Les barres de
      d&eacute;filement sont automatiquement r&eacute;gl&eacute;es
      sur des positions raisonnables. D&eacute;placer les barres de
      d&eacute;filement pour se concentrer sur diff&eacute;rentes
      parties du panneau.</p>

      <p>Quand un panneau est amplifi&eacute;, toutes les fonctions
      standard fonctionnent, sauf pour les infobulles des
      ic&ocirc;nes. Les &eacute;l&eacute;ments peuvent &ecirc;tre
      ajout&eacute;s, d&eacute;plac&eacute;s ou supprim&eacute;s.
      Les menus contextuels sont disponibles. Aiguillages et
      Multi-capteurs se comportent comme ils le font &agrave;
      l'&eacute;chelle normale. Si la grille est affich&eacute;e
      dans le mode modifier, elle est &eacute;galement agrandie.
      Toutes les coordonn&eacute;es affich&eacute;es sont celles du
      Panneau sans grossissement. Un groupe sp&eacute;cial peut
      &ecirc;tre sauv&eacute; alors qu'il est amplifi&eacute;.</p>

      <p>Quand un panneau est charg&eacute;, il vient toujours avec
      <b>Pas de Zoom</b> s&eacute;lectionn&eacute;. Puisque le zoom
      est temporaire, le facteur de zoom n'est pas conserv&eacute;
      lorsque le panneau est sauv&eacute;.</p><a name=
      "Marqueurmenu" id="Marqueurmenu"></a>

      <h2>Utilisation du Menu Marqueur de l'&Eacute;diteur de
      R&eacute;seau</h2>Le menu Marqueurs fournit les
      <b>Marqueurs</b> qui peuvent &ecirc;tre utilis&eacute;s pour
      garder une trace de la localisation des trains sur des
      panneaux du R&eacute;seau. Les marqueurs sont de petites
      ic&ocirc;nes color&eacute;es qui affichent une ID train,
      g&eacute;n&eacute;ralement le num&eacute;ro de la locomotive.
      Lors de l'ex&eacute;cution des trains, un marqueur est
      cr&eacute;&eacute; pour chaque train, et ce marqueur est
      d&eacute;plac&eacute; autour du panneau alors que le train
      traverse le r&eacute;seau. Cette fonctionnalit&eacute; est
      particuli&egrave;rement utile pour ceux qui n'ont pas du
      mat&eacute;riel de d&eacute;tection de canton, et ne peut
      donc pas utiliser le <b>Suivi de Train</b>
      caract&eacute;ristique de l'&Eacute;diteur de R&eacute;seau
      (voir ci-dessous <a href="#tracking"></a>).

      <p>Les marqueurs sont diff&eacute;rents des autres articles
      sur les panneaux &Eacute;diteur de R&eacute;seau. En ce que
      toutes les fonctions sont actives lorsque le panneau n'est
      pas en mode &eacute;dition. Les marqueurs peuvent &ecirc;tre
      cr&eacute;&eacute;s, repositionn&eacute;s, et retir&eacute;s
      &agrave; tout moment. Le menu Marqueur et les menus
      contextuels des Marqueurs individuels sont toujours actifs.
      Des marqueurs qui sont pr&eacute;sents sur un panneau sont
      sauvegard&eacute;s sur le disque lorsque le panneau est
      sauvegard&eacute; sur le disque.</p>

      <ul>
        <li><b>Ajouter Loco...</b> - La s&eacute;lection de cet
        &eacute;l&eacute;ment apporte une petite fen&ecirc;tre qui
        permet &agrave; un marqueur d'&ecirc;tre cr&eacute;&eacute;
        &agrave; partir d'une entr&eacute;e ID Loco. L'ic&ocirc;ne
        Marqueur n'est pas tr&egrave;s grande, donc pas plus de 6
        caract&egrave;res doivent &ecirc;tre saisis.
        Habituellement, le num&eacute;ro de la locomotive est
        entr&eacute;. Apr&egrave;s avoir entr&eacute; un ID Loco,
        cliquez sur OK, et un nouveau marqueur blanc appara&icirc;t
        au centre de la fen&ecirc;tre du panneau. Utilisez le menu
        contextuel marqueur pour changer sa couleur, etc. Refermer
        cette fen&ecirc;tre en cliquant sur l'ic&ocirc;ne de
        fermeture dans sa barre de titre.</li>

        <li><b>Ajouter Loco partir de la Liste...</b> - La
        s&eacute;lection de cet &eacute;l&eacute;ment apporte une
        petite fen&ecirc;tre qui permet qu'un marqueur soit
        cr&eacute;&eacute; pour une locomotive dans la Liste JMRI.
        Pour utiliser cette option, la locomotive doit &ecirc;tre
        dans la Liste JMRI avant que le panneau soit ouvert. Quand
        une locomotive est s&eacute;lectionn&eacute;e dans le menu
        liste, un marqueur pour cette locomotive appara&icirc;t
        imm&eacute;diatement dans le centre du panneau. Si elle est
        pr&eacute;sente dans l'entr&eacute;e Liste, le
        "num&eacute;ro de ligne" est utilis&eacute; comme l'ID
        Loco. Sinon, l'adresse DCC de la locomotive est
        utilis&eacute;e. Utilisez le marqueur de la fen&ecirc;tre
        du menu contextuel pour changer sa couleur, etc Pour les
        marqueurs cr&eacute;&eacute;s &agrave; partir d'une
        entr&eacute;e Liste, le menu contextuel du marqueur a un
        &eacute;l&eacute;ment <b>R&eacute;gulateur</b>, qui peut
        &ecirc;tre utilis&eacute; pour ouvrir un r&eacute;gulateur
        JMRI pour que cette locomotive. Refermer cette
        fen&ecirc;tre en cliquant sur l'ic&ocirc;ne de fermeture
        dans sa barre de titre.</li>

        <li><b>Retirez les marqueurs</b> - La s&eacute;lection de
        cet &eacute;l&eacute;ment supprime <b>tous</b> les
        marqueurs du panneau R&eacute;seau. Cet action ne peut pas
        &ecirc;tre annul&eacute;e. Remarque: Un seul marqueur peut
        &ecirc;tre retir&eacute; en s&eacute;lectionnant
        <b>Supprimer</b> dans son menu contextuel</li>
      </ul><a name="editing" id="editing"></a>

      <h2>&Eacute;diter et Supprimer des
      &Eacute;l&eacute;ments</h2>

      <p>Chaque &eacute;l&eacute;ment sur un panneau comporte un
      menu d&eacute;roulant. <b>Sauf pour les marqueurs, les menus
      contextuels sont seulement actifs en mode &eacute;dition.</b>
      Pour acc&eacute;der au menu contextuel d'un objet &agrave;
      base d'ic&ocirc;nes (, l'ic&ocirc;ne de signal,
      l'&eacute;tiquette de texte, l'&eacute;tiquette de la
      m&eacute;moire, multi - capteurs, horloge rapide,ic&ocirc;ne
      &eacute;tiquette, un rep&egrave;re, enregistreur ou de fond):
      sur les syst&egrave;mes Windows et Linux, faites un clic
      droit sur l'ic&ocirc;ne; sur les syst&egrave;mes Macintosh,
      le contr&ocirc;le - clic sur l'ic&ocirc;ne (maintenez la
      touche Ctrl enfonc&eacute;e et cliquez avec le bouton de la
      souris n sur un point quelconque de l'ic&ocirc;ne).Les
      &eacute;l&eacute;ments dessin&eacute;s sont similaires, sauf
      pour ceux que vous avez cliquez. Pour les aiguillages,
      croisements, ou des segments de voie, un Ctrl - clic ou clic
      - droit &agrave; l'int&eacute;rieur du cercle au centre de
      l'&eacute;l&eacute;ment. Pour les points d'ancrage ou de
      heurtoirs, le contr&ocirc;le - clic ou clic - droit
      l'int&eacute;rieur du carr&eacute; indiquant le point de
      connexion.</p>

      <p>Pour supprimer un &eacute;l&eacute;ment d'un panneau,
      s&eacute;lectionnez <b>Supprimer</b> dans le menu contextuel
      de cet &eacute;l&eacute;ment. Certains &eacute;l&eacute;ments
      afficheront une bo&icirc;te de dialogue de
      v&eacute;rification. La plupart des dialogues de
      v&eacute;rification ont une option pour fermer les
      bo&icirc;tes de dialogue de confirmation au cas o&ugrave;
      vous voudriez supprimer plusieurs &eacute;l&eacute;ments
      identiques. Quand un objet ic&ocirc;ne est "enlev&eacute;"
      &agrave; partir du panneau, son ic&ocirc;ne est
      supprim&eacute;e, mais l'article lui-m&ecirc;me (t&ecirc;te
      de signalisation, capteur, variable en m&eacute;moire, etc)
      n'est pas supprim&eacute;. Si vous avez besoin de supprimer
      l'&eacute;l&eacute;ment lui-m&ecirc;me, le faire en utilisant
      le Tableau correspondant (Tableau Signaux,Tableau Capteur,
      etc) <b>Remarque importante: Avant de supprimer un
      &eacute;l&eacute;ment dans un tableau, assurez - vous que
      toutes les r&eacute;f&eacute;rences &agrave; cet
      &eacute;l&eacute;ment sont retir&eacute;es des autres
      endroits. Aussi imm&eacute;diatement apr&egrave;s la
      suppression d'un &eacute;l&eacute;ment, enregistrez votre
      panneau et red&eacute;marrer avant de faire autre chose!</b>
      S'il n'y a pas de bonne raison pour supprimer un
      &eacute;l&eacute;ment, ou s'il existe une incertitude sur la
      suppression de toutes les r&eacute;f&eacute;rences &agrave;
      un &eacute;l&eacute;ments, ne pas supprimer
      l'&eacute;l&eacute;ment de son tableau. Les
      &eacute;l&eacute;ments suppl&eacute;mentaires
      inutilis&eacute;s dans une table ne d&eacute;range en rien,
      mais la suppression d'un &eacute;l&eacute;ment
      r&eacute;f&eacute;renc&eacute; peut causer des ennuis. La
      suppression d'une ic&ocirc;ne &agrave; partir d'un panneau
      est s&eacute;curitaire, mais la suppression de
      l'&eacute;l&eacute;ment que l'ic&ocirc;ne repr&eacute;sente
      n&eacute;cessite plus de prudence.</p>

      <p>Certains menus contextuels permettent des informations
      relatives &agrave; l'&eacute;l&eacute;ment &agrave; modifier
      directement dans le menu contextuel, par exemple, des options
      de taille de police, le style et la couleur du texte les
      &eacute;tiquettes et les &eacute;tiquettes de texte
      m&eacute;moire. Le menu contextuel permet l'arr&ecirc;t de
      l'horloge rapide et son red&eacute;marrage et de changer son
      rapport d'acc&eacute;l&eacute;ration. Les ic&ocirc;nes
      bas&eacute;e sur les menus contextuels montrent l'emplacement
      de l'ic&ocirc;ne sur le panneau <i>x</i> (horizontal) et
      <i>y</i> (vertical). Ces coordonn&eacute;es donnent
      l'emplacement du coin sup&eacute;rieur gauche de
      l'ic&ocirc;ne. Une fa&ccedil;on pratique de changer
      l'emplacement d'un &eacute;l&eacute;ment &agrave; base
      d'ic&ocirc;nes est de s&eacute;lectionner <b>D&eacute;finir X
      &amp; Y</b> dans son menu contextuel. S&eacute;lectionner
      <b>D&eacute;finir x &amp; y</b> fait appara&icirc;tre une
      petite fen&ecirc;tre qui donne un r&eacute;glage
      pr&eacute;cis de la position de l'ic&ocirc;ne.</p>

      <p>Avec les aiguillages, croisements, et les segments de
      voie, la s&eacute;lection <b>Modifier ...</b> dans le menu
      contextuel affiche une petite fen&ecirc;tre pour
      l'&eacute;dition. Si un aiguillage n'a pas de connexions, un
      &eacute;l&eacute;ment<b>rotation</b> appara&icirc;t dans son
      menu contextuel, permettant &agrave; l'aiguillage
      d'&ecirc;tre tourn&eacute; &agrave; n'importe quel angle.
      Plus d'informations sur les boites de dialogue &eacute;dition
      des aiguillages, croisements, et les segments de voie est
      contenue ci-dessous dans la discussion sur ces
      &eacute;l&eacute;ments, et dans la page d'aide de chaque
      bo&icirc;te de dialogue d'&eacute;dition.</p>

      <p>Un menu contextuel ic&ocirc;ne de signal permet
      d'&eacute;diter des informations sur le signal li&eacute; au
      R&eacute;seau, mais il contient aussi une rubrique
      <b>Modifier Logique...</b> qui ouvre une fen&ecirc;tre pour
      &eacute;diter une logique simple signal pour la t&ecirc;te de
      signalisation (pour plus d'informations sur la Logique simple
      signal, consultez l'aide de cette fen&ecirc;tre). La Logique
      simple signal soutient la signalisation ABS*, et se chargera
      de la plupart de vos besoins de logique signal. Reportez-vous
      &agrave; Logix pour une logique plus complexe
      n&eacute;cessaire qui n'est pas manipul&eacute;e par de
      logiques simples signal.</p>Avec les aiguillages,
      croisements, et les points d'ancrage, la plupart des outils
      de l'&Eacute;diteur de R&eacute;seau pour l'attribution des
      t&ecirc;tes de signalisation &agrave; ces
      &eacute;l&eacute;ments, pour le placement automatique des
      ic&ocirc;nes t&ecirc;te de signalisation sur le panneau, et
      pour la cr&eacute;ation automatis&eacute;e de la logique du
      signal pour les t&ecirc;tes de signalisation affect&eacute;es
      peuvent &ecirc;tre affich&eacute;s dans le menu contextuel
      jusqu'&agrave; ce qu'un minimum d'informations soit
      disponible pour les outils. Le reste des outils
      <b>D&eacute;finir Signaux...</b>speut &ecirc;tre accessible
      via le menu Outils. Ces outils sont bri&egrave;vement
      d&eacute;crit ci-dessous <a href="#toolsmenu">Utilisation du
      menu Outils de l'&Eacute;diteur de R&eacute;seau</a> , et
      sont discut&eacute;s en d&eacute;tail sur la page d'aide de
      la fen&ecirc;tre de dialogue de l'outil.

      <a name="turnouts" id="turnouts"></a>
      <h2>Aiguillages</h2>

      <p>L'&Eacute;diteur de R&eacute;seau prend en charge six
      types diff&eacute;rents d'appareils de voie (aiguillages):
      (<b>D</b>), <b>G</b>), Sym&eacute;trique (<b>Y</b>),
      (<b>Bretelle Double</b> ), (<b>Bretelle Droite</b>). et
      (<b>Bretelle Gauche</b>). Les deux autres types d'appareils
      de voie, parfois utilis&eacute; dans des mod&egrave;les de
      trains miniatures, jonction double et aiguillage triple, on
      peut les obtenir en utilisant deux aiguillages G ou D.Une
      jonction double, par exemple, est facilement
      repr&eacute;sent&eacute;s par deux aiguillages G et/ou D avec
      leurs pointes reli&eacute;es par un segment de voie courte.
      Une fois qu'un aiguillage a &eacute;t&eacute;
      cr&eacute;&eacute;, son type ne peut pas &ecirc;tre
      chang&eacute;. Changer le type d'un aiguillage
      n&eacute;cessite de retirer et de recr&eacute;er
      l'aiguillage. Le dessin des pi&egrave;ces d'un aiguillage
      peut &ecirc;tre allong&eacute;, raccourcie ou
      repositionn&eacute; en faisant glisser les points de
      connexion avec la Bouton droit de la souris, et l'aiguillage
      entier peut &ecirc;tre repositionn&eacute; en faisant glisser
      le cercle du centre avec la m&ecirc;me touche de la souris
      (en Linux).</p>

      <p>Lorsque de nouveaux aiguillages (et croisements) sont
      cr&eacute;&eacute;s, l'&Eacute;diteur de R&eacute;seau
      utilise par d&eacute;faut les d&eacute;placements depuis le
      centre du nouvel aiguillage pour redimensionner le nouveau
      dessin des aiguillage. L'&Eacute;diteur de R&eacute;seau
      dispose de deux ensembles de d&eacute;placements par
      d&eacute;faut, une pour pour les aiguillages r&eacute;guliers
      (<b>D</b>, <b>G</b>, <b>Y</b>) et une pour les bretelles (
      <b>Bretelle Double</b>, <b>Bretelle Droite</b>, <b>Bretelle
      Gauche</b>). Ces param&egrave;tres de taille par
      d&eacute;faut peuvent &ecirc;tre chang&eacute;s si une taille
      par d&eacute;faut diff&eacute;rente est n&eacute;cessaire.
      Cr&eacute;ez d'abord un nouvel aiguillage (ou
      s&eacute;lectionnez un aiguillage existants) et
      redimensionner en faisant glisser ses points de connexion.
      Ensuite, s&eacute;lectionnez <b>Utiliser la Taille Comme par
      D&eacute;faut</b> dans le menu contextuel de l'aiguillage.
      Ceci va changer les param&egrave;tres de taille par
      d&eacute;faut de sorte que les aiguillages suivant &agrave;
      ajout&eacute;e seront de la m&ecirc;me taille que
      l'aiguillage redimensionn&eacute;. Chaque <b>Taille Utilisez
      Comme par d&eacute;faut</b> change l'un des deux ensembles de
      param&egrave;tres de taille par d&eacute;faut. Les deux
      ensembles de param&egrave;tres de taille par d&eacute;faut
      sont enregistr&eacute;s lorsque le panneau est sauv&eacute;.
      Pour revenir &agrave; la taille des aiguillages par
      d&eacute;faut de l'&Eacute;diteur de R&eacute;seau,
      s&eacute;lectionner <b>'Utilisation Taille par D&eacute;faut
      des Aiguillages du Programme</b> dans le menu Outils.</p>

      <p>Les dessins d'aiguillages dans un sch&eacute;ma de voies
      sont dessin&eacute;s en utilisant les lignes solides pour les
      deux voies directe et d&eacute;vi&eacute;e jusqu'&agrave; ce
      que les dessins de l'aiguillage sont li&eacute;es &agrave; un
      aiguillage dans le Tableau Aiguillage. Une fois li&eacute;
      &agrave; aiguillages r&eacute;el, les dessins de l'aiguillage
      montrent les "&eacute;tats connus" des aiguillages qu'ils
      repr&eacute;sentent. Apr&egrave;s la liaison, vous pouvez
      basculer chaque aiguillage de votre R&eacute;seau en cliquant
      sur le point central de son dessin (&agrave; condition que
      <b>Autoriser Contr&ocirc;le de la Position</b> soitt
      coch&eacute;e dans le Menu Options, et votre syst&egrave;me
      DCC supporte le contr&ocirc;le informatique des aiguillages).
      La capacit&eacute; de basculer en cliquant peut &ecirc;tre
      d&eacute;sactiv&eacute; en cochant
      <b>D&eacute;sactiv&eacute;</b> dans le menu contextuel de
      l'aiguillage.</p>

      <p>Vous pouvez lier chaque dessin d'aiguillage avec une
      aiguillage r&eacute;elle (interne ou mat&eacute;riel) dans le
      Tableau Aiguillage quand les dessins sont
      cr&eacute;&eacute;s, en entrant son Nom du Tableau Aiguillage
      (nom syst&egrave;me ou nom utilisateur) dans <b>Aiguillage:
      Nom</b> (Rang&eacute;e du haut de la barre d'outils) avant de
      cliquer pour cr&eacute;er cet aiguillage. Alternativement,
      vous pouvez cr&eacute;er d'abord vos dessins aiguillage, puis
      s&eacute;lectionnez <b>Modifier...</b> dans chaque menu
      contextuel d'aiguillage &agrave; l'ouverture d'un dialogue
      aiguillage <b>Modifier</b> qui permet la saisie du nom de
      l'aiguillage. Une fois que le nom d'un aiguillage r&eacute;el
      est entr&eacute;, l'aiguillage r&eacute;el peut &ecirc;tre
      bascul&eacute; en cliquant avec la souris au centre de
      l'aiguillage. Basculer l'aiguillage peut &ecirc;tre
      d&eacute;sactiv&eacute; en cochant
      <b>d&eacute;sactiv&eacute;</b> dans le menu contextuel de
      l'aiguillage.</p>

      <p>En option, vous pouvez d&eacute;signer dans quel
      <b>Canton</b> un aiguillage se trouve en entrant un nom de
      canton dans le champs <b>canton: Nom</b> de la barre d'outil
      avant la cr&eacute;ation de chaque dessin d'aiguillage, ou en
      entrant un nom de canton dans la fen&ecirc;tre de dialogue
      &Eacute;dition Aiguillage &agrave; un moment
      ult&eacute;rieur. La bo&icirc;te de dialogue Modifier
      Aiguillage permet d'acc&eacute;der &eacute;galement &agrave;
      une bo&icirc;te de dialogue Modifier Canton, o&ugrave;
      l'information du canton pour l'aiguillage peut &ecirc;tre
      entr&eacute; ou chang&eacute;. (les cantons sont
      discut&eacute;s plus en d&eacute;tail ci-dessous.)</p>

      <p>Quand une voie secondaire se raccorde &agrave; une voie
      principale &agrave; un aiguillage D ou G, la Voie Principale
      continue normalement &agrave; travers l'aiguillage en suivant
      la voie droite (le chemin direct). Parfois, cependant, la
      ligne principale suit la voie divergente (le chemin
      d&eacute;vi&eacute;). Pour permettre l'entr&eacute;e de cette
      information, la boite de dialogue &Eacute;dition de
      l'aiguillage contient une entr&eacute;e appel&eacute;e
      <b>&Eacute;tat Aiguillage pour Continuation
      Itin&eacute;raire</b>. L'&Eacute;tat de l'Aiguillage par
      D&eacute;faut pour Poursuivre l'Itin&eacute;raire est
      l'&Eacute;tat Droit lorsqu'un dessin d'aiguillage est
      cr&eacute;&eacute;. Vous devriez le changer pour
      D&eacute;vi&eacute; si la voie principale suit la voie
      d&eacute;vi&eacute;e &agrave; travers l'aiguillage. Pour un
      aiguillage Triple, vous devriez toujours v&eacute;rifier pour
      voir si l' &Eacute;tat de l'aiguille pour Poursuivre son
      Itin&eacute;raire est correctement configur&eacute; pour
      refl&eacute;ter le chemin de la ligne principale. Pour tester
      si l'&Eacute;tat de l'aiguillage pour Suivre son
      Itin&eacute;raire est correctement r&eacute;gl&eacute;,
      v&eacute;rifiez l' &eacute;tat de l'aiguillage dans le
      Tableau Aiguillage lorsque l'aiguillage est fix&eacute; pour
      donner la voie principale. L'&eacute;tat du Tableau
      Aiguillage doit correspondre &agrave; l'&Eacute;tat de
      l'Aiguillage pour Poursuivre l'Itin&eacute;raire choisit dans
      la boite de dialogue &Eacute;diter Aiguillage. D&eacute;finir
      la voie principale est facultatif; si vous n'avez pas
      d&eacute;fini de voie principale ce point peut &ecirc;tre
      ignor&eacute;</p>

      <p>Les Bretelles diff&egrave;rent des aiguillages de
      plusieurs fa&ccedil;ons importantes. Comme d'autres
      aiguillages, les bretelles ont deux &eacute;tats -
      crois&eacute; et droit. Pour changer l'&eacute;tat d'une
      bretelle , cependant,cela n&eacute;cessite que deux ou quatre
      aiguillages changent simultan&eacute;ment. Ceci peut
      &ecirc;tre accompli en utilisant un &agrave; quatre
      commutateurs. Normalement, une bretelle est affect&eacute;e
      &agrave; une entr&eacute;e simple d'aiguillage dans la Table
      Aiguillage, mais il peut avoir y en plusieurs si ses moteurs
      sont contr&ocirc;l&eacute;s par diff&eacute;rents
      d&eacute;codeurs stationnaires. (Vous pouvez utiliser deux
      Itin&eacute;raires JMRI contr&ocirc;l&eacute;s par le
      m&ecirc;me aiguillage interne pour faire faire travailler les
      moteurs multiples ensemble. Dans ce cas, entrez l'aiguillage
      interne comme l'aiguillage li&eacute; au dessin de la
      bretelle.) Avec les bretelle, les voies de croisement sont
      toujours consid&eacute;r&eacute;es comme des voie
      d'&eacute;vitement , et de toute voie principale entrant dans
      l'aiguillage, quitte sur le m&ecirc;mes axe que son
      entr&eacute;e. Donc il n'y a pas de d'&Eacute;tat
      d'Aiguillage pour Suivre l'Itin&eacute;raire &agrave;
      entr&eacute;e dans une boite de dialogue &Eacute;dition
      Bretelle.</p>

      <p>Si vous d&eacute;finissez des cantons dans une liaison,
      noter que les bretelles ont quatre points de connexion, dont
      chacun peut &ecirc;tre connect&eacute; &agrave; un autre
      canton. Ainsi les pi&egrave;ces d'une bretelle peuvent
      &ecirc;tre dans un, deux, trois ou quatre cantons
      diff&eacute;rents. La bo&icirc;te de dialogue Modifier
      Aiguillage pour une bretelle permet l'entr&eacute;e d'un
      maximum de quatre cantons, chacun li&eacute; &agrave; un des
      quatre points de connexion. Le premier canton entr&eacute;
      doit &ecirc;tre le <b>Canton: Nom</b> sur le terrain; ce
      canton est li&eacute; au point de connexion gauche
      sup&eacute;rieure (si l'aiguillage n'a pas &eacute;t&eacute;
      tourn&eacute;), et sert de canton par d&eacute;faut pour la
      bretelle. Si pour les <b>canton 2</b>, <b>canton 3</b>, ou
      <b>canton 4</b> les entr&eacute;es sont vides, le canton par
      d&eacute;faut est utilis&eacute;. les points de connexion des
      canton sont num&eacute;rot&eacute;s 1, 2, 3 et 4, partant du
      point de connexion en haut &agrave; gauche dans le sens
      horaire.</p><a name="track" id="track"></a>

      <h2>Tron&ccedil;ons de voie et Points de connexion</h2>

      <p>Un <b>Segment de Voie</b> est un morceau de voie droite
      entre deux points de connexion. Les points de raccordement
      sont dessin&eacute;s comme des petits carr&eacute;s rouges ou
      verts. Les points de connexion sont disponibles sur les
      aiguillages, les points d'ancrage, heurtoirs, et croisement.
      Chaque aiguillage a trois ou quatre points de connexion,
      chacun acceptant une connexion. Chaque point d'ancrage a un
      point de connexion qui peut accepter deux connexions. Un
      heurtoir est semblable, mais accepte une seule connexion. Les
      croisements ont quatre points de connexion, chacun acceptant
      une connexion. Le point de connexion qui peut accepter un
      segment de voie de raccordement est titr&eacute;es en rouge.
      Quand un point de connexion a sa capacit&eacute; de
      connexions remplie, sa couleur passe au vert. Lorsque tous
      les points de connexion sont verts, un sch&eacute;ma de voie
      est complet, avec toutes les connexions d&eacute;finies.</p>

      <p>Les segments de voie sont normalement dessin&eacute;s en
      traits pleins, mais vous pouvez d&eacute;cider qu'un segment
      de voie soit dessin&eacute; en <i>Pointill&eacute;s</i> pour
      montrer les tunnels ou les voies traversant &agrave;
      diff&eacute;rents niveaux. Vous pouvez demander une ligne
      pointill&eacute;e pour un segment de voie en cochant
      <b>Pointill&eacute;</b> dans la barre d'outil avant que le
      segment de voie soit cr&eacute;&eacute;, ou vous pouvez
      changer un segment de voie en <b>Pointill&eacute;s</b> dans
      la boite de dialogue &Eacute;diter Segment. (Des points
      d'ancrage peuvent &ecirc;tre ajout&eacute;s pour obtenir que
      votre voie pointill&eacute;e couvre la zone exacte
      souhait&eacute;e.) Vous pouvez aussi d&eacute;signer un
      segment de voie <i>Cach&eacute;</i> donc il est
      affich&eacute; uniquement lorsque le mode &eacute;dition est
      actif. Les tron&ccedil;ons de voie <i>cach&eacute;s</i> sont
      utiles pour suivre les diagrammes dessin&eacute;s sur
      plusieurs niveau la fin d'un niveau se connecte au
      d&eacute;but du m&ecirc;me niveau ou d'un autre. Pour faire
      un segment de voie cach&eacute;, cochez <b>Masquer la
      Voie</b> dans la bo&icirc;te de dialogue &Eacute;diter
      Segment de Voie.</p>

      <p>En option, les segments de voie sont utilis&eacute;s pour
      d&eacute;signer la <i>voie principale</i> ou la <i>voie
      d'&eacute;vitement</i> . Les voies des aiguillages et des
      croisement sont d&eacute;termin&eacute; pour la <i>ligne
      principale</i> ou la <i>voie d'&eacute;vitement</i> selon les
      d&eacute;signations des segments de voie qui sont
      connect&eacute;s. Voir la discussion sur les
      itin&eacute;raires continus dans la section ci-dessus sur les
      aiguillages pour des informations sur comment une ligne
      principale est suivie gr&acirc;ce &agrave; un aiguillage.</p>

      <p>Si <b>Voie Principale</b> est coch&eacute;e dans la barre
      d'outils quand un segment de voie est cr&eacute;&eacute;, ce
      segment voie est d&eacute;sign&eacute; comme <i>voie
      principale</i>, sinon il est consid&eacute;r&eacute; comme
      <i>voie d'&eacute;vitement</i> . Vous pouvez changer de ligne
      principale pour une une voie d'&eacute;vitement, ou vice
      versa, dans la boite de dialogue &Eacute;diter Voie. La voie
      principale et la voie d'&eacute;vitement peuvent &ecirc;tre
      &eacute;tablies avec des lignes de diff&eacute;rentes
      largeurs. La largeurs de voie pour chacune sont
      d&eacute;finies en utilisant l'&eacute;l&eacute;ment
      <b>D&eacute;finir Largeur...</b>dans le menu Options.</p>

      <p>En option, vous pouvez d&eacute;signer dans quel
      <b>canton</b> se trouve un segment de voie - soit par entrer
      un nom de canton dans le <b>Canton: Nom</b> de la barre
      d'outil avant la cr&eacute;ation de chaque segment de voie,
      ou en entrant un nom de canton dans la boite de dialogue
      &Eacute;diter Segment de Voie &agrave; un moment
      ult&eacute;rieur. La bo&icirc;te de dialogue Modifier Segment
      de Voie permet de demander &eacute;galement une boite de
      dialogue Cr&eacute;er/Modifier Canton , afin que
      l'information pour le canton du segment de voie puisse
      &ecirc;tre entr&eacute;e ou modifi&eacute;e. (les cantons
      sont discut&eacute;s plus en d&eacute;tail ci-dessous.)</p>

      <p>Un <b>Connecteur</b> est utilis&eacute; pour indiquer que
      la voie en cours se termine sur ce panneau et peut se
      poursuivre sur un autre. Le connecteur utilise les
      m&ecirc;mes &eacute;tats rouge/vert d'un Point d'ancrage,
      avec un troisi&egrave;me &eacute;tat bleu qui signifie que le
      connecteur n'a pas &eacute;t&eacute; li&eacute;e &agrave; un
      segment de piste sur un panneau diff&eacute;rent. Pour faire
      le lien, faites un clic droit sur le connecteur et
      s&eacute;lectionnez "&Eacute;dition lien", la bo&icirc;te de
      dialogue qui s'affiche sera remplie par une liste des
      panneaux de r&eacute;seau disponibles, et les connecteurs de
      bord valides. Un connecteur de bord valide est d&eacute;fini
      comme un qui n'est pas d&eacute;j&agrave; connect&eacute;,
      est reli&eacute; &agrave; un segment de voie qui est
      configur&eacute; avec un canton, qui n'est pas le m&ecirc;me
      que le canton reli&eacute; &agrave; un Segment de voie est
      r&eacute;alis&eacute; sous une forme (par exemple:le
      connecteur de bord devient une limite de canton). Et que les
      deux segments de voie vont dans la m&ecirc;me direction.</p>

      <p><a name="xing" id="xing"></a></p>

      <h2>Croisements</h2>

      <p>Un croisement est une pi&egrave;ce particuli&egrave;re de
      la voie qui repr&eacute;sente deux voies traversant au niveau
      du sol. Un croisement a quatre points de connexion, et deux
      voies, d&eacute;sign&eacute; 1 et 2. Quand un croisement est
      cr&eacute;&eacute;e, la voie 1 est la voie horizontale, et la
      voie 2 est la voie coupante. L'angle entre les deux voies,
      l'inclinaison de chaque voie, et le longueur de chaque voie
      peut &ecirc;tre modifi&eacute;e en faisant glisser les points
      de connexion avec la touche m&eacute;ta enfonc&eacute;e. Le
      centre du croisement peut &ecirc;tre positionn&eacute; en
      faisant glisser le centre du cercle avec la touche Meta
      enfonc&eacute; (voir la barre d'aide pour ce qui est de la
      touche m&eacute;ta pour votre syst&egrave;me
      d'exploitation)(Bouton - droit pour Linux).</p>

      <p>Optionnellement chaque voie sera soit <i>voie
      principale</i> ou <i>voie d'&eacute;vitement</i> en fonction
      de la d&eacute;signation en voie principale ou en voie
      d'&eacute;vitement des segments de voie connect&eacute;s
      &agrave; chaque voie. Aussi vous pouvez optionnellement
      assigner ind&eacute;pendamment chaque voie &agrave; un canton
      diff&eacute;rent. Si un nom de canton est entr&eacute; dans
      <b>Canton: Nom</b> de la barre d'outils avant de cr&eacute;er
      un croisement, ce canton est attribu&eacute; aux deux voies.
      Chaque voie peut &ecirc;tre affect&eacute;e &agrave; un autre
      canton dans la boite de dialogue Modifier Croisement. La
      bo&icirc;te de dialogue Modifier Croisement permet
      &eacute;galement une boite de dialogue Cr&eacute;er/Modifier
      Canton qui doit &ecirc;tre demand&eacute;e pour chacun des
      deux cantons, afin que l'information pour ces cantons
      puissent &ecirc;tre incluses ou modifi&eacute;es. Le canton
      (s) affect&eacute; &agrave; un croisement peut &ecirc;tre
      diff&eacute;rent du canton (s) du tron&ccedil;on de voie
      reli&eacute;, dans ce cas, chaque croisement &agrave; un
      point de raccordement o&ugrave; les changements de canton
      sert de canton fronti&egrave;re. (les cantons sont
      discut&eacute;s plus en d&eacute;tail
      ci-dessous.)</p><a name="turn" id="turn"></a>

      <h2>Pont Tournant</h2>

      <p>Un pont tournant est une repr&eacute;sentation
      sch&eacute;matique d'un pont tournant sur le r&eacute;seau.
      Un pont tournant est dessin&eacute; comme un cercle avec un
      nombre variable de connexions de voie, appel&eacute;es
      <i>voies rayonnantes</i>. Chaque <i>voie rayonnante</i> est
      dessin&eacute;e comme une voie courte en talon rayonnant
      &agrave; partir du cercle du pont. Un segment de voie doit se
      connecter &agrave; chaque voie rayonnante. La plupart de ces
      segments de voies reliera une voie rayonnante &agrave; un
      heurtoir. La distance de chaque point de connexion de voie
      rayonnante &agrave; partir du cercle du pont est fixe, mais
      la direction de chaque voie rayonnante peut &ecirc;tre
      vari&eacute;e en faisant glisser son point de connexion
      autour du cercle du pont. Tout nombre de ponts peut
      &ecirc;tre ajout&eacute; &agrave; un panneau, et chaque pont
      peut avoir n'importe quel nombre de voies rayonnantes.</p>

      <p>Un pont est ajout&eacute; &agrave; un panneau en
      s&eacute;lectionnant <b>Ajouter pont</b> dans le menu Option
      panneau. Les nouveaux ponts sont plac&eacute;s au centre du
      panneau, et devraient &ecirc;tre d&eacute;plac&eacute;s au
      endroits souhait&eacute;s en d&eacute;pla&ccedil;ant son
      point central avec la touche m&eacute;ta enfonc&eacute;e
      (glisser bouton droit sur Windows et Linux). Quand un pont
      est ajout&eacute;, il a quatre voies rayonnantes
      situ&eacute;es en haut, en bas, &agrave; gauche et &agrave;
      droite. Le Menu contextuel du pont dispose de deux
      &eacute;l&eacute;ments. S&eacute;lectionner
      <b>Modifier...</b> fait appara&icirc;tre une bo&icirc;te de
      dialogue Modifier Pont, et en s&eacute;lectionnant
      <b>Supprimer</b> supprime le pont et tous les segments voie
      qui lui sont connect&eacute;s. Avant qu'un pont soit
      effectivement supprim&eacute;, le programme demande
      confirmation de cette action.</p>

      <p>La bo&icirc;te de dialogue Modifier Pont permet de
      modifier le rayon du cercle du pont, et pr&eacute;voit
      l'ajout et la suppression de voies rayonnantes. Pour de plus
      amples informations sur la fa&ccedil;on d'ajouter et de
      supprimer des voies rayonnantes, voir la page d'aide de la
      boite de dialogue Modifier Pont</p><a name="background" id=
      "background"></a>

      <h2>Fonds</h2>

      <p>Les images de fond ne sont pas requises pour les panneaux
      R&eacute;seau. Le support pour l'ajout d'un
      arri&egrave;re-plan est fourni pour les panneaux qui
      n&eacute;cessitent autre que le fond par d&eacute;faut
      &agrave; disposition sur l'Editeur de fond. Les images de
      fond peut &ecirc;tre utilis&eacute; simplement pour le
      changement de la couleur de l'arri&egrave;re-plan du
      R&eacute;seau, ou pour des applications plus
      sophistiqu&eacute;es, telles que la mise en place d'un
      panneau de la CTC.</p>

      <p>Une image de fond peut &ecirc;tre cr&eacute;&eacute;e en
      utilisant un &eacute;diteur d'images &agrave; base de pixels
      pour cr&eacute;er l'image, et de l'enregistrer comme un
      fichierau format d'image .gif. Vous pouvez cr&eacute;er une
      image de fond unique pour l'ensemble du panneau, ou
      cr&eacute;er des tranches verticales &agrave; utilis&eacute;
      dans un contexte multi - coupes (voir ci-dessous). Pour un
      fond multi - tranches, cr&eacute;er votre image tranche (s),
      puis ajouter les copies, l'une &agrave; droite de l'autre,
      jusqu'&agrave; ce que la superficie de l'aire
      d&eacute;sir&eacute;e soit couverte.</p>

      <p><b>Remarque importante: si vous cr&eacute;ez votre propre
      fond d'images (ou d'ic&ocirc;nes) ne les stockez pas avec les
      images JMRI pr&eacute;d&eacute;finis o&ugrave; elles seront
      effac&eacute;es lorsque vous mettrez &agrave; niveau JMRI. Au
      lieu de cela, cr&eacute;ez un nouveau dossier appel&eacute;
      "ressources" dans votre r&eacute;pertoire
      pr&eacute;f&eacute;rences JMRI (o&ugrave; votre fichier
      panneau est stock&eacute;), et ajouter vos images et les
      ic&ocirc;nes pour ce dossier.</b></p>

      <p>Une image de fond est ajout&eacute;e &agrave; un panneau
      en s&eacute;lectionnant l <b>Ajouter Image de fond...</b>
      dans le menu Option du panneau. La s&eacute;lection
      <b>Ajouter Image de fond...</b> met en place un dialogue de
      s&eacute;lection de fichier pour s&eacute;lectionner le
      fichier contenant l'image de fond. L'&Eacute;diteur
      R&eacute;seau fournit des images de fond multiples. La
      premi&egrave;re image de fond est plac&eacute; au coin
      sup&eacute;rieur gauche &agrave; x = 0 et y = 0. La prochaine
      image de fond est plac&eacute;e en haut du panneau et
      &agrave; la droite de l'image de fond existante &agrave;
      l'extr&ecirc;me droite. Ceci permet la mise en &oelig;uvre
      facile d'images de fond multi - coupes (voir ci-dessous). Le
      <i>x, y</i> emplacement du coin sup&eacute;rieur gauche de
      chaque image de fond est montr&eacute; dans son menu
      contextuel. Cet emplacement peut &ecirc;tre modifi&eacute;e
      en s&eacute;lectionnant Fixer <b>X &amp; Y</b> dans le menu
      contextuel.</p>

      <p>Pour les utilisateurs construisant un panneau classique
      am&eacute;ricain &amp; S, il existe deux s&eacute;ries
      d'images pr&eacute;d&eacute;finies "Tranches" actuellement
      disponibles. Un ensemblede 718 pixels de haut, et le
      deuxi&egrave;me ensemble de 900 pixels de haut. Choisissez
      l'ensemble qui correspond le mieux &agrave; votre
      &eacute;cran. Ces "tranches" sont Situ&eacute; &agrave;
      icons/USS/background/. Les images de 900 pixels de haut
      inclus un "-9" dans leurs noms. Les images bords gauche et
      droit ont chacun 12 pixels de large. Les principales
      "tranches" du panneauont 65 pixels de large. Ajouter d'abord
      l'image bord gauche, puis ajouter une tranche ou une vierge,
      y compris plaque d'interrupteur (s) pour chaque aiguillage
      sur votre panneau CTC, puis terminer en ajoutant l'image bord
      droit. Les avantages de la la construction de fond CTC avec
      des tranches sont que 1) vous pouvez faire pratiquement tout
      Longueur de panneau CTC, et 2) les plaques seront
      pr&eacute;cis&eacute;ment positionn&eacute;es
      automatiquement.</p><a name="block" id="block"></a>

      <h2>Cantons</h2>

      <p>Les cantons sont des tron&ccedil;ons de voie dont
      l'occupation peut &ecirc;tre suivi individuellement. Diviser
      la voie en cantons est facultative. Les cantons mis en place
      dans un sch&eacute;ma de voies correspondent normalement
      &agrave; des cantons physiques sur un r&eacute;seau.
      L'Occupation du canton est indiqu&eacute;e par l'&eacute;tat
      d'un capteur <i>d'occupation</i>. Lorsque la voie d'un
      r&eacute;seau est divis&eacute;e en cantons, toutes les voie
      ne doivent pas appartenir &agrave; un canton. Par exemple la
      voie de triage, n'est normalement pas dans un canton, alors
      que la voie principale sera toujours divis&eacute;e en
      cantons. La principale utilisation des cantons est de
      faciliter la signalisation, mais les cantons peuvent
      &ecirc;tre utilis&eacute;s pour contr&ocirc;ler d'autres
      fonctions d'animation sur le r&eacute;seau.</p>

      <p>Si un nom de canton est entr&eacute; dans <b>Canton:
      Nom</b> de la barre d'outil avant l'ajout d'un aiguillage,
      croisement, ou un segment de voie, l'&eacute;l&eacute;ment
      ajout&eacute; est attribu&eacute; &agrave; ce canton, si un
      nom de capteur (le nom d syst&egrave;me ou nom 'utilisateur)
      a &eacute;t&eacute; entr&eacute; dans le <b>Capteur
      d'Occupation</b> dans le champs, ce capteur sera
      attribu&eacute; &agrave; l'entr&eacute;e du canton. Un
      aiguillage, le segment de voie, ou un croisement, peuvent
      &eacute;galement &ecirc;tre affect&eacute;s &agrave; un
      canton en entrant le nom de ce canton dans le dialogue
      d'&eacute;dition accessible en s&eacute;lectionnant
      <b>Modifier...</b> dans cet &eacute;l&eacute;ment du menu
      contextuel. Dans les deux cas, si un canton avec le nom
      entr&eacute; n'existe pas, il est cr&eacute;&eacute;.</p>

      <p>Un nom de canton peut &ecirc;tre n'importe quelle
      s&eacute;rie de caract&egrave;res alphab&eacute;tiques ou
      num&eacute;riques qui d&eacute;crivent le canton, par
      exemple, "Red principal 2", "lac Siding", ou "Moose Block".
      Une fois qu'un canton est cr&eacute;&eacute;, son nom ne peut
      &ecirc;tre chang&eacute;; tenter de changer un canton de Nom
      va cr&eacute;er un nouveau canton ayant le nouveau nom.
      Apr&egrave;s tous les &eacute;l&eacute;ments affect&eacute;s
      &agrave; l'ancien canton seront modifi&eacute;s pour le
      nouveau canton, le canton avec l'ancien nom sera
      automatiquement supprim&eacute; (voir ci-dessous).</p>

      <p>L'aiguillage, croisement, et segment de voie
      &eacute;ditent des dialogues permettant d'acc&eacute;der aux
      dialogue Cr&eacute;er/Modifier canton o&ugrave; les
      informations sp&eacute;cifiques &agrave; un canton peuvent
      &ecirc;tre inscrites ou modifi&eacute;es. Le champ <b>Capteur
      d'Occupation:</b> dans la bo&icirc;te de dialogue
      Cr&eacute;er/Modifier canton indique le nom du capteur
      d'occupation actuellement affect&eacute; au canton, s'il y en
      a un. Pour entrer ou changer le capteur d'occupation, entrez
      le nom (nom syst&egrave;me ou nom utilisateur) d'un capteur
      dans le Tableau du Capteur dans le <b>capteur
      d'occupation:</b>. Un capteur peut &ecirc;tre affect&eacute;
      en tant que capteur d'occupation d'un seul canton; tenter de
      faire autrement se traduira par un message d'erreur.
      Normalement, l'&eacute;tat d'un capteur d'occupation est
      "actif" quand un canton est occup&eacute;, si "Actif" est la
      valeur automatique par d&eacute;faut pour les occupations.
      Cela peut &ecirc;tre modifi&eacute;e en s&eacute;lectionnant
      "inactifs" dans <b>Valeur occup&eacute;:.</b> de la
      bo&icirc;te de s&eacute;lection</p>

      <p>Les couleurs de voie des cantons sont utilis&eacute;s au
      lieu de la couleur de la voie par d&eacute;faut si une
      section de voie est dans un canton. Les
      &eacute;l&eacute;ments de voie dans un canton sont
      dessin&eacute;s avec des couleurs de voie diff&eacute;rentes
      pour les &eacute;tats occup&eacute;s et inoccup&eacute;s,
      permettant &agrave; la voie dans un canton les changement de
      couleur quand un train entre et sort de ce canton. Pour
      d&eacute;finir les couleurs voie, s&eacute;lectionner la
      couleur de la voie inoccup&eacute;e dans la bo&icirc;te de
      s&eacute;lection <b>Couleur de Voie:</b> , et
      s&eacute;lectionnez la couleur de voie occup&eacute;e dans la
      bo&icirc;te de s&eacute;lection <b>Couleur de Voie
      Occup&eacute;e:</b>. Une autre couleur de la voie
      inoccup&eacute;e est pr&eacute;vu pour des utilisations
      particuli&egrave;res. Par exemple,Le Dispatcheur a une option
      pour utiliser la couleur de voie alternative inoccup&eacute;e
      pour les cantons qui sont allou&eacute;s, mais
      inoccup&eacute;s. R&eacute;glez la couleur de la voie
      alternative inoccup&eacute;e en utilisant la couleur de voie
      <b>alternative:</b> dans la bo&icirc;te de s&eacute;lection.
      Quand la couleur voie est d&eacute;termin&eacute;e,
      l'&Eacute;diteur de R&eacute;seau utilise la couleur de la
      voie occup&eacute;e si un canton est occup&eacute;, puis si
      elle n'est pas occup&eacute;e, va utiliser la couleur de voie
      alternative inoccup&eacute;e si elle a &eacute;t&eacute;
      demand&eacute;, sinon il utilise la couleur de voie
      inoccup&eacute;e.</p>

      <p>Optionnellement une Variable M&eacute;moire peut
      &ecirc;tre affect&eacute;e &agrave; un canton en entrant son
      nom (Nom syst&egrave;me ou nom utilisateur) dans le champs
      <b>Nom Variable M&eacute;moire:</b>. Ceci est utile lors de
      la mise en place du suivi des trains (voir ci-dessous
      <a href="#tracking"></a>). Assurez - vous que la variable
      m&eacute;moire est dans le Tableau Variable M&eacute;moire
      avant de l'entrer ici.</p>

      <p>Puisque les cantons sont des &eacute;l&eacute;ments sur le
      r&eacute;seau physique, le m&ecirc;me canton peut &ecirc;tre
      utilis&eacute; dans plus d'un panneau. Par cons&eacute;quent,
      l'information canton est sauvegard&eacute; dans portion
      sp&eacute;cifique non - panneau de l'information du
      r&eacute;seau, lorsque les panneaux sont enregistr&eacute;s
      dans un fichier sur le disque.</p>

      <p>Les cantons sont automatiquement supprim&eacute;s quand
      ils ne sont plus utilis&eacute;s. L'&Eacute;diteur de
      R&eacute;seau garde la trace du nombre
      d'&eacute;l&eacute;ments de piste (aiguillages, des segments
      de piste, et de croisement) qui sont affect&eacute;s &agrave;
      un canton. Ce nombre est affich&eacute; dans l'option
      Cr&eacute;er/Modifier canton comme <b>Utilisez Compteur
      courant:</b>. Lorsque les panneaux sont enregistr&eacute;s
      sur le disque, seuls les cantons avec une utilisation du
      compteur plus grande que z&eacute;ro sont
      enregistr&eacute;s.</p><a name="tracking" id="tracking"></a>

      <h2>Cantons, &Eacute;tiquettes M&eacute;moire, et Suivi de
      Train</h2>

      <p>Le <b>Suivi de Train</b> est une technique d'animation qui
      nous permet d'afficher en dynamique, quand un train occupe un
      canton. Ainsi, pour un train, ou pour plusieurs trains
      circulant sur le r&eacute;seau en m&ecirc;me temps, nous
      pouvons montrer o&ugrave; chaque train est &agrave; un moment
      donn&eacute;.Le <b>Suivi Train</b> utilise le logiciel canton
      JMRI. Chaque canton occup&eacute; a une <i>valeur</i>, qui
      est automatiquement pass&eacute;e de canton en canton quand
      un train se d&eacute;place de canton en canton.La
      <i>Valeur</i> d'un canton est effac&eacute;e lorsque le
      canton n'est plus occup&eacute;. Ainsi, la <i>valeur</i> suit
      le train autour du circuit. Le R&eacute;glage de la
      <i>valeur</i> pour un nom de train, passe le nom du train de
      canton en canton.</p>

      <p>L'&Eacute;diteur de R&eacute;seau dispose d'un outil
      int&eacute;gr&eacute; qui initialise automatiquement chaque
      canton, la Cr&eacute;ation des chemins n&eacute;cessaires et
      BeanSettings. Cette initialisation (d&eacute;j&agrave; fait
      dans les scripts uniquement) est n&eacute;cessaire pour
      permettre au logiciel de canton de suivre les trains.Puisque
      l'&Eacute;diteur de R&eacute;seau capture la
      connectivit&eacute; compl&egrave;te de son panneau, il a
      l'information n&eacute;cessaire pour effectuer cette
      initialisation. L'initialisation d'un canton est
      effectu&eacute;e automatiquement lorsque les cantons sont
      chang&eacute;s et quand un panneau de R&eacute;seau est
      charg&eacute;. Puisque l'initialisation est automatique, les
      utilisateurs du R&eacute;seau n'ont pas besoin d'&ecirc;tre
      concern&eacute;s par les chemins et param&egrave;tres des
      entit&eacute;s des cantons.</p>

      <p>L'&Eacute;diteur de R&eacute;seau permet &agrave; une
      Variable M&eacute;moire d'&ecirc;tre affect&eacute;e &agrave;
      chaque canton. Lorsque la <b>valeur</b> d'un Canton
      changes,L'&Eacute;diteur de R&eacute;seau automatiquement
      copie la nouvelle <i>valeur</i> du Canton dans sa Variable
      M&eacute;moire (s'il en existe une). Ainsi, en utilisant une
      &Eacute;tiquette M&eacute;moire &agrave; proximit&eacute; de
      chaque canton, le nom du train dans ce canton peut &ecirc;tre
      affich&eacute;.</p>

      <p>Cela peut para&icirc;tre compliqu&eacute;, mais c'est
      tr&egrave;s facile &agrave; installer car Canton de JMRI et
      le logiciel &Eacute;diteur de R&eacute;seau fait presque tout
      automatiquement. Il y a m&ecirc;me des logiciels pour
      enregistrer automatiquement et restaurer les <i>valeurs</i>
      Canton entre les sessions.</p>

      <p>Si votre panneau est bloqu&eacute; et que chaque canton a
      un capteur mat&eacute;riel d'occupation, R&eacute;gler le
      Suivi Train pour effectuer les op&eacute;rations
      suivantes:</p>

      <ul>
        <li>1. Cr&eacute;ez une variable de m&eacute;moire dans le
        Tableau Variable M&eacute;moire pour chaque canton.</li>

        <li>2. Modifier chaque canton, ajoutant son nom de variable
        de la m&eacute;moire ( <a href="#cantonk">voir
        ci-dessus</a>).</li>

        <li>3. Placez une &Eacute;tiquette M&eacute;moire pour
        attribuer sa variable de m&eacute;moire &agrave;
        proximit&eacute; de chaque canton dans le panneau.</li>

        <li>4. Ouvrez le Tableau Cantons, et entrez le nom de
        chaque train dans la colonne "Valeur" du canton qu'il
        occupe. <b>N'oubliez pas de cliquer quelque part en dehors
        de la zone d'entr&eacute;e apr&egrave;s avoir saisi un nom
        de train pour que Java lise ce qui a &eacute;t&eacute;
        entr&eacute;.</b></li>
      </ul>

      <p>Remarque: Si le programme d&eacute;tecte qu'un canton est
      inoccup&eacute; <i>avant</i>que la <i>valeur</i> du canton
      soit pass&eacute; sur le canton suivant, le nom de train sera
      perdu. Il est donc important d'avoir des roues et des voies
      propres, et d'avoir assez de voitures dans chaque train dans
      le trac&eacute; courant afin d'assurer que le canton de
      d&eacute;tection ne perde pas l'information avant que le
      train p&eacute;n&egrave;tre dans le bloc suivant.</p><a name=
      "tips" id="tips"></a>

      <h2>Conseils</h2>

      <p>En raison de la fa&ccedil;on dont un panneau R&eacute;seau
      est rafra&icirc;chi, le sch&eacute;ma &eacute;tabli sera sur
      le dessus de toutes les ic&ocirc;nes et les
      &eacute;tiquettes. Il est possible d'avoir une
      &eacute;tiquette ou une ic&ocirc;ne qui semblent &ecirc;tre
      "sur le dessus d'une" section de voie, comme cela est
      couramment fait dans l'&eacute;diteur de configuration. Pour
      cr&eacute;er une rupture dans le suivi visible, sans rompre
      la connectivit&eacute;, placer un Point d'ancrage &agrave;
      chaque extr&eacute;mit&eacute; de la rupture. Reliez ces
      points d'ancrage avec un segment de voie. Rendre le segment
      de voie de liaison invisible par l'&eacute;dition et cocher
      <b>Masquer Voie</b>. Le segment de voie appara&icirc;tra
      comme une ligne &eacute;troite en mode &eacute;dition, mais
      sera invisible lorsque le mode &eacute;dition est
      d&eacute;sactiv&eacute;.</p>

      <p>Rappelez - vous que "les noms syst&egrave;me" des
      &eacute;l&eacute;ments (aiguillages, les capteurs, les
      t&ecirc;tes de signalisation, etc) ne peuvent pas &ecirc;tre
      modifi&eacute;s, mais que "les noms utilisateur" peuvent
      &ecirc;tre chang&eacute;. S'il y a une chance que Vous
      puissiez modifier le nom utilisateur d'un article, utilisez
      son nom syst&egrave;me lors de la saisie du nom de
      l'&eacute;l&eacute;ment. Si vous utilisez le nom
      d'utilisateur, puis modifier le nom d'utilisateur, tous les
      affectations utilisant l'ancien nom d'utilisateur seront
      inutilisables, jusqu'&agrave; ce que vous modifiez toutes les
      occurrences de l'ancien nom par le nouveau nom. Comme les
      panneaux &Eacute;diteur de R&eacute;seau sont
      enti&egrave;rement &agrave; base d'ic&ocirc;ne, leur
      sch&eacute;ma de voie a la possibilit&eacute; d'&ecirc;tre
      regarder d'une mani&egrave;re plus prototypiques.L'
      &Eacute;diteur de R&eacute;seau ont plus de
      possibilit&eacute;s d'animation et des outils
      automatis&eacute;s pour la mise en place des signaux, le
      suivi des trains, etc. Si vous souhaitez deux mondes,
      envisager &agrave; la fois la construction d'&Eacute;diteur
      de Panneau et de panneaux R&eacute;seau pour votre
      r&eacute;seau. Vous pouvez facilement passer de l'un &agrave;
      l'autre par le menu <b>Panneaux</b>. Puisque que les deux
      types de panneaux partagent les m&ecirc;mes
      &eacute;l&eacute;ments de configuration (Aiguillages,Capteurs
      Variable M&eacute;moire, t&ecirc;tes de signalisation, etc.),
      Ce qui est fait dans un panneau est r&eacute;fl&eacute;chi
      dans l'autre si les m&ecirc;mes articles sont
      affich&eacute;s. Apr&egrave;s qu'ils aient &eacute;t&eacute;s
      charg&eacute;s, les panneaux continuent &agrave; fonctionner,
      qu'ils soient affich&eacute;s ou non. Ils ont juste besoin
      d'&ecirc;tre pr&eacute;sent dans le sous - menu <b>Affichcher
      Panneau</b> Ainsi, par exemple, si vous install&eacute; un
      Panneau R&eacute;seau pour le suivi des trains comme vue plus
      haut, Vous pouvez suivre les trains dans un panneau compagnon
      Editeur de Panneau juste en ajoutant des &Eacute;tiquettes
      M&eacute;moires.</p><a name="finish" id="finish"></a>

      <h2>Mettre la Touche Finale &agrave; votre Panneau</h2>

      <p>Ci-dessous est une version am&eacute;lior&eacute;e du
      panneau simple ovale construit avec <b>D&eacute;buter avec
      &Eacute;diteur de R&eacute;seau</b>. Les &eacute;tapes
      g&eacute;n&eacute;rales n&eacute;cessaires pour obtenir
      depuis le panneau de d&eacute;part ce panneau sont
      esquiss&eacute;es ci-dessous. Les &eacute;tapes ne doivent
      pas &ecirc;tre faites dans le m&ecirc;me ordre
      pr&eacute;sent&eacute;. Les choses sont
      pr&eacute;sent&eacute;es dans l'ordre, mais des variations
      sont possibles pour arriver au m&ecirc;me point final. Cet
      exemple est pr&eacute;sent&eacute; pour illustrer certaines
      des choses qui peuvent &ecirc;tre faites facilement en
      utilisant l'&Eacute;diteur de R&eacute;seau. Vous pouvez
      choisir de faire plus ou moins sur vos panneaux
      R&eacute;seau.</p>

      <p><a href="./images/OvalLayoutEditMode.gif"><img src=
      "./images/EnhancedPanel.gif" width="592"
      height="171" hspace="0" vspace="0"></a></p>

      <ul>
        <li>Les aiguillages du Tableau Aiguillage ont
        &eacute;t&eacute; assign&eacute;s &agrave; chaque dessin
        d'aiguillage utilisant l'&eacute;l&eacute;ment
        <b>&Eacute;diter...</b> dans le menu contextuel de chaque
        aiguillage.</li>

        <li>Les trois points d'ancrage ont &eacute;t&eacute;
        ajout&eacute;s, l'un sur chaque voie lat&eacute;rale
        verticale, et un autre sur la voie du bas pour servir de
        <i>limites de canton</i>. Les fronti&egrave;res de canton
        sont des lieux sur la voie o&ugrave; deux cantons se
        rejoignent; La voie &agrave; une fronti&egrave;re de canton
        est normalement coup&eacute;e sur le r&eacute;seau. L'ajout
        de points d'ancrage a &eacute;t&eacute; rendue plus facile
        en utilisant l'outil <b>Translater S&eacute;lection</b>...
        Dans le Menu Outils, pour &eacute;taler le panneau initial
        dans les directions vertical et horizontale.</li>

        <li>La voie du R&eacute;seau a &eacute;t&eacute;
        divis&eacute;e en cantons par l'affectation de noms de
        cantons &agrave; tous les segments de voies et aiguillages.
        Quand un nom de canton est entr&eacute;, si un canton de ce
        nom n'existe pas, un nouveau canton est cr&eacute;&eacute;
        automatiquement. Les aiguillages ont &eacute;t&eacute;
        plac&eacute;s dans le m&ecirc;me canton que le segment de
        voie reli&eacute; &agrave; la pointe (cot&eacute;
        &eacute;quipage mobile), et les points des segments direct
        et d&eacute;vi&eacute; de l'aiguillage ont
        &eacute;t&eacute; plac&eacute;s dans des cantons
        diff&eacute;rents.</li>

        <li>Les noms de cantons sont &eacute;t&eacute;
        plac&eacute;s sur le panneau en utilisant
        <b>l'&Eacute;tiquette Texte</b> sur la barre d'outils. Cela
        a &eacute;t&eacute; fait pour illustrer cet exemple , mais
        vous pouvez ou ne souhaitez pas afficher les noms de canton
        sur votre panneau final.</li>

        <li>A chaque canton a &eacute;t&eacute; attribu&eacute; un
        capteur d'occupation du Tableau Capteur. Les capteurs ont
        &eacute;t&eacute; ajout&eacute;s au Tableau Capteur avant
        d'attribuer l'occupation capteurs. Un capteur d'occupation
        a &eacute;t&eacute; attribu&eacute; &agrave; chaque canton
        en utilisant le bouton <b>Cr&eacute;er/Modifier le
        canton</b> dans la boite de dialogue <b>Modifier Segment de
        Voie</b> d'un des segments de voie dans le canton.</li>

        <li>La voie sur l'ovale principal a &eacute;t&eacute;
        d&eacute;sign&eacute; <i>voie principale</i> en utilisant
        le dialogue <b>&Eacute;diter Segment de Voie</b> pour
        chaque segment de voie. Cela a donn&eacute; des largeurs de
        voie diff&eacute;rentes pour la voie principale et
        secondaire.</li>

        <li>Les T&ecirc;tes de Signalisation sont d&eacute;finies
        dans le tableau Signaux pour chacun des signaux
        plac&eacute;s sur le panneau. Les types de t&ecirc;te de
        signalisation &agrave; trois sorties sont utilis&eacute;s
        pour tous.</li>

        <li>Les signaux ont &eacute;t&eacute; plac&eacute;s aux
        aiguillages en utilisant l'outil <b>Fixer Signal &agrave;
        l'Aiguillage</b> dans le menu Outils. Pour chaque
        t&ecirc;te de signalisation <b>Ajouter Ic&ocirc;ne de
        Signal au R&eacute;seau</b> a &eacute;t&eacute;
        coch&eacute;, mais <b>Configurer Logique</b> ne
        l'&eacute;tait pas.</li>

        <li>Les signaux ont &eacute;t&eacute; plac&eacute;s aux
        limites de canton &agrave; trois points d'ancrage en
        utilisant <b>Fixer les Signaux aux Fronti&egrave;res du
        Canton</b> dans le menu Outils. <b>Ajouter Ic&ocirc;ne
        Signal au R&eacute;seau</b> a &eacute;t&eacute;
        coch&eacute;, mais <b>Configurer Logique</b> ne
        l'&eacute;tait pas.</li>

        <li>La logique pour les signaux aux aiguillages a
        &eacute;t&eacute; mise en place en utilisant <b>Fixer
        Signaux &agrave; l'Aiguillage</b>. Le nom de l'aiguillage a
        &eacute;t&eacute; entr&eacute;, puis <b>Obtenir
        Sauvegard&eacute;es</b> a &eacute;t&eacute; cliqu&eacute;e
        pour r&eacute;cup&eacute;rer les noms d'aiguillage. Ensuite
        <b>Installer la Logique</b> a &eacute;t&eacute;
        coch&eacute;e pour chaque t&ecirc;te de signalisation, et
        <b>Ajouter Ic&ocirc;ne de Signal au R&eacute;seau</b> ne
        l'a pas &eacute;t&eacute;.</li>

        <li>La logique pour les signaux au point d'ancrage limites
        de canton a &eacute;t&eacute; mise en place &agrave; l'aide
        de <b>D&eacute;finir Signaux aux Fronti&egrave;res du
        Canton</b> en suivant une proc&eacute;dure similaire.</li>

        <li>Puisque tous les signaux sont rouge si les capteurs
        d'occupation sont dans un &eacute;tat "Inconnu", le Tableau
        Capteur a &eacute;t&eacute; ouvert et tous les capteurs
        d'occupation furent mis &agrave; "Inactif"
        (inoccup&eacute;s) en cliquant sur "Inconnu" une fois. Puis
        l'aiguillage mat&eacute;riel a &eacute;t&eacute;
        cliqu&eacute; pour le mettre en d&eacute;viation, en
        produisant le panneau ci-dessus (Avec mode &Eacute;diter
        d&eacute;sactiv&eacute; dans le menu Options).</li>
      </ul>

      <p>Vous devriez &ecirc;tre capable de basculer vos
      aiguillages en cliquant dans leurs centres et de regarder le
      changement de couleur des signaux. Si vous n'avez pas encore
      de mat&eacute;riel pour votre d&eacute;tecteurs d'occupation,
      vous pouvez changer leur &eacute;tat dans le tableau de
      capteur pour simuler un train en marche sur le r&eacute;seau.
      (Ou vous pouvez mettre en place des ic&ocirc;nes capteur et
      cliquez dessus pour modifier leur &eacute;tat.) Si les
      &eacute;tapes ci-dessus ne sont pas claires, consulter la
      description de cet &eacute;l&eacute;ment dans la
      documentation ci-dessus. La page d'aide pour chaque outil
      r&eacute;f&eacute;renc&eacute; contient &eacute;galement des
      informations explicatives sur cet outil.</p>

      <p>Ceci est un exemple de ce qui peut &ecirc;tre facilement
      fait en utilisant l'&Eacute;diteur R&eacute;seau. Pour ceux
      qui envisagent d'installer des signaux, La mise en place d'un
      panneau avec des cantons d&eacute;finis et signaux
      plac&eacute;s peuvent aider &agrave; d&eacute;cider o&ugrave;
      placer les cantons et les signaux avant de les installer sur
      votre r&eacute;seau.</p>

      <!--#include virtual="/Footer" -->
    </div>
  </div>
</body>
</html>
