<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01//EN" "http://www.w3.org/TR/html4/strict.dtd">
<html lang="fr">
<head>
<!-- Copyright Bob Jacobsen 2008 -->
<!--  $Id$ -->
<!-- UpDated by Herv&#233; Blorec <bzh56420@yahoo.fr> 2013-11-01--> 

<title>JMRI: RPS Icon</title>

<!-- Style -->
<META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=iso-8859-1">
<LINK REL="stylesheet" TYPE="text/css" HREF="/css/default.css"
	MEDIA="screen">
<LINK REL="stylesheet" TYPE="text/css" HREF="/css/print.css"
	MEDIA="print">
<LINK REL="icon" HREF="/images/jmri.ico" TYPE="image/png">
<LINK REL="home" TITLE="Home" HREF="/">
<!-- /Style -->
</HEAD>

<BODY>
<!--#include virtual="/Header" -->
  <div class="nomenu" id="mBody">
    <div id="mainContent">

<h1> 
JMRI: Ic&#244;ne RPS 
</h1>

RPS est un syst&#232;me permettant de mesurer les positions du mat&#233;riel roulant sur votre
r&#233;seau.
Plus d'informations sur RPS est disponible sur la
<a href="../../../../html/hardware/rps/index.shtml"> page principale d'aide sur RPS</a>.
Les ic&#244;nes Reporter RPS se d&#233;place sur le TCO pour montrer
o&#249; l'&#233;quipement correspondant se trouve sur le r&#233;seau.

<p>
<img align="right" height="45" width="45" src="../../../../images/bangdesk.gif" alt="Cute image de work">
<em> Cette page est encore en construction, mais le support de l'ic&#244;ne RPS
 lui-m&#234;me est d&#233;j&#224; pr&#233;sent dans JMRI. Allez-y et essayez-le!</Em>
<p>

Les ic&#244;nes RPS sont un moyen de mettre des ic&#244;nes sur un
<a href="PanelEditor.shtml">TCO</a>
qui vont se d&#233;placer quand le syst&#232;me RPS trouve l'emplacement d'
un &#233;metteur associ&#233;.

<h2> Ajouter une Ic&#244;ne RPS sur un TCO</h2>

Habituellement, chaque ic&#244;ne repr&#233;sente un &#233;metteur RPS, donc une
locomotive. Actuellement, vous devez ajouter une Ic&#244;ne pour chaque &#233;quipement &#233;quip&#233; RPS que vous souhaitez suivre. Bien que ce soit couteux,
il vous donne un contr&#244;le tr&#232;s fin sur les positions des &#233;metteur qui sont
sont affich&#233;es et comment elles sont pr&#233;sent&#233;es.

<em> Cette Section demande encore beaucoup de travail</em> <p>

Cliquez sur "Ajouter rapport RPS " sur  <a href="PanelEditor.shtml">l'&#201;diteur de TCO</a>.
Une ic&#244;ne  RPS appara&#238;tra sur le TCO &#224; son
emplacement par d&#233;faut, mais &#231;a ne marchera pas encore jusqu'&#224; ce qu'elle soit calibr&#233;e.
<p>
Faites un clic droit ou option-clic sur l'ic&#244;ne pour voir le menu contextuel, o&#249;
vous pouvez calibrer l'ic&#244;ne.

<h3> Calibration d'une Ic&#244;ne RPS</h3>
Lorsque vous &#233;talonnez une ic&#244;ne RPS, vous sp&#233;cifiez
comment des lieux RPS mesur&#233;s  correspondent &#224; des positions sur le TCO.
<p>
Les &#233;tapes sont les suivantes:
<ul>
<li> Arr&#234;ter le syst&#232;me de scrutation RPS, alors les objets ne vont plus se d&#233;placer
.
<li> Ajouter l'ic&#244;ne au panneau.
<li> Faites glisser l'ic&#244;ne jusqu'&#224; ce qu'elle soit sur la position qui
correspond &#224; l'origine de votre installation 0,0 RPS.
<li> Faites un clic droit ou option-clic sur l'ic&#244;ne pour
obtenir le menu contextuel, et s&#233;lectionnez "D&#233;finir Origine».<li> D&#233;placer la locomotive r&#233;elle &#224; un autre point sur le r&#233;seau
, et commencer l'interrogation du syst&#232;me RPS &#224; nouveau. Obtenez une
bonne mesure de la position. Arr&#234;ter le syst&#232;me RPS.
<li> Faites glisser l'ic&#244;ne &#224; l'endroit o&#249; vous voulez qu'elle soit sur le TCO
lorsque l'&#233;metteur est &#224; cet endroit.
<li> Depuis le menu contextuel de l'ic&#244;ne, s&#233;lectionnez "D&#233;finir emplacement actuel».
<li> Obtenir &#224; nouveau le menu contextuel. Il ne devrait plus dire
"Non calibr&#233;", et devrait plut&#244;t vous montrer la position actuelle.
</UL>
<p>
Ne pas oublier de sauvegarder votre TCO!

 <a id="popup"> <h2> Menu Contextuel</h2>

Le menu contextuel de l'ic&#244;ne RPS contient:
<dl>
<dt>Lecture position RPS
<dd> Ceci est juste un titre, la s&#233;lectionner ne fait rien

<dt>Rotation 
<dd> Tourne l'ic&#244;ne affich&#233;e, en incr&#233;ments de 90 degr&#233;s. Notez que
ce n'est pas une rotation d&#249; au syst&#232;me de coordonn&#233;es RPS, mais simplement de la
pr&#233;sentation de l'ic&#244;ne.

<dt> Afficher ID
<dd> Quand elle est coch&#233;e, la cha&#238;ne d'identification sera affich&#233; en plus de l'ic&#244;ne.

<dt>D&#233;finir l'origine 
<dd> D&#233;finit la position d'affichage actuelle de l'ic&#244;ne comme la position 0,0
du syst&#232;me RPS. Cela doit &#234;tre fait en tant que premi&#232;re &#233;tape de l'&#233;talonnage.

<dt> D&#233;finir la Situation actuelle
<dd> Modifications de l'&#233;talonnage de telle sorte que sa position sur le TCO
et la mesure RPS soit en accord. Pour l'utiliser, v&#233;rifiez d'abord que le syst&#232;me 
RPS  a fait une bonne mesure de la position des &#233;metteurs, alors
faites glisser l'ic&#244;ne &#224; l'endroit o&#249; elle devrait appara&#238;tre sur l'&#233;cran, et enfin
choisissez "Situation actuelle" dans le menu contextuel. Dans l'avenir,
lorsque le syst&#232;me RPS mesures au m&#234;me endroit, l'ic&#244;ne appara&#238;tra
dans cette position.

<dt> Pas &#233;talonn&#233;
<dd> Un message d'&#233;tat, pas un contr&#244;le, cela apparait quand l'ic&#244;ne n'a pas &#233;t&#233; &#233;talonn&#233;e.
Le calibrage assure correctement la position de l'ic&#244;ne sur l'&#233;cran 
refl&#233;tant l'emplacement que RPS a mesur&#233;.

<dt> A (x), (y)
<dd>Une fois l'ic&#244;ne calibr&#233;e, le menu contextuel affiche
la mesure RPS du positionnement le plus r&#233;cent 

<dt> Afficher ID
<dd> Si elle est coch&#233;e, l'ic&#244;ne aura des informations ID affich&#233;es &#224; cot&#233; d'elle.

<dt> D&#233;finir le filtre
<dd> Ouvre une fen&#234;tre qui vous permet d'entrer une valeur de filtre pour cette
ic&#244;ne.

<dt>D&#233;sactiver 
<dd>Contr&#244;les si oui ou non l'ic&#244;ne peut &#234;tre d&#233;plac&#233;e autour manuellement.

<dt>Retirer 
<dd>Supprime l'ic&#244;ne RPS du TCO. Il s'agit d'une suppression d&#233;finitive.

<dt>Aide 
<dd> Affiche cette page

</dl>

 <a id="filter"> <a
<h2> Filtrage et Plusieurs Locomotives</h2>

Nous essayons toujours de trouver la meilleure fa&#231;on de configurer plusieurs ic&#244;nes
sur un TCO. Une ic&#244;ne unique, sans r&#233;glages sp&#233;ciaux, sera sautillante sur le TCO
quand les lectures entrent en jeu. Elle ira &#224; la position d'une lecture, puis
passera directement &#224; la position de la prochaine lecture, qui pourrait provenir
d'un autre &#233;metteur de locomotive.

<p>
Si vous voulez avoir plusieurs ic&#244;nes, chacune montrant la position d'une seul
locomotive, vous pouvez configurer des filtres sur chaque ic&#244;ne.
<ul>
<li> Ajouter une ic&#244;ne au panneau de RPS
<li> Ouvrez le menu contextuel sur l'ic&#244;ne et s&#233;lectionnez "D&#233;finir le filtre".
<li> Cela ouvrira une petite fen&#234;tre dans laquelle vous pouvez saisir la valeur de l'ID de la
locomotive que vous voulez que cette ic&#244;ne suive. Une fois que vous avez fait cela,
l'ic&#244;ne ne se d&#233;placera qu'&#224; la position mesur&#233;e de cette locomotive.
</ul>

<p>
Cette m&#233;thode est un peu fastidieuse, surtout si vous avez une liste importante,
puisque vous aurez &#224; le faire manuellement pour chaque locomotive. Et vous les aurez toutes &#224; 
calibrer. (Une bonne fa&#231;on de faire est de copier les lignes d&#233;finissant
une ic&#244;ne dans le fichier de TCO, en effet faites un tas de duplicata des ic&#244;nes calibr&#233;es,
puis d&#233;finissez les filtres, voir ci-dessous).
Mais il a l'avantage que vous pouvez contr&#244;ler exactement quelles locomotives sera afficher et celles qui ne le seront pas.
Cette m&#233;thode permet &#233;galement de joindre des images <a href="#custicon"> personnalis&#233;es</a> (par exemple une image
d'une locomotive sp&#233;cifique) &#224; l'ic&#244;ne sp&#233;cifique qui repr&#233;sente chaque ID.

<a id="custom">
<h2> Personnalisation</h2>
<h3>Position de D&#233;part </h3>
Lorsque vous ouvrez le TCO, les ic&#244;nes sont remise &#224; la m&#234;me
position sur l'&#233;cran qu'elles occupaient lorsque le TCO a &#233;t&#233; sauvegard&#233; dans le fichier.
<p>
Vous pouvez l'utiliser pour par exemple mettre les ic&#244;nes hors de la voie.
Elles restent dans cette position jusqu'&#224; ce qu'une lecture valide les d&#233;place, donc
Vous pouvez l'utiliser pour "parquer" les locomotives qui ne sont pas sur la bonne voie
hors de la partie active du TCO.

<a id="custicon"><h3> Afficher une Ic&#244;ne Personnalis&#233;e</h3>
Bien qu'il n'y ait pas encore d'interface graphique pour &#231;a  (&#231;a vient!),
vous pouvez modifier l'ic&#244;ne d'un &#233;metteur qui est suivi par
le syst&#232;me RPS afin qu'il affiche par exemple une petite image de la locomotive.
Pour ce faire, vous allez &#233;diter le fichier de d&#233;finition de panneau directement.
(Il ya plus d'informations sur le
Format XML, que nous utilisons
<a href="../../../../html/apps/DecoderPro/IntroXML.shtml"> ici</a>) Les &#233;tapes sont les suivantes:
<ul>
<li> Cr&#233;er une ic&#244;ne sur l'&#233;diteur de TCO, et sauver le TCO dans un fichier.
<li> Faites une copie de sauvegarde du fichier, au cas o&#249; quelque chose tourne mal.
<li> A l'aide d'un &#233;diteur de texte, ouvrez le fichier pour le modifier.
<li> Trouvez la ligne qui d&#233;finit l'ic&#244;ne. Il contiendra la cha&#238;ne "RpsPositionIconXml»,
ainsi une approche est de rechercher cela. Il va ressembler &#224; (il sera probablement sur une seule ligne):
<code> <pre>
    &lt;Sensoricon x = "95" y = "150" level = "10"
            actif = "resources/icons/smallschematics/tracksegments/circuit occupied.gif"
            error = "resources/icons/smallschematics/tracksegments/circuit error.gif"
            rotate = "0" forcecontroloff = "false" momentary = "false"
            sxscale = "11.849106591612951" syscale = "-11,889381744148094"
            sxorigin = "41" syorigin = "768"
            class = "jmri.jmrit.display.configurexml.RpsPositionIconXml" /&gt;
</code></pre>
<li> Pour que l'ic&#244;ne suive d'un &#233;metteur sp&#233;cifique, entrez l'ID de l'&#233;metteur en tant qu'attribut "filtre". Par exemple, pour
suivre l'&#233;metteur 5510, modifiez la ligne:
<code> <pre>
    &lt;Sensoricon filter = "5510" x = "95" y = "150" level = "10"
            actif = "resources/icons/smallschematics/tracksegments/circuit occupied.gif"
            error = "resources/icons/smallschematics/tracksegments/circuit error.gif"
            rotate = "0" forcecontroloff = "false" momentary = "false" s
            xscale = "11.849106591612951" syscale = "-11,889381744148094"
            sxorigin = "41" syorigin = "768"
            class = "jmri.jmrit.display.configurexml.RpsPositionIconXml" /&gt;
</code></pre>
<li> Les attributs "actif" et "erreur" sont les ic&#244;nes &#224; afficher lorsque le syst&#232;me 
obtiennent des r&#233;sultats fiables et n'obtiennent pas de bonnes lectures, respectivement.
Vous pouvez modifier celle ci &#224; l'emplacement de n'importe quel fichier d'ic&#244;ne que vous souhaitez.
Par exemple, vous pouvez les changer pour une photo (petite) de la
 locomotive, ou pour une image avec le num&#233;ro du train.
</UL>

Une belle interface graphique pour faire cela est &#224; venir, mais elle n'est pas encore l&#224;.
<!--#include virtual="/Footer" -->
</body>
</html>
