<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<!-- Updated by Herv&#233; Blorec <bzh56420@yahoo.fr> 2013-11-01-->

<html lang="fr">
<head>
  <meta name="generator" content=
  "HTML Tidy for Mac OS X (vers 31 October 2006 - Apple Inc. build 15.17), see www.w3.org">

  <title>JMRI: Set Signals at Crossover Help</title>
  <meta http-equiv="Content-Type" content=
  "text/html; charset=us-ascii">
  <meta name="author" content="Dave Duchamp">
  <meta name="keywords" content="JMRI help Layout Editor panel">
  <!-- Style -->
  <meta http-equiv="Content-Type" content=
  "text/html; charset=us-ascii">
  <link rel="stylesheet" type="text/css" href="/css/default.css"
  media="screen">
  <link rel="stylesheet" type="text/css" href="/css/print.css"
  media="print">
  <link rel="icon" href="/images/jmri.ico" type="image/png">
  <link rel="home" title="Home" href="/">
  <!-- /Style -->
</head>

<body>
  <!--#include virtual="/Header" -->
<div class="nomenu" id="mBody">
    <div id="mainContent">

      <h1>D&eacute;finir Signaux &agrave; une Bretelle</h1>

      <h2>Introduction</h2>

      <p>Cet outil fournit une proc&eacute;dure automatis&eacute;e
      pour l'attribution des signaux &agrave; une bretelle, qu'elle
      soit double, seulement &agrave; droite, ou seulement &agrave;
      gauche. Si n&eacute;cessaire, cet outil va placer des
      ic&ocirc;nes de signaux sur le TCO &agrave; l'emplacement
      sp&eacute;cifi&eacute;, et mettra en place une logique de
      signal pour sp&eacute;cifier les signaux. Avant de
      s&eacute;lectionner cet outil, l'aiguillage doit &ecirc;tre
      sur le TCO, et les signaux requis doivent &ecirc;tre dans le
      Tableau Signal. Cet outil place uniquement le signal lorsque
      la voie principale de l'aiguillage est verticale ou
      horizontale (Ou presque verticale ou horizontale) sur le TCO,
      donc la conception de votre TCO devra en tenir compte . La
      Logique Simple Signal cr&eacute;&eacute;e par cet outil ne
      fonctionne correctement que si chacun des segments de voies
      reli&eacute;s aux quatre points de connexion des bretelles
      sont affect&eacute;s &agrave; des cantons
      diff&eacute;rents.</p>

      <p>Lorsque cet &eacute;l&eacute;ment est
      s&eacute;lectionn&eacute; dans le menu <b>Outils</b>, une
      petite bo&icirc;te de dialogue est affich&eacute;e pour
      l'inscription du nom d'aiguillage (syst&egrave;me ou
      utilisateur) de la bretelle. Si cet outil est entr&eacute; en
      s&eacute;lectionnant <b>D&eacute;finir Signaux...</b> dans le
      menu contextuel de la bretelle, le nom de l'aiguillage est
      automatiquement inscrit. Apr&egrave;s que le nom de la
      bretelle ait &eacute;t&eacute; saisi et
      v&eacute;rifi&eacute;,une boite de dialogue est
      montr&eacute;e pour la saisie des noms (syst&egrave;me ou
      utilisateur) de quatre &agrave; huit signaux &agrave;
      affecter &agrave; la bretelle.</p>

      <p>La bretelle diff&egrave;re des autres aiguillages de
      plusieurs fa&ccedil;ons importantes. Comme d'autres
      aiguillages, les bretelles ont deux &eacute;tats -
      crois&eacute;(D&eacute;vi&eacute;e) et droite (Directe).
      Modifier l'&eacute;tat d'une bretelle, cependant,
      n&eacute;cessite que deux ou quatre aiguillages changent
      &agrave; l'unisson. Cela peut &ecirc;tre accompli en
      utilisant un composant &agrave; quatre commutateurs.
      Normalement, &agrave; une bretelle est attribu&eacute;e une
      entr&eacute;e d'aiguillage unique dans le tableau aiguillage,
      mais il peut y en avoir plusieurs si ses commutateurs sont
      command&eacute;s par diff&eacute;rents d&eacute;codeurs
      stationnaires. Vous pouvez utiliser deux voies JMRI
      command&eacute;es par le m&ecirc;me aiguillage interne pour
      que plusieurs commutateurs travaillent ensemble. Dans ce cas,
      entrez l'aiguillage interne comme un aiguillage li&eacute; au
      dessin de la bretelle.</p>

      <p>Pour chaque signal, des cases &agrave; cocher sont
      disponibles pour s&eacute;lectionner si une ic&ocirc;ne doit
      &ecirc;tre plac&eacute;e sur le TCO, et si une Logique Simple
      Signal doit &ecirc;tre cr&eacute;&eacute;e pour le signal.
      Peu importe si les ic&ocirc;nes sont plac&eacute;es ou la
      logique est cr&eacute;&eacute;e, l'&Eacute;diteur de TCO va
      enregistrer que les entr&eacute;es signaux sont
      affect&eacute;s &agrave; la bretelle
      sp&eacute;cifi&eacute;e.</p>

      <p><b>L'affectation des signaux aux aiguillages est
      importante pour bien d&eacute;crire votre r&eacute;seau dans
      l'&Eacute;diteur de TCO.</b> M&ecirc;me si vous choisissez de
      placer vos ic&ocirc;nes et de configurer votre logique signal
      manuellement, vous devez utiliser cet outil pour assigner les
      signaux &agrave; leur bretelle.</p>

      <h2>Boite de Dialogue installation des Signaux de la
      Bretelle</h2>

      <p>Si vous &ecirc;tes invit&eacute; &agrave; entrer le nom de
      <b>l'Aiguillage</b>, entrez le nom (syst&egrave;me ou
      utilisateur) de la bretelle &agrave; laquelle les signaux
      seront affect&eacute;s. Si l'outil ne peut pas trouver
      l'aiguillage entr&eacute; sur le TCO, un message d'erreur en
      r&eacute;sultera. Aussi, si l'aiguillage entr&eacute; n'est
      pas une bretelle, une message d'erreur en r&eacute;sultera.
      Si un aiguillage interne est utilis&eacute; pour
      contr&ocirc;ler la bretelle (voir ci-dessus), entrez son nom
      <b>Nom de l'Aiguillage</b>.</p>

      <p>Des noms de signaux (soit syst&egrave;me ou utilisateur)
      sont entr&eacute;s dans la bo&icirc;te de dialogue.
      L'entr&eacute;e de deux signaux &agrave; chaque angle de la
      bretelle est pr&eacute;vue. Pour les bretelles droites ou
      bretelles gauches, l'outil pr&eacute;voit deux signaux
      &agrave; chaque angle de la pointe, et un signal &agrave;
      chaque angle de la voie directe. Au moins un signal
      <b>direct</b> doit &ecirc;tre entr&eacute; &agrave; chaque
      coin, mais les mentions <b>divergentes</b> sont facultatives.
      L' &eacute;tiquettes coin, A, B, C et D sont comme ci-dessous
      pour le cas de bretelle double dans le cas des huit signaux
      et la bretelle droite continue (Directe). (Dans le diagramme
      ci-dessous, la bretelle double n'a pas &eacute;t&eacute;
      tourn&eacute;e.)</p>

      <p><a href="./images/DoubleXover8.gif"><img src=
      "./images/DoubleXover8.gif" width="207"
      height="109" hspace="0" vspace="0" alt="Ic?ne Bretelle avec
      huit signaux"></a></p>

      <p>De m&ecirc;me, le diagramme ci-dessous montre le cas de
      quatre signaux avec une bretelle double en position
      divergente (D&eacute;vi&eacute;e). Si vous faites pivoter
      l'aiguillage, les &eacute;tiquettes d'angle tournent aussi.
      Les Bretelles simples sont les m&ecirc;mes, sauf avec une
      voie de croisement au lieu de deux.</p>

      <p><a href="./images/DoubleXover4.gif"><img src=
      "./images/DoubleXover4.gif" alt="Ic?ne Bretelle avec
      quatre signaux" width="221" height="113" hspace="0"
      vspace="0"></a></p>

      <p>Si les signaux de cette bretelle ont &eacute;t&eacute;
      saisis pr&eacute;c&eacute;demment, cliquez <b>Obtenir
      Sauvegarde</b> pour r&eacute;cup&eacute;rer les noms de
      signaux saisis pr&eacute;c&eacute;demment.</p>

      <p>N'importe lequel des angles qui peuvent avoir deux
      signaux, peuvent effectivement avoir un ou deux signaux, de
      sorte que tous les cas entre les deux illustr&eacute;s
      ci-dessus sont possibles. La bretelle simple peut peut avoir
      4, 5 ou 6 signaux, et les bretelles doubles peuvent avoir 4,
      5, 6, 7 ou 8 signaux. Si un signal est entr&eacute; pour
      <b>D&eacute;vi&eacute;</b>, les signaux pour <b>Directe</b>
      la voie continue et les signaux <b>Divergents</b> la voie
      vers la voie crois&eacute;e. Si aucun signal n'est
      entr&eacute;e pour <b>Divergent</b>, le signal <b>Continu</b>
      refl&egrave;te l'&eacute;tat de voie selon que l'aiguillage
      est commut&eacute; ou non. Dans ce cas, le type logique
      simple signal pour le signal <b>Continu</b> est <b>En
      Pointe</b>.</p>

      <p>S'il y avait un signal pr&eacute;c&eacute;demment
      attribu&eacute; pour toute position, et vous entrez un
      <i>autre</i> signal dans le m&ecirc;me lieu, le signal
      remplacera le signal pr&eacute;c&eacute;dent, et
      l'ic&ocirc;ne du signal pr&eacute;c&eacute;dent (s'il y en
      avait un) sera supprim&eacute;e &agrave; partir du TCO. De
      m&ecirc;me, si vous remplacez un signal
      pr&eacute;c&eacute;demment affect&eacute; <b>Divergent</b>
      avec une entr&eacute;e vide (pas de signal), l'entr&eacute;e
      pr&eacute;c&eacute;dente est supprim&eacute;e et la bretelle
      n'aura pas de signal &agrave; cette position. <b>Si un signal
      est modifi&eacute;, vous devez refaire toute la logique qu'il
      implique.</b></p>

      <p>Cochez <b>Ajouter Ic&ocirc;ne de Signal au TCO</b> pour
      demander que l'ic&ocirc;ne d'un signal soit plac&eacute;e sur
      le TCO &agrave; la position indiqu&eacute;e de l'aiguillage.
      Cet outil ne peut placer une ic&ocirc;ne de signal que sur un
      aiguillage qui est presque &agrave; la verticale ou presque
      &agrave; l' horizontale. Si ce n'est pas le cas, un message
      est imprim&eacute;, et vous devez placer l'ic&ocirc;ne de
      signal manuellement en utilisant la barre d'outils de
      l'&Eacute;diteur de TCO. Malgr&eacute; tout, le Nom du signal
      est attribu&eacute; &agrave; la position
      sp&eacute;cifi&eacute;e de l'aiguillage.</p>

      <p>Cochez <b>Configurer Logique</b> pour demander que l'outil
      mette en place une Logique Simple Signal pour un signal.
      L'outil permettra de cr&eacute;er la logique et remplira
      automatiquement les entr&eacute;es avec les information
      disponibles. Si l'outil ne poss&egrave;de pas assez
      d'informations disponibles pour configurer la logique, un
      message en r&eacute;sultera, et vous aurez &agrave; revenir
      plus tard apr&egrave;s que plusieurs signaux aient
      &eacute;t&eacute; assign&eacute;s aux aiguillages et aux
      limites de canton sur le TCO.</p>

      <h2>Notes</h2>

      <p>Lors de la configuration logique, cet outil va suivre la
      voie dans le canton jusqu'&agrave; ce qu'il trouve un signal
      avant l'aiguillage signal&eacute;. Si votre mod&egrave;le
      contient des sections qui sont signal&eacute;es et les
      sections qui ne le sont pas, pour obtenir que cet outil mette
      en place une logique correcte, vous pourriez avoir &agrave;
      placer un signal virtuel (un signal qui ne correspond pas
      &agrave; un signal r&eacute;el sur le r&eacute;seau) &agrave;
      la fin du canton non signal&eacute; qui relie un
      tron&ccedil;on de voie qui est signal&eacute; avec une voie
      qui n'est pas signal&eacute;. Si un canton se termine par un
      Heurtoir, aucun signal n'est requis &agrave; la fin.</p>

      <p>Si un canton a un aiguillage interne (l'aiguillage, et les
      tron&ccedil;ons de voie &agrave; sa pointe et ses jambes font
      parties du canton), le programme va attendre les signaux
      &agrave; cet aiguillage, m&ecirc;me si ce n'est pas &agrave;
      la fin du canton. Cependant, parfois l'utilisateur peut ne
      pas vouloir signaler un aiguillage rarement utilis&eacute;
      dans un canton. En suivant la voie &agrave; travers un
      canton, le programme va sauter l'aiguillage interne non
      signal&eacute; si <b>Passer Aiguillage Interne Non
      Signal&eacute;</b> est coch&eacute;e dans le menu
      <b>Outils</b> de l'Editeur de TCO. Il avertira de ce qu'il
      fait. <b>Utilisez cette option avec prudence.</b> Il n'y a
      pas de signal de protection contre un aiguillage qui,
      &eacute;tant ignor&eacute;, est mal r&eacute;gl&eacute;, si
      un aiguillage interne non signal&eacute; n'est pas
      r&eacute;gl&eacute; correctement, un d&eacute;raillement des
      trains pourraient en r&eacute;sulter.</p>

      <p>Cet outil met en place trois aspects de signalisation.
      Avec les bretelle, les voies de croisement sont toujours
      consid&eacute;r&eacute;es comme voie d'&eacute;vitement, et
      de toute voie principale entrant dans l'aiguillage, le quitte
      sur la ligne directe. Donc, si la bretelle est dans
      l'&eacute;tat crois&eacute;, la vitesse limit&eacute;e (le
      feu le moins restrictive n'est pas vert, mais jaune) est mise
      en place (voir le sch&eacute;ma quatre - aiguillages
      ci-dessus). Si vous pr&eacute;f&eacute;rez ne pas avoir de
      limitation de vitesse lorsque le l'aiguillage est
      orient&eacute; vers le croisement, modifier le signal logique
      simple en s&eacute;lectionnant <b>Modifier Logique...</b>
      dans le menu contextuel de l'aiguillage, <b>D&eacute;cocher
      Vitesse limit&eacute;e</b> , et cliquez sur <b>Appliquer</b>
      .</p>

      <p>Si vous avez une situation particuli&egrave;re &agrave; un
      signal, vous pouvez avoir &agrave; faire plus de
      modifications d'informations saisies par cet outil que dans
      la Logique Simple Signal. Si vous aimeriez avoir quatre
      aspects de signalisation, vous pouvez facilement modifier
      manuellement la logique pour y parvenir. De m&ecirc;me, par
      une simple modification manuelle de la logique, vous pouvez
      ajouter un balisage lumineux d'approche. La bo&icirc;te de
      dialogue Logique Simple Signal peut &acirc;tre accessible
      depuis le menu contextuel de chaque ic&ocirc;ne de signal. Si
      votre situation sp&eacute;ciale ne peut pas &ecirc;tre
      manipul&eacute;e par un logique simple signal, vous devez
      vous r&eacute;f&eacute;rer &agrave; Logix pour adapter la
      logique signal &agrave; vos besoins.</p>

      <p>S'il vous pla&icirc;t rappelez vous de <b>sauvegarder
      votre TCO apr&egrave;s l'utilisation de cet outil.</b></p>
    </div>
  </div>
</body>
</html>
