<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<!-- Updated by Herv&#233; Blorec <bzh56420@yahoo.fr> 2013-11-01-->

<html lang="fr">
<head>
  <meta name="generator" content=
  "HTML Tidy for Mac OS X (vers 31 October 2006 - Apple Inc. build 15.17), see www.w3.org">

  <title>JMRI: Set Signals at 3-Way Turnout Help</title>
  <meta name="author" content="Dave Duchamp">
  <meta name="keywords" content="JMRI help Layout Editor panel">
  <!-- Style -->
  <meta http-equiv="Content-Type" content=
  "text/html; charset=us-ascii">
  <link rel="stylesheet" type="text/css" href="/css/default.css"
  media="screen">
  <link rel="stylesheet" type="text/css" href="/css/print.css"
  media="print">
  <link rel="icon" href="/images/jmri.ico" type="image/png">
  <link rel="home" title="Home" href="/">
  <!-- /Style -->
</head>

<body>
  <!--#include virtual="/Header" -->
<div class="nomenu" id="mBody">
    <div id="mainContent">

      <h1>D&eacute;finir des signaux aux Aiguillages Triples</h1>

      <h2>Introduction</h2>

      <p>Dans l'&eacute;diteur de TCO un aiguillage triple est
      mod&eacute;lis&eacute; en utilisant deux aiguillages,
      habituellement un droit et une gauche, orient&eacute; de
      sorte que la pointe du deuxi&egrave;me aiguillage soit
      reli&eacute;e &agrave; la voie directe de l'aiguillage par un
      segment de voie tr&egrave;s court . Cet outil fournit une
      proc&eacute;dure automatis&eacute;e pour l'affectation des
      signaux et la cr&eacute;ation automatique d'une logique
      signal pour un aiguillage triple mod&eacute;lis&eacute; dans
      cette voie. Cet outil peut &eacute;galement &ecirc;tre
      utilis&eacute; pour placer des signaux et mettre la logique
      pour deux aiguillages r&eacute;els orient&eacute;s comme
      d&eacute;crit ci-dessus, o&ugrave; l'utilisateur ne veut pas
      mettre de signaux entre les deux aiguillages -
      essentiellement deux vrais aiguillages gauches ou droits qui
      simulent un v&eacute;ritable aiguillage triple.</p>

      <h2>Introduction</h2>

      <p>Six signaux peuvent &ecirc;tre plac&eacute;s autour de
      l'aiguillage triple, comme indiqu&eacute;
      ci-dessous:</p>
      <a href="./images/DoubleXover8.gif"><img src=
      "3_WayTurnout.jpg" width="469" height="180"
      hspace="0" vspace="0"></a>

      <p>L'aiguillage &agrave; la pointe, est d&eacute;sign&eacute;
      comme <b>aiguillage A</b> et l'autre est <b>l'aiguillage
      B</b>. Six signaux sont possibles - trois &agrave; la pointe,
      indiquant l'&eacute;tat de la voie continue ( signal haut),
      voie d&eacute;vi&eacute;e Un (au milieu), et B voie
      d&eacute;vi&eacute;e (signal bas), et un signal &agrave;
      chacune des trois autres voies.</p>

      <p>Si n&eacute;cessaire, cet outil va placer des ic&ocirc;nes
      de signal sur le panneau dans les six positions
      indiqu&eacute;es ci-dessus et mettre en place une logique de
      contr&ocirc;le pour chacune des six signaux
      sp&eacute;cifi&eacute;s. Dans certaines situations, un
      utilisateur peut choisir de placer un seul signal &agrave; la
      pointe, entra&icirc;nant seulement quatre signaux autour de
      l'aiguillage triple. Cet outil va placer les quatre signaux
      sp&eacute;cifi&eacute;s, et mettre en place une logique pour
      les signaux aux voies Divergentes A, Divergentes, B et la
      voie Droite, mais il ne peut pas mettre en place une logique
      pour le seul signal en pointe. Les instructions sur comment
      le faire manuellement, avec l'aide de cet outil est
      indiqu&eacute; ci-dessous.</p>

      <p>Avant de s&eacute;lectionner cet outil, les aiguillages
      doivent &ecirc;tre &agrave; la fois sur le TCO,
      connect&eacute;s comme indiqu&eacute; par un segment de voie
      unique , et les signaux requis doivent &ecirc;tre dans la
      Table T&ecirc;te de Signal. L'outil ne place les signaux que
      lorsque la voie principale de chaque aiguillage est verticale
      ou horizontale (Ou presque verticale ou horizontale) sur le
      panneau, d'o&ugrave; la conception de votre panneau en
      cons&eacute;quence. La logique de contr&ocirc;le
      cr&eacute;&eacute;e par cet outil ne fonctionne correctement
      que si chacun des trois segments de voies reli&eacute;es
      &agrave; la voie directe et aux deux voies divergentes de
      l'aiguillage triple est affect&eacute;e &agrave; un autre
      bloc, et ces blocs sont diff&eacute;rents du bloc de segment
      de voie reli&eacute; &agrave; la pointe de l'aiguillage
      triple . L'aiguillage triple (les deux aiguillages et leur
      segment de voie court les reliant ) peut &ecirc;tre dans un
      bloc s&eacute;par&eacute; ou dans le m&ecirc;me bloc que le
      segment voie connect&eacute; &agrave; la pointe.</p>

      <p>Lorsque cet &eacute;l&eacute;ment est
      s&eacute;lectionn&eacute;, une bo&icirc;te de dialogue
      appara&icirc;t pour la saisie des noms (syst&egrave;me ou
      utilisateur) des deux aiguillages, et les noms
      (syst&egrave;me ou utilisateur) des six (ou quatre) signaux
      &agrave; affecter &agrave; l'aiguillage triple. Vous pouvez
      entrer &agrave; la fois le nom de l'aiguillage , ou entrer un
      seul aiguillage et permettre au programme de trouver l'autre.
      Si vous entrez un aiguillage, assurez-vous de le mettre dans
      la position correcte. Pour v&eacute;rifier que le second
      aiguillage a &eacute;t&eacute; trouv&eacute; correctement,
      cliquez sur le bouton Obtenir Sauvegarde .</p>

      <p>Pour chaque signal, des cases &agrave; cocher sont
      disponibles pour s&eacute;lectionner si une ic&ocirc;ne doit
      &ecirc;tre plac&eacute;e sur le panneau, et si la logique de
      commande doit &ecirc;tre cr&eacute;&eacute;e pour le signal.
      Peu importe si les ic&ocirc;nes sont plac&eacute;es ou la
      logique est cr&eacute;&eacute;e, l'&eacute;diteur de TCO va
      enregistrer que les entr&eacute;es signals sont
      affect&eacute;es &agrave; l'aiguillages
      sp&eacute;cifi&eacute;. <b>L'affectation des signaux aux
      aiguillages est important pour bien d&eacute;crire votre
      r&eacute;seau dans l'&eacute;diteur de TCO .</b> M&ecirc;me
      si vous choisissez de placer vos ic&ocirc;nes et configurer
      votre signal logique manuellement, vous devez utiliser cet
      outil pour assigner le signal &agrave; son aiguillage
      triple.</p>

      <p>Apr&egrave;s qu'un aiguillage triple ait &eacute;t&eacute;
      configur&eacute; &agrave; l'aide de cet outil d'installation,
      l'&eacute;diteur de TCO garde la trace du fait que les
      aiguillage A et B sont li&eacute;s. Donc, si vous
      s&eacute;lectionnez <b>D&eacute;finir des Signaux...</b> dans
      le menu contextuel de l'un ou l'autre aiguillage, vous
      revenez &agrave; cette bo&icirc;te de dialogue avec les deux
      aiguillages remplis.Si vous voulez plus tard
      &laquo;dissocier&raquo; les deux aiguillages et ajouter les
      signaux manquants, pour chacun des aiguillages,
      s&eacute;lectionnez <b>D&eacute;finir des Signaux &agrave;
      l'aiguillage...</b>, remplissez le nom de aiguillage
      manuellement, entrez les signaux, et cliquez sur
      <b>Termin&eacute;</b>. Apr&egrave;s que ceci soit fait pour
      les deux aiguillages, les aiguillages ne seront plus
      li&eacute;s.</p>

      <h3>Dialogue de D&eacute;finition de signaux pour un
      Aiguillage triple</h3>

      <p>Dans <b>le Nom de l'aiguillage A</b> et <b>le Nom de
      l'aiguillage B</b>, entrez le nom (Syst&egrave;me ou
      utilisateur) d'un ou deux des aiguillages. Si un seul est
      entr&eacute;, l' outil va trouver l'autre lorsque les boutons
      <b>Termin&eacute;</b> ou <b>Obtenir Sauvegarde</b> sont
      cliqu&eacute;s. Si l'outil ne peut pas trouver le second
      aiguillage, ou si les deux entr&eacute;es aiguillages ne sont
      pas sur le panneau ou non connect&eacute;es comme
      d&eacute;crit ci-dessus par un segment de voie unique, il en
      r&eacute;sulte un message d'erreur. L'aiguillage &agrave; la
      pointe de l'aiguillage triple doit &ecirc;tre entr&eacute;
      comme aiguillage A, et l'aiguillage le plus
      &eacute;loign&eacute; de la pointe doit &ecirc;tre
      entr&eacute; comme aiguillage B.</p>

      <p>Les noms des T&ecirc;tes de Signaux (soit syst&egrave;me
      ou utilisateur) sont entr&eacute;s dans la section suivante.
      Si les signaux de ces aiguillages ont &eacute;t&eacute;
      saisies pr&eacute;c&eacute;demment, cliquez <b>Obtenir
      Sauvegarde</b> pour r&eacute;cup&eacute;rer les noms des
      signaux pr&eacute;c&eacute;demment entr&eacute;s.</p>

      <p>Les noms des signaux (soit syst&egrave;me ou utilisateur)
      sont entr&eacute;s dans la section suivante. Si les signaux
      de ces aiguillages ont &eacute;t&eacute; saisis
      pr&eacute;c&eacute;demment, <b>cliquez Obtenir Sauvegarde</b>
      pour r&eacute;cup&eacute;rer les noms des signaux
      pr&eacute;c&eacute;demment entr&eacute;s. L'outil fournit
      pour l'entr&eacute;e trois signaux &agrave; la pointe et un
      dans chacune des trois autres voies. Les signaux de la pointe
      et de la voie D&eacute;vi&eacute; A sont plac&eacute;es avec
      l'aiguillage A. Les signaaux de la voie d&eacute;vi&eacute;e
      B et de la voie directe B sont plac&eacute;es avec
      l'aiguillage B. Le signal pointe directe (vert dans le haut
      de la figure) refl&egrave;te le trajet de la voie Directe
      avec la voie en Pointe. Les deux autres signaux
      refl&egrave;tent le trajet des pointes avec leurs voies
      d&eacute;vi&eacute;es respectives. Si seulement un signal de
      pointe est entr&eacute;, il doit &ecirc;tre entr&eacute;
      &agrave; la position Pointe Continue .</p>

      <p>S'il y avait un signal pr&eacute;c&eacute;demment
      attribu&eacute; &agrave; toute position, et vous entrez un
      <i>autre</i> signal dans le m&ecirc;me lieu, le signal
      remplacera le signal pr&eacute;c&eacute;dent, et
      l'ic&ocirc;ne du signal pr&eacute;c&eacute;dent (s'il y en
      avait un) sera supprim&eacute;e &agrave; partir du TCO. De
      m&ecirc;me, si vous remplacez le signal pr&eacute;cedemment
      affect&eacute; &agrave; la <b>Pointe Divergente</b> par des
      entr&eacute;es vides (pas de signal), les entr&eacute;es
      pr&eacute;c&eacute;dentes sont supprim&eacute;es, et il n'y
      aura pas de signaux &agrave; ces postes. <b>Si un signal est
      modifi&eacute;, vous devrez refaire toute la logique qu'elle
      implique.</b></p>

      <p>Cochez <b>Ajouter Ic&ocirc;ne de Signal au TCO</b> pour
      demander que l'ic&ocirc;ne d'un signal soit plac&eacute; sur
      le TCO &agrave; la position indiqu&eacute;e par l'aiguillage.
      Cet outil ne peut placer une ic&ocirc;ne de signal sur les
      aiguillage qui sont presque &agrave; la verticale ou presque
      &agrave; l' horizontale. Si ce n'est pas le cas, un message
      est imprim&eacute;, et vous devez placer l'ic&ocirc;ne de
      signal manuellement en utilisant la barre d'outils de
      l'&eacute;diteur de TCO. Peu importe, le Nom de signal qui
      est attribu&eacute; &agrave; la position
      sp&eacute;cifi&eacute;e de l'aiguillage. Cette affectation
      est importante pour la mise en place logique pour d'autres
      signaux sur la voie. L'affectation des signaux est
      &eacute;galement importante d&eacute;crivant
      compl&egrave;tement votre r&eacute;seau dans l'&eacute;diteur
      de TCO.</p>

      <p>Cochez <b>Configurer Logique</b> pour demander que l'outil
      mette en place une logique de commande de signal pour un
      signal. Pour chacun de ces signaux, l'outil cr&eacute;e une
      Logique simple de signal pour le signal, et en plus le cas
      &eacute;ch&eacute;ant, il cr&eacute;e un Logix qui assure que
      les branchements sont synchronis&eacute;s pour le signal.
      L'outil fera des tentative de configuration de la logique et
      de remplir automatiquement les entr&eacute;es avec les
      informations disponibles. Si l'outil n'a pas assez
      d'informations disponibles pour configurer la logique, un
      message en r&eacute;sultera, et vous aurez &agrave; revenir
      plus tard, apr&egrave;s plusieurs que plusieurs cantons (Avec
      des capteurs d'occupation) et/ou des signaux aient
      &eacute;t&eacute; assign&eacute;s &agrave; des aiguillages et
      des limites de cantons sur le TCO. <b>Remarque: Cet outil ne
      peut pas actuellement mettre en place une logique pour un
      seul signal &agrave; la pointe d'une aiguillage &agrave; 3
      voies. Voir ci-dessous pour savoir comment le faire
      manuellement</b>.</p>

      <h3>Notes</h3>

      <p>Cet outil va mettre en place la logique simple signal
      d'une mani&egrave;re normalis&eacute;e qui devrait couvrir la
      plupart des cas. Si les signaux ne se comportent pas comme
      vous le voulez, n'h&eacute;sitez pas &agrave; modifier la
      logique simple signal manuellement pour obtenir le
      r&eacute;sultat recherch&eacute; . Pour modifier la logique
      simple signal pour un signal, dans le mode &eacute;diter,
      appeler le menu contextuel de l'ic&ocirc;ne du signal dont la
      logique doit &ecirc;tre &eacute;dit&eacute;e, et
      s&eacute;lectionnez <b>&eacute;diter Logique...</b>.
      Habituellement l'ajout ou le retrait d'un capteur, ou cocher
      ou d&eacute;cocher une option, est tout ce qui est
      n&eacute;cessaire. Dans des cas plus compliqu&eacute;s , vous
      devrez peut-&ecirc;tre cr&eacute;er un Logix pour
      d&eacute;finir l'&eacute;tat d'un capteur interne, qui est
      ensuite ajout&eacute; &agrave; la Logique Simple Signal.</p>

      <p>Lors de la configuration logique, cet outil va suivre la
      voie dans les cantons jusqu'&agrave; ce qu'il trouve un
      signal &agrave; la fin du canton loin de l'aiguillage
      signal&eacute; . Si votre r&eacute;seau contient des sections
      qui sont signal&eacute;es et les sections qui ne le sont pas,
      pour obtenir cet outil pour mettre en place une logique
      correctement, vous pourriez avoir &agrave; cr&eacute;er et
      assigner un signal virtuel (un signal qui ne correspond pas
      &agrave; un signal r&eacute;el sur le r&eacute;seau) &agrave;
      la fin du canton non signal&eacute; qui relie la voie qui est
      signal&eacute;e avec une voie qui n'est pas signal&eacute;e.
      (Vous n'avez pas besoin d'ajouter une ic&ocirc;ne pour le
      signal virtuel &agrave; votre panneau, mais elle doit exister
      dans votre table signal, et doit &ecirc;tre affect&eacute;e
      &agrave; un aiguillage ou &agrave; une limite de canton
      &agrave; l'aide d'un outil (D&eacute;finir signalisation...).
      Si un canton se termine par un Heurtoir, aucun signal virtuel
      n'est requis &agrave; la fin du heurtoir.</p>

      <p>Si un canton a un aiguillage interne (l'aiguillage, et les
      tron&ccedil;ons de voie de sa pointe et les branches continue
      sont au sein du canton), le programme va attendre les signaux
      &agrave; cet aiguillage, m&ecirc;me si ce n'est pas &agrave;
      la fin du canton. Cependant, parfois o&ugrave; l'utilisateur
      peut ne pas vouloir signaler un aiguillage rarement
      utilis&eacute; dans un canton. En suivant la voie &agrave;
      travers un canton, le programme va sauter l'aiguillage
      interne non signal&eacute; si <b>Passer Aiguillage Interne
      non Signal&eacute;</b> est coch&eacute; dans le menu
      <b>Outils</b> de l'&eacute;diteur de TCO&gt;. Il sera
      pourtant toujours, avertit de ce qu'il fait. <b>Utilisez
      cette option avec prudence.</b> Il n'y a pas de signal de
      protection pour un aiguillage ignor&eacute; mal
      r&eacute;gl&eacute;, si un aiguillage interne non
      signal&eacute; n'est pas r&eacute;gl&eacute; correctement, un
      d&eacute;raillement des trains pourraient en
      r&eacute;sulter.</p>

      <p>Lors du r&eacute;glage du Logix utilis&eacute; dans la
      logique de commande, l'outil cr&eacute;e un capteur interne
      pour communiquer avec la logique simple signal. Le Logix
      appara&icirc;tra dans votre table Logix, et le capteur
      interne appara&icirc;tra dans votre Table capteur. Les noms
      syst&egrave;mes de Logix et du capteur interne sera, IX ou IS
      suivis par TTT_X_HHH, o&ugrave; TTT est le nom du
      syst&egrave;me d'aiguillage o&ugrave; les signaux sont
      situ&eacute;es, soit X est C (Droit) ou T
      (D&eacute;vi&eacute;), selon que le signal est situ&eacute;e
      sur la voie Droite ou de la voie D&eacute;vi&eacute;e ,
      O&ugrave; HHH est le nom syst&egrave;me du signal. Le but de
      cette Logix est de s'assurer que l'aspect du signal sera
      rouge si l'aiguillage n'est pas dans la logique simple signal
      de commutation contre la voie signal&eacute;e par le
      signal.</p>

      <p>Cet outil met en place trois aspects de signalisation.
      Quand un signal montre l'&eacute;tat vers &agrave; une voie
      d&eacute;vi&eacute;e, l'outil sera mis en place pour limiter
      la vitesse (l'aspect le moins restrictive n'est pas vert,
      mais jaune), et le signal montrera jaune quand il serait
      contraire au vert. Vous pouvez changer cela avec une
      modification simple (voir ci-dessous).</p>

      <p>Si vous avez une situation particuli&egrave;re &agrave; un
      signal, vous pouvez avoir &agrave; modifier les informations
      saisies par cet outil dans la logique simple signal. Si vous
      aimeriez avoir quatre aspects de signalisation, vous pouvez
      facilement modifier manuellement la logique pour y parvenir.
      De m&ecirc;me, pour des modifications manuelles simples de la
      logique, vous pouvez ajouter le balisage lumineux d'approche.
      Si vous ne voulez pas en jaune lors d'un basculement vers un
      itin&eacute;raire d&eacute;vi&eacute;, mais que vous
      pr&eacute;f&eacute;rez le vert, ouvrez la Logique Simple
      signal pour le signal que vous voulez changer et
      d&eacute;cochez <b>Vitesse Limit&eacute;e</b>. La bo&icirc;te
      de dialogue Logique Simple Signal peut &ecirc;tre accessible
      depuis le menu contextuel de chaque ic&ocirc;ne de signal. Si
      votre situation sp&eacute;ciale ne peut pas &ecirc;tre
      manipul&eacute;e par une Logique Simple signal, vous devez
      vous r&eacute;f&eacute;rer &agrave; Logix pour adapter le
      signal logique &agrave; vos besoins.</p>

      <h3>Logique pour une Seule T&ecirc;te &agrave; la pointe</h3>

      <p>Il y a diff&eacute;rentes fa&ccedil;ons de mettre en place
      la logique d'un signal unique &agrave; la la pointe d'un
      aiguillage triple. La proc&eacute;dure suivante fera le
      travail, et c'est assez simple.</p>

      <ul>
        <li>
          <p>D&eacute;finir trois signaux virtuelles dans la Table
          Signal, et entrez les comme signaux <b>Pointe
          -Directe</b>, <b>Pointe - D&eacute;vi&eacute;e A</b> et
          <b>Pointe - D&eacute;vi&eacute;e B</b> , avec les signaux
          r&eacute;els <b>D&eacute;vi&eacute;e A</b>,
          <b>Directe</b> , et <b>D&eacute;vi&eacute;e B</b>. Les
          Signaux virtuels sont les signaux qui ne sont pas sur le
          r&eacute;seau- seulement dans l'ordinateur</p>
        </li>

        <li>
          <p>Cochez <b>Mettre en place la Logique</b> pour chacune
          des signaux virtuels, mais ne pas cochez <b>Ajouter
          Ic&ocirc;ne de Signal au TCO</b> pour aucun de ces trois
          signaux virtuels. Cliquez <b>Termin&eacute;</b>. Ceci
          mettra en place la logique pour les trois signaux
          virtuels.</p>
        </li>

        <li>R&eacute;ouvrir l'outil et effacer les noms des trois
        signaux virtuels. Placez le v&eacute;ritable signal dans la
        position <b>Pointe- Directe</b>. Cochez <b>Ajouter
        Ic&ocirc;ne de Signal au TCO</b>, mais ne cochez pas
        <b>Configurer Logic</b> pour ce signal. Cliquez
        <b>Termin&eacute;</b>. Les trois aiguillages virtuels ne
        sont plus affect&eacute; &agrave; l'aiguillage triple, mais
        ils sont encore dans l'ordinateur et leur logique sera
        toujours fonctionelle.</li>

        <li>Configurer un Logix pour d&eacute;finir l'apparence du
        signal de l'unique et v&eacute;ritable pointe, le signal
        repose sur les apparences des trois signaux virtuels.
        Fondamentalement, le signal r&eacute;el devrait &ecirc;tre
        fix&eacute; &agrave; la moins restrictive des apparences
        des trois signaux virtuels. Ceci peut &ecirc;tre accompli
        par un Logix avec sept Conditions avec un nombre croissant
        de variables d'&eacute;tat simple, mis en place comme suit:

          <ul>
            <li>condition 1: Si le signal vert IHV1, alors
            r&eacute;glez Apparence Signal IH1 au Vert</li>

            <li>condition 2: si condition C1 est Faux ET signal
            IHV2 Vert, alors D&eacute;finir Apparence Signal IH1
            Vert</li>

            <li>condition 3: si condition C1 Faux ET condition C2
            Faux ET Signal IHV3 Vert , alors r&eacute;glez
            Apparence Signal IH1 vert</li>

            <li>condition 4: si condition C1 Faux ET condition C2
            Faux ET Condition C3 Faux et Signal IHV1 Jaune , alors
            D&eacute;finir Apparence Signal IH1 Jaune</li>

            <li style="list-style: none">nel C1 Faux ET
            conditionnel C2 Faux ET Conditionnel C3 Faux ET
            conditionnel C4 Faux et Signal IHV2 Jaune, alors
            fix&eacute; Apparence signal IH1 Jaune</li>

            <li>Condition 6 : si condition C1 Faux ET condition C2
            Faux ET Condition C3 Faux ET condition C4 Faux ET
            condition C5 Faux ET Signal IHV3 Jaune , alors
            r&eacute;glez Apparence Signal IH1 Jaune</li>

            <li>condition 7: si condition C1 Faux ET condition C2
            Faux ET Condition C3 Faux ET condition C4 Faux ET C5
            condition Faux ET Condition C6 Faux, Alors
            d&eacute;finir Apparence Signal IH1 Rouge</li>
          </ul>O&ugrave;

          <p>IHV1, IHV2 et IHV3 sont les signaux virtuels, IH1 est
          le v&eacute;ritable signal, et C1, C2, ... , C7 sont les
          conditions 1 &agrave; 7. Remplacez les noms r&eacute;els
          de ces &eacute;l&eacute;ments lorsque vous configurez
          votre Logix.</p>
        </li>
      </ul>

      <p><b>S'il vous pla&icirc;t n'oubliez pas d'enregistrer votre
      panneau apr&egrave;s l'utilisation de cet outil.</b></p>

      <!--#include virtual="/Footer" -->
    </div>
  </div>
</body>
</html>
