<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01//EN" "http://www.w3.org/TR/html4/strict.dtd">
<!--  $Id$ -->
<!-- UpDated by Herv&#233; Blorec <bzh56420@yahoo.fr> 2013-11-01--> 
<html lang="fr">
<head>
 <TITLE>
      JMRI: Set Signals at Turnout Help
 </TITLE>
    <META http-equiv=Content-Type content="text/html; charset=iso-8859-1">
    <META content="Dave Duchamp" name=Author>
    <META name="keywords" content="JMRI help Layout Editor Tool">

<!-- Style -->
  <META http-equiv=Content-Type content="text/html; charset=iso-8859-1">
  <link rel="stylesheet" type="text/css" href="/css/default.css" media="screen">
  <link rel="stylesheet" type="text/css" href="/css/print.css" media="print">
  <link rel="icon" href="/images/jmri.ico" type="image/png">
  <link rel="home" title="Home" href="/">
<!-- /Style -->
</head>

<body>
<!--#include virtual="/Header" -->
  <div class="nomenu" id="mBody">
    <div id="mainContent">

<H1>D&#233;finir Signaux aux aiguillages
</H1>
<h2> Introduction</h2>
<p>
Cet outil fournit une proc&#233;dure automatis&#233;e pour l'attribution des signaux &#224; un aiguillage.
Les aiguillages Droits, Gauches, et Sym&#233;trique sont pris en charge.
Si n&#233;cessaire, cet outil va placer des ic&#244;nes de signal sur le TCO &#224; la position sp&#233;cifi&#233;e de l'aiguillage,
 et une Logique Simple Signal sera mise en place pour les signaux sp&#233;cifi&#233;s.
Avant de s&#233;lectionner cet outil, l'aiguillage doit &#234;tre sur le TCO, et au besoin
les signaux doivent &#234;tre dans le Tableau Signal. Cet outil met seulement les signaux
correctement lorsque la voie principale de l'aiguillage est verticale ou horizontale (ou principalement
verticale ou horizontale) sur le TCO, donc la conception de votre TCO doit en tenir compte.</p>
<p>
Lorsque cet &#233;l&#233;ment est s&#233;lectionn&#233;, une bo&#238;te de dialogue est affich&#233;e pour l'inscription du nom de l'aiguillage
(Syst&#232;me ou utilisateur), et les noms des trois ou quatre signaux doivent &#234;tre affect&#233;s
&#224; l'aiguillage. Pour chaque signal, des cases &#224; cocher sont disponibles pour la s&#233;lection
si une ic&#244;ne doit &#234;tre plac&#233;e sur le TCO, et si une Logique Simple Signal 
doit &#234;tre cr&#233;&#233;e pour le signal. Peu importe si les ic&#244;nes
sont plac&#233;es ou si la logique est cr&#233;&#233;e, l'&#201;diteur de R&#233;seau va enregistrer que les entr&#233;es
Signaux sont affect&#233;es &#224; l'aiguillage d&#233;termin&#233;.</p>
<p>  <b>L'affectation des signaux 
aux aiguillages est importante pour bien d&#233;crire votre r&#233;seau dans l'&#201;diteur de TCO.</B> M&#234;me si vous choisissez de placer vos ic&#244;nes et configurer votre logique signal 
manuellement, vous devez utiliser cet outil pour assigner le signal &#224; l'aiguillage.</p>

<h2>Boite de Dialogue D&#233;finir les signaux &#224; l'aiguillage</h2>
<p>
Dans le champ <b>Nom Aiguillage</b>, entrez le nom (syst&#232;me ou utilisateur) de l'
aiguillage auquel les signaux seront affect&#233;s. Si l'outil ne peut pas trouver
l'aiguillage entr&#233; sur le r&#233;seau, un message d'erreur en r&#233;sultera.</p>
Les noms de signaux (soit syst&#232;me ou utilisateur) sont entr&#233;s dans la section suivante.
L'entr&#233;e <b>Pointe - Divergente</b> est facultative, mais les trois autres doivent
&#234;tre entr&#233;es. Si les signaux &#224; cet aiguillage ont &#233;t&#233; saisis pr&#233;c&#233;demment,
cliquez <b>Obtenir Sauvegarde</b> pour r&#233;cup&#233;rer les noms de signaux pr&#233;c&#233;demment saisis.
Les titres utilis&#233;s pour les quatre signaux doivent suivre le mod&#232;le illustr&#233; ci-dessous.</P>
<p>
<A href="./images/TurnoutSignalModel.gif"><IMG SRC="./images/TurnoutSignalModel.gif" 
ALIGN=CENTER WIDTH="225" HEIGHT="75" HSPACE="0" VSPACE="0"></A>

<p>
Si un signal est entr&#233; pour la <b>Pointe - Divergente</b>, puis <b>Pointe - 
Directe</b> signale  la voie continue et  <b>Pointe - Divergente</b>
signale la voie d&#233;vi&#233;e. Si aucun signal n'est entr&#233;e pour
 <b>Pointe - Divergente</b>, le signal <b>Pointe - Continue</b> refl&#232;te
l'&#233;tat de la voie selon la commutation de l'aiguillage . Dans ce cas, le
Type de logique pour le signal <b>Pointe - Continue</b>  est
<b> Aiguillage en Pointe</b>.</p>
<p>
Remarque: S'il y avait un signal pr&#233;c&#233;demment attribu&#233; &#224; l'une des deux
positions, et vous entrez un <i>autre</i> signal dans le m&#234;me lieu,
le signal remplacera le  signal pr&#233;c&#233;dent, et l'ic&#244;ne
du signal pr&#233;c&#233;dent (s'il y en a une) sera supprim&#233;e du
TCO. De m&#234;me, si vous remplacez un signal pr&#233;c&#233;demment affect&#233; &#224; <b>Pointe -
Divergente</b> avec une entr&#233;e vide (pas de signal), la pr&#233;c&#233;dente
entr&#233;e est supprim&#233;e et l'aiguillage n'aura pas de signal &#224; cette position
. <b> Si un signal est chang&#233;, vous devez refaire toute logique qu'il implique.</b></p>
<p>
Cochez <b>Ajouter Ic&#244;ne de Signal au TCO</b> pour demander que l'ic&#244;ne d'un signal
 soit plac&#233;e sur le TCO &#224; la position indiqu&#233;e de l'aiguillage. Cet outil
 peut seulement placer une ic&#244;ne de signal sur un des aiguillages qui est presque &#224; la verticale ou presque
horizontale. Si ce n'est pas le cas, un message est imprim&#233;, et vous devez placer
l'ic&#244;ne de signal manuellement en utilisant la barre d'outils de l'&#201;diteur de TCO. Peu importe, le
Nom du signal qui est attribu&#233; &#224; la position sp&#233;cifi&#233;e de l'aiguillage.</p>
<p>
Cochez <b> Configurer Logique</b> pour demander que l'outil mette en place une Logique Simple
Signal pour un signal. L'outil permettra de cr&#233;er la logique et 
remplira automatiquement les entr&#233;es avec l'information disponible. Si
l'outil ne poss&#232;de pas assez d'informations disponibles pour configurer la
logique, un message en r&#233;sultera, et vous aurez &#224; revenir plus tard apr&#232;s que
plusieurs signaux aient &#233;t&#233; assign&#233;s &#224; des aiguillages et des limites de canton sur le
TCO.</p>
<h2> Notes</h2>
<p>
Lors de la configuration de la logique, cet outil va suivre la voie dans le
 canton jusqu'&#224; ce qu'il trouve un signal &#224; la fin du canton avant l'aiguillage signal&#233;.
 Si votre r&#233;seau contient des sections qui sont
signal&#233;e et des sections qui ne le sont pas, pour obtenir que cet outil mettre en place une logique
correctement, vous pourriez avoir &#224; placer un signal virtuel (un signal qui ne
correspond pas &#224; un signal r&#233;el sur le r&#233;seau) 
non signal&#233; &#224; la fin du canton qui relie un tron&#231;on de voie qui est
signal&#233;e avec une voie qui n'est pas signal&#233;e. Si un canton se termine par un
Heurtoir, aucun signal n'est requis .</p>
<p>
Si un canton a un aiguillage interne (l'aiguillage, et ses tron&#231;ons de voie &#224; sa
la pointe et les jambes font partie du canton), le programme va attendre les signaux
&#224; cet aiguillage, m&#234;me si ce n'est pas &#224; la fin du canton. Cependant, parfois 
l'utilisateur peut ne pas vouloir signaler un aiguillage rarement utilis&#233; dans un canton.
En suivant la voie &#224; travers un canton, le programme va sauter 
l'aiguillage interne non signal&#233; si <b> Passer Aiguillage Interne Non Signal&#233;</b> est coch&#233; dans
le menu <b> Outils</b> de l'&#201;diteur de TCO.
Il avertira toujours de ce qu'il fait. <b> Utilisez cette option avec
prudence.</b> Il n'y a pas de signal de protection contre un aiguillage ignor&#233;
mal r&#233;gl&#233;, si un aiguillage non signal&#233; interne n'est pas r&#233;gl&#233;e correctement,
un d&#233;raillement des trains pourrait en r&#233;sulter.</p> 
<p>
Cet outil met en place trois aspects de signalisation. Si la voie d&#233;vi&#233;e par le biais
 de l'aiguillage n'est pas en voie principale, la vitesse limit&#233;e (la moins restrictive
n'est pas vert, mais jaune) est mise en place. Si vous avez une situation particuli&#232;re &#224; un
signal, vous pouvez avoir &#224; modifier les informations entr&#233;es par l'outil. Si vous
aimeriez avoir quatre aspects de signalisation, vous pouvez facilement modifier manuellement la logique
pour y parvenir. De m&#234;me, par une modification manuelle simple de la logique, vous pouvez
ajouter un balisage lumineux d'approche. La bo&#238;te de dialogue Simple Logique Signal peut
est accessible depuis le menu contextuel de l'ic&#244;ne de signal. Si votre 
situation sp&#233;ciale ne peut pas &#234;tre manipul&#233;e par une Simple Logique Signal, vous devez vous r&#233;f&#233;rer &#224;
Logix pour adapter le signal logique &#224; vos besoins.</p>
<p>
Si vous utilisez deux aiguillages pour repr&#233;senter une Travers&#233;e Jonction Double, ou si
vous utilisez deux aiguillages pour repr&#233;senter un aiguillage triple, la logique
mise en place par cet outil ne fonctionnera pas correctement. Pour ces deux cas, vous devriez
utiliser les  outils pour <b>D&#233;finir les Signaux des Aiguillages Pointe-&#224;-Pointe </b> ou  pour <b>D&#233;finir le Signal d'un Aiguillage Triple</b> qui sont disponibles dans le menu <b>Outils</b> de l'&#201;diteur de TCO .
</p>
<p>
<b>S'il vous pla&#238;t rappelez vous de sauver votre TCO apr&#232;s l'utilisation de cet outil.</b></p> 

<!--#include virtual="/Footer" -->
</body>
</html>

