<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//FR"
"http://www.w3.org/TR/html4/loose.dtd">
<!-- Translation by Herv&#233; BLOREC <bzh56420@yahoo.fr> on 2019-03-18 -->
<html lang="fr">
<head>
  <meta name="generator" content=
  "HTML Tidy for Mac OS X (vers 31 October 2006 - Apple Inc. build 15.17), see www.w3.org">

  <title>Operations-Build Trains</title><!-- Style -->
  <meta http-equiv="Content-Type" content=
  "text/html; charset=us-ascii">
  <link rel="stylesheet" type="text/css" href="/css/default.css"
  media="screen">
  <link rel="stylesheet" type="text/css" href="/css/print.css"
  media="print">
  <link rel="icon" href="/images/jmri.ico" type="image/png">
  <link rel="home" title="Home" href="/"><!-- /Style -->
</head>

<body>
  <!--#include virtual="/Header" -->

  <div id="mBody">
    <!--#include virtual="Sidebar" -->

    <div id="mainContent">
     


<h1> Utilisation de JMRI&reg; pour l'Exploitation des Trains</h1>

      <h2> Assemblage de Trains</h2>

      <div align = "right">
        <p><a href="Ops_Trains.shtml"> Retour</a> <a href =
        "Ops_TripThruOperations.shtml"></a></p>

        <p><a href="index.shtml#Operations"> Retour &#224; l'Index</a></p>
     </div>
      <h>

      <h3> Listes de Man&#156;uvres par Emplacement</h3>

      <p>Une Liste de Man&#156;uvres indique l'activit&#233;l requise pour desservir 
      tous les Trains visitant cet emplacement. Normalement, une liste de 
      Man&#156;uvres est donn&#233;e au responsable d'un Triage ou d'un site 
      comportant de nombreuses embranchements ou industries.</P>

      <p>Pour pr&#233;visualiser ou imprimer une Liste de Man&#156;uvres, 
      s&#233;lectionnez le ou les Emplacements et configurez votre imprimante, 
      puis appuyez sur <input name = "button14" id =
      "button14" value = "Aper&#231;u des Listes de Man&#156;uvres" 
      type = "button"> ou <input name = "button15" id = "button15" value =
      "Imprimer les Listes de Man&#156;uvres" type = "button"></p>

      <p><input name = "button16" id = "button16" value = "Enregistrer" type =
      "bouton"> enregistrera vos s&#233;lections. <br>
      <br>
      <img style = "width: 561px; height: 660px;" alt = "liste de commutation"
      src = "images/Ops_TrainsSwitchList.png"> <br></p>

      <p>Aper&#231;u ou impression de Liste de Man&#156;uvre</p>

      <p><img src = "images/Ops_TrainsPreviewSwitchList.png" alt =
      "preview switch list" height = "375" width = "724"></p>

      <h3>Assemblage de Trains</h3>

      <p>Pour assembler un train, appuyez sur <input name = "button17" id =
      "button17" value = "Assembler" type = "submit"> dans la ligne 
      correspondant au train souhait&#233; dans la fen&#234;tre <strong>Trains
      </strong>. Une fois le train construit <input name = "button17" 
      id = "button18" value = "Assembler" type = "submit"> passe &#224; <input name =
      "button18" id = "button19" value = "Imprimer" type = "submit"> ou
      <input name = "button52" id = "button52" value = "Aper&#231;u" type =
      "bouton">.</p>

      <p>Vous pouvez s&#233;lectionner l'action que vous souhaitez effectuer 
      sur tous les Trains s&#233;lectionn&#233;s.</p>

      <p><img style = "width: 422px; height: 126px;" alt = "action"
      src = "images/Ops_Trains_action.png"></p>

      <p><img style = "width: 1016px; height: 146px;" alt =
      "Construction des Trains" src = "images/Ops_TrainsBuild01.png"> <br></p>

      <p>Si vous voulez voir comment le train a &#233;t&#233; assembl&#233;, s&#233;lectionnez 
      <input name = "checkbox5" id = "checkbox5" checked =" checked ".
      type = "checkbox"> <strong>Cr&#233;er des rapports</strong> avant d'appuyer
       sur <input name = "button19" id = "button20" value = "Aper&#231;u"
      type = "submit"> pour le train souhait&#233;.</p>

      <p><img style = "width: 635px; height: 148px;" alt =
      "Trains construits" src = "images/Ops_TrainsBuild03.png"></p>

      <p>Si le <input name = "checkbox5" id = "checkbox6" checked =
      "checked" type = "checkbox"> <strong>Pr&#233;visualisation de Manifeste
      </strong> est s&#233;lectionn&#233;, le programme g&#233;n&#232;re le rapport d'assemblage, 
      le manifeste et les pr&#233;sente dans des fen&#234;tres de pr&#233;visualisation.</p>

      <p><img style = "width: 319px; height: 126px;" alt =
      "Trains construits" src = "images/Ops_TrainsBuild02.png"> <br></p>

      <p>Si vous souhaitez cr&#233;er plusieurs Trains sans devoir appuyer 
      sur des boutons individuels pour chaque train, s&#233;lectionnez les 
      Trains &#224; assembler dans la colonne <strong>Assembler</strong>.
      <input name = "checkbox5" id = "checkbox7" "checked =" checked "
      type = "checkbox"> et appuyez sur <input name = "boutton20" id =
      "button21" value = "Assembler" type = "submit"> trouv&#233; en bas du 
      panneau Trains. Le programme Assemblera ensuite des manifestes pour 
      tous les Trains s&#233;lectionn&#233;s.</P>

      <p>Si un train ne parvient pas &#224; s'assembler, le <input name = 
      "button21" id ="button22" value = "D&#233;placer" type = "submit"> changera le texte
      to <input name = "button22" id = "button23" value = "Rapport" type =
      "submit">. Appuyer sur <input name = "button23" id = "button24"
      value = "Rapport" type = "submit"> imprimera ou pr&#233;visualisera le 
      rapport d'Assemblage pour ce train. Chaque fois qu'un train ne 
      parvient pas &#224; s'assembler, un message d'&#233;chec d'Assemblage 
      appara&#238;tra. Si vous souhaitez d&#233;sactiver cette fonctionnalit&#233;, 
      d&#233;cochez la case <input name = "checkbox5".
      id = "checkbox8" type = "checkbox"> <strong>Cr&#233;er des messages</strong>.</p>

      <p>Avec <input name = "checkbox5" id = "checkbox9" checked =
      "checked" type = "checkbox"> <a href =
      "Ops_ManifestPreview.shtml"> Aper&#231;u du Manifeste</a>, appuyez sur 
      <input name = "button24" id = "button25" value = "Pr&#233;visualisation" type =
      "submit"> et le manifeste de train s'affiche dans la fen&#234;tre 
      d'aper&#231;u de votre imprimante syst&#232;me.</p>

      <p>Avec <input name = "checkbox6" id = "checkbox10" checked =
      "checked" type = "checkbox"> <strong>Aper&#231;u du Manifeste</strong>,
      <input name = "checkbox7" id = "checkbox11" checked = "checked"
      type = "checkbox"> <a href = "Ops_BuildReportPreveiw.shtml"> <strong>
      Rapports d'Assemblage</strong></a> et <input name = "checkbox8" id =
      "checkbox12" checked = "checked" type = "checkbox"> <strong>Messages 
      d'Assemblage </strong> s&#233;lectionn&#233;s, appuyez sur <input name = "button25" id =
      "button26" value = "Aper&#231;u" type = "submit"> et tous les Rapports 
      et Manifestes de train sont pr&#233;visualis&#233;s. Vous pouvez ensuite 
      imprimer les rapports ou manifestes souhait&#233;s &#224; l'aide de la bo&#238;te 
      de dialogue d'impression de votre syst&#232;me.</p>

      <h3> Probl&#232;mes d'Assemblage des Trains</h3>

      <p>Si vous rencontrez un probl&#232;me lors de l'Assemblage  d'un Train, 
      vous pouvez s&#233;lectionner <input name = "checkbox9" id = "checkbox13" 
      checked =" checked "type = "checkbox"> <strong>Rapports d'Assemblage
      </strong> dans la case &#224; cocher au bas du panneau de Train. 
      Lorsqu'un Assemblage  &#233;choue pour une raison quelconque et que 
      <input name = "checkbox10" id = "checkbox14" checked = "checked" 
      type = "checkbox"> <strong>Cr&#233;er des Rapports</strong> est 
      s&#233;lectionn&#233;, le programme envoie un Rapport &#224; votre imprimante si 
      <input name = "checkbox11" id ="checkbox15" type = "checkbox"> 
      <strong>Pr&#233;visualisation des Manifestes</strong> ne sont pas 
      s&#233;lectionn&#233;s. ou dans une fen&#234;tre de pr&#233;visualisation si <input name 
      = "checkbox12" id = "checkbox16" checked ="checked" type = 
      "checkbox"> <strong>Pr&#233;visualisation des Manifestes</strong> sont 
      s&#233;lectionn&#233;s. Le rapport de g&#233;n&#233;ration peut imprimer diff&#233;rents 
      niveaux de d&#233;tail, du plus simple au plus d&#233;taill&#233;. Consultez la 
      section <a href="Ops_PrintOptions.shtml"> D&#233;tails du Rapport 
      d'Assemblage </a> pour plus d'informations sur la modification du 
      niveau de d&#233;tail du Rapport d'Assemblage.</P>

      <p>Le programme confirme maintenant lors de l'Assemblage que 
      tous les Wagons d'un noyau ont le m&#234;me emplacement de d&#233;part et la
       m&#234;me Voie.</p>

      <p>Le programme attendra la fin des scripts avant de cr&#233;er un train.</p>

      <h4>Assemblage de plusieurs Trains pour une session</h4>

      <p>La plupart des sessions d'Exploitation requi&#232;rent plus d'un 
      train pour occuper vos op&#233;rateurs. La bonne fa&#231;on de faire est 
      d'assembler et d'imprimer tous les Trains n&#233;cessaires avant de les 
      terminer. Donc, si vous avez besoin d'une douzaine de Trains pour 
      une session, vous devez Assembler douze Trains avant de terminer 
      un train. Terminer un train indique au programme que les locomotives 
      et les wagons de ce train ont &#233;t&#233; livr&#233;s &#224; leur emplacement final 
      et peuvent &#234;tre r&#233;utilis&#233;s lors de l'Assemblage de nouveaux Trains. 
      Il faut donc toujours tout assembler, tout imprimer, puis terminer 
      chaque train apr&#232;s avoir termin&#233; son parcours! Il est normal 
      d'Assembler tous les Trains, d'imprimer tous les Trains, puis 
      d'utiliser le param&#232;tre <input name = "button37" id = "button45" 
      value = "Enregistrer Assemblage" type = "submit"> et fermez le 
      programme. Plus tard, vous pourrez red&#233;marrer le programme et 
      mettre fin aux Trains qui ont termin&#233; leur parcours.</P>

      <p>L'heure exacte pour terminer un train est le moment o&#249; le train 
      arrive &#224; destination. Arr&#234;ter un train avant qu'il ne soit achev&#233; 
      signifie que la base de donn&#233;es d'exploitation estime que les 
      locomotives et les wagons ont &#233;t&#233; livr&#233;s. Il est pr&#233;f&#233;rable 
      d'Assembler et d'imprimer douze Trains, puis de s'apercevoir que 
      seuls neuf Trains ont termin&#233; leur parcours. Vous pouvez alors 
      terminer neuf Trains et laisser les trois autres pour la prochaine 
      fois. Ou, si vous le souhaitez, vous pouvez r&#233;initialiser les Trains 
      qui ne sont pas partis de leur terminal. R&#233;initialiser les Trains 
      n'est vraiment pas n&#233;cessaire, les Trains qui ne se sont pas arr&#234;t&#233;s 
      pendant cette session pourraient le faire pendant la prochaine session.</P>

      <p>Une autre m&#233;thode consiste &#224; cr&#233;er, imprimer et utiliser 
      <input name = "button39" id = "button46" value = "D&#233;placer" type =
      "submit"> pour chaque train pour suivre le mouvement r&#233;el des Trains
       pendant votre session. Tant que les Trains de votre r&#233;seau 
       correspondent aux emplacements du programme, vous pouvez cr&#233;er 
       un nouveau train.</P>

      <h4> Trains en mouvement</h4>
      <p>Apr&#232;s avoir fourni &#224; vos op&#233;rateurs un manifeste imprim&#233; ou une 
      liste de Man&#156;uvres, vous devez conserver la base de donn&#233;es du 
      programme synchronis&#233;e avec le mouvement r&#233;el des Trains sur votre 
      r&#233;seau. Ceci est fait par  <input name = "button38" id =
      "button47" value = "D&#233;placer" type = "submit"> situ&#233; &#224; l'extr&#234;me 
      droite du menu du train. Appuyer sur <input name = "button40"
      id = "button48" value = "D&#233;placer" type = "submit"> obligera le 
      train &#224; quitter sa position actuelle pour se d&#233;placer sur la 
      position suivante de l'itin&#233;raire. Les Machines et les Wagons 
      affect&#233;s au train se rendront au prochain emplacement sur le r&#233;seau. 
      &#193; chaque Emplacement, les Wagons peuvent &#234;tre ramass&#233;es ou d&#233;pos&#233;es. 
      Vous pouvez &#233;galement d&#233;placer un train en s&#233;lectionnant l'ic&#244;ne 
      du train et en s&#233;lectionnant <input name = "button41" id = "button49"
       value = "D&#233;placer" type = "submit"> dans le menu contextuel de 
       l'ic&#244;ne. Chaque fois que vous appuyez sur <input name = "button42" 
       id = "button50" value = "D&#233;placer" type = "submit"> le train 
       se rapproche  de son Emplacement terminal. Lorsque le train arrive au 
       dernier emplacement de l'itin&#233;raire, le dernier appui sur 
       <input name = "button43" id = "button51" value ="D&#233;placer" 
       type = "submit"> mettra fin au train. Une fois qu'un train est 
       termin&#233;, vous pouvez le reconstruire.</P>

      <p>Chaque fois qu'une Machine ou qu'un Wagon est d&#233;plac&#233;, un compteur 
      qui leur est associ&#233; est incr&#233;ment&#233;. Le programme utilise cette 
      information pour d&#233;terminer les wagons qui n'ont pas boug&#233; 
      r&#233;cemment et essaie de s&#233;lectionner les wagons avec le moins de 
      d&#233;placements possible lors de l'assemblage de nouveaux Trains. 
      Chaque fois qu'un Wagon est prise en charge ou laiss&#233;e sur un site, 
      le programme incr&#233;mente le nombre associ&#233; &#224; ce site. Le programme 
      tente de d&#233;placer les Wagons dans les endroits o&#249; le nombre de 
      Wagons est le moins utilis&#233;.</P>
      <h>

      <div align = "right">
        <p><a href="Ops_Trains.shtml"> Retour</a></p>

        <p><a href="index.shtml#Operations"> Retour &#224; l'Index</a></p>
      </div><!--#include virtual="/Footer" -->
    </div>
  </div>
</body>
</html>
