<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01//EN"
"http://www.w3.org/TR/html4/strict.dtd">
<!-- UpDated  by Blorec Herv&#233; le 2013-09-21-->

<html lang="fr">
<head>
  <meta name="generator" content=
  "HTML Tidy for Mac OS X (vers 31 October 2006 - Apple Inc. build 15.17), see www.w3.org">

  <title>JMRI: Light Documentation</title>
  <meta content="Bob Jacobsen" name="Author">
  <meta name="keywords" content=
  "hardware layout java model railroad JMRI CMRI decoderpro panelpro tools loconet lenz nce easydcc dcc nmra">
  <!-- Style -->
  <meta http-equiv="Content-Type" content=
  "text/html; charset=us-ascii">
  <link rel="stylesheet" type="text/css" href="/css/default.css"
  media="screen">
  <link rel="stylesheet" type="text/css" href="/css/print.css"
  media="print">
  <link rel="icon" href="/images/jmri.ico" type="image/png">
  <link rel="home" title="Home" href="/"><!-- /Style -->
</head>

<body>
  <!--#include virtual="/Header" -->

  <div id="mBody">
    <!--#include virtual="Sidebar" -->

    <div id="mainContent">
      <h1>JMRI:Documentation Lumi&egrave;re</h1>

      <h2>Que sont les Lumi&egrave;res?</h2>

      <p>Les Lumi&egrave;res sont des bits de sortie
      num&eacute;rique qui fonctionnent comme des interrupteurs
      marche/arr&ecirc;t. Les Lumi&egrave;res ont &eacute;t&eacute;
      cr&eacute;&eacute;es pour fournir un contr&ocirc;le
      ais&eacute; des voyants du panneau de commande et
      l'&eacute;clairage des paysages. Les Lumi&egrave;res peuvent
      aussi &ecirc;tre utilis&eacute;es &agrave; des fins qui
      n&eacute;cessitent une commutation marche/arr&ecirc;t. Les
      Lumi&egrave;re peuvent &ecirc;tre utilis&eacute;es, par
      exemple, pour activer un dispositif d&eacute;coupleur
      &eacute;lectromagn&eacute;tique pour un temps
      pr&eacute;-d&eacute;termin&eacute; en r&eacute;ponse &agrave;
      un bouton du panneau de contr&ocirc;le. Initialement
      d&eacute;velopp&eacute; pour une utilisation avec le C/MRI,
      les Lumi&egrave;res actuellement sont &eacute;galement mises
      en oeuvre sur LocoNet (Digitrax) et les syst&egrave;mes
      Oaktree.</p>

      <p>Les Lumi&egrave;res partagent les bits de sortie
      num&eacute;rique disponibles avec les Aiguillages. Soit une
      Lumi&egrave;re ou un Aiguillage, mais pas les deux, peut
      contr&ocirc;ler un bit de sortie num&eacute;rique
      sp&eacute;cifique. Puisque les Lumi&egrave;res n'ont pas la
      structure de r&eacute;trosignalisation des Aiguillages, les
      Lumi&egrave;res ne doivent pas &ecirc;tre utilis&eacute;es
      pour commander les Aiguillages sur le r&eacute;seau; seuls
      les Aiguillages devraient &ecirc;tre utilis&eacute;s pour
      commander les commutateurs de voies (Aiguillage) . Pour des
      raisons historiques, les apparences des T&ecirc;tes Signal
      sont d&eacute;finies en utilisant les aiguillages, m&ecirc;me
      si elles peuvent &ecirc;tre r&eacute;ellement physiquement
      allum&eacute;es par les Lumi&egrave;res. Alors les
      Aiguillages devraient &ecirc;tre utilis&eacute;s pour
      r&eacute;f&eacute;rencer les bits de sortie num&eacute;rique
      utilis&eacute;s avec T&ecirc;te Signal JMRI. Lumi&egrave;re
      doit &ecirc;tre utilis&eacute;e si vous avez besoin d'un
      m&eacute;canisme simple pour contr&ocirc;ler
      l'&eacute;clairage ou des d&eacute;cors, les voyants du
      panneau, ou pour d'autres t&acirc;ches sous/hors tension
      o&ugrave; les m&eacute;canismes de contr&ocirc;le des
      lumi&egrave;res sont adapt&eacute;s aux besoins.</p>

      <p>En option, une Lumi&egrave;re peut &ecirc;tre
      contr&ocirc;l&eacute;e de quatre fa&ccedil;ons: elle peut
      &ecirc;tre contr&ocirc;l&eacute;e par un Capteur, par un
      Aiguillage, par l'Horloge rapide JMRI, ou commut&eacute;e
      pendant une p&eacute;riode d&eacute;termin&eacute;e par un
      Capteur. Quand une Lumi&egrave;re est cr&eacute;&eacute;e, ou
      quand elle est lue &agrave; partir d'un fichier de
      configuration, la Lumi&egrave;re est "activ&eacute;e", il est
      mis en place une surveillance automatique des changements
      d'&eacute;tat de son Capteur de Commande, de l'Aiguillage, ou
      une Horloge rapide. Lorsque le Capteur de commande,
      l'Aiguillage, ou de l'Horloge changent d'une mani&egrave;re
      sp&eacute;cifi&eacute;e par l'utilisateur, la Lumi&egrave;re
      est allum&eacute;e ou &eacute;teinte. Les Lumi&egrave;res
      peuvent &eacute;galement &ecirc;tre contr&ocirc;l&eacute;es
      par <a href="Logix.shtml">Logix</a>, si plus de logique
      complexe de contr&ocirc;le est n&eacute;cessaire.</p>

      <p>Le Tableau Lumi&egrave;re contient une colonne
      'Activ&eacute;'. Pour qu'une Lumi&egrave;re soit
      d&eacute;clench&eacute;e par son Capteur de commande,
      l'Horloge rapide, l'Aiguillage de commande, elle doit
      &ecirc;tre "activ&eacute;e", ce qui revient &agrave; cocher
      la case dans la colonne 'Activ&eacute;e'. Vous pouvez
      d&eacute;cocher cette case pour d&eacute;sactiver le
      d&eacute;clenchement temporaire d'une Lumi&egrave;re , c'est
      &agrave; dire &eacute;viter qu'elle commute lors du
      contr&ocirc;le des m&eacute;canismes des feux.</p>

      <h3>Commutation d'une Lumi&egrave;re allum&eacute;e ou
      &eacute;teinte</h3>

      <p>Les Lumi&egrave;res peuvent &ecirc;tre activ&eacute;es ou
      d&eacute;sactiv&eacute;es en cliquant sur le bouton dans la
      colonne &Eacute;tat de la Table Lumi&egrave;res. La
      Lumi&egrave;re peut &ecirc;tre configur&eacute;e pour suivre
      l'&eacute;tat d'un aiguillage , lorsque l'Aiguillage est
      droit, et hors tension lorsqu'il n'est pas
      d&eacute;vi&eacute;, ou vice versa. La lumi&egrave;re peut
      &ecirc;tre r&eacute;gl&eacute;e pour suivre l'&eacute;tat
      d'un D&eacute;tecteur d'occupation de canton, lorsque le
      capteur est actif, et d&eacute;sactiv&eacute; quand il est
      inactif, ou vice-versa. La Lumi&egrave;re peut
      &eacute;galement &ecirc;tre r&eacute;gl&eacute;e par un
      bouton du panneau de commande pour suivre les horloge rapide
      JMRI, sur une p&eacute;riode de temps
      sp&eacute;cifi&eacute;e, puis s'&eacute;teindre. La
      Lumi&egrave;re peut &eacute;galement &ecirc;tre
      contr&ocirc;l&eacute;e &agrave; partir d'un <a href=
      "Logix.shtml">Logix</a>, comme l'action d'une de ses
      conditions. Si vous avez besoin d'une logique plus puissante
      pour contr&ocirc;ler votre lumi&egrave;re, consid&eacute;rez
      l'aide d'un <a href="Logix.shtml">Logix</a>.</p>

      <p>Notez que activ&eacute;e/d&eacute;sactiv&eacute;e
      s'applique uniquement &agrave; un m&eacute;canisme de
      commande automatis&eacute; de la Lumi&egrave;re. Un Etat
      "d&eacute;sactiv&eacute;" n'emp&ecirc;chera pas une
      Lumi&egrave;re d'&ecirc;tre activ&eacute;e ou
      d&eacute;sactiv&eacute;e en utilisant le bouton dans le
      Tableau Lumi&egrave;re ou en &eacute;tant
      contr&ocirc;l&eacute;e par un automate Logix.</p>

      <h3>Sauvegarde Lumi&egrave;res sur disque</h3>

      <p>Les Lumi&egrave;res sont enregistr&eacute;es dans votre
      fichier de configuration de r&eacute;seau, avec les
      aiguillages, capteurs, les T&ecirc;tes de signal, etc Pour
      stocker ces informations sur le disque, utilisez
      <b>Enregistrer Configuration ...</b> dans le <b>fichier</b>
      de menu en haut du Tableau Lumi&egrave;res (ou d'autres
      tableau &agrave; partir du menu Outils), ou
      s&eacute;lectionnez <b>Enregistrer Panneau...</b> dans le
      menu <b>Panneau</b> . Notez que l'&eacute;tat
      activ&eacute;/d&eacute;sactiv&eacute; de chaque
      Lumi&egrave;re n'est pas enregistr&eacute; dans le fichier de
      configuration. Lorsque les Lumi&egrave;res sont
      charg&eacute;es &agrave; partir d'un fichier de
      configuration, elles sont tous activ&eacute;es. <a name=
      "addLight" id="addLight"></a></p>

      <h3>Ajout d'un Nouvelle Lumi&egrave;re</h3>

      <p>Pour ajouter une nouvelle Lumi&egrave;re, suivez cette
      proc&eacute;dure:</p>

      <ol>
        <li>Cliquez <b>Tableau Lumi&egrave;res</b> dans le menu
        <b>Outils</b> pour faire appara&icirc;tre le Tableau
        Lumi&egrave;re, et cliquez sur le bouton <b>Ajouter ...</b>
        au bas de la table pour faire appara&icirc;tre la
        fen&ecirc;tre Ajouter/Modifier Lumi&egrave;re.</li>

        <li>Entrez un nom syst&egrave;me, selon la convention JMRI.
        La premi&egrave;re lettre d&eacute;signe le mat&eacute;riel
        de votre syst&egrave;me ('L' pour loconet, "C" pour C/MRI,
        etc), et la deuxi&egrave;me lettre doit &ecirc;tre 'L' pour
        la lumi&egrave;re. Elles sont suivies par un nombre qui
        donne l'adresse mat&eacute;rielle du bit de sortie
        num&eacute;rique r&eacute;f&eacute;renc&eacute;. Exemples
        d'adresses valides du syst&egrave;me sont: CL1004, et
        LL401, en supposant que vous ayiez le mat&eacute;riel pour
        les bits sortie num&eacute;rique adress&eacute;s .</li>

        <li>Entrez un nom utilisateur. Toute cha&icirc;ne de
        caract&egrave;res qui est diff&eacute;rente du nom
        utilisateur d'autres Lumi&egrave;res sera accept&eacute;e,
        mais il est sage d'utiliser une cha&icirc;ne qui
        d&eacute;crit l'utilisation pr&eacute;vue de la
        Lumi&egrave;re.</li>

        <li>S&eacute;lectionnez le type de commande &agrave; partir
        des options dans le menu contextuel. Lorsque vous changez
        le type de commande, diff&eacute;rentes options
        apparaissent sur les deux lignes ci-dessous. Les options de
        contr&ocirc;le sont examin&eacute;es plus en d&eacute;tail
        <a href="#lightcontrol">ci-dessous</a>.</li>

        <li>Entrez les informations requises pour compl&eacute;ter
        la d&eacute;finition de la commande dans les champs qui
        apparaissent. Si vous avez besoin d'entrer un nom de
        capteur ou un nom d'aiguillage, vous devez entrer le nom
        (nom syst&egrave;me ou nom utilisateur) d'un capteur ou
        d'un aiguillage existant. <b>Attention</b> : si vous entrez
        un nom d'utilisateur, soyez prudent sur le changement du
        nom utilisateur de votre capteur ou de votre aiguillage. Un
        simple changement du nom utilisateur pourrait casser votre
        d&eacute;finition de commande de Lumi&egrave;re.</li>

        <li>Ensuite se trouve la zone des notes de la fen&ecirc;tre
        Ajouter/Modifier Lumi&egrave;re. C'est ici qu'apparaitront
        les instructions et les messages d'erreur lorsque vous
        cr&eacute;ez ou modifiez une Lumi&egrave;re. Il faut
        toujours v&eacute;rifier ce domaine pour voir si les choses
        se d&eacute;roulent comme pr&eacute;vu.</li>

        <li>Cliquez sur le bouton <b>Cr&eacute;er</b> situ&eacute;
        au bas de la fen&ecirc;tre. Si tout va bien, un message
        indiquant "Nouvelle Lumi&egrave;re ajout&eacute;e ..." sera
        affich&eacute; dans la zone des notes. S'il y a des
        probl&egrave;mes avec quoi que ce soit, une erreur ou un
        message d'avertissement sera affich&eacute; dans la zone
        des notes; vous devez alors corriger l'erreur et cliquez
        sur <b>Cr&eacute;er</b> &agrave; nouveau.</li>
      </ol>

      <h3>Modification d'une Lumi&egrave;re Existante</h3>

      <p>Pour modifier une Lumi&egrave;re existante, suivez cette
      proc&eacute;dure:</p>

      <ol>
        <li>Modifier une Lumi&egrave;re existante peut &ecirc;tre
        d&eacute;marr&eacute; par une des deux
        m&eacute;thodes:</li>

        <li>Cliquez sur un bouton <b>Modifier</b> Lumi&egrave;re
        dans la Table Lumi&egrave;re.</li>

        <li>Entrez le nom syst&egrave;me de la Lumi&egrave;re
        &agrave; modifier dans la fen&ecirc;tre Lumi&egrave;re
        Ajouter/Modifier et cliquez sur le bouton <b>Modifier</b>
        Lumi&egrave;re au le bas de la fen&ecirc;tre
        Ajouter/Modifier Lumi&egrave;re. Ce doit &ecirc;tre le
        m&ecirc;me que le nom syst&egrave;me montr&eacute; dans le
        Tableau lumi&egrave;re.</li>

        <li style="list-style: none">Les boutons
        <b>Cr&eacute;er</b> et <b>Modifier</b> au bas de la
        Fen&ecirc;tre de Lumi&egrave;re Ajouter/Editer vont changer
        pour <b>Mise &agrave; jour</b> et <b>Annuler</b> .</li>

        <li>Effectuez les modifications ou les ajouts que vous avez
        besoin &agrave; l'information dans la bo&icirc;te de
        dialogue. Notez que le nom syst&egrave;me de la
        Lumi&egrave;re &eacute;dit&eacute;e ne peut pas &ecirc;tre
        chang&eacute;, mais le nom utilisateur peut &ecirc;tre
        chang&eacute;. Les autres &eacute;l&eacute;ments sont
        d&eacute;crits <a href="#addLight">ci-dessus</a>.</li>

        <li>Apr&egrave;s avoir modifi&eacute; les informations
        Lumi&egrave;re, cliquez sur <b>Mise &agrave; jours</b> pour
        changer la lumi&egrave;re s&eacute;lectionn&eacute;e. Si
        tout va bien, un message indiquant "Lumi&egrave;re mise
        &agrave; jour..." sera affich&eacute; dans la zone des
        notes S'il y un probl&egrave;me, un message d'avertissement
        ou d'erreur sera affich&eacute; dans la zone des notes, et
        la mise &agrave; jour sera arr&ecirc;t&eacute;e pour que
        vous corrigiez l'erreur et cliquez sur <b>Mise &agrave;
        jours</b> &agrave; nouveau.</li>

        <li style="list-style: none">Cliquez</li>

        <li><b>Annuler</b> pour quitter le mode &eacute;dition sans
        changer la Lumi&egrave;re s&eacute;lectionn&eacute;e. Si la
        fen&ecirc;tre ajouter/modifier Lumi&egrave;re est
        rejet&eacute;e (ferm&eacute;e) alors que dans le mode
        &eacute;dition, <b>Annuler</b> est automatiquement
        s&eacute;lectionn&eacute;, et aucune modification ne sera
        apport&eacute;e &agrave; la Lumi&egrave;re
        s&eacute;lectionn&eacute;e.</li>

        <li>apr&egrave;s avoir modifi&eacute; les informations de
        Lumi&egrave;re, cliquez <b>Mise &agrave; jour</b> pour
        changer la lumi&egrave;re s&eacute;lectionn&eacute;e. Si
        tout va bien, un message indiquant "lumi&egrave;re mise
        &agrave; jour ..." sera affich&eacute; dans la zone des
        notes. S'il y a un probl&egrave;me, une erreur ou un
        message d'avertissement sera affich&eacute; dans la zone
        des notes, et la mise &agrave; jour sera
        arr&ecirc;t&eacute;e pour vous permettre de corriger
        l'erreur et cliquez sur <b>Mise &agrave; jours</b> &agrave;
        nouveau.</li>

        <li>Cliquez <b>Annuler</b> pour quitter le mode
        &eacute;dition sans changer la Lumi&egrave;re
        s&eacute;lectionn&eacute;e. Si la fen&ecirc;tre de
        lumi&egrave;re ajouter/modifier est rejet&eacute;e
        (ferm&eacute;e) alors que dans le mode &eacute;dition,
        <b>Annuler</b> est automatiquement
        s&eacute;lectionn&eacute;, et aucune modification n'est
        apport&eacute;e &agrave; la Lumi&egrave;re
        s&eacute;lectionn&eacute;e.</li>
      </ol><a name="lightcontrol" id="lightcontrol"></a>

      <h3>Options de Commande Automatis&eacute;e des
      Lumi&egrave;res</h3>Le fonctionnement d'une lumi&egrave;re
      peut &ecirc;tre command&eacute;e par les moyens suivants:

      <ul>
        <li><b>Par Capteur</b> - La Lumi&egrave;re sera
        allum&eacute;e lorsque le capteur change d'actif ou
        d'inactif, selon le choix fait dans le "Sens pour ON" du
        menu contextuel, et il sera &eacute;teint, lorsque le
        capteur inverse l'&eacute;tat. Sp&eacute;cifiez le capteur
        en saisissant son nom (nom syst&egrave;me ou nom
        utilisateur) dans le champ "Nom de Capteur". Cette option a
        un certain nombre d'utilisations, y compris
        l'&eacute;tablissement d'une lumi&egrave;re du tableau de
        commande pour suivre l'occupation des cantons. C'est utile,
        par exemple, pour suivre la position du train dans la
        surveillance d'une coulisse.</li>

        <li><b>Par l'Horloge Rapide</b> - La Lumi&egrave;re sera
        allum&eacute;e quand l'horloge atteint l'heure
        indiqu&eacute;e dans le "Time On" et sera
        d&eacute;sactiv&eacute;e lorsque l'horloge rapide atteint
        le temps entr&eacute; dans "Time Off". Les temps sont
        entr&eacute;s dans le format "hh: mm" , o&ugrave; "hh" est
        heures et "mm" est minutes d'une horloge 24 heures. Une
        utilisation de cette option est d'activer et de
        d&eacute;sactiver l'&eacute;clairage des paysages, les
        lumi&egrave;res des rues, lumi&egrave;res des maison, etc
        pour simuler le temps de passage &agrave; la nuit sur le
        r&eacute;seau.</li>

        <li>
          <p><b>Par &Eacute;tat d'Aiguillage</b> - La
          Lumi&egrave;re sera allum&eacute;e quand l'aiguillage
          passe de droit &agrave; d&eacute;vi&eacute;, selon le
          choix fait dans le "Etat pour ON" du menu contextuel, et
          il sera &eacute;teint, quand l'aiguillage inverse son
          &eacute;tat. Sp&eacute;cifiez l'aiguillage en saisissant
          son nom (nom syst&egrave;me ou nom utilisateur) dans le
          champ "Nom de l'Aiguillage". Cette option peut &ecirc;tre
          utilis&eacute;e pour allumer une lumi&egrave;re sur le
          tableau de commande pour suivre l'&eacute;tat d'un
          aiguillage. C'est utile, par exemple, pour surveiller
          l'&eacute;tat des aiguillages cach&eacute;s.</p>
        </li>

        <li><b>Par Chronom&eacute;trage ON</b> - La Lumi&egrave;re
        sera allum&eacute;e lors du changement du capteur
        d&eacute;clencheur actif, et il sera &eacute;teint, quand
        le temps pr&eacute;cis&eacute; se sera
        &eacute;coul&eacute;. Sp&eacute;cifiez le capteur
        d&eacute;clencheur en saisissant son nom (nom du
        syst&egrave;me ou nom d'utilisateur) dans le champ "Nom du
        capteur de d&eacute;clenchement. Entrez le temps d'allumage
        de la Lumi&egrave;re (en millisecondes) dans la
        "dur&eacute;e ON" dans le champs . Cette option a un
        certain nombre d'utilisations, ell a &eacute;t&eacute;
        initialement con&ccedil;ue pour enclenchez un
        d&eacute;coupleur &eacute;lectromagn&eacute;tique en
        r&eacute;ponse &agrave; un bouton poussoir du panneau de
        contr&ocirc;le, mais il peut &eacute;galement &ecirc;tre
        utilis&eacute; pour d'autres types d'animation sur le
        r&eacute;seau, par exemple, pour contr&ocirc;ler la
        sonnerie d'une cloche de passage &agrave; niveau quand un
        train entre dans le canton.</li>
      </ul><a name="variablelight" id="variablelight"></a>

      <h3>Lumi&egrave;res Variables</h3>

      <p>Une lumi&egrave;re variable permet un niveau variable
      d'intensit&eacute;s entre On et Off. L'utilisation typique
      serait pour l'&eacute;clairage simulant les changements pour
      le moment de la journ&eacute;e et la nuit. Seules certaines
      formes de lumi&egrave;res ont la possibilit&eacute;
      d'&ecirc;tre variable. Des exemples comprennent des
      dispositifs Internes et PowerLine. Un certain nombre
      d'options de configuration sont disponibles pour les
      lumi&egrave;res variables <a href=
      "#VariableLightSettings">ci-dessous</a>.</p>

      <p>Une lumi&egrave;re variable est ajust&eacute;e par un
      r&eacute;glage d'intensit&eacute;. La gamme de
      l'intensit&eacute; est de 0,00 pour Off &agrave; 1,00 qui est
      On complet. L'entr&eacute;e utilisateur pour
      l'intensit&eacute; sera soit l'utilisation de la valeur avec
      virgule ou la valeur de pourcentage de 0% &agrave; 100%.</p>

      <p>Selon le mat&eacute;riel utilis&eacute;, certaines
      lumi&egrave;res variables feront un ajustement
      d'initialisation lors du passage du mode simple mode on/off
      pour l'utilisation des param&egrave;tres d'intensit&eacute;.
      Sur ces appareils ce ne sera pas &agrave; nouveau
      n&eacute;cessaire aussi longtemps que <b>uniquement</b> les
      commandes de r&eacute;glage d'intensit&eacute; sont
      utilis&eacute;es. Un m&eacute;lange sur les commande
      marche/arr&ecirc;t peut exiger que l'initialisation se
      produise &agrave; nouveau.</p>

      <p>Une lumi&egrave;re variable a trois types
      d'op&eacute;rateurs:</p>

      <dl>
        <dt><b>On</b></dt>

        <dd>Cette op&eacute;ration va enclencher une lumi&egrave;re
        variable. Il va l'emporter sur tous les r&eacute;glages
        d'intensit&eacute; du courant et r&eacute;gler
        l'intensit&eacute; &agrave; 1. S'il y a des effets de
        transition permis, ils seront ignor&eacute;s et
        l'intensit&eacute; ira au niveau maximale.</dd>

        <dt><b>Off</b></dt>

        <dd>Cette op&eacute;ration va mettre une lumi&egrave;re
        variable hors tension. Il va l'emporter sur tous les
        r&eacute;glages d'intensit&eacute; du courant et
        r&eacute;gler l'intensit&eacute; &agrave; 0. S'il y a des
        effets de transition permis, ils seront ignor&eacute;s et
        l'intensit&eacute; ira au niveau minimale.</dd>

        <dt><b>R&eacute;glage Intensit&eacute;</b></dt>

        <dd>Cette op&eacute;ration r&egrave;glera la lumi&egrave;re
        &agrave; une intensit&eacute; cible. Si l'interface prend
        en charge des effets de transition et s'ils sont
        configur&eacute;s, la lumi&egrave;re va faire une
        transition contr&ocirc;l&eacute;e du courant de
        r&eacute;glage pour le nouveau r&eacute;glage.</dd>
      </dl><a name="VariableLightSettings" id=
      "VariableLightSettings"></a>

      <h3>R&eacute;glages Variables de la lumi&egrave;re</h3>

      <p>Ces param&egrave;tres ajustent la mani&egrave;re dont la
      commande "intensit&eacute;" est utilis&eacute;e.</p>

      <dl>
        <dt><b>Intensit&eacute; minimum</b></dt>

        <dd>Une valeur de 0 &agrave; 100 (pour cent) qui
        d&eacute;finit la plus faible intensit&eacute; de
        lumi&egrave;re qui sera valid&eacute;e par une commande
        DIM. Une commande hors explicite va ignorer cette
        valeur.</dd>

        <dt><b>Intensit&eacute; maximale:</b></dt>

        <dd>Une valeur de 0 &agrave; 100 (pour cent) qui fixe
        l'intensit&eacute; maximale de la lumi&egrave;re qui sera
        valid&eacute;e par une commande DIM. Une commande explicite
        On va ignorer cette valeur.</dd>

        <dt><b>Temps de transition :</b></dt>

        <dd>Nombre de minutes pour passer de 0% &agrave; 100%
        d'intensit&eacute;. Une valeur de z&eacute;ro provoquera le
        passage d'une valeur minimale &agrave; une valeur maximale
        aussi rapidement que l'appareil est en mesure de le
        faire</dd>
      </dl><!--#include virtual="/Footer" -->
    </div>
  </div>
</body>
</html>
