<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01//EN" "http://www.w3.org/TR/html4/strict.dtd">
<!-- Updated by Blorec Herv&#233; le 2017-01-02 -->
<html lang="fr">
<head>
  <meta name="generator" content=
  "HTML Tidy for Mac OS X (vers 31 October 2006 - Apple Inc. build 15.17), see www.w3.org">

  <title>JMRI: Light Documentation</title>
  <meta name="author" content="Bob Jacobsen">
  <meta name="keywords" content=
  "hardware layout java model railroad JMRI CMRI decoderpro panelpro tools loconet lenz nce easydcc dcc nmra">
  <!-- Style -->
  <meta http-equiv="Content-Type" content="text/html; charset=us-ascii">
  <link rel="stylesheet" type="text/css" href="/css/default.css" media="screen">
  <link rel="stylesheet" type="text/css" href="/css/print.css" media="print">
  <link rel="icon" href="/images/jmri.ico" type="image/png">
  <link rel="home" title="Home" href="/">
	<!-- /Style -->
</head>

<body>
<!--#include virtual="/Header" -->
<div id="mBody">
    <!--#include virtual="Sidebar" -->
    <div id="mainContent">
        <!-- Page Body -->

<h1>JMRI:Documentation Lumi&#232;re</h1>

<h2>Qu'est ce que les Lumi&#232;res?</h2>

<p>Les Lumi&#232;res sont des bits de sortie num&#233;rique qui fonctionnent comme des interrupteurs marche/arr&#234;t. Les Lumi&#232;res
ont &#233;t&#233; cr&#233;&#233;es pour fournir un contr&#244;le ais&#233; des voyants du panneau de commande et l'&#233;clairage des paysages
. Les Lumi&#232;res peuvent aussi &#234;tre utilis&#233;es &#224; des fins qui n&#233;cessitent une commutation marche/arr&#234;t
.Les Lumi&#232;re peuvent &#234;tre utilis&#233;es, par exemple, pour activer un dispositif d&#233;coupleur &#233;lectromagn&#233;tique
 pour un temps pr&#233;-d&#233;termin&#233; en r&#233;ponse &#224; un bouton du panneau de contr&#244;le.
Initialement d&#233;velopp&#233; pour une utilisation avec le C/MRI, les Lumi&#232;res actuellement sont &#233;galement
mises en oeuvre sur LocoNet (Digitrax) et les syst&#232;mes Oaktree et CBUS MERG.</p>
<p>Les  Lumi&#232;res partagent les bits de sortie num&#233;rique disponibles avec les Aiguillages. Une
Lumi&#232;re ou un Aiguillage, mais pas les deux, peut commander un bit de sortie num&#233;rique sp&#233;cifique.
Puisque les Lumi&#232;res n'ont pas la structure de r&#233;trosignalisation des Aiguillages, les Lumi&#232;res ne doivent pas
&#234;tre utilis&#233;es pour commander les Aiguillages sur le r&#233;seau; seuls les Aiguillages devraient &#234;tre utilis&#233;s pour commander les commutateurs de voies (Aiguillage) . Pour des raisons historiques, les apparences des Feux de Signalisation sont d&#233;finies en utilisant les aiguillages, m&#234;me si elles peuvent &#234;tre des lumi&#232;res physiques. Alors les Aiguillages devraient &#234;tre utilis&#233;s pour r&#233;f&#233;rencer les bits de sortie num&#233;rique utilis&#233;s avec les Feux de Signalisation JMRI. Lumi&#232;re doit &#234;tre utilis&#233;e si vous avez besoin d'un m&#233;canisme simple pour commander l'&#233;clairage ou des d&#233;cors, les voyants du panneau, Ou pour d'autres t&#226;ches de commutation o&#249; les m&#233;canismes de commande de Lumi&#232;res r&#233;pondent au besoin 
</p>

<p>En option, une Lumi&#232;re peut &#234;tre contr&#244;l&#233;e de quatre fa&#231;ons: elle peut &#234;tre
contr&#244;l&#233;e par un Capteur, par un Aiguillage, par l'Horloge acc&#233;l&#233;r&#233;e JMRI, ou commut&#233;e
pendant une p&#233;riode d&#233;termin&#233;e par un Capteur. Quand une Lumi&#232;re est cr&#233;&#233;e, ou quand elle
est lue &#224; partir d'un fichier de configuration, la Lumi&#232;re est "activ&#233;e", il est mis en place
une surveillance automatique des changements d'&#233;tat de son Capteur de Commande,
de l'Aiguillage, ou une Horloge acc&#233;l&#233;r&#233;e. Lorsque le Capteur de commande, l'Aiguillage, ou de 
l'Horlogechangent d'une mani&#232;re sp&#233;cifi&#233;e par l'utilisateur, la Lumi&#232;re est allum&#233;e ou &#233;teinte. Les Lumi&#232;res peuvent &#233;galement &#234;tre contr&#244;l&#233;es par 
<a href="Logix.shtml">Logix</a>, si plus de logique complexe de contr&#244;le est n&#233;cessaire.</p>
<p>Le Tableau Lumi&#232;re contient une colonne 'Activ&#233;'. Pour qu'une Lumi&#232;re soit
d&#233;clench&#233;e par son Capteur de commande, l'Horloge acc&#233;l&#233;r&#233;e, l'Aiguillage de commande,
elle doit &#234;tre "activ&#233;e", ce qui revient &#224; cocher la case dans la colonne 'Activ&#233;e' 
. Vous pouvez d&#233;cocher cette case pour d&#233;sactiver le d&#233;clenchement temporaire d'une
Lumi&#232;re , c'est &#224; dire &#233;viter qu'elle commute lors du contr&#244;le des m&#233;canismes des feux
.</p>

 <h2>Comment configurer les Lumi&#232;res</h2>

<h3>Le Tableau Lumi&#232;res</h3>
<p>Les lumi&#232;res sont cr&#233;&#233;es et &#233;dit&#233;es dans le <a href="../../package/jmri/jmrit/beantable/LightTable.shtml">Tableau Lumi&#232;re</a>.<br>
Il contient les colonnes suivantes:</p>
	<ul>
	<li>Nom Syst&#232;me</li>
	<li>Nom Utilisateur (optionnel)</li>
	<li>&#201;tat</li>
	<li>Commentaire (optionnel, double clic pour &#233;diter)</li>
	<li>Activ&#233;e</li>
	<li>Intensit&#233;</li>
	</ul>	

<h3>Commandes du Tableau Lumi&#232;re</h3>
<p> Dans le tableau lumi&#232;res, il y a un bouton <a href="../../package/jmri/jmrit/beantable/LightAddEdit.shtml">Ajouter..</a>.</p>
<p> Dans chaque ligne du tableau il y a un bouton Modifier et un bouton Effacer</p> 

<h3>Commuter une Lumi&#232;res On et Off</h3>
<p>Les Lumi&#232;res peuvent &#234;tre activ&#233;es ou d&#233;sactiv&#233;es en cliquant sur le bouton dans la
colonne &#201;tat de la Table Lumi&#232;res. La Lumi&#232;re peut &#234;tre configur&#233;e pour suivre l'&#233;tat
d'un aiguillage , lorsque l'Aiguillage est droit, et hors tension lorsqu'il n'est
pas d&#233;vi&#233;, ou vice versa. La lumi&#232;re peut &#234;tre r&#233;gl&#233;e pour suivre l'&#233;tat d'un
D&#233;tecteur d'occupation de canton, lorsque le capteur est actif, et d&#233;sactiv&#233; quand il est inactif, ou
vice-versa. La Lumi&#232;re peut &#233;galement &#234;tre r&#233;gl&#233;e par un bouton du panneau de commande pour
suivre les horloge acc&#233;l&#233;r&#233;es  JMRI, sur une p&#233;riode de temps sp&#233;cifi&#233;e, puis s'&#233;teindre.
La Lumi&#232;re peut &#233;galement &#234;tre command&#233;e &#224; partir d'un
<a href="Logix.shtml">Logix</a>,
comme l'action d'une de ses
conditions. Si vous avez besoin d'une logique plus puissante pour contr&#244;ler votre lumi&#232;re, consid&#233;rez
l'aide d'un <a href="Logix.shtml">Logix</a>.</p>

<p>Notez que activ&#233;e/d&#233;sactiv&#233;e s'applique uniquement &#224; un m&#233;canisme de commande automatis&#233; de la Lumi&#232;re.
 Un Etat "d&#233;sactiv&#233;" n'emp&#234;chera pas une Lumi&#232;re
d'&#234;tre activ&#233;e ou d&#233;sactiv&#233;e en utilisant le bouton dans le Tableau Lumi&#232;re ou en 
&#233;tant contr&#244;l&#233;e par un automate Logix.</p>
   
<h3>Sauvegarde Lumi&#232;res sur disque </h3>

<p>Les Lumi&#232;res sont enregistr&#233;es dans votre fichier de configuration de r&#233;seau, avec les aiguillages,
capteurs, les T&#234;tes de signal, etc Pour stocker ces informations sur le disque, utilisez   <b>
Enregistrer Configuration ...</b>  dans le  <b>fichier</b>  de menu en haut du Tableau Lumi&#232;res
(ou d'autres tableau &#224; partir du menu Outils), ou s&#233;lectionnez  <b>Enregistrer Panneau...</b>  
dans le menu  <b>Panneau</b> . Notez que l'&#233;tat activ&#233;/d&#233;sactiv&#233; de chaque Lumi&#232;re
n'est pas enregistr&#233; dans le fichier de configuration. Lorsque les Lumi&#232;res sont charg&#233;es &#224; partir d'un
fichier de configuration, elles sont tous activ&#233;es.

<a name="addLight"></a><h3>Ajout d'un Nouvelle Lumi&#232;re</h3>

<p>Pour ajouter une nouvelle Lumi&#232;re, suivez cette proc&#233;dure:</p>
<ol>
	<li>Cliquez <b> Tableau Lumi&#232;res</b> dans le menu <b>Outils</b> pour faire appara&#238;tre
	le Tableau Lumi&#232;re, et cliquez sur le bouton  <b>Ajouter ...</b> au bas de la
	table pour faire appara&#238;tre la fen&#234;tre Ajouter/Modifier Lumi&#232;re.
	</li>
	<li>Entrez un nom syst&#232;me, selon la convention JMRI. La premi&#232;re
	lettre d&#233;signe le mat&#233;riel de votre syst&#232;me ('L' pour loconet, "C" pour C/MRI,
	etc), et la deuxi&#232;me lettre doit &#234;tre 'L' pour la lumi&#232;re. Elles sont suivies par
	un nombre qui donne l'adresse mat&#233;rielle du bit de sortie num&#233;rique
	r&#233;f&#233;renc&#233;. Exemples d'adresses valides du syst&#232;me sont: CL1004, et LL401,
	en supposant que vous ayiez le mat&#233;riel pour les bits sortie num&#233;rique adress&#233;s.
	</li>
	<li>Entrez un nom utilisateur. Toute cha&#238;ne de caract&#232;res qui est diff&#233;rente
	du nom utilisateur d'autres Lumi&#232;res sera accept&#233;e, mais il est
	sage d'utiliser une cha&#238;ne qui d&#233;crit l'utilisation pr&#233;vue de la Lumi&#232;re.
	</li>
	<li>S&#233;lectionnez le type de commande &#224; partir des options dans le menu contextuel.
	Lorsque vous changez le type de commande, diff&#233;rentes options apparaissent sur les deux lignes
	ci-dessous. Les options de contr&#244;le sont examin&#233;es plus en d&#233;tail
	<a href="#lightcontrol">ci-dessous</a>.
	</li>
	<li>Entrez les informations requises pour compl&#233;ter la d&#233;finition de la commande
	dans les champs qui apparaissent. Si vous avez besoin d'entrer un nom de capteur ou un nom d'aiguillage, vous devez entrer le nom (nom  syst&#232;me ou nom utilisateur) d'un capteur ou d'un aiguillage existant.  <b>Attention</b> : si vous entrez un nom d'utilisateur, soyez prudent sur
	le changement du nom utilisateur de votre capteur ou de votre aiguillage. Un simple changement
	du nom utilisateur pourrait casser votre d&#233;finition de commande de Lumi&#232;re.
	</li>
	<li>Ensuite se trouve la zone des notes de la fen&#234;tre Ajouter/Modifier Lumi&#232;re. C'est ici qu'apparaitront
	les instructions et les messages d'erreur lorsque vous cr&#233;ez ou modifiez
	une Lumi&#232;re. Il faut toujours v&#233;rifier ce domaine pour voir si les choses se d&#233;roulent comme pr&#233;vu.
	</li>
	<li>Cliquez sur le bouton  <b>Cr&#233;er</b> situ&#233; au bas de la fen&#234;tre.
	Si tout va bien, un message indiquant "Nouvelle Lumi&#232;re ajout&#233;e ..." sera
	affich&#233; dans la zone des notes. S'il y a des probl&#232;mes avec quoi que ce soit, une erreur ou un
	message d'avertissement sera affich&#233; dans la zone des notes; vous devez alors
	corriger l'erreur et cliquez sur  <b>Cr&#233;er</b> &#224; nouveau.
	</li>
</ol>

<h3>Modification d'une Lumi&#232;re Existante</h3>
<p>Pour modifier une Lumi&#232;re existante, suivez cette proc&#233;dure:</p>
<ol>
	<li>Modifier une Lumi&#232;re existante peut &#234;tre d&#233;marr&#233; par une des deux m&#233;thodes:
	<ul>
		<li>Cliquez sur le bouton <a href="../../package/jmri/jmrit/beantable/LightTable.shtml"> Tableau 			Lumi&#232;re</a></li>
		<li>Entrez le nom syst&#232;me de la Lumi&#232;re &#224; modifier dans <a href="../../package/jmri/jmrit/beantable/LightAddEdit.shtml">le volet Ajouter/Modifier Lumi&#232;re</a>
		et cliquez sur le bouton  <b>Modifier</b> Lumi&#232;re au
		bas du volet. Ce doit &#234;tre le m&#234;me
		que le nom syst&#232;me montr&#233; dans le Tableau lumi&#232;re.</li>
	</ul>


	Les boutons <b>Cr&#233;er</b> et <b>Modifier</b> au bas du panneau Ajouter/Editer Lumi&#232;re 
 	vont changer pour <b>Mise &#224; jour</b> et <b>Annuler</b> .</li>
	<li>Effectuez les modifications ou les ajouts que vous avez besoin &#224; l'information dans
	la bo&#238;te de dialogue. Notez que le nom syst&#232;me de la Lumi&#232;re &#233;dit&#233;e ne peut pas 		&#234;tre chang&#233;, mais le nom utilisateur peut &#234;tre chang&#233;. Les autres &#233;l&#233;ments sont 		d&#233;crits <a href="#addLight">ci-dessus</a>.</li>
	<li>Apr&#232;s avoir modifi&#233; les informations Lumi&#232;re, cliquez sur <b>Mise &#224; jours</b> 
	pour changer la lumi&#232;re s&#233;lectionn&#233;e. Si tout va bien, un
	message indiquant "Lumi&#232;re mise &#224; jour ..." sera affich&#233; dans la zone des notes
 	S'il y un probl&#232;me, un message d'avertissement ou d'erreur sera
	affich&#233; dans la zone des notes, et la mise &#224; jour sera arr&#234;t&#233;e pour que vous
	corrigiez l'erreur et cliquez sur  <b>Mise &#224; jours</b> &#224; nouveau.</li>
	<li>Cliquez <b>Annuler</b> pour quitter le mode &#233;dition sans changer la Lumi&#232;re
	s&#233;lectionn&#233;e. Si la fen&#234;tre ajouter/modifier Lumi&#232;re est rejet&#233;e (ferm&#233;e)
	alors que dans le mode &#233;dition,  <b>Annuler</b> est automatiquement s&#233;lectionn&#233;, et aucune
	modification ne sera apport&#233;e &#224; la Lumi&#232;re s&#233;lectionn&#233;e.</li>
	
	<li>apr&#232;s avoir modifi&#233; les informations de Lumi&#232;re, cliquez  <b>Mise &#224; jour</b> pour 	changer la lumi&#232;re s&#233;lectionn&#233;e. Si tout va bien, un
	message indiquant "lumi&#232;re mise &#224; jour ..." sera affich&#233; dans la zone des notes.
 	S'il y a un probl&#232;me, une erreur ou un message d'avertissement sera
	affich&#233; dans la zone des notes, et la mise &#224; jour sera arr&#234;t&#233;e pour vous permettre de
	corriger l'erreur et cliquez sur  <b>Mise &#224; jours</b> &#224; nouveau.</li>
	<li>Cliquez  <b>Annuler</b> pour quitter le mode &#233;dition sans changer la
	Lumi&#232;re s&#233;lectionn&#233;e. Si la fen&#234;tre de lumi&#232;re ajouter/modifier est rejet&#233;e 	(ferm&#233;e)
	alors que dans le mode &#233;dition,  <b>Annuler</b> est automatiquement s&#233;lectionn&#233;, et aucune
	modification n'est apport&#233;e &#224; la Lumi&#232;re s&#233;lectionn&#233;e.</li>
</ol>

<a name="lightcontrol"></a><h3>Options  de Commande Automatis&#233;e des Lumi&#232;res</h3>

Le fonctionnement d'une lumi&#232;re peut &#234;tre command&#233;e par les moyens suivants:
	<ul>
	<li><b>Par Capteur</b> - La Lumi&#232;re sera allum&#233;e lorsque le Capteur
	change d'actif ou d'inactif, selon le choix fait dans le
	"Sens pour ON" du menu contextuel, et il sera &#233;teint, lorsque le capteur
	inverse l'&#233;tat. Sp&#233;cifiez le capteur en saisissant son nom
	(nom syst&#232;me ou nom utilisateur) dans le champ "Nom de Capteur". Cette option a
	un certain nombre d'utilisations, y compris l'&#233;tablissement d'une lumi&#232;re du tableau de commande 		pour suivre l'occupation des cantons
. 	C'est utile, par exemple, pour suivre la position du train dans la surveillance d'une coulisse.
	</li>
	<li> <b>Par l'Horloge Rapide</b> - La Lumi&#232;re sera allum&#233;e quand l'horloge
 	atteint l'heure indiqu&#233;e dans le "Time On" et sera d&#233;sactiv&#233;e lorsque
	l'horloge rapide atteint le temps entr&#233; dans "Time Off". Les temps sont
	entr&#233;s dans le format "hh: mm" , o&#249; "hh" est heures et "mm" est minutes d'une horloge	
	24 heures. Une utilisation de cette option est d'activer et de d&#233;sactiver l'&#233;clairage des paysages,
	les lumi&#232;res des rues, lumi&#232;res des maison, etc pour simuler le temps de passage &#224; la nuit sur
	le r&#233;seau.
	</li>
 	<li><b>Par &#201;tat d'Aiguillage</b> - La Lumi&#232;re sera allum&#233;e quand l'aiguillage passe de 		droit &#224; d&#233;vi&#233;, selon le choix fait dans le
	"Etat pour ON" du menu contextuel, et il sera &#233;teint, quand l'aiguillage
	inverse son &#233;tat. Sp&#233;cifiez l'aiguillage en saisissant son nom
	(nom syst&#232;me ou nom utilisateur) dans le champ "Nom de l'Aiguillage". Cette option peut
	&#234;tre utilis&#233;e pour allumer une lumi&#232;re sur le tableau de commande pour suivre l'&#233;tat d'un 		aiguillage.
	C'est utile, par exemple, pour surveiller l'&#233;tat des aiguillages cach&#233;s.
	</li>
	<li><b>Par Chronom&#233;trage ON</b> - La Lumi&#232;re sera allum&#233;e lors du changement du capteur 		d&#233;clencheur actif, et il sera &#233;teint, quand le temps pr&#233;cis&#233;
 	se sera &#233;coul&#233;. Sp&#233;cifiez le capteur d&#233;clencheur en saisissant son nom
	(nom du syst&#232;me ou nom d'utilisateur) dans le champ "Nom du capteur de d&#233;clenchement. Entrez 
	le temps d'allumage de la Lumi&#232;re  (en millisecondes) dans la "dur&#233;e ON"
	dans le champs . Cette option a un certain nombre d'utilisations, ell a &#233;t&#233; initialement
	con&#231;ue pour enclenchez un d&#233;coupleur &#233;lectromagn&#233;tique en r&#233;ponse &#224; un bouton
	poussoir du panneau de contr&#244;le, mais il peut &#233;galement &#234;tre utilis&#233; pour d'autres types
	d'animation sur le r&#233;seau, par exemple, pour commander la sonnerie d'une cloche de passage &#224;
	niveau quand un train entre dans le canton.
	</li>
</ul>
	
<a name="variablelight"></a><h3>Lumi&#232;res Variables</h3>

<p>
	Une lumi&#232;re variable permet un niveau variable d'intensit&#233;s entre On et Off.
	L'utilisation typique serait pour l'&#233;clairage simulant les changements pour le
	moment de la journ&#233;e et la nuit. Seules certaines formes de lumi&#232;res ont la possibilit&#233; 		d'&#234;tre variable.
	Des exemples comprennent des dispositifs Internes et PowerLine.
	Un certain nombre d'options de configuration sont disponibles pour les lumi&#232;res variables
     <a href="#VariableLightSettings">ci-dessous</a>.</p>
<p>
	Une lumi&#232;re variable est ajust&#233;e par un r&#233;glage d'intensit&#233;.
	La gamme de l'intensit&#233; est de 0,00 pour Off &#224; 1,00 qui est On complet.
 	L'entr&#233;e utilisateur pour l'intensit&#233; sera soit l'utilisation de la valeur avec virgule
 	ou la valeur de pourcentage de 0% &#224; 100%.</p>
<p>
	Selon le mat&#233;riel utilis&#233;, certaines lumi&#232;res variables feront un
	ajustement d'initialisation lors du passage du mode simple mode on/off
	pour l'utilisation des param&#232;tres d'intensit&#233;.
	Sur ces appareils ce ne sera pas &#224; nouveau n&#233;cessaire aussi longtemps que  <b>uniquement</b> 
	les commandes de r&#233;glage d'intensit&#233; sont utilis&#233;es.
	Un m&#233;lange sur les commande marche/arr&#234;t peut exiger que l'initialisation se produise &#224; 	n
	nouveau.</p>
<p>
	Une lumi&#232;re variable a trois types d'op&#233;rateurs:
	<dl>
		<dt> <b>On</b> </dt>
		<dd>
			Cette op&#233;ration va enclencher une lumi&#232;re variable.
            	Elle va l'emporter sur tous les r&#233;glages d'intensit&#233; du courant et r&#233;gler 
			l'intensit&#233; &#224; 1.
            	 S'il y a des effets de transition permis, ils seront ignor&#233;s
             	et l'intensit&#233; ira au niveau maximale.
		</dd>
		<dt> <b>Off</b> </dt>
		<dd>
			Cette op&#233;ration va mettre une lumi&#232;re variable hors tension.
            	Elle va l'emporter sur tous les r&#233;glages d'intensit&#233; du courant et r&#233;gler 
		l'intensit&#233; &#224; 0.
             	S'il y a des effets de transition permis, ils seront ignor&#233;s
             	et l'intensit&#233; ira au niveau minimale.
		</dd>
        <dt> <b>R&#233;glage Intensit&#233;</b> </dt>
		<dd>
		Cette op&#233;ration r&#232;glera la lumi&#232;re &#224; une intensit&#233; cible. Si l'interface 
		prend en charge des effets de transition et s'ils sont configur&#233;s, la lumi&#232;re va faire une 
		transition contr&#244;l&#233;e du courant de r&#233;glage pour le nouveau r&#233;glage.
		</dd>    
	</dl>

	<a name="VariableLightSettings"></a><h3>R&#233;glages Variables de la lumi&#232;re</h3>
	<p>
	Ces param&#232;tres ajustent la mani&#232;re dont la commande "intensit&#233;" est utilis&#233;e.
	<dl>
		<dt> <b>Intensit&#233;  minimum </b> </dt>
		<dd>
			Une valeur de 0 &#224; 100 (pour cent) qui d&#233;finit la plus faible intensit&#233; de lumi&#232;re
			qui sera valid&#233;e par une commande dim
			Une commande hors explicite va ignorer cette valeur.
		</dd>

		<dt> <b>Intensit&#233; maximale:</b> </dt>
		<dd>
			Une valeur de 0 &#224; 100 (pour cent) qui fixe l'intensit&#233; maximale de la lumi&#232;re qui
			sera valid&#233;e par une commande dim
			Une commande explicite On va ignorer cette valeur.
		</dd>

		<dt> <b>Temps de transition :</b> </dt>
		<dd>
			Nombre de minutes pour passer de 0% &#224; 100% d'intensit&#233;.
			Une valeur de z&#233;ro provoquera le passage d'une valeur minimale &#224; une valeur maximale
			 aussi rapidement que l'appareil est en mesure de le faire
		</dd>
	</dl>

		<!--#include virtual="/Footer" -->
	</div><!-- closes #mainContent-->
</div><!-- closes #mBody-->
</body>
</html>
