<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01//EN" "http://www.w3.org/TR/html4/strict.dtd">
<!-- Updated by Blorec Herv&#233; le 2016-08-29-->
<html lang="fr">
<head>
  <title>
 	JMRI: LRoute Documentation
  </title>

  <meta name="author" content="Pete Cressman">
  <meta name="keywords"
        content="hardware layout java model railroad JMRI CMRI decoderpro panelpro tools loconet lenz nce easydcc dcc nmra">
<!-- Style -->
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<link rel="stylesheet" type="text/css" href="/css/default.css" media="screen">
<link rel="stylesheet" type="text/css" href="/css/print.css" media="print">
<link rel="icon" href="/images/jmri.ico" type="image/png">
<link rel="home" title="Home" href="/">
<!-- /Style -->
</head>

<body>
<!--#include virtual="/Header" -->
<div id="mBody">
	<!--#include virtual="Sidebar" -->
	<div id="mainContent">
		<!-- Page Body -->

<h1>JMRI: Documentation LItin&#233;raire</h1>

<h2>Que sont LItin&#233;raires</h2>
<p>LItin&#233;raires &#233;tends les capacit&#233;s d'Itin&#233;raires. Lumi&#232;res et Feux de Signalisation
sont inclus dans la collection des Aiguillages et/ou des Capteurs dont les &#233;tats peuvent &#234;tre 
d&#233;finis tous &#224; la fois et utilis&#233;s pour la commande de l'itin&#233;raire. Comme avec les Itin&#233;rairess, quand 
un LItin&#233;raire est d&#233;clench&#233;, un son peut &#234;tre jou&#233;, ou un script peut &#234;tre ex&#233;cut&#233;. 
LItin&#233;raires sont capable d'ex&#233;cuter toutes les t&#226;ches 
que peuvent faire les itin&#233;raires. Pour plus de d&#233;tails et d'exemples consulter la 
<a href="Routes.shtml">documentation principale Itin&#233;raires</a>.
</p>

<h2>Comment LItin&#233;raires difff&#232;rent de Itin&#233;raires</h2>
<p>Alors qu'un itin&#233;raire peut &#234;tre command&#233; par un maximum de trois capteurs et/ou par 
un commande d'aiguillage, un LItin&#233;raire peut utiliser n'importe quel nombre ou une combinaison de 
capteurs, d'aiguillages, de lumi&#232;res et/ou de Feux de Signalisation pour commander "l'itin&#233;raire".
</p>
<p>Les LItin&#233;raires sont mises en &#339;uvre comme un groupe de Conditionels dans un Logix. Cela 
donne une autre extension des capacit&#233;s en ce que, ce Logix peut &#234;tre 
&#233;dit&#233; dans l'&#233;diteur de Logix, o&#249; les Conditions peuvent &#234;tre modifi&#233;es ou cr&#233;&#233;es 
pour pr&#233;former d'autres t&#226;ches.
Quand un LItin&#233;raire est cr&#233;&#233;, ou quand il est lu &#224; partir d'un
fichier de configuration, le LItin&#233;raire est "activ&#233;", il est mis en place
pour surveiller automatiquement les changements des &#233;tat de ses entit&#233;s de commande. Lorsque
ces entit&#233;s changents de la mani&#232;re 
sp&#233;cifi&#233;e par l'utilisateur, l'LItin&#233;raire est 'd&#233;clench&#233;' et les
actions s&#233;lectionn&#233;es par l'utilisateur sont prises - Et si 
sp&#233;cifi&#233;, un son est jou&#233; ou un script est ex&#233;cut&#233;.
</p>
<p> Le Tableau LItin&#233;raire contient une colonne 'Activ&#233;'. Pour qu'un LItin&#233;raire soit
d&#233;clench&#233; par ses entit&#233;s de commande,
il doit &#234;tre "activ&#233;". Pour cela, sa case &#224; cocher dans la colonne 'Activ&#233;' 
doit &#234;tre coch&#233;e. Cette case &#224; cocher active/d&#233;sactive la mise en &#339;uvre du Logix qui prends en charge
l'LItin&#233;raire.</p>

<h2>Comment d&#233;marrer pour ajouter ou modifier des LItin&#233;raires:</h2>

<p>D'abord assurez-vous que les Tableaux pour les Capteurs, les Aiguillages, les Lumi&#232;res et/ou
Feux de Signalisation contiennent toutes les entit&#233;s 
impliqu&#233;es dans le LItin&#233;raire &#224; d&#233;finir. Ensuite, s&#233;lectionnez <b>le Tableau LItin&#233;raire</b> 
&#224; partir du menu <b>Outils</b>  
et cliquez sur <b>Ajouter ...</b> au bas du Tableau pour
faire appara&#238;tre la fen&#234;tre Ajouter/Modifier LItin&#233;raire.</p>

	<a name="addroute" id="addroute"></a>
	<h3>Pour ajouter un Nouvel LItin&#233;raire:</h3>

<ol>
	<li>Entrez un nom syst&#232;me, tels que "RTX100". tout
        nom court peut &#234;tre utilis&#233; &#224; condition qu'il soit diff&#233;rent des nom syst&#232;me
        des autres LItin&#233;raires .<br>
		Par convention, les noms commencent g&#233;n&#233;ralement par les lettres "RTX" pour un
        LItin&#233;raire.
	</li>
	<li>Entrez un nom utilisateur. Toute cha&#238;ne de caract&#232;res qui est diff&#233;rente
        du nom utilisateur des autres LItin&#233;raires est accept&#233;e, mais il est
        sage d'utiliser une cha&#238;ne qui d&#233;crit l'utilisation pr&#233;vue de l'LItin&#233;raire.
	</li>
	<li>Notez les quatre onglets sous la barre de menu. S&#233;lectionnez l'onglet &#233;tiquet&#233;
        <b>Actions ( sortie )</b>. Celui-ci affiche un tableau avec tous les
        Capteurs,les Aiguillages, les Lumi&#232;res et/ou Feux de Signalisation que l'utilisateur a d&#233;fini
        dans leurs tableaux respectifs.
	</li>
	<li>S&#233;lectionnez les Entit&#233;s devant &#234;tre incluses pour les actions &#224; prendre dans le
         LItin&#233;raire de la liste en cliquant sur la 
			case dans la colonne <b>Inclure</b>. Pour chaque &#233;l&#233;ment inclus,
         utilisez la liste d&#233;roulante dans la colonne <b>D&#233;terminer Action</b> pour s&#233;lectionner 
			les mesures qui devraient &#234;tre prises pour l'entit&#233;.. Par exemple,
         un aiguillage inclut peut &#234;tre "R&#233;gl&#233; Direct", "R&#233;gl&#233; D&#233;vi&#233;" ou
         "Changements" et un capteur inclut
         peut &#234;tre "R&#233;gl&#233; Actif", "R&#233;gl&#233; Inactif" ou "Bascule"
         lorsque le LItin&#233;raire est "Configur&#233;" - de m&#234;me pour les feux. un
         Feux de Signalisation inclus peut &#234;tre r&#233;gl&#233; &#224; l'une quelconque
         de ses "apparences". Ne vous inqui&#233;tez pas si tout n'est pas
         parfait. Il est facile de modifier ces informations ult&#233;rieurement.
	</li>
	<li>
		Notez que l'onglet "Actions (sortie) "vous permet d'afficher
         "Toutes" les entit&#233;s ou seulement celles "incluses". 
			C'est seulement pour votre convenance pour v&#233;rifier que toutes les entit&#233;s d&#233;sir&#233;es
          ont &#233;t&#233; inscrites; elle n'affecte pas l'entr&#233;e des
         informations.
	</li>
	<li>
         <p>Ensuite s&#233;lectionnez l'onglet intitul&#233;
         <b>D&#233;clencheurs/Commandes (entr&#233;e)</b>. Celui-ci affiche &#233;galement un tableau avec tous les
         Capteurs, Aiguillages, Lumi&#232;res et/ou Feux de Signalisation que l'utilisateur a d&#233;fini
         dans leurs tableaux respectifs.   
	<li>S&#233;lectionnez l'entit&#233; devant &#234;tre incluse pour la commande (par ex:D&#233;clencheur) du
			LItin&#233;raire de la liste en cliquant sur la 
			case dans la colonne <b>Inclure</b>. Pour chaque &#233;l&#233;ment inclus, 
			utilisez la case dans la colonne <b>&#201;tat du d&#233;clencheur</b> dans la liste d&#233;roulante pour s&#233;lectionner 
			l'&#233;tat qui doit d&#233;clencher l'entit&#233;. Par exemple, 
			un aiguillage inclus peut &#234;tre r&#233;gl&#233; pour d&#233;clencher "Sur Direct", "Sur D&#233;vi&#233;" 
			ou "sur le Changement ". Elle permettra d'&#233;viter le d&#233;clenchement lorsque l'aiguillage est d&#233;vi&#233; si 
			"V&#233;to lorsque D&#233;vi&#233;" est s&#233;lectionn&#233; ou emp&#234;cher le d&#233;clenchement lorsqu'il est droit, si
			"V&#233;to lorsque Direct" est s&#233;lectionn&#233;. Les s&#233;lections sont similaires pour un Capteur inclus 
			ou une Lumi&#232;re. Un Feu de Signalisation inclus a le choix de "On" pour chacune 
			de ses apparences et des choix de "v&#233;to lorsque" pour chaque apparence.
	</li>
    <li>Cet onglet a &#233;galement des boutons radio "Tout" et "inclus" qui op&#232;rent
		d'une mani&#232;re semblable &#224; l'onglet pr&#233;c&#233;dent.
	</li>
    <li>Ensuite, s&#233;lectionnez l'onglet &#233;tiquet&#233; <b>Alignement/Verrouillage/ etc.</b> .
	</li>
	<li>Si vous voulez que LItin&#233;raire d&#233;clenche un son quand se il d&#233;clenche,
        entrez le nom de fichier d'un fichier son dans la boite texte suivante "Jouer fichier Son".
        En cliquant <b>D&#233;terminer</b> fera appara&#238;tre un dialogue de s&#233;lection de fichiers
        pour aider &#224; localiser le fichier. Une fois le fichier localis&#233;, cliquez
        sur son nom dans la bo&#238;te de dialogue qui va le copier, compl&#233;tez avec le chemin, dans
        la zone de texte.
	</li>
	<li>
		De m&#234;me, si vous voulez un script &#224; ex&#233;cuter lorsque le LItin&#233;raire
		d&#233;clenche, entrez son nom de fichier dans la bo&#238;te de texte intitul&#233;e "Ex&#233;cuter le script". Le
		bouton <b>Valider</b>  peut &#234;tre utilis&#233; comme ci-dessus pour aider &#224; la saisie
		des informations du fichier script.
		</li>
  		<li>
  		V&#233;rification des boites &#224; cochez <b>D&#233;finir verrouillages</b> qui verrouille les aiguillages
		inclus &#224; partir de l'onglet "Actions (sortie)" lorsque les entit&#233;s depuis
		"D&#233;clencheurs/Commandes (entr&#233;e)" d&#233;clenchent. Lorsque ces entit&#233;s ne sont plus
		pour d&#233;terminer en &#233;tat de d&#233;clenchement, les aiguillages ci-dessus sont d&#233;verrouill&#233;s.
        Pour plus d'informations sur les verrrouillages d'aiguillage, voir
		<a href="../../package/jmri/jmrit/beantable/RouteAddEdit.shtml">aiguillage fonction de verrouillage</a>.
 	</li>
 	<li>
  		Le tableau de l'onglet "Alignement/Verrouillages/etc." r&#233;pertorie tous les capteurs
		d&#233;finis dans le Tableau Capteur. Un capteur (ou capteurs) 
		peut &#234;tre choisi pour devenir actif lorsque les actions des 
		entit&#233;s incluses &#224; partir de l'onglet "Actions (sortie)" sont termin&#233;es. Vous 
		pouvez choisir d'indiquer l'"alignement" des Capteurs, Aiguillages, les Lumi&#232;res et/ou 
		Feux de Signalisation en groupes s&#233;par&#233;s ou pour tous ensembles. Si les actions 
		de groupe sont achev&#233;es par des moyens autres que le d&#233;clencheur LItin&#233;raire, le 
		capteur indiquera toujours "alignement".

  		<li> Enfin, s&#233;lectionnez l'onglet intitul&#233; <b>LItin&#233;raire Basique</b>  et retour au premier onglet.
       	</li>
		<li>Cliquez sur le bouton <b>Ajouter LItin&#233;raire</b>  situ&#233; au
			bas de la fen&#234;tre. Si tout va bien, un message 
			indiquant "LItin&#233;raire nouveau ajout&#233; ..." sera affich&#233; dans la bo&#238;te de notes 
			en bas de l'onglet. S'il y a des probl&#232;mes avec quoi que ce soit, 
			un message d'erreur s'affichera dans la bo&#238;te de notes; vous devrez alors 
			corriger l'erreur et cliquez sur <b>Ajouter LItin&#233;raire</b>  &#224; nouveau.</li>
	</ol>
	<p>Pour sortir de l'addition d'un LItin&#233;raire, pressez le bouton<b>Cancel</b>.

<h3>Pour Modifier un LItin&#233;raire existant:</h3>

<ol>
 	<li>Modifier un LItin&#233;raire existant peut &#234;tre lancer selon les deux fa&#231;ons suivantes:
		<ul>
		<li>Cliquez sur un bouton <b>Modifier</b>  LItin&#233;raire dans le tableau LItin&#233;raire.</li>
		<li>Entrez le nom  syst&#232;me de l'LItin&#233;raire &#224; modifier dans 
			la fen&#234;tre Ajouter/Editer LItin&#233;raire et cliquez sur le bouton <b>Modifier LItin&#233;raire</b> 
			situ&#233; au bas de la fen&#234;tre Ajouter/Modifier LItin&#233;raire. Ce doit &#234;tre le m&#234;me 
			que le nom syst&#232;me indiqu&#233; dans le tableau LItin&#233;raire.</li>
		</ul>
	Les boutons <b>Ajouter</b> et <b>Modifier</b> dans 
	la fen&#234;tre Ajouter/Modifier LItin&#233;raire vont changer en <b>Supprimer</b>, 
	<b>Mise &#224; Jour</b> et <b>Annuler</b>.</li>
	<li>Effectuez les modifications ou les ajouts que vous devez &#224; l'information dans
	la bo&#238;te de dialogue. Notez que le nom syst&#232;me de l'LItin&#233;raire &#233;dit&#233; ne peut pas &#234;tre 
	chang&#233;, mais le nom utilisateur peut &#234;tre chang&#233;. Les autres &#233;l&#233;ments sont d&#233;crits 
	<a href="#addroute">ci-dessus</a>.</li>
	<li> Apr&#232;s avoir modifi&#233; les informations LItin&#233;raire, cliquez sur 
	<b>Mise &#224; Jour</b>  pour changer le LItin&#233;raire s&#233;lectionn&#233;. Si tout va bien, un
	message indiquant "LRoute updated.." sera affich&#233; dans la bo&#238;te de notes 
	en bas de la fen&#234;tre. S'il y a un probl&#232;me, un message d'erreur 
	s'affiche dans la bo&#238;te de notes, et l'actualisation est arr&#234;t&#233;e 
	pour vous permettre de corriger l'erreur et cliquez sur <b>Mise &#224; Jour</b> &#224; nouveau.</li>
	<li>Cliquez <b>Annuler</b> pour quitter le mode &#233;dition sans changer le 
	LItin&#233;raire s&#233;lectionn&#233;. Si la fen&#234;tre Ajouter/Modifier LItin&#233;raire est rejet&#233;e (ferm&#233;e) 
	alors que dans le mode &#233;dition, <b>Annuler</b> est automatiquement s&#233;lectionn&#233;, et aucune
	modification n'est apport&#233;e au LItin&#233;raire s&#233;lectionn&#233;.</li>
</ol>

<p>Pour supprimer le LItin&#233;raire, appuyez sur le bouton <b>Supprimer</b> .

<h3>Pour enregistrer LItin&#233;raires sur le Disque:</h3>

<p>Les LItin&#233;raires sont enregistr&#233;s dans votre 
fichier de configuration de r&#233;seau, avec les aiguillages, les capteurs, les Feux de Signalisation, 
les lumi&#232;res, etc. Pour stocker ces informations sur le disque, utilisez <b>Stocker 
Configuration...</b> dans le menu <b>fichier</b> en haut du Tableau LItin&#233;raire 
(ou d'autres tableaux &#224; partir du menu Outils), ou s&#233;lectionnez <b>Stocker Panneau ...</b>
 dans le menu <b>Panneau</b>. Notez que l'&#233;tat activ&#233;/d&#233;sactiv&#233; de chaque LItin&#233;raire 
n'est pas enregistr&#233; dans le fichier de configuration. Lorsque les LItin&#233;raires sont charg&#233;s &#224; partir 
du fichier de configuration, ils sont tous activ&#233;s.

<a name="sensorlogic"></a><h3>Commander des LItin&#233;raires depuis des Entit&#233;s de Commande/D&#233;clenchement</h3>

Le fonctionnement d'un LItin&#233;raire peut &#234;tre command&#233; par de nombreux moyens: 
des capteurs reli&#233;s &#224; des d&#233;tecteurs d'occupation ou 
des commutateurs sur le r&#233;seau, ou les feux dans le cas du C/MRI. M&#234;me 
les apparences des Feux de signalisation peuvent commander l'itin&#233;raire. Les capteurs et les aiguillages 
peuvent &#234;tre des entit&#233;s r&#233;elles ou internes.
<p>
Par exemple, par d&#233;faut lorsque l'un 
des capteurs inclus passe &#224; l'&#233;tat actif, le LItin&#233;raire est &#233;tabli.
Cela pourrait &#234;tre utilis&#233; pour d&#233;finir un LItin&#233;raire quand un canton est devenu occup&#233;, 
ou quand un bouton a &#233;t&#233; pouss&#233;.
<p>
Chaque capteur commande a un "mode" 
qui lui est associ&#233;, qui peut &#234;tre:

<dl>
	<dt>"Sur Actif"</dt>
	<dd> La m&#233;thode par d&#233;faut, le LItin&#233;raire est d&#233;clench&#233; lorsque
	le capteur passe actif, par exemple "D&#233;vi&#233; aiguillage 12 lorsque le capteur 12
	devient actif "</dd>

	<dt>"Sur Inactif"</dt>
	<dd> Le LItin&#233;raire est d&#233;clench&#233; lorsque le capteur passe
	inactif. Par exemple, en utilisant le LItin&#233;raire ci-dessus, plus une seconde LItin&#233;raire
	"aiguillage 12 D&#233;vi&#233; lorsque le capteur 12 devient Inactif" aura aiguillage 12
	suivi d'un interrupteur du TCO reli&#233; au capteur 12, comme il est retourn&#233; d'avant
	en arri&#232;re.</dd>

	<dt>"Sur Changement"</dt>
	<dd> LItin&#233;raire est d&#233;clench&#233; lorsque le capteur d'&#233;tat
	change, soit d'actif &#224; inactif ou inactif &#224; actif.</dd>

	<dt>"V&#233;to lorsque Active"</dt>
	<dd> Si ce capteur est actif,
	le LItin&#233;raire ne d&#233;clenchera pas, peu importe ce que stipule la commande d'autres
	entit&#233;s pour le changement. Cela a plusieurs utilisations, par exemple pour emp&#234;cher de d&#233;vi&#233;
	un aiguillage pendant le passage d'un train, lorsque le canton est montr&#233; occup&#233;</dd>

	<dt>"V&#233;to Lorsque inactif"</dt><dd> Comme v&#233;to actif, mais la logique est
	invers&#233;e.</dd>
</dl>

<p>Semblable &#224; des capteurs de commande indiqu&#233;s ci-dessus, un aiguillage 
de commande a un "mode" qui lui est associ&#233;, qui peut &#234;tre:
<dl>
<dt>"Sur Direct"</dt><dd> La m&#233;thode par d&#233;faut, le LItin&#233;raire est d&#233;clench&#233; lorsque
l'aiguillage passe &#224; l'&#233;tat Direct.</dd>
<dt>"Sur D&#233;vi&#233;"</dt><dd> LItin&#233;raire est d&#233;clench&#233; lorsque l'aiguillage
passe &#224; l'&#233;tat D&#233;vi&#233;.</dd>
<dt>"Sur Changement"</dt><dd> LItin&#233;raire est d&#233;clench&#233; lorsque l'&#233;tat de l'aiguillage
change, soit de droit &#224; d&#233;vi&#233; ou de d&#233;vi&#233; &#224; droit.</dd> 
<dt>"V&#233;to lorsque Direct"</dt><dd>Si cet aiguillage est droit,
LItin&#233;raire est emp&#234;ch&#233; de se d&#233;clencher.</dd> 
<dt>"V&#233;to lorsque d&#233;vi&#233;"</dt><dd> Si cet aiguillage est d&#233;vi&#233;,
LItin&#233;raire est emp&#234;ch&#233;e de se d&#233;clencher.</dd>
</dl>

<p>De m&#234;me, les commandes Lumi&#232;re ont des "modes" qui peuvent &#234;tre:
<dl>
<dt>"Allum&#233;"</dt><dd> La m&#233;thode par d&#233;faut, LItin&#233;raire est d&#233;clench&#233; quand
la lumi&#232;re passe &#224; l'&#233;tat allum&#233;.</dd>
<dt>"Pas Allum&#233;"</dt><dd> LItin&#233;raire est d&#233;clench&#233; lorsque la lumi&#232;re
passe &#224; l'&#233;tat &#233;teint</dd>
<dt>"Sur le changement"</dt><dd> LItin&#233;raire est d&#233;clench&#233; lorsque l'&#233;tat de la lumi&#232;re
change, soit &#224; partir allum&#233; vers &#233;teint ou &#233;teint vers allum&#233; .</dd>
<dt>"V&#233;to Lorsqu'il est allum&#233;"</dt><dd> Si cette lumi&#232;re est allum&#233;e,
LItin&#233;raire est emp&#234;ch&#233; de se d&#233;clencher.</dd>
<dt>"V&#233;to lorsque &#201;teint"</dt><dd> Si cette lumi&#232;re n'est pas allum&#233;e, le
LItin&#233;raire est emp&#234;ch&#233; de se d&#233;clencher.</dd>
</dl>

<p>Pour La commande Feux de Signalisation les "modes" diff&#232;rent quelque peu de ce qui pr&#233;c&#232;de.
elle est:
<dl>
<dt>"Sur Rouge"</dt><dd> LItin&#233;raire est d&#233;clench&#233; quand le signal
passe &#224; l'apparence Rouge.</dd>
<dt>"Sur Flash Rouge"</dt><dd>LItin&#233;raire est d&#233;clench&#233; quand le signal
passe &#224; l'apparence Flash Rouge.</dd>
<dt>"Sur Jaune"</dt><dd>LItin&#233;raire est d&#233;clench&#233; quand le signal
passe &#224; l'apparence Jaune.</dd>
<dt>"Sur Flash jaune"</dt><dd>LItin&#233;raire est d&#233;clench&#233; quand le signal
passe l'apparence Flash Jaune.</dd>
<dt>"Sur Vert"</dt><dd>LItin&#233;raire est d&#233;clench&#233; quand le signal
passe &#224; l'apparence Vert.</dd>
<dt>"Sur Flash Vert "</dt><dd>LItin&#233;raire est d&#233;clench&#233; quand le signal
passe l'apparence Flash Vert.</dd>
<dt>"Sur Allum&#233;"</dt><dd>LItin&#233;raire est d&#233;clench&#233; quand le signal
passe d'&#201;teint &#224; Allum&#233;.</dd>
<dt>"Sur Tenu"</dt><dd>LItin&#233;raire est d&#233;clench&#233; quand le signal
est mis &#224; Held.</dd>
<dt>"V&#233;to Lorsque Rouge"</dt><dd> LItin&#233;raire est emp&#234;ch&#233; de se d&#233;clencher quand
le signal passe &#224; l'apparence Rouge.</dd>
<dt>"V&#233;to lorsque clignotant rouge"</dt><dd> LItin&#233;raire est emp&#234;ch&#233; de se d&#233;clencher quand
le signal passe &#224; l'apparence Flash Rouge. </dd>
<dt>"V&#233;to Quand Jaune"</dt><dd> LItin&#233;raire est emp&#234;ch&#233; de se d&#233;clencher quand
le signal passe &#224; l'apparence Jaune.</dd>
<dt>"V&#233;to lorsque Jaune clignotant"</dt><dd> LItin&#233;raire est emp&#234;ch&#233; de se d&#233;clencher quand
le signal &#224; l'apparence Flash Jaune .</dd>
<dt>"V&#233;to lorsque verte"</dt><dd> LItin&#233;raire est emp&#234;ch&#233; de se d&#233;clencher quand
le signal &#224; l'apparence Verte.</dd>
<dt>"V&#233;to lorsque Clignotant vert"</dt><dd> LItin&#233;raire est emp&#234;ch&#233; de se d&#233;clencher quand
le signal &#224; l'apparition Vert .</dd>
<dt>"V&#233;to Lorsqu'il est allum&#233;"</dt><dd> LItin&#233;raire est emp&#234;ch&#233; de se d&#233;clencher quand
le signal passe d'&#201;teint &#224; Allum&#233; .</dd>
<dt>"V&#233;to lorsque Manuel"</dt><dd> LItin&#233;raire est emp&#234;ch&#233; de se d&#233;clencher quand
le signal mis &#224; Manuel.</dd>
</dl>

<p>Notez qu'il y a ici un "et/ou" implicite. Tous les "v&#233;to" 
des capteurs, les "v&#233;to" aiguillages, les "v&#233;to" feux et les "v&#233;to" signaux  
doivent &#234;tre dans leur &#233;tat de non-v&#233;to  et qu'au moins l'une 
des entit&#233;s doit d&#233;clencher le changement 
appropri&#233;  pour le LItin&#233;raire &#224; r&#233;gler.
Un seul "v&#233;to" aiguillage, "v&#233;to" capteur," v&#233;to" de lumi&#232;re  ou l'apparition de "v&#233;to" 
signaux " permettra d'&#233;viter &#224; LItin&#233;raire d'&#234;tre d&#233;clench&#233;. 
L'expression logique d&#233;finie par LItin&#233;raire est que le "non-droit de v&#233;to 
des entit&#233;s sont relier par des OR" comme une clause et les "v&#233;to" des 
entit&#233;s sont associ&#233;es par des ET comme une clause. Les deux clauses 
sont alors rejoints par un op&#233;rateur ET.
</p>

<a name="setroutebehavior"></a><h3>D&#233;finition des Pr&#233;f&#233;rences pour Correspondre &#224; Celles des Itin&#233;raires</h3>
  
<p>Dans Itin&#233;raires, les "v&#233;to" des entit&#233;s sont passifs. C'est, bien que l'&#233;tat du "v&#233;to"
emp&#234;che l'Itin&#233;raire de d&#233;clencher, quand l'Etat du "v&#233;to"  est &#224; gauche,
il ne d&#233;clenche pas l'Itin&#233;raire. D'autre part, en g&#233;n&#233;ral une condition Logix 
a tous les &#233;tat de ses variables qui d&#233;clenchent les actions quand ils changent. Les boutons 
radio sur l'onglet "LItin&#233;raire base"<b>Route Logix Type</b> donne des option.
Si vous voulez que le LItin&#233;raire s'effectue de  mani&#232;re passive comme le fait un Itin&#233;raire, 
appuyez sur le bouton <b>Old</b>. Si vous voulez que le LItin&#233;raire d&#233;clenche ses 
actions quand tout les ""droit de v&#233;to" sont retir&#233;s, appuyez sur le bouton <b>New</b>.</p>
  
<!--#include virtual="/Footer" -->
 </div><!-- closes #mainContent-->
</div> <!-- closes #mBody-->
</body>
</html>
