<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01//EN" "http://www.w3.org/TR/html4/strict.dtd">
<!--Updated by Blorec Herv&#233; le 2013-09-24-->
<html lang="fr">
<head>

<title>JMRI: Memories</title>

<!-- Style -->
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<link rel="stylesheet" type="text/css" href="/css/default.css" media="screen">
<link rel="stylesheet" type="text/css" href="/css/print.css" media="print">
<link rel="icon" href="/images/jmri.ico" type="image/png">
<link rel="home" title="Home" href="/">
<!-- /Style -->
</head>

<body>
<!--#include virtual="/Header" -->
<div id="mBody">
    <!--#include virtual="Sidebar" -->
    <div id="mainContent">
        <!-- Page Body -->

<h1> JMRI: Documentation Variables M&#233;moires</h1>


Une variable m&#233;moire JMRI peut contenir n'importe quel type d'objet. C'est vraiment le
code utilisateur qu'il faut mettre dedans et comment les manipuler.

<h2> La Table de M&#233;moire</h2>
Le
<a href="../../package/jmri/jmrit/beantable/MemoryTable.shtml">Tableau m&#233;moire </a>
vous permet de voir quelles m&#233;moires ont &#233;t&#233; d&#233;finies, et quelle valeur
elles contiennent actuellement. Le tableau demandera au contenu de la m&#233;moire de
s'afficher lui-m&#234;me, de sorte qu'une image ou une ic&#244;ne s'affiche comme une image dans le tableau; 
la plupart des autres choses se montreront en que tant que cha&#238;ne. Vous pouvez taper une nouvelle valeur de cha&#238;ne
dans une m&#233;moire, ou 
<a href="../../package/jmri/jmrit/beantable/MemoryAddEdit.shtml"> cr&#233;er une nouvelle variable m&#233;moire </a>.

<h2>Utilisation des M&#233;moires avec Logix </h2>
Un Logix peut tester une m&#233;moire pour des contenus particuliers, et  d&#233;finir les contenus d'une
 m&#233;moire sous forme de chaine est n&#233;cessaire. Ceci vous permet d'utiliser une m&#233;moire comme un indicateur d'&#233;tat,
compteur ou n'importe quoi d'autre que vous pouvez imaginer. En raison de leur interface utilisateur, 
Logix g&#233;n&#233;ralement met seulement les valeurs de cha&#238;ne dans les variables de la m&#233;moire.

<h2> Affichage d'une M&#233;moire sur un Panneau </h2>
Le contenu d'une m&#233;moire peut &#234;tre affich&#233;e sur un 
<a href="../../package/jmri/jmrit/display/PanelEditor.shtml">Panneau</a>. Habituellement, la m&#233;moire va essayer d'afficher ses
contenus directement. Si le contenu est une ic&#244;ne, une image ou une cha&#238;ne, le contenu
seront affich&#233;s directement. Comme un cas particulier, si les contenus de la m&#233;moire sont
"nulle" (la m&#233;moire ne contient pas d'objet), une ic&#244;ne X rouge  est affich&#233;e.
Cela vous permet de voir et de positionner la m&#233;moire sur le panneau. Si
la m&#233;moire contient la cha&#238;ne de longueur nulle "", ceci est un objet, et il sera
 affich&#233; sous forme d'espace vide.
<p>
Vous pouvez personnaliser l'apparence du texte dans l'ic&#244;ne via son menu contextuel.
<p>
Vous pouvez &#233;galement d&#233;finir une s&#233;rie d'ic&#244;nes &#224; afficher &#224; la place 
du contenu propre de la m&#233;moire, si vous le souhaitez. Un exemple pour savoir comment cela est
fait, s'il vous pla&#238;t voir le 
<a href="http://jmri.org/xml/samples/MemoryIconExample.xml">fichier &#233;chantillon XML</a>. 
Utilisez la commande de votre navigateur "voir la source", ou t&#233;l&#233;charger ce fichier pour voir comment c'est fait.
Fondamentalement, le navigateur de fichiers XML a un &#233;l&#233;ment "memoryicon"  qui transporte des informations diverses
pour savoir o&#249; placer l'ic&#244;ne, si elle peut &#234;tre choisie, etc
Dans cet &#233;l&#233;ment, vous pouvez d&#233;finir des &#233;l&#233;ments "memorystate" qui
d&#233;finit ce que l'ic&#244;ne a &#224; afficher lorsque la m&#233;moire a une valeur sp&#233;cifique:
<code>
    &lt;memoryicon memory="IM20" defaulticon="resources/icons/misc/Question-black.gif"&gt;
      &lt;memorystate value="9" icon="resource:resources/icons/misc/Nixie/M9B.gif" /&gt;
      &lt;memorystate value="8" icon="resource:resources/icons/misc/Nixie/M8B.gif" /&gt;
    &lt;/memoryicon&gt;
</code>
(Cet exemple a &#233;t&#233; simplifi&#233; en omettant quelques trucs de l'&#233;l&#233;ment memoryicon)
Dans l'exemple, les deux &#233;l&#233;ments memorystate assurent que si la
m&#233;moire contient "9" ou "8", certaines images seront affich&#233;es, sinon 
une ic&#244;ne de point d'interrogation noire par d&#233;faut sera affich&#233;e.
<p>
Malheureusement, JMRI n'a pas un bon outil graphique pour la d&#233;finition des
ic&#244;nes affich&#233;es lors de l'utilisation d'une ic&#244;ne de la m&#233;moire de cette fa&#231;on. Vous devez &#233;diter le fichier XML
&#224; la main, en suivant l'un des exemples.

<!--#include virtual="/Footer" -->
 </div><!-- closes #mainContent-->
</div> <!-- closes #mBody-->
</body>
</html>
