<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01//EN" "http://www.w3.org/TR/html4/strict.dtd">
<!-- Updated by Blorec Herv&#233;  2017-01-05-->

<html lang="fr">
<head>
  <meta name="generator" content=
  "HTML Tidy for Mac OS X (vers 31 October 2006 - Apple Inc. build 15.17), see www.w3.org">

  <title>JMRI: Route Documentation</title>
  <meta name="author" content="Bob Jacobsen">
  <meta name="keywords" content=
  "hardware layout java model railroad JMRI CMRI decoderpro panelpro tools loconet lenz nce easydcc dcc nmra">
  <!-- Style -->
  <meta http-equiv="Content-Type" content="text/html; charset=us-ascii">
  <link rel="stylesheet" type="text/css" href="/css/default.css" media="screen">
  <link rel="stylesheet" type="text/css" href="/css/print.css" media="print">
  <link rel="icon" href="/images/jmri.ico" type="image/png">
  <link rel="home" title="Home" href="/">
    <!-- /Style -->
</head>

<body>
<!--#include virtual="/Header" -->
<div id="mBody">
    <!--#include virtual="Sidebar" -->
    <div id="mainContent">
        <!-- Page Body -->

<h1>JMRI: Documentation Itin&#233;raires</h1>

<h2>Que sont les Itin&#233;raires?</h2>

<p>Les Itin&#233;raires sont des collections d'appareils de voie et/ou de capteurs dont les &#233;tats peuvent &#234;tre
 d&#233;t&#233;rmin&#233;s tous &#224; la fois. Aussi, quand un Itin&#233;raire est d&#233;clench&#233;, un son peut &#234;tre jou&#233;,
ou un script peut &#234;tre ex&#233;cut&#233;. Par exemple, un Itin&#233;raire peut &#234;tre mis en place pour effacer tous les
aiguillages sur une ligne principale avec un ordinateur ou les boutons d'un panneau de contr&#244;le.
Les Itin&#233;raires peuvent &#233;galement &#234;tre mis en place pour contr&#244;ler le r&#233;glage des ensembles d'
aiguillages dans les zones de garage ou de triages. Une autre utilisation consiste &#224; fixer la disposition
des aiguillages &#224; la position par d&#233;faut lorsque l'on commence une session de fonctionnement.
Les Itin&#233;raires JMRI sont similaires aux itin&#233;raires mis en &#339;uvre dans le Digitrax Chief system
, &#224; l'exception des itin&#233;raires JMRI o&#249; vous pouvez m&#233;langer les aiguillages contr&#244;l&#233;s par des
syst&#232;mes mat&#233;riels diff&#233;rents, et peut &#233;galement mettre des capteurs, jouer un son, ou
ex&#233;cuter un script.</p>
<p>Les option d'un Itin&#233;raire peuvent &#234;tre contr&#244;l&#233;es par un maximum de trois capteurs et/ou par
un aiguillage de cocommande. Lorsqu'un Itin&#233;raire est cr&#233;&#233;, ou quand il est lu &#224; partir d'un
fichier de configuration, l'Itin&#233;raire est "activ&#233;", il est mis en place
pour surveiller automatiquement les changements d'&#233;tat de ses capteurs de contr&#244;le
et/ou de l'aiguillage de contr&#244;le. Lorsque les capteurs de contr&#244;le ou l'aiguillage change
de la mani&#232;re sp&#233;cifi&#233;e par l'utilisateur, l'Itin&#233;raire est 'set' ('d&#233;clench&#233;');
les aiguillages et les capteurs inclus sont r&#233;gl&#233;s comme indiqu&#233;, et si
sp&#233;cifi&#233;, un son est jou&#233; ou un script est ex&#233;cut&#233;.</p>
<p> le Tableau Itin&#233;raire contient une colonne "Activ&#233;". Pour un itin&#233;raire 
d&#233;clench&#233; par ses capteurs de contr&#244;le ou ses aiguillage de contr&#244;le,
elle doit &#234;tre "activ&#233;", la case dans la colonne "Activ&#233;" 
doit &#234;tre coch&#233;e. Vous pouvez d&#233;cocher cette case pour d&#233;sactiver temporairement un
itin&#233;raire, c'est &#224; dire l'emp&#234;cher de fixer ses aiguillages,
capteurs, etc quand un capteur de commande ou l'aiguillage de commande change.</p>

<h3>Le Tableau Itin&#233;raire</h3>
Les Itin&#233;raires peuvent &#234;tre vus et configur&#233;s en utilisant <a href="../../package/jmri/jmrit/beantable/RouteTable.shtml">Le Tableau 
Itin&#233;raires</a>.
Il contient les colonnes suivantes:
	<ul>
	<li>Nom Syst&#232;me</li>
	<li>Nom Utilisateur (option )</li>
	<li>Commentaire ( option, double clic pour &#233;diter )</li>
	<li>Activ&#233; ( case &#224; cocher )</li>
	<li>Verrouill&#233; ( case &#224; cocher )</li>
    </ul>

<h3>Commandes du Tableau Itin&#233;raires</h3>
<p> En bas du tableau il y a le bouton  <a href="../../package/jmri/jmrit/beantable/RouteAddEdit.shtml"><b>Ajouter...</b></a>.

<h2> Comment configurer les Itin&#233;raires:</h2>

<p> d'abord s'assurer que le <a href="../../package/jmri/jmrit/beantable/TurnoutTable.shtml">Tableau Aiguillage</a> contient tous les 
aiguillages impliqu&#233;s dans les Itin&#233;raires &#224; d&#233;finir, et que le 
<a href="../../package/jmri/jmrit/beantable/SensorTable.shtml">Tableau Capteur</a> 
contient tous les capteurs n&#233;cessaires. Ensuite, s&#233;lectionnez <b>Outils</b> -&gt; <b>Tableaux</b> -&gt; <b>Itin&#233;raires</b>, ,
et cliquez sur le bouton <b> Ajouter ...</b> au bas du tableau pour
faire appara&#238;tre la fen&#234;tre Ajouter/Modifier l'Itin&#233;raire.</p>

<a name="addroute"></a><h3> Ajouter un nouvel Itin&#233;raire</h3>

<ol>
    <li> Entrez un nom  syst&#232;me, telles que "IR100' - tout
    Nom court peut &#234;tre utilis&#233; &#224; condition qu'il soit diff&#233;rent du nom syst&#232;me
    d'autres itin&#233;raires. <br>
    Par convention, les noms syst&#232;mes commencent g&#233;n&#233;ralement par "IR" pour Internal Route
    .
    </li>
    <li> Entrez un nom utilisateur. Toute cha&#238;ne de caract&#232;res qui est diff&#233;rente
    du nom utilisateur d'autres itin&#233;raires sera accept&#233;e, mais il est
    sage d'utiliser une cha&#238;ne qui d&#233;crit l'utilisation pr&#233;vue de l'Itin&#233;raire.
    <p> Notez qu'avant la version 1.5.6 de JMRI, il y avait un bug qui
    vous a emp&#234;ch&#233; d'avoir plus d'un nom utilisateur vide. Dans les
    versions les plus r&#233;centes, vous pouvez avoir autant d'Itin&#233;raires avec des noms d'utilisateur vide
    que vous le souhaitez; ils doivent &#234;tre r&#233;f&#233;renc&#233;s via leurs noms syst&#232;me,
    bien s&#251;r. </p>
    </li>
    <li> S&#233;lectionnez les aiguillages devant &#234;tre inclus dans le nouvel
    itin&#233;raire dans la liste de tous les aiguillages d&#233;finis, en cliquant sur la
    case dans la colonne <b>Inclure</b>. Pour chaque aiguillage inclus,
    utilisez la liste d&#233;roulante dans la colonne <b>Fixer &#201;tat</b>  pour s&#233;lectionner si
    l'aiguillage inclus doit d'&#234;tre "Fix&#233; Direct", "Fix&#233; D&#233;vi&#233;" ou
    " Les deux" lorsque l'Itin&#233;raire est "Fix&#233;". Ne vous inqui&#233;tez pas si tout n'est pas
    parfait. Il est facile de modifier ces informations ult&#233;rieurement.
    <p> Notez que la fen&#234;tre  Ajouter/Modifier Itin&#233;raire vous permet d'afficher
    "Tous" les Aiguillages et Capteurs ou Les Aiguillages et Capteurs "inclus". C'est
     uniquement pour votre convenance pour v&#233;rifier que tous les aiguillages d&#233;sir&#233;s
    et/ou les capteurs ont &#233;t&#233; inclus; elle n'affecte pas les entr&#233;es
    d'informations.</p>
    </li>
    <li> De m&#234;me, s&#233;lectionnez les capteurs &#224; inclure dans le nouvel
    Itin&#233;raire dans la liste de tous les capteurs d&#233;finis, en cliquant sur le
    case dans la colonne <b>Inclure</b> . Pour chaque capteur inclus,
    utilisez la liste d&#233;roulante dans la colonne <b>Fixer &#201;tat </b>  pour s&#233;lectionner si
    ce capteur doit &#234;tre "Fix&#233; Actif", "Fix&#233; Inactif" ou "Les deux"
    lorsque l'itin&#233;raire est "fix&#233;".
    </li>
    <li> Si vous voulez que l'Itin&#233;raire joue un son lorsque il se d&#233;clenche,
    entrez le nom de fichier d'un fichier son dans la zone de texte suivante "Jouer fichier son"
    . En cliquant <b>fixer</b> pour faire appara&#238;tre une s&#233;lection de fichiers
     pour aider &#224; localiser le fichier. Une fois le fichier localis&#233;, cliquer sur
    son nom dans la bo&#238;te de dialogue le copieras, avec le chemin complet, dans
    la zone de texte.
    </li>
    <li>De m&#234;me, si vous voulez un script &#224; ex&#233;cuter lorsque l'Itin&#233;raire
    d&#233;clenche, entrez son nom de fichier dans la zone de texte sur la droite. Le bouton'
    <b>Fixer</b>  peut &#234;tre utilis&#233; comme ci-dessus pour l'aider &#224; entrer
    les informations sur le fichier script.
    </li>
    <li> Si vous voulez que le r&#233;glage de l'Itin&#233;raire soit contr&#244;l&#233;
    par une ou plusieurs capteurs d'entr&#233;e, entrez leurs noms (nom syst&#232;me ou nom utilisateur)
    et s&#233;lectionner &#224; quel genre de logique ils ob&#233;issent. Les Choix logique sont d&#233;crits dans
    <a  href="#sensorlogic">d&#233;tails ci-dessous </a>.
    <p> Lorsque vous enregistrez vos Itin&#233;raires et les restaurez en utilisant un fichier de configuration,
    le nom du capteur que vous entrez ici est utilis&#233; pour recr&#233;er l'itin&#233;raire.
    Un nom syst&#232;me sera toujours associ&#233; avec le capteur de la m&#234;me entr&#233;e.
    Un nom utilisateur peut &#234;tre d&#233;plac&#233; &#224; une autre entr&#233;e en changeant les entr&#233;es
    dans le tableau Capteur. Par exemple, "Occupation Est OS"pourrait &#234;tre
    chang&#233; depuis l'entr&#233;e du capteur LocoNet LS12 &#224; LS24 pour simplement en associant
    ce nom utilisateur avec un nom syst&#232;me diff&#233;rent, ce qui rend la rec&#226;blage du r&#233;seau
    facile. Cependant les noms utilisateurs entr&#233;s ici doivent exister, si vous changez le
    nom utilisateur du capteur de "Occupation East OS" &#224; "Occupation Orient", l'itin&#233;raire
    ne se charge pas correctement jusqu'&#224; ce que vous le modifiez pour utiliser le nouveau nom.</p>
    </li>
    <li> &#201;galement optionnel, si vous souhaitez activer
    l'Itin&#233;raire lorsqu'un aiguillage particulier change d'&#233;tat, saisissez un
    nom d'aiguillage (nom syst&#232;me ou nom utilisateur) et s&#233;lectionnez la logique &#224; laquelle il
    ob&#233;ira. Les choix de logique sont expliqu&#233;s en d&#233;tail
    <a href="#turnoutlogic"> ci-dessous </a>.
    <p> Lorsque vous enregistrez et restaurez vos Itin&#233;raires en utilisant un fichier de configuration,
    le nom de l'aiguillage que vous indiquez ici est utilis&#233; pour recr&#233;er l'itin&#233;raire.
    Un nom syst&#232;me sera toujours associ&#233; au m&#234;me aiguillage.
    Un nom utilisateur peut &#234;tre d&#233;plac&#233; vers un autre aiguillage en changeant les entr&#233;es
     aiguillage dans le tableau. Par exemple, "Fixer Voie 5" pourrait &#234;tre
    chang&#233; depour un capteur d'aiguillage  de 105 &#224;l'aiguillage 5 en associant simplement
    ce nom utilisateur avec un nom de syst&#232;me diff&#233;rent, ce qui rend le rec&#226;blage plus
    facile. Les noms utilisateurs entr&#233;s ici doivent exister cependant, si vous changez le
    nom utilisateur de l'aiguillage de partir "Track Set 5" &#224; "Set Trk 5", l'itin&#233;raire
    ne se charge pas correctement jusqu'&#224; ce que vous modifiez pour utiliser le nouveau nom.</p>
    </li>
     <li>
     L'entr&#233;e "Ajouter retard de" est normalement laiss&#233; &#224; "0". Quand un
     Itin&#233;raire commande ensembles ses aiguillages, il attend 250 millisecondes entre chaque
     commande d'aiguillage. Si ce n'est pas assez de temps entre chaque
     commande pour votre type de contr&#244;le d'aiguillage, vous pouvez augmenter
     le temps entre les commandes en ajoutant un retard (en millisecondes).</li>
    <li>Cliquez sur <b>Ajouter Itin&#233;raire</b> au
    le bas de la fen&#234;tre. Si tout va bien, un message
    indiquant "Nouvel Itin&#233;raire Ajout&#233; ..." sera affich&#233; dans la bo&#238;te de notes
    pr&#232;s du bas de la fen&#234;tre. S'il ya des probl&#232;mes avec quoi que ce soit,
    un message d'erreur s'affiche dans la bo&#238;te de notes; vous devez alors
    corriger l'erreur et cliquez sur <b>Ajouter Itin&#233;raire</b> &#224; nouveau.</li>
</ol>

<h3>Pour modifier un Itin&#233;raire existant</h3>
<ol>
    <li>Modifier un itin&#233;raire existant peut &#234;tre d&#233;marr&#233; suivant l'une des deux fa&#231;ons
    suivantes:
    <ul>
        <li>Cliquez sur <b>Modifier un Itin&#233;raire</b> dans le Tableau Itin&#233;raire.</li>
        <li> Entrez le nom  syst&#232;me de l'Itin&#233;raire &#224; &#233;diter dans la fen&#234;tre
        Ajouter/Modifier et cliquez sur le bouton <b>Modifier Itin&#233;raire</b> au
        bas de la fen&#234;tre Ajouter/modifier Itin&#233;raire. Ce doit &#234;tre le m&#234;me
        que le nom syst&#232;me indiqu&#233; dans le Tableau Itin&#233;raire. </li>
    </ul>
    Le bouton <b>Ajouter Itin&#233;raire</b> et <b>Modifier Itin&#233;raire</b>  dans la fen&#234;tre
    Ajouter/Modifier va changer pour
    <b>Mise &#224; Jour Itin&#233;raire</b> et <b>Annuler Itin&#233;raire</b>.</li>

    <li>Effectuez les modifications ou les ajouts que vous devez dans l'information dans
    la bo&#238;te de dialogue. Notez que le nom  syst&#232;me d'Itin&#233;raire &#233;dit&#233; ne peut pas &#234;tre
    chang&#233;, mais le nom utilisateur peut &#234;tre chang&#233;. Les autres &#233;l&#233;ments sont d&#233;crits
    <a href="#addroute">ci-dessus</a>.</li>

    <li> Apr&#232;s avoir modifi&#233; les informations d'Itin&#233;raire, cliquez sur <b>Mise &#224; Jour
    Itin&#233;raire</b> pour changer l'itin&#233;raire s&#233;lectionn&#233;. Si tout va bien, un
    message indiquant "Itin&#233;raire &#224; jour ..." sera affich&#233; dans les notes
    du bas de la fen&#234;tre. S'il 'y a un probl&#232;me, un message d'erreur
    sera affich&#233; dans la bo&#238;te de notes, et la mise &#224; jour est arr&#234;t&#233;e
    pour vous permettre de corriger l'erreur et cliquez sure <b>Mise &#224; Jour
    Itin&#233;raire</b> &#224; nouveau.</li>

    <li>Cliquez > <b>Annuler</b> pour quitter le mode &#233;dition sans changer l'
    itin&#233;raire s&#233;lectionn&#233;. Si la fen&#234;tre  Ajouter/Editer Itin&#233;raire est rejet&#233;e (ferm&#233;e)
    dans le mode &#233;dition, <b>Annuler</b> est automatiquement s&#233;lectionn&#233;, et aucune
    modification n'est apport&#233;e &#224; l'Itin&#233;raire s&#233;lectionn&#233;.</li>
</ol>

<h3>Configurer (d&#233;clencher) un Itin&#233;raire:</h3>

<p>Les Itin&#233;raires peuvent &#234;tre "d&#233;clench&#233;s" en cliquant sur le bouton <b>Set</b> dans la colonne d'&#201;tat
 du Tableau Itin&#233;raire. Un Itin&#233;raire peut &#233;galement &#234;tre r&#233;gl&#233; par les boutons du tableau de commande.
Si les capteurs de ces boutons sont d&#233;finis comme des capteurs de commande dans les informations de l'Itin&#233;raire
. Si une aiguillage de contr&#244;le est d&#233;fini dans les informations de l'Itin&#233;raire, d&#233;viant
ou mettant en direct l'aiguillage depuis votre r&#233;gulateur physique qui d&#233;clenchera &#233;galement l'Itin&#233;raire.
Notez que les
aiguillages de contr&#244;le peuvent &#234;tre des aiguillages r&#233;els, aiguillages fant&#244;me ou aiguillages internes
comme d&#233;crit<A  HREF="#turnoutlogic"> ci-dessous </a>. Un Itin&#233;raire peut &#233;galement &#234;tre d&#233;clench&#233;
&#224; partir d'un Logix, comme l'action d'une de ses conditions. Si vous avez besoin de 
logique plus puissante que celle fournit par l'Itin&#233;raire lui-m&#234;me, pour commander votre itin&#233;raire ,
envisager d'utiliser un <a href="Logix.shtml"> Logix </a>. </p>

<p> Notez que activ&#233;s/d&#233;sactiv&#233;s et "droit de v&#233;to" logique discut&#233; ci-dessous pour la commande des
<a href="#sensorlogic"> capteurs </a> et pour le contr&#244;le des
<a href="#turnoutlogic"> aiguillages </a> ne s'appliquent qu'aux m&#233;canisme de contr&#244;le automatis&#233;s d'un Itin&#233;raire
. Ni la logique "D&#233;sactiv&#233;e", ni "v&#233;to" permettra d'&#233;viter qu'un itin&#233;raire
soit valid&#233; (d&#233;clench&#233;) en utilisant le <b>Set</b> &#224; partir d'un bouton ou Logix. </p>

<p> Il est &#233;galement utile de noter que si un itin&#233;raire a &#233;t&#233; d&#233;clench&#233; et est en train
d'envoyer des commandes aux aiguillages de l'Itin&#233;raire est marqu&#233; comme occup&#233; jusqu'&#224; ce que cette op&#233;ration soit
achev&#233;e. Un Itin&#233;raire ne peut &#234;tre d&#233;clench&#233; &#224; nouveau alors qu'il est occup&#233;, c'est &#224; dire jusqu'&#224; ce que son
op&#233;ration en cours soit termin&#233;e.

<h3>Pour Sauvegarder les Itin&#233;raires sur le disque :</h3>

<p> Les Itin&#233;raires  sont enregistr&#233;s dans votre
fichier de configuration de r&#233;seau, avec les aiguillages, les capteurs, les t&#234;tes de signal
, les lumi&#232;res, etc. Pour stocker ces informations sur le disque, utilisez <b>Enregistrer la Configuration ...</b> 
dans le menu du <b>Fichier</b> en haut du Tableau Itin&#233;raire
 (ou d'autres tableaux &#224; partir du menu Outils), ou s&#233;lectionnez <b>Stocker Panneau ...</b>
dans le menu <b>Panneau</b>. Notez que l'&#233;tat activ&#233;/d&#233;sactiv&#233; pour chaque Itin&#233;raire
n'est pas enregistr&#233; dans le fichier de configuration. Lorsque les Itin&#233;raires sont charg&#233;s &#224; partir d'un
fichier de configuration, ils sont tous activ&#233;s.

<a name="sensorlogic"></a><h3>Le contr&#244;le des Itin&#233;raires &#224; partir de Capteurs</h3>

Le fonctionnement d'un Itin&#233;raire peut &#234;tre contr&#244;l&#233; par un maximum de trois
capteurs. Ceux-ci peuvent &#234;tre reli&#233;s &#224; des d&#233;tecteurs d'occupation ou
commutateurs sur le TCO, ou m&#234;me juste pour faire fonctionner l'itin&#233;raire
&#224; partir d'un panneau de commande sur l'ordinateur. Ces capteurs peuvent &#234;tre des capteurs r&#233;els
 ou des d&#233;tecteurs internes.
<p>
Par d&#233;faut, lorsque l'un des
capteurs d&#233;finis passe &#224; l'&#233;tat actif, l'Itin&#233;raire sera d&#233;clench&#233;.
Cela pourrait par exemple &#234;tre utilis&#233; pour d&#233;finir un Itin&#233;raire quand un canton est devenu occup&#233;,
ou quand un bouton a &#233;t&#233; pouss&#233;.
<p>
Une logique plus puissante peut aussi faire des choses comme "d&#233;finir
Itin&#233;raires pour avoir la position d'un aiguillage qui suive la position d'un
interrupteur du panneau ". Pour cela, chacun des trois capteurs a un" mode
associ&#233;, qui peut &#234;tre:
<dl>
<dt> "Sur Actif" </dt> <dd> La m&#233;thode par d&#233;faut, l'Itin&#233;raire est d&#233;clench&#233; lorsque
le capteur passe actif, par exemple "D&#233;viez l'aiguillage 12 lorsque le capteur 12 devient
actif "</dd>

<dt> "Sur inactif" </dt> <dd> L'Itin&#233;raire est d&#233;clench&#233; lorsque le capteur passe
inactif. Par exemple, en utilisant l'Itin&#233;raire ci-dessus, plus un deuxi&#232;me Itin&#233;raire
"Fermer l'aiguillage 12 lorsque le capteur 12 devient inactif" aura l'aiguillage 12
&#224; suivre un interrupteur du panneau reli&#233; au capteur 12 comme il est retourn&#233; en arri&#232;re et en avant 
etc. </dd>

<dt> "Sur le changement" </dt> <dd> L'Itin&#233;raire est d&#233;clench&#233; lorsque l'&#233;tat du capteur
change, que ce soit d'actif &#224; inactif ou inactif &#224; actif. </dd>

<dt> "V&#233;to actif" </dt> <dd> Si ce capteur est actif, les autres capteurs param&#233;tr&#233;s
"sur actif", "Sur inactif", "Le changement" seront ignor&#233;s, et un
 contr&#244;le d'aiguillage r&#233;gl&#233; "sur Direct", "sur D&#233;vi&#233;" ou "sur Changement" sera
&#233;galement ignor&#233;. Cela a plusieurs utilisations, par exemple pour emp&#234;cher de d&#233;vier un
aiguillage sous un train, lorsque le canton est montr&#233; occup&#233;. </dd>

<dt> "V&#233;to inactif" </dt> <dd> Comme veto actif, mais l'autre polarit&#233; de
la logique. </dd>

</dl>
<p> Notez qu'il y a ici un "et/ou" implicite ici. Tous les "v&#233;to"
capteur et le "v&#233;to" aiguillage, s'il y en a , doivent &#234;tre dans leur 
&#233;tat de non-droit de v&#233;to_et _ au moins un des capteurs de d&#233;clenchement ou d'un
d&#233;clenchement d'aiguillage doivent voir le changement appropri&#233; pour que l'
Itin&#233;raire soit r&#233;alis&#233;. </p>

<a name="turnoutlogic"></a><h3> Contr&#244;le d'Itin&#233;raire &#224; partir d'un Aiguillage</h3>

<p> La r&#233;alisation (d&#233;clenchement) d'un Itin&#233;raire peut &#234;tre commandl&#233; &#224; partir d'un aiguillage.
Cet aiguillage peut &#234;tre un aiguillage physique r&#233;el, un aiguillage "fant&#244;me" (un num&#233;ro d'aiguillage
 DCC sans aiguillage physique correspondant), ou aiguillage "interne". </p>
<ul>
<li> Si un aiguillage r&#233;el est utilis&#233;, l'aiguillage r&#233;el va
recevoir la commande d'activation original, puis l'
Itin&#233;raire fixera toutes les positions d'aiguillage et/ou les &#233;tats des capteur qui ont &#233;t&#233; sp&#233;cifi&#233;s
. Ceci peut &#234;tre utilis&#233; pour d&#233;finir de multiples
aiguillages pour correspondre &#224; un aiguillage r&#233;el d'origine, ou pour d&#233;finir
le retour de l'aiguillage &#224; sa position initiale (si vous ne voulez pas que 
quiconque le change), etc L'Itin&#233;raire se d&#233;clenche lorsque
l'aiguillage est fix&#233; &#224; partir de JMRI, et/ou avec certains
syst&#232;mes DCC (Digitrax LocoNet et Lenz XPressNet syst&#232;mes), il
 se d&#233;clenche quand un op&#233;rateur commande &#224; l'aiguillage
 de changer d'&#233;tat &#224; partir d'un r&#233;gulateurr de poche.
<li> Un aiguillage "fant&#244;me  est une aiguillage DCC qui n'
existent pas r&#233;ellement. Pour en utiliser un, il suffit de cr&#233;er une entr&#233;e d'aiguillage
pour un num&#233;ro d'adresse qui n'existe pas sur votre r&#233;seau.
Les op&#233;rateurs peuvent s&#233;lectionner le num&#233;ro de l'aiguillage fant&#244;me
 sur leurs r&#233;gulateur et envoyer des commandes pour provoquer la mise en place de l'Itin&#233;raire
 . Avec l'ajout de capteurs comme les v&#233;tos dans les Itin&#233;raires
 vous pouvez faire des choses comme  permettre aux op&#233;rateurs de changer les aiguillages
 (via l'Itin&#233;raire) lorsque le r&#233;partiteur a valid&#233; par un bouton un acc&#232;s local.
<li> Un "aiguillage interne" est celui qui n'existe que dans le
 logiciel JMRI, il ne correspond pas &#224; une adresse particuli&#232;re
sur la r&#233;seau, et il ne correspond en particuluer &#224; aucun
mat&#233;riel sur le r&#233;seau. Le nom  syst&#232;me des aiguillages internes
commencer par "IT", par exemple "IT201". JMRI sait qu'ils sont 
distincts du r&#233;seau et n'a donc pas &#224; envoyer de commandes au
mat&#233;riel connect&#233; lorsque l'un change . Ceux-ci peuvent &#234;tre utilis&#233;s avec des
Itin&#233;raires demandant une logique compliqu&#233;e sous-jacente.
Par exemple, une ic&#244;ne sur un panneau peut d&#233;finir un aiguillage interne,
qui &#224; son tour peut fixer l'aiguillage d'une groupe de triage entier.
 </ul>
<p> similaires aux Capteurs de commande ci-dessus, l'aiguillage de commande
a un "mode" qui lui est associ&#233;, qui peut &#234;tre:
<dl>
<dt> "Sur direct" </dt> <dd> La m&#233;thode par d&#233;faut, l'Itin&#233;raire est d&#233;clench&#233; lorsque
l'aiguillage change pour l'&#233;tat direct. </dd>
<dt> "Sur D&#233;vi&#233;" </dt> <dd> L'Itin&#233;raire est d&#233;clench&#233;e lorsque l'aiguillage
change pour l'&#233;tat d&#233;vi&#233;. </dd>
<dt> "Sur Changement" </dt> <dd> L'Itin&#233;raire est d&#233;clench&#233; lorsque l'&#233;tat de l'aiguillage
change, que ce soit de direct &#224; partir d&#233;vi&#233; ou d&#233;vi&#233; &#224; la position directe. </dd>
<dt> "V&#233;to direct" </dt> <dd> Si cette aiguillage est direct, les capteurs mis
"Sur Actif", "Sur Inactif" "Sur Changement" seront ignor&#233;s. </dd>
<dt> "Veto d&#233;vi&#233;" </dt> <dd> Si cette aiguillage est d&#233;vi&#233;, les capteurs mis en
"Sur Actif", "Sur Inactif" Le changement" seront ignor&#233;. </dd>
</dl>
<p> Un seul "v&#233;to" aiguillage ou "veto"  capteur peut emp&#234;cher l'Itin&#233;raire d'&#234;tre
d&#233;clench&#233;. Tous les "v&#233;to" des capteurs et des "v&#233;to" d'aiguillage, s'il y en a
 un, doivent &#234;tre dans leur &#233;tat non-v&#233;to_et_ au moins l'un des capteurs ou un des aiguillage de
d&#233;clenchement doit voir le Changement appropri&#233; pour que l'Itin&#233;raire soit fix&#233;
</p>

        <!--#include virtual="/Footer" -->
    </div><!-- closes #mainContent-->
  </div><!-- closes #mBody-->
</body>
</html>
