<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<!-- $Id$ -->
<!-- UpDated by Blorec Herv&#233; le 2013-10-05-->
<html lang="fr">
<head>
<meta name="generator" content=
"HTML Tidy for Mac OS X (vers 31 October 2006 - Apple Inc. build 15.17), see www.w3.org">
<title>JMRI: Sensor Documentation</title>
<meta http-equiv="Content-Type" content=
"text/html; charset=us-ascii">
<meta content="Bob Jacobsen" name="Author">
<meta http-equiv="Content-Type" content=
"text/html; charset=us-ascii">
<meta name="keywords" content=
"sensor model railroad JMRI decoderpro panelpro">
<meta http-equiv="Content-Type" content=
"text/html; charset=us-ascii">
<link rel="stylesheet" type="text/css" href="/css/default.css"
media="screen">
<link rel="stylesheet" type="text/css" href="/css/print.css" media=
"print">
<link rel="icon" href="/images/jmri.ico" type="image/png">
<link rel="home" title="Home" href="/">
</head>
<body>
&gt; &gt; <!-- Style -->
 &gt; <!-- /Style -->
<div id="container"><!--#include virtual="/Header" -->
<div id="mBody"><!--#include virtual="Sidebar" -->
<div id="mainContent"><!-- Page Body -->
<h2>JMRI:Documentation Capteur</h2>
<h3>Que sont les capteurs?</h3>
<p>Un capteur est une fa&ccedil;on pour JMRI de repr&eacute;senter
une entr&eacute;e sur le r&eacute;seau.</p>
<p>JMRI utilise un Capteur pour repr&eacute;senter l'&eacute;tat
d'un d&eacute;tecteur d'occupation du canton, ou un bouton poussoir
sur le tableau de bord, ou &agrave; peu pr&egrave;s tout ce que
vous pouvez joindre &agrave; une entr&eacute;e sur votre
syst&egrave;me DCC ou Syst&egrave;me C/MRI.</p>
<h3>Contr&ocirc;ler un Capteur</h3>
<p>G&eacute;n&eacute;ralement, vous ne contr&ocirc;lez pas
l'&eacute;tat d'un objet Capteur; JMRI, travaillant avec le
mat&eacute;riel de votre r&eacute;seau le peut.</p>
<p>Mais il y a certaines occasions o&ugrave; vous aimeriez changer
localement l'&eacute;tat d'un Capteur: Pour d&eacute;boguer une
certaine logique qui utilise le capteur comme une entr&eacute;e,
etc. Il peut &ecirc;tre tr&egrave;s pratique pour modifier
temporairement la mani&egrave;re dont un Capteur est
r&eacute;gl&eacute;, sans avoir &agrave; couper le r&eacute;seau et
appuyez sur un bouton ou de mettre une locomotive dans un
canton.</p>
<p>Par cons&eacute;quent, nous vous laissons changer localement un
Capteur via le tableau de Capteur (voir ci-dessous), ou en cliquant
sur une ic&ocirc;ne du Capteur sur un panneau (voir la <a href=
"../apps/PanelPro/PanelPro.shtml">pages PanelPro</a> pour plus
d'info sur les panneaux).</p>
<p>Le changement prend effet imm&eacute;diatement, sauf si une
minuterie anti-rebond est configur&eacute; voir ci-dessous, mais ne
dure que jusqu'&agrave; la prochaine fois que vous le changer dans
le programme, ou la prochaine fois dque l'entr&eacute;e duu
mat&eacute;riel sur le r&eacute;seau change de valeur.</p>
<h3><a name="Debounce" id="Debounce"></a> Capteur Anti-Rebonds</h3>
<p>L'installation de Capteur Antirebond est l&agrave; pour aider
&agrave; pr&eacute;venir les faux d&eacute;clenchements d'un
capteur passant dans le syst&egrave;me et d&eacute;clenchant
d'autres &eacute;v&eacute;nements dans le syst&egrave;me.<br>
Ces faux d&eacute;clenchements pourrait &ecirc;tre d&ucirc;
&agrave; un z&ocirc;ne sale de la voie ou des interf&eacute;rences
&eacute;lectriques.</p>
<p>L'installation vous permet d'assigner une dur&eacute;e en
millisecondes avant que le changement soit enregistr&eacute; avec
le reste du syst&egrave;me. Si apr&egrave;s cette p&eacute;riode
l'Etat n'a pas chang&eacute; alors l'&eacute;tat du capteur sera
retransmis sur le reste du syst&egrave;me.<br>
Toutefois, si l'&eacute;tat des capteurs est diff&eacute;rent
apr&egrave;s que la temporisation soit finie, alors le
syst&egrave;me va red&eacute;marrer le processus, cette fois
apr&egrave;s que le minuteur ait termin&eacute;, il sera
v&eacute;rifier si l'&eacute;tat du capteur est dans le m&ecirc;me
&eacute;tat qu'il &eacute;tait avant qu'il red&eacute;marre le
processus. Si ce n'est pas le cas le processus est relanc&eacute;
&agrave; nouveau jusqu'&agrave; ce que l'Etat soit le m&ecirc;me
avant et apr&egrave;s que le chronom&egrave;tre ait
&eacute;t&eacute; lanc&eacute;.</p>
<h3>Sauvegarde de configuration du capteur sur le disque</h3>
<p>Les Capteurs ont enregistr&eacute;s dans votre fichier de
configuration de r&eacute;seau, avec les aiguillages, les
lumi&egrave;res, les t&ecirc;tes de signal, etc. Pour stocker ces
informations sur le disque, utilisez <b>Stocker Configuration
...</b> dans le menu <b>Fichier</b> en haut du Tableau
Lumi&egrave;re (ou d'autres tableaux &agrave; partir du menu
Outils), ou s&eacute;lectionnez <b>Stocker Panneau...</b> dans le
menu <b>Panneau</b> . <a name="add" id="add"></a></p>
<h3><a name="add" id="add">Ajout d'un nouveau Capteur</a></h3>
<a name="add" id="add"></a>
<p>Pour cr&eacute;er un nouveau capteur, suivez cette
proc&eacute;dure:</p>
<ol>
<li style="list-style: none">Cliquez</li>
<li><a href=
"../../package/jmri/jmrit/beantable/SensorTable.shtml"><b>Tableau
Capteur</b></a> dans le menu <b>Outils</b> pour faire
appara&icirc;tre le Tableau de Capteur, et cliquez sur le bouton
<a href=
"../../package/jmri/jmrit/beantable/SensorAddEdit.shtml"><b>Ajouter
...</b></a> au bas de le Tableau pour ouvrir la fen&ecirc;tre
Ajouter/modifier Capteur.</li>
<li>Depuis la liste d&eacute;roulante <b>Syst&egrave;me</b>,
s&eacute;lectionnez le syst&egrave;me auquel le Capteur est
connect&eacute;. Dans la zone <b>Adresse mat&eacute;rielle</b>
entrez dans l' <a href=
"../doc/Technical/Names.shtml#systeminfo">adresse mat&eacute;rielle
de la connexion d'entr&eacute;e</a>
r&eacute;f&eacute;renc&eacute;e.<br>
Le format de l'adresse mat&eacute;rielle peut souvent &ecirc;tre
souvent dans le format de la "carte : canal" ou "Adresse Chassis:
Pin", vous aurez besoin pour confirmer les
sp&eacute;cificit&eacute;s de chaque syst&egrave;me en utilisant le
<a href="../doc/Technical/Names.shtml#systeminfo">lien</a>
suivant</li>
<li>Entrez un nom utilisateur. Toute cha&icirc;ne de
caract&egrave;res qui est diff&eacute;rent du nom utilisateur
d'autres capteurs sera accept&eacute;e, mais il est sage d'utiliser
une cha&icirc;ne qui d&eacute;crit l'utilisation pr&eacute;vue du
Capteur. Vous pouvez laisser ce champ vide si vous le
souhaitez.</li>
<li>Si vous souhaitez ajouter un certain nombre de capteurs
&agrave; la fois, cliquez sur la case &agrave; cocher <b>Ajouter
une plage</b> et puis dans la case <b>Nombre &agrave; ajouter</b>
entrez le nombre de capteurs que vous souhaitez ajouter. Si vous
avez entr&eacute; un nom utilisateur , alors il sera ajout&eacute;
avec un certain num&eacute;ro pour s'assurer que chaque nom
utilisateur est unique. Si une adresse mat&eacute;rielle qui existe
d&eacute;j&agrave; dans le canton qui est en cours d' ajout, alors
le syst&egrave;me va sauter cette adresse et se poursuivra.</li>
<li>Cliquez sur le bouton <b>OK</b> situ&eacute; au bas de la
fen&ecirc;tre. Si tout va bien, un message indiquant "Nouveau
capteur ajout&eacute; ...&ucirc;" sera affich&eacute; dans la zone
des notes. S'il y a des probl&egrave;mes avec quoi que ce soit, une
erreur ou message d'avertissement sera affich&eacute; dans la zone
des notes; vous devez alors corriger l'erreur et cliquez sur
<b>OK</b> &agrave; nouveau.</li>
<li>Retour au Tableau du Capteur principale, vous pouvez alors voir
l'&eacute;tat actuel du Capteur .</li>
</ol>
<!--#include virtual="/Footer" --></div>
<!-- closes #mainContent--></div>
<!-- closes #mBody--></div>
<!-- closes #container -->
</body>
</html>
