<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01//EN"
"http://www.w3.org/TR/html4/strict.dtd">
<!-- UpDated by Blorec Herv&#233; le 2013-10-01-->
<html lang="fr">
<head>
<meta name="generator" content=
"HTML Tidy for Mac OS X (vers 31 October 2006 - Apple Inc. build 15.17), see www.w3.org">
<!-- Copyright Bob Jacobsen 2008 -->
<!-- $Id$ -->
<title>JMRI: Speedometer</title>
<!-- Style -->
<meta http-equiv="Content-Type" content=
"text/html; charset=us-ascii">
<link rel="stylesheet" type="text/css" href="/css/default.css"
media="screen">
<link rel="stylesheet" type="text/css" href="/css/print.css" media=
"print">
<link rel="icon" href="/images/jmri.ico" type="image/png">
<link rel="home" title="Home" href="/"><!-- /Style -->
</head>
<body>
<!--#include virtual="/Header" -->
<div class="nomenu" id="mBody">
<div id="mainContent">
<h2>Tachym&egrave;tre</h2>
<p>(Voir aussi la page sur le tachym&egrave;tre NCE <a href=
"NCE-Speedometer.shtml"></a>) et le <a href=
"../../hardware/bachrus/index.shtml">tachym&egrave;tre
Bachrus</a>)</p>
Les biblioth&egrave;ques JMRI contiennent un outil compteur que
vous pouvez utiliser directement depuis l'&eacute;cran, ou le
construire dans vos propres applications
<p>Avant vous devrez configurer la mesure de la vitesse .</p>
<p>Pour ce faire, entrez le nombre de capteurs dans les trois
champs. C'est un nombre (comme 23) pour l'adresse du BDL16, DS54,
etc le canal qui rapporte le changement d'occupation. La
fa&ccedil;on la plus simple pour obtenir le bon num&eacute;ro est
d'ouvrir une fen&ecirc;tre "Moniteur", et d&eacute;poser une
locomotive sur le canton qui vous &ecirc;tes int&eacute;resse. Vous
verrez le message du capteur, avec le num&eacute;ro, dans la
fen&ecirc;tre qui ressemble &agrave; quelque chose comme ceci:</p>
<pre>
    General sensor input report: contact 161 (DS54 20 ch1 Sw  input)
        (BDL16 10 A2) is Lo
</pre>
Le num&eacute;ro de contact, 161 dans ce cas, est ce que vous
voulez.
<p>Il y a trois capteurs afin que vous puissiez avoir un intervalle
plus court pour les vitesses lentes et un intervalle plus long pour
des vitesses rapides. L'intervalle est du capteur 1 &agrave;
capteur 2, et du capteur de 1 &agrave; capteur 3.</p>
<p>Vous devez &eacute;galement choisir "&agrave; l'entr&eacute;e"
ou "&agrave; la sortie" pour chacun des capteurs. Ceci dit soit le
d&eacute;marrage/arr&ecirc;t de l'horloge lorsque le capteur montre
que le canton est d'abord occup&eacute;, soit quand il montre que
le canton est inoccup&eacute;.</p>
<p>Vous pouvez &eacute;galement entrer la distance en echelle en
pieds entre les diff&eacute;rents points. Si vous utilisez "sur
l'entr&eacute;e", la mesure utilise l'entr&eacute;e fin du
bloc.</p>
<p>Enfin, cliquez sur le bouton "D&eacute;marrer". Les trois petits
points rouges sur le c&ocirc;t&eacute; droit commenceront &agrave;
changer de couleur pour indiquer l'&eacute;tat des capteurs
s&eacute;lectionn&eacute;s: rouge pour "inconnu", aucun message
encore vu; Blanc pour "inoccup&eacute;"; vert ou jaune pour
"occup&eacute;".</p>
<p>Une fois que vous cliquez sur le bouton D&eacute;marrer, vous ne
pouvez pas modifier la configuration. Il suffit de fermer cette
fen&ecirc;tre et ouvrir un autre. Vous pouvez avoir plusieurs
fen&ecirc;tres d'outils tachym&egrave;tre ouvertes si vous le
souhaitez. <!--#include virtual="/Footer" --></p>
</div>
</div>
</body>
</html>
