<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01//EN"
"http://www.w3.org/TR/html4/strict.dtd">
<html lang="en">
<head>
<meta name="generator" content=
"HTML Tidy for Mac OS X (vers 31 October 2006 - Apple Inc. build 15.17), see www.w3.org">
<!-- Copyright ($Author$) 2009 -->
<!-- $Id$ -->
<!-- Translated by Herv&#233; Blorec 2013-09-10 -->
<title>JMRI: JMRIClient and SimpleServer Configuration</title>
<!-- Style -->
<meta http-equiv="Content-Type" content=
"text/html; charset=us-ascii">
<link rel="stylesheet" type="text/css" href="/css/default.css"
media="screen">
<link rel="stylesheet" type="text/css" href="/css/print.css" media=
"print">
<link rel="icon" href="/images/jmri.ico" type="image/png">
<link rel="home" title="Home" href="/"><!-- /Style -->
</head>
<body>
<!--#include virtual="/Header" -->
<div class="nomenu" id="mBody">
<div id="mainContent">
<h1>JMRI: Connexion JMRIClient</h1>
<p>La connexion JMRIClient fournit une m&eacute;thode de connexion
&agrave; distance d'un programme JMRI &agrave; un autre. Il peut
&ecirc;tre utilis&eacute; pour construire un panneau sur un
ordinateur qui est connect&eacute; au r&eacute;seau directement,
mais actuellement fait fonctionner le panneau sur un ordinateur
sans connexion physique au r&eacute;seau.</p>
<h2>Le Simple Serveur JMRI</h2>
<p>"Simple" dans ce cas, d&eacute;signe en fait le protocole, pas
le serveur lui-m&ecirc;me. Il utilise des commandes assez simples
qui incluent le nom du p&eacute;riph&eacute;rique (sauf pour la
commande d'alimentation) pour envoyer des informations
bi-directionnelles. Le protocole limite les actions qui peuvent
&ecirc;tre prises, de sorte qu'il sera &eacute;ventuellement
remplac&eacute; par un protocole plus complet (et complexe).</p>
<p>Le serveur prend en charge actuellement le basculement
d'aiguillages, la commutation de lumi&egrave;res et , les
commentaires des capteurs, des commentaires de Rapports et la
commande d'alimentation. Vous pouvez d&eacute;marrer le serveur
&agrave; travers une action configuration. Il utilise le port TCP
2048. Le Port est situ&eacute; dans une pr&eacute;f&eacute;rence,
de sorte que vous pouvez le changer si n&eacute;cessaire.</p>
<h2>JMRIClient</h2>
<p>JMRIClient fonctionne avec le serveur pour permettre la commande
&agrave; distance des aiguillages, lumi&egrave;res, alimentation,
et la r&eacute;troaction &agrave; distance des capteurs et
Rapports.</p>
<p>Pour configurer le JMRIClient, vous pouvez s&eacute;lectionner
l'option "JMRI (R&eacute;seau)" dans la liste des fabricants de
Syst&egrave;mes. Sous cette option se trouve "Connexion
R&eacute;seau JMRI". Vous pouvez avoir plusieurs interfaces
"connexion r&eacute;seau JMRI" configur&eacute;es.</p>
<p>Le client utilise actuellement le pr&eacute;fixe du
syst&egrave;me pour d&eacute;terminer ce qu'il faut envoyer au
serveur. Si votre serveur dispose d'une connexion avec un
pr&eacute;fixe "XYZ", vous avez besoin de configurer votre client
avec le pr&eacute;fixe "XYZ" pour pouvoir acc&eacute;der aux
dispositifs nomm&eacute;s sur le serveur.</p>
<p>Si vous avez plus d'un syst&egrave;me connect&eacute; au
serveur, vous devez configurer plus d'une connexion client. NOTE:
Il y a actuellement un avertissement lorsque vous configurez plus
d'un client, parce que toute l'information du port est la
m&ecirc;me. Vous pouvez ignorer ceci pour une connexion
r&eacute;seau.</p>
<p>Une fois que le client a envoy&eacute; une requ&ecirc;te au
serveur sur un objet, tous les les changements d'&eacute;tat sont
affich&eacute;s &agrave; la fois sur le client et le serveur.</p>
<h2>Exemples d'exploitations</h2>
<h3>Duplication de connexion simple</h3>
<p>L'utilisation op&eacute;rationnelle simple de JMRIClient et du
serveur simple est d'avoir un ordinateur reli&eacute; directement
au r&eacute;seau (l'ordinateur serveur) et un second ordinateur
(l'ordinateur client) reli&eacute; au premier par
l'interm&eacute;diaire d'un r&eacute;seau informatique o&ugrave;
vous souhaitez faire fonctionner un panneau.</p>
<p>Pour cet exemple, nous supposerons que le serveur dispose d'une
connexion Loconet avec le pr&eacute;fixe "L".</p>
<p>Sur l'ordinateur serveur, ouvrez les Pr&eacute;f&eacute;rences
et s&eacute;lectionnez le groupe D&eacute;marrage. cliquez sur le
bouton "Ajouter une action", et s&eacute;lectionnez
"D&eacute;marrer serveur simple JMRI" dans la liste d'options.
Enregistrer les pr&eacute;f&eacute;rences et red&eacute;marrez le
programme.</p>
<p><img src="images/simpleserver-autostart.png" alt=
"Action ajout&eacute; &agrave; d&eacute;marrer automatiquement le JMRI SimpleServer">
&lt;/ p&gt;</p>
<p>Sur la machine cliente, ajouter un "(R&eacute;seau) JMRI"
connexion. Changer le pr&eacute;fixe syst&egrave;me connexion pour
"L". et d&eacute;finir l'adresse IP &agrave; l'adresse IP du
serveur. Sauvegarder les pr&eacute;f&eacute;rences et
red&eacute;marrez le programme.</p>
<p><img src="images/jmriclient-base-configuration.png" alt=
"JMRIClient Configuration screen (configured for LocoNet with a server on localhost)"></p>
<p>Une fois que les deux ordinateurs ont red&eacute;marrer JMRI,
vous serez en mesure de charger un fichier panneau sur l'ordinateur
client qui a &eacute;t&eacute; cr&eacute;&eacute; au paravant sur
l'ordinateur serveur.</p>
<p>Chaque machine aura son propre ensemble de fichiers tableaux et
(&eacute;ventuellement) de panneau charg&eacute;s, si le client
d&eacute;clenche une action, l'information sera
transf&eacute;r&eacute;e vers le serveur, et le serveur va
d&eacute;clencher une action sur le r&eacute;seau. Si une action se
produit sur le serveur, le serveur tramsmet une indication de
l'action au client si le client a a indiqu&eacute; qu'il
s'int&eacute;resse &agrave; l'appareil.</p>
<h2>Remarques sur l'utilisation</h2>
<ol>
<li>Si vous avez des logixs ou des itin&eacute;raires, vous voulez
probablement que ceux-ci ne s'ex&eacute;cutent que sur une des deux
machines.</li>
<li>Pour tout renseignement sur une lumi&egrave;re / aiguillage /
capteur qui doivent &ecirc;tre restitu&eacute; au client, il doit
&ecirc;tre d&eacute;fini sur le client.</li>
<li>
<p>L'inversion est d&eacute;finie &agrave; la fois pour les
capteurs et les aiguillages. Si l'invertion est activ&eacute;e
&agrave; la fois par le client et le serveur, le dispositif
r&eacute;el aura un comportement normal lorsque le client
l'utilisera.</p>
<p>Celui-ci est int&eacute;ressant, car il peut &ecirc;tre un bug
ou pas un bug en fonction de votre cas d'utilisation.</p>
<p>Si votre cas d'utilisation est que le client et les serveurs ont
des panneaux en cours d'ex&eacute;cution , alors vous pourriez
consid&eacute;rer cela comme un bug. Il existe deux solutions de
contournement dans ce cas 1) charger un panneau sans configuration
d'inversion sur le client ou 2) Ex&eacute;cutez le panneau sur le
serveur via une seconde instance de JMRI qui est agissant comme un
client pour la premi&egrave;re instance.</p>
<p>Si votre cas d'utilisation est que le serveur fournit juste les
connexions, mais ne fait pas de logique, alors ce n'est pas un
bug.</p>
</li>
</ol>
<!--#include virtual="/Footer" --></div>
</div>
</body>
</html>
