# SectionTransitTableBundle_fr.properties
#
# French properties for the jmri.jmrit.beantable.SectionTableAction and
#     jmri.jmrit.beantable.TransitTableAction GUI elements not contained in 
#     jmri.jmrit.beantable.BeanTableBundle.properties
#
# Translated by Herv\u00e9 BLOREC <bzh56420@yahoo.fr> le 2016-6-03

# compare entries with jmri.jmrit.dispatcher.DispatcherBundle
SectionSystemNameHint = Entrez le nom syst\u00e8me pour la nouvelle Section, ex: IY13
SectionUserNameHint = Entrez le nom utilisateur pour la section, par exemple, Sloan pour Baxter
SectionCreateButtonHint = Appuyez sur pour v\u00e9rifier les entr\u00e9es et cr\u00e9er une nouvelle section.
SectionUpdateButtonHint = Appuyez sur pour mettre \u00e0 jour cette section.
BlockTableMessage = Cantons de la section (au moins 1 est n\u00e9cessaire)
SectionFree =LIBRE
SectionForward = AVANT
SectionReverse = INVERSE
SectionFirstBlock = premier Canton
SectionLastBlock = dernier Canton

SectionTypeSMLLabel = <html> Cet article a \u00e9t\u00e9 g\u00e9n\u00e9r\u00e9 \u00e0 partir de la logique M\u00e2t de Signalisation. <br> les Cantons et les points d'entr\u00e9e sont remplis lorsque le panneau est charg\u00e9e </html>
SectionTypeDynLabel = Ce chapitre a \u00e9t\u00e9 cr\u00e9\u00e9 dynamiquement et ne sera pas sauv\u00e9

TransitSystemNameHint = Entrez le nom syst\u00e8me pour le nouveau Transit, ex: IZ13
TransitUserNameHint = Entrez le nom utilisateur pour le transit, par exemple, Passager Run
SectionTableMessage = Les Sections dans le transit (au moins 2 sont n\u00e9cessaires)
TransitIdle = ATTENTE
TransitAssigned = AFFECT\u00c9
TransitStartBlock = Canton de d\u00e9part
TransitEndBlock = Canton de Fin
ButtonDuplicate = Dupliquer
ButtonAddNewAction = Ajt Nouv Action
NewActionButtonHint = Appuyez sur pour ajouter une nouvelle action
DoneButtonHint = Appuyez sur lorsque vous avez termin\u00e9 avec cette fen\u00eatre
UpdateActionButton = M \u00e0 J Action
UpdateActionButtonHint = Appuyez sur pour mettre \u00e0 jour cette Action
CreateActionButton = Cr\u00e9er Nouv Act
CreateActionButtonHint = Appuyez sur pour cr\u00e9er une nouvelle Action
SequenceColName = Ordre
ActionColName = Actions
AddEditActions = Voir/Ajouter/modifier des Actions
DirectionColName = Direction
AlternateColName = Alternative
TitleViewActions = Voir les Actions
TitleAddAction = Ajouter Action
TitleEditAction = Modifier Action
SequenceAbbrev = S\u00e9quence
WhenColName = Lorsque
WhatColName = Action Demand\u00e9e
Primary = Primaire
Alternate = Alternative
Wait = Attendre Red\u00e9marrer
AddNextButton = Ajt Sect Suiv
DeleteSectionsButton = Supp Ttes Sect
DeleteSectionsButtonHint = Appuyez sur pour supprimer toutes les Sections dans le tableau ci-dessus et recommencez.
PrimarySectionBoxHint = Choisissez une section \u00e0 ajouter depuis cette liste, puis appuyez sur Ajt Sect Suiv.
AlternateSectionBoxHint = Choisissez une section \u00e0 ajouter pour une alternative \u00e0 la section ci-dessus.
AddPrimaryButton = Ajt Sect Suiv
AddPrimaryButtonHint = Appuyez sur pour ajouter la section s\u00e9lectionn\u00e9e \u00e0 gauche pour ce Transit.
RemoveLastButton = Supp dern Sect
RemoveLastButtonHint = Appuyez sur pour supprimer la plus basse des Sections de Transit.
AddAlternateButton = Ajtr Sect Alt
AddAlternateButtonHint = Appuyez sur pour ajouter la section s\u00e9lectionn\u00e9e \u00e0 gauche comme une alternative \u00e0 la section ci-dessus.
RemoveFirstButton = Supp Preme Section
RemoveFirstButtonHint = Appuyez sur pour supprimer la plus haute Section et les Alternatives de ce transit.
InsertAtBeginningBoxHint = Choisissez une Section \u00e0 ins\u00e9rer au d\u00e9but de ce Transit, puis appuyez sur [Ins\u00e9rer en tant que Premi\u00e8re Section] .
InsertAtBeginningButton = Ins\u00e9rer Comme premi\u00e8re section
InsertAtBeginningButtonHint = Appuyez sur pour ins\u00e9rer la Section s\u00e9lectionn\u00e9e comme la premi\u00e8re Section de ce Transit.
LabelSeqNum = Num\u00e9ro d'Ordre
SeqNumHint = Entrer le num\u00e9ro d'ordre de la section qui doit \u00eatre remplac\u00e9e, ajout\u00e9e ou supprim\u00e9e par les boutons ci-dessous.
ReplacePrimaryForSeqButton = Remplacer primaires par Ordre
ReplacePrimaryForSeqButtonHint = Appuyez sur pour remplacer la Section primaire du num\u00e9ro d'ordreentr\u00e9, si possible.
DeleteAlternateForSeqButton = Supprimer Alternate Par Ordre
DeleteAlternateForSeqButtonHint = Appuyez sur pour supprimer toutes les sections alternatives du num\u00e9ro d'ordree entr\u00e9, le cas \u00e9ch\u00e9ant.
AddAlternateForSeqButton = Ajouter Alternate Par Ordre
AddAlternateForSeqButtonHint = Appuyez sur pour ajouter une Section alternative au num\u00e9ro d'ordre entr\u00e9, si possible.
ReplacePrimaryChoice = Veuillez s\u00e9lectionner une Section pour remplacer\nLa S\u00e9lection Primaire Actuelle.
ReplacePrimaryTitle = Choisir Section
AddAlternateChoice = Veuillez s\u00e9lectionner une autre Section \u00e0 ajouter.
AddAlternateTitle = Choisir la Section Alternative
CancelButtonHint = Appuyez sur pour annuler sans cr\u00e9er ou mettre \u00e0 jour.
DeleteAllBlocksButton = Supp tous Cantons
DeleteAllBlocksButtonHint = Appuyez sur pour supprimer tous les Cantons dans le tableau ci-dessus et recommencez.
BlockBoxHint = s\u00e9lectionner un Canton \u00e0 ajouter depuis cette liste, puis appuyez sur le Bouton Ajouter S\u00e9lection.
AddBlockButton = Ajt Cant S\u00e9lect
AddBlockButtonHint = Appuyez sur pour ajouter le Canton s\u00e9lectionn\u00e9 \u00e0 gauche.
YesDeleteIt = Oui, supprimer la Section
NoCancel = Non, Annuler

WhenText = Quand:
WhenBoxTip = S\u00e9lectionnez cette option lorsque l'action doit \u00eatre initi\u00e9
WhatText = Quoi:
WhatBoxTip = S\u00e9lectionnez ce pourquoi l'action est demand\u00e9e
OptionalDelay = Option Temporisation
#Milliseconds = (millisecondes)
BlockStringTip = S\u00e9lectionner un Canton au sein de cette Section
MastLabel = M\u00e2t Signal:
HeadLabel = ou Feux:
DoneSensorLabel = Capteur Fait (facultatif)
HintDoneSensor = (Facultatif) Entrez le nom du capteur pour avertir le R\u00e9partiteur lorsque vous aurez termin\u00e9 de travailler.

OnEntry = Sur Entr\u00e9e Section
HintDelayData = (Facultatif) Entrez le temps en millisecondes \u00e0 attendre avant que l'action soit lanc\u00e9e
OnExit = Sur Sortie Section
OnEntryFull =A l'entr\u00e9e de cette section
OnEntryDelayedFull = "{0}" ms apr\u00e8s \u00eatre entr\u00e9 dans cette Section
OnExitFull =A la sortie de cette section
OnExitDelayedFull = "{0}" ms apr\u00e8s la sortie de cette Section
OnBlockEntry = Sur le Canton d'entr\u00e9e
HintBlockEntry = s\u00e9lectionner un Canton dans cette Section.
OnBlockExit = Sur le Canton Sortie
OnBlockEntryFull = Sur Entr\u00e9e Canton "{0}"
OnBlockEntryDelayedFull = "{0}" ms apr\u00e8s \u00eatre \u00eatre entr\u00e9  Canton "{1}"
OnBlockExitFull = \u00e0 la Sortie du Canton "{0}"
OnBlockExitDelayedFull = "{0}" ms apr\u00e8s la Sortie du Canton "{1}"
TrainStop = Sur arr\u00eat de train
TrainStopFull = Quand le train arr\u00eate de bouger
TrainStopDelayedFull = "{0}" ms alors que le train s'immobilise
TrainStart = D\u00e9part du Train
TrainStartFull = Lorsque le train se met en mouvement
TrainStartDelayedFull = "{0}" ms alors que le train se met en mouvement
OnSensorActive = Sur Capteur ACTIF
HintSensorEntry = Entrer le nom syst\u00e8me ou nom utilisateur du Capteur
OnSensorActiveFull = lorsque le Capteur "{0}" devient ACTIF
OnSensorActiveDelayedFull = "{0}" ms apr\u00e8s que le Capteur "{1}" soit devenu ACTIF
OnSensorInactive = sur le capteur INACTIF
OnSensorInactiveFull = lorsque le capteur "{0}" devient INACTIF
OnSensorInactiveDelayedFull = "{0}" ms apr\u00e8s que le Capteur "{1}" soit devenu INACTIF

Pause = Train en Pause
PauseFull = Pause pour "{0}" minutes rapides
HintPauseData = Entrez le nombre de minutes de l'horloge rapide pourla dur\u00e9e de la pause.
SetMaxSpeed = D\u00e9finir la Vitesse Maximale
HintSetSpeedData1 =  Entrez le pourcentage de vitesse \u00e0 atteindre (1-99)
SetMaxSpeedFull = R\u00e9gler la vitesse maximale des trains \u00e0 {0} pour cent
SetTrainSpeed= r\u00e9gler la vitesse du train
SetTrainSpeedFull = R\u00e9gler la vitesse du train \u00e0 "{0}" pour cent
RampTrainSpeed = rampe de vitesse du train
HintSetTrainSpeedData2 = Entrez le temps en millisecondes pour que la rampe de vitesse atteigne la vitesse fix\u00e9e
RampTrainSpeedFull = vitesse de rampe en "{0}" pour cent.
ToManualMode = Passer en Mode Manuel
ToManualModeFull = Changer pour R\u00e9gulateur en manuel. Aucun capteur fait.
ToManualModeAltFull = Changez le R\u00e9gulateur en manuel. Capteur "{0}" fait
SetLight = D\u00e9finir Lumi\u00e8re Locomotive
SetLightFull = R\u00e9gler la lumi\u00e8re de la locomotive "{0}"
HintSetLight = S\u00e9lectionnez \u00c9teinte ou Allum\u00e9 pour activer ou d\u00e9sactiver la Lumi\u00e8re
StartBell = D\u00e9but de Cloche
StartBellFull = D\u00e9but Cloche (si d\u00e9codeur de son)
StopBell = Arr\u00eat de Cloche
StopBellFull = Arr\u00eat Cloche (si d\u00e9codeur de son)
SoundHorn = Son Corne
HintSoundHornData1 = Entrez dur\u00e9e en millisecondes pour un seul coups de corne
SoundHornFull = Son corne pour {0} ms
SoundHornPattern = Mod\u00e8le Son Corne
HintSoundHornPatternData1 = Entrer la longueur de son court en millisecondes
HintSoundHornPatternData2 = Entrer la longueur de son long en millisecondes
HintSoundHornPatternString = Entrez mod\u00e8le: 's' pour court, 'l' pour long, par exemple 'lsl' pour les long-court-long
SoundHornPatternFull = Mod\u00e8le de son corne "{0}"; bref={1} long={2}
LocoFunction = D\u00e9finir Fonction D\u00e9codeur
HintLocoFunctionData1 = Entrer le num\u00e9ro (0-28) de la fonction du d\u00e9codeur \u00e0 d\u00e9finir.
HintLocoFunctionOnOff = S\u00e9lectionnez On ou Off pour activer ou d\u00e9sactiverla fonction sp\u00e9cifi\u00e9e.
LocoFunctionFull = R\u00e9gler fonction d\u00e9codeur "{0}" \u00e0 "{1}"
SetSensorActive = D\u00e9finir capteur ACTIF
SetSensorActiveFull = D\u00e9finir Capteur  "{0}" ACTIF
SetSensorInactive = D\u00e9finir Capteur INACTIF
SetSensorInactiveFull = D\u00e9finir Capteur "{0}" INACTIF

LayoutEditorBoxHint = S\u00e9lectionnez un panneau \u00c9diteur de R\u00e9seau, puis s\u00e9lectionnez le bouton radio pour l'utiliser.
SetManuallyHint = S\u00e9lectionnez ce bouton radio pour permettre l'\u00e9dition manuelle de la direction du point d'entr\u00e9e.
SetAutomaticHint = S\u00e9lectionnez ce bouton radio pour le r\u00e9glage automatique de la direction du point d'entr\u00e9e.
EntryPointTable = Tableau des points d'entr\u00e9e
SetManually = R\u00e9glage manuel
UseConnectivity = Ensemble utilisant la connectivit\u00e9 \u00e0 partir du Panneau \u00c9diteur de R\u00e9seau:
FromBlock = Canton entrant par
ToBlock = Canton d'entr\u00e9e
TravelDirection = Direction du voyage
DirectionNote = Note: La direction AVANT est du Canton Haut vers le Canton du bas.

DirectionSensorLabel = Capteurs de Direction (Facultatif)
ForwardSensor = Capteur Avant:
ForwardSensorHint = Entrer  le nom du capteur de marche avant (syst\u00e8me ou utilisateur).
ReverseSensor = Capteur inverse:
ReverseSensorHint = Entrez le nom du capteur de marche arri\u00e8re (syst\u00e8me ou utilisateur).
StoppingSensorLabel = Capteurs d'arr\u00eat (Facultatif)
ForwardStopSensor = Capteur Arr\u00eat Avant :
ForwardStopSensorHint = Entrer le nom du capteur d'arr\u00eat avant (syst\u00e8me ou utilisateur).
ReverseStopSensor =  Capteur d'Arr\u00eat Arri\u00e8re:
ReverseStopSensorHint = Entrer le nom du capteur d'arr\u00eat inverse (syst\u00e8me ou utilisateur).

ValidateAllSections =Valider Toutes les Sections
SetupDirectionSensors = R\u00e9gler Capteurs de Direction Situ\u00e9 dans la Logique
RemoveDirectionSensors =  Retirer les Capteurs de direction \u00e0 partir de la Logique

ChoiceTitle = Choisissez Panneau
MissingEntryError = Erreur - L'Entr\u00e9e n\u00e9cessaire "{0}" n'a pas \u00e9t\u00e9 trouv\u00e9e.
EntryError = Erreur dans l'entr\u00e9e "{0}" -
EntryRangeError = L'entr\u00e9e"{0}"  n'est pas dans la plage autoris\u00e9e de "{1}" \u00e0 "{2}"
MissingPattern = Erreur -  Le mod\u00e8le pour le son de la corne n'a pas \u00e9t\u00e9 entr\u00e9.
ErrorPattern = erreur - Mauvais caract\u00e8re dans le mod\u00e8le de corne. Seulement "s" et "l" sont autoris\u00e9s.
PauseTime = Temps de Pause
SpeedPercentage = Pourcentage de vitesse
HornBlastLength = Longueur du coup de Corne 
ShortBlastLength = Longueur Coup Bref
LongBlastLength = Longueur Coup Prolong\u00e9
FunctionNumber = Num\u00e9ro de Fonction
NoSensorError = Erreur - Pas de nom de Capteur n'a \u00e9t\u00e9 entr\u00e9.
SensorEntryError = Le nom du Capteur saisi ne correspond pas \u00e0 un Capteur dans le Tableau Capteur.

Message1 = Les Sections exigent Cantons et Chemins. S'il vous pla\u00eet les d\u00e9finir avant la cr\u00e9ation des Sections.
Message2 = Erreur - Impossible de cr\u00e9er une nouvelle Section. Nom syst\u00e8me ou nom utilisateur n'est pas unique.
Message3 = Erreur - Impossible de mettre \u00e0 jour. Le nouveau nom utilisateur est d\u00e9j\u00e0 utilis\u00e9 pour un autre \u00e9l\u00e9ment.
Message4 = Erreur en ajoutant le Canton \u00e0 la Section. S'il vous pla\u00eet appuyez sur Annuler et r\u00e9essayez.
Message5 = Erreur - Aucun Canton \u00e0 ajouter.
Message6 = Erreur - Une section doit avoir au moins un Canton. S'il vous pla\u00eet ajouter des Cantons et essayer \u00e0 nouveau.
Message7 = Erreur - Impossible de fournir un capteur avant. S'il vous pla\u00eet corriger le nom du capteur avant et essayez \u00e0 nouveau.
Message8 = Erreur - Impossible de fournir un capteur de marche arri\u00e8re. S'il vous pla\u00eet corriger le nom du capteur de marche arri\u00e8re et essayez \u00e0 nouveau.
Message9 = Erreur - Les capteurs avant et arri\u00e8re doivent \u00eatre diff\u00e9rent. S'il vous pla\u00eet essayer de nouveau.
Message10 = Erreur - direction du point d'entr\u00e9e est inconnue. S'il vous pla\u00eet attribuer une direction \u00e0 tous les points d'entr\u00e9e.
Message11 = Veuillez choisir un panneau \u00c9diteur de R\u00e9seau pour d\u00e9finir la connectivit\u00e9.
Message12 = Avertissement - demande d'outils annul\u00e9e parce que vous avez annul\u00e9\nau lieu de choisir un panneau \u00c9diteur de R\u00e9seau comme n\u00e9cessaire.
Message13 = Demande annul\u00e9e. Cet outil n\u00e9cessite un panneau \u00c9diteur de R\u00e9seau\npour d\u00e9finir la connectivit\u00e9. S'il vous pla\u00eet cr\u00e9er ou charger en un et essayer \u00e0 nouveau.
Message14 = {0} messages d'erreur \u00e9mis lors de la validation des sections.\nVoir pour plus de d\u00e9tails le Registre d'erreurs.
Message15 = Toutes les Sections ont \u00e9t\u00e9 v\u00e9rifi\u00e9es. Aucune erreur trouv\u00e9e.
Message16 = Il n'y a pas de Sections dans le Tableau Section.
Message17 = La Section - "{0}" - est utilis\u00e9e par les Transits suivants -
Message18 = Supprimer cette Section va briser les Transits.
Message18a = Recommandons de supprimer Transits affect\u00e9s en premier.
Message19 = Aucune Transit utilise la Section - "{0}", mais il peut \u00eatre utilis\u00e9 ailleurs.
Message20 = Voulez-vous toujours supprimer cette Section?
Message21 = Les Transits exigent des Sections. S'il vous pla\u00eet d\u00e9finir des Sections avant de tenter de cr\u00e9er des Transits.
Message22 = Erreur - Impossible de cr\u00e9er un nouveau Transit. Nom syst\u00e8me ou nom utilisateur n'est pas unique.
Message23 = Un Transit ne peut pas avoir plus de 150 \u00e9l\u00e9ments qui lui soient affect\u00e9s.
Message24 = Erreur - Pas de Section Alternative \u00e0 ajouter.
Message25 = Erreur - Pas de Section \u00e0 ajouter.
Message26 = Un Transit n\u00e9cessite au moins deux Sections principales.\nS'il vous pla\u00eet ajouter des Sections avant de tenter de cr\u00e9er / mettre \u00e0 jour ce Transit.
Message27 = {0} messages d'erreur ou d'avertissement \u00e9mis lors du placement de capteurs de direction dans lalogique signal.\nVoir journal des erreurs pour plus de d\u00e9tails.
Message28 = Capteurs Itin\u00e9raire plac\u00e9s dans la logique du signal sans erreurs ni avertissements \u00e9mis.
Message29 = Cet outil n\u00e9cessite un panneau \u00c9diteur de R\u00e9seau, mais aucun panneau \u00c9diteur de R\u00e9seau n'est pr\u00e9sent.
Message30 = Impossible de placer des capteurs de direction, car il n'y a pas de Sections d\u00e9finies.
Message31 = Capteurs Itin\u00e9raires retir\u00e9s de la logique du signal sans erreur.
Message32 = Vous ne pouvez pas supprimer capteurs de direction, car il n'y a pas de Sections d\u00e9finies.
Message33 = {0} messages d'erreur \u00e9mis lors du retrait de capteurs de direction de\nla logique signal. Voir journal des erreurs pour plus de d\u00e9tails.
Message34 = Le num\u00e9ro d'ordre doit \u00eatre saisi avant de tenter\nde modifier par num\u00e9ro d'Ordre. Veuillez r\u00e9essayer
Message35 = Erreur - Pas de section \u00e0 ins\u00e9rer au d\u00e9but
Message36 = D\u00e9sol\u00e9, aucune Section trouv\u00e9 pour remplacer la Section Primaire \u00e0 "{0}".
Message37 = D\u00e9sol\u00e9, aucune nouvelle Section Alternative trouv\u00e9e pour la Section Primaire \u00e0 "{0}".
