<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01//EN"
"http://www.w3.org/TR/html4/strict.dtd">

<html lang="fr">
<head>
<!-- Updated by Blorec Herv&#233;  2017-01-26-->
<title>JMRI Hardware Support - ESU ECoS</title>

<!-- Style -->
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<link rel="stylesheet" type="text/css" href="/css/default.css" media="screen">
<link rel="stylesheet" type="text/css" href="/css/print.css" media="print">
<link rel="icon" href="/images/jmri.ico" type="image/png">
<link rel="home" title="Home" href="/">
<!-- /Style -->
</head>

<body>
<!--#include virtual="/Header" -->
<div id="mBody">
    <!--#include virtual="../SidebarUp" -->
    <div id="mainContent">
        <!-- Page Body -->

<h1>Support Mat&#233;riel: ESU ECoS</h1>

<a name="hardware"></a><h2>Mat&#233;riel pris en charge</h2>
<h3>Centrale</h3>
<p>JMRI peut se connecter &#224; une centrale ESU ECoS
via une connexion Internet.</p>

Le support pour ECoS a &#233;t&#233; premi&#232;rement disponible dans <a href="http://jmri.org/releasenotes/jmri2.3.3.shtml">JMRI 2.3.3</a>.<br>
Le support pour le R&#233;gulateur ECoS a &#233;t&#233; premi&#232;rement disponible dans <a href="http://jmri.org/releasenotes/jmri2.7.4.shtml">JMRI 2.7.4</a>.<br>
Le support pour la R&#233;trosignalisation ECOS S88 des capteurs a &#233;t&#233; premi&#232;rement disponible dans <a href="http://jmri.org/releasenotes/jmri2.7.9.shtml">JMRI 2.7.9</a>.<br>
Le support pour la R&#233;trosignalisation ECOS RailCom a &#233;t&#233; premi&#232;rement disponible dans <a href="http://jmri.org/releasenotes/jmri2.99.7.shtml">JMRI 2.99.7</a>. 

<a name="limitations"></a><h2>Limitations</h2>
<p>La programmation est support&#233;par l'2cos depuis le firmware version 4.1, toutefois, cela ne concerne que la voie de programmation. Programmer sur le circuit est seulement disponible depuis l'Ecos directement. Une information supp&#233;mentaire sur l'Ecos peur &#234;tre trouv&#233;e
sur le  <a href="http://www.esu.eu/us/index.php?showId=205">site web ESU</a>.
<p>Le couplage n'est pas encore pris en charge.<p>

<a name="connecting"></a><h2>Connexion</h2>
<h3>R&#233;glages</h3>
Pour configurer la connexion:
<ul>
    <li> Ouvrez  "Pr&#233;f&#233;rences" JMRI  sous le menu "&#201;dition",
    <li>Select "ESU" comme System Manufacturer
    <li>S&#233;lectionnez "ESU ECoS" comme  System Connection,( la seule option )
    <li>Entrez l'adresse IP de votre appareil ECoS,
    <li>Laissez le num&#233;ro de port &#224; 15471,
    <li>Cliquez sur "Enregistrer". et rd&#233;marrer
</ul>

<p>
Aiguillage, Capteur,un r&#233;gulateur basique et un support alimentation sont disponibles pour connect&#233; JMRI &#224; une Ecos
</p>

<h3>R&#233;gulateurs</h3>
Seul le mod&#232;le de base pour les r&#233;gulateur via l'Ecos est pris en charge. Quand une entr&#233;e dans la Liste , ou une adresse DCC est directement
entr&#233;e dans le champ d'adresse, JMRI va v&#233;rifier la liste existante des locomotives ECoS pour trouver une correspondance avec la premi&#232;re adresse DCC qu'il rencontre.
Si aucune correspondance n'est trouv&#233;e, le r&#233;gulateur va cr&#233;er une entr&#233;e dans l'Ecos qui sera r&#233;pertori&#233;e comme "Cr&#233;&#233; par JMRI" avec une valeur par d&#233;faut de 128 crans de vitesse. <br>
Depuis la version 2.9.4 lorsque vous fermez JMRI, vous serez invit&#233; &#224; supprimer ou conserver les entr&#233;es dans l'ECoS.<br>
<p>Le couplage n'est <strong>pas</strong> pris en charge</p>

 <h3>Capteurs </h3>
<p>Les Capteur ECOS connect&#233;s sur le bus s88 ont des noms comme "US100: 01", o&#249; "U" est le nom du
        syst&#232;me pour ecos Esu
"S" signifie capteur, "100" est l'adresse s88 immatricul&#233;e dans l'Ecos, et "01"est le port de cette carte.
</p>

 <h3>Aiguillages </h3>
<p>Les aiguillages ECOS connect&#233;s ont des noms comme "UT123", o&#249; "U"
est le nom du syst&#232;me pour ecos Esu, "T" d&#233;signe Turnout (aiguillage), et
"123" est l'adresse.
</p>

<h3> Initialisation Ecos </h3>
Lorsque JMRI commence, d'abord il lit L'information des aiguillages, des capteurs depuis l'ECoS, ce qui peut prendre quelques secondes. Les aiguillages et les capteurs sont automatiquement ajout&#233;s dans les tableaux JMRI, ceci est n&#233;cessaire pour qu'un lien puisse &#234;tre &#233;tabli entre les Capteurs et Aiguillages configur&#233;s dans l'Ecos et l'adresse accessoire que JMRI utilise. <br>
Tout en recueillant les informations de la loco depuis l' Ecos, JMRI va v&#233;rifier s'il existe d&#233;j&#224; une entr&#233;e de liste associ&#233;e &#224; la loco. Si la v&#233;rification &#233;choue, le syst&#232;me vous demandera si vous souhaitez ajouter l'importation de la Loco &#224; la liste.
<p>

<a name="tools"></a><h2>Outils JMRI ECoS</h2>
<ul>
<li>Pr&#233;f&#233;rences Ecos
<li>G&#233;n&#233;rateur de Commande
<li>&#201;tat Ecos
</ul>

 <h3>Ecos Base de Donn&#233;es Loco </h3>
<p>La base de donn&#233;es Loco Ecos vous permet de visualiser toutes les locomotives qui sont configur&#233;s dans
    l'Ecos, de les affecter &#224; une entr&#233;e de l'Inventaire JMRI ou de l'Importer dans l'Inventaire JMRI.
</p>

<h3> Importation Locos de Ecos </h3>
<p>Lors de l'importation de la locomotive dans JMRI, il cr&#233;e actuellement seulement un enregistrement squelette,
        qui contient le nom  de la loco avec le
type de d&#233;codeur en cas de s&#233;lection et l'adresse loco. Ce processus actuellement n'importe pas les valeurs de CV stock&#233;es sur l'Ecos dans JMRI.
</p>

<h3> Exportation Locos dans Ecos </h3>
<p>Quand un nouveau fichier d'entr&#233;e est cr&#233;&#233; dans JMRI, il vous sera demand&#233; si vous souhaitez
ajouter l'entr&#233;e de l'Inventaire dans la base de donn&#233;es Ecos. L'entr&#233;e Ecos utilisera l'ID de
l'Inventaire comme nom de la loco, d&#233;finit la vitesse de 128 pas, et r&#232;gle l'adresse de la locomotive.
Le nombre de crans de vitesses peut &#234;tre modifi&#233; dans le Menu Pr&#233;f&#233;rences Ecos.</p>

    <!--#include virtual="/Footer" -->
 </div><!-- closes #mainContent-->
</div> <!-- closes #mBody-->
</body>
</html>
