<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">

<html lang="fr">
<head>
  <meta name="generator" content=
  "HTML Tidy for Mac OS X (vers 31 October 2006 - Apple Inc. build 15.17), see www.w3.org">

  <title>JMRI: Simple Signal Logic</title>
  <meta name="author" content="Bob Jacobsen, Egbert Broerse">
  <meta name="Date.Modified" content="20171115">
  <meta name="keywords" content="JMRI help Simple Signal Logic">
  <!-- Style -->
  <meta http-equiv="Content-Type" content=
  "text/html; charset=iso-8859-1">
  <link rel="stylesheet" type="text/css" href="/css/default.css"
  media="screen">
  <link rel="stylesheet" type="text/css" href="/css/print.css"
  media="print">
  <link rel="icon" href="/images/jmri.ico" type="image/png">
  <link rel="home" title="Home" href="/">
  <!-- /Style -->
</head>

<body>
  <!--#include virtual="/Header.shtml" -->
  <div class="nomenu" id="mBody">
    <div id="mainContent">

      <h1>JMRI : La logique du signal simple</h1>

      <a name="contents" id="contents"></a>
      <h2>Contenu</h2>

      <p>La documentation ci-dessous d&#233;crit la signalisation avec JMRI.
      &#224 l'aide d'un outil plus ancien, SSL, et discute de la fa&#231;on de configurer les situations de base de la
      signalisation avec cet outil.</p>

      <ul>
        <li><a href="#intro">Introduction</a></li>

        <li><a href="#start">D&#233;marrer</a></li>

        <li><a href="#more">Plus d'informations</a></li>
      </ul>

      <a name="intro" id="intro"></a>
      <h2>Introduction</h2>

      <p>La logique du signal simple (SSL) a fourni la premi&#232;re m&#233;thode permettant 
        la mise en place rapide d'une signalisation de base de style
      (BAL dans JMRI (cette logique est faite pour la signalisation US). Pour des op&#233;rations plus complexes
      d&#233;passant les capacit&#233;s de SSL, reportez-vous &#224 la nouvelle
      m&#233;thode plus r&#233;cente et pr&#233;f&#233;r&#233;e de Logique des M&#226ts de Signalisation sur le site <a href=
      "../../../../html/tools/signaling/index.shtml">page d'aide Signalisation Principale
      </a>. Notez que SSL ne tient pas compte des objets M&#226ts de Signalisation
      et ne pilote que les Signaux individuels.</p> <p>.

      <p><b>N'utilisez pas l'outil SSL lorsque vous avez d&#233;j&#224 construit des 
        M&#226ts de Signalisation et la logique des M&#226ts de Signalisation plus avanc&#233;e dans le m&#234;me
      Panneau/fichier de configuration.</b></p> <p>.

      </p> <p>Une grande partie de la signalisation BAL de base peut &#234;tre r&#233;sum&#233;e &#224 " un...
      Signal passe au rouge lorsqu'un train ne peut pas entrer en toute s&#233;curit&#233; dans le Canton qu'il prot&#232;ge.
      prot&#232;ge ; il passe au jaune lorsque le Canton suivant
      prot&#233;g&#233; ne peut pas &#234;tre p&#233;n&#233;tr&#233;. Bien qu'il s'agisse d'une
      simplification, il peut servir de point de d&#233;part puissant pour
      comprendre la logique de signalisation.</p>

      <p>L'interface utilisateur SSL a &#233;t&#233; con&#231;ue pour &#234;tre conviviale pour
      tous les utilisateurs ayant une familiarit&#233; de base avec JMRI. SSL fournit un
      moyen de configurer des signaux de base de mani&#232;re intuitive,
      sans que l'utilisateur n'ait &#224 se familiariser avec toute la logique
      n&#233;cessaire pour tenir compte des diff&#233;rents aspects du signal.
      <a href="../../../../images/SslExample.png"><img src=...
      "../../../../images/SslExample.png" align="right"
      width="452" height="287" hspace="0" vspace="0" alt=
      "Figure du panneau Simple Signal Logic"></a></p>.

      <p>L'outil de logique de signal simple vous permet de configurer JMRI
      pour utiliser une logique de base de type BAL afin de d&#233;finir l'apparence des
      Signaux de signal. Les champs varient en fonction de l'option s&#233;lectionn&#233;e.
      .  &#224 l'aide de l'outil SSL, vous saisissez les informations pour
      chaque Signal sur :</p>

      <ul>
        <li><b>Pour le Signal:</b> Le Signal &#233;tant
        pilot&#233;.</li>

        <li><b>Prot&#232;ge le(s) Capteur(s):</b> Quels capteurs (d&#233;tecteurs d'occupation
        d&#233;tecteurs) couvrent le Canton imm&#233;diatement apr&#232;s le signal.
        Lorsque l'un de ces capteurs indique " actif ", le Signal 
        sera mis au rouge.</li>

        <li><b>Rouge quand Aiguillage:</b> Si le Canton contient un aiguillage, 
          choisissez ou saisissez le Nom Syst&#232;me de l'Aiguillage et utilisez les
        boutons de s&#233;lection pour choisir si vous entrez sur la
        voie directe ou d&#233;vi&#233;e. Le Signal sera r&#233;gl&#233; sur Rouge
        chaque fois que l'aiguillage est plac&#233; contre cette voie.</li>

        <li><b>Prot&#232;ge le Signal :</b> Le prochain Signal que le
        train atteindra ; ce Signal sera mise sur Jaune si
        le Signal suivant est rouge.</li>

        <li><b>Avec Jaune Clignotant</b> Si la case est coch&#233;e,
        le Signal sera mise en jaune clignotant (JMRI va
        alternera entre &#233;teint et  jaune) si le prochain Signal  prot&#233;g&#233;e
        prot&#233;g&#233;e suivante est jaune, donnant ainsi une signalisation &#224 quatre Cantons.li>

        <li><b>Vitesse Limit&#233;e</b> Si cette case est coch&#233;e, ce
        Signal sera r&#233;gl&#233; sur le jaune comme l'aspect le moins restrictif.</li>

        <li><b>Vitesse restreinte</b> Si cette case est coch&#233;e, ce Signal sera r&#233;gl&#233; 
          sur rouge clignotant comme aspect le moins restrictif.</li>

        <li><b>Est un signal distant</b> Si cette case est coch&#233;e,
        ce signal sera d&#233;fini comme l'aspect le plus restrictif de
        ce  Signal, soit le prochain Signal prot&#233;g&#233;.</li>

        <li><b>Capteur de Signal d'Approche :</b> Le capteur qui
        commande si ce Signal est allum&#233;e ou non. Seule la
        Signal mat&#233;riel r&#233;el sur le r&#233;seau s'&#233;teindra.
        Les indicateurs du panneau afficheront l'apparence normale du signal.
        Laissez cette entr&#233;e vide pour toujours afficher Allum&#233;.</li>

        <li><b>Aiguillage en Pointe</b> La signal est situ&#233;
        sur le c&#244;t&#233; voie unique de l'aiguillage, faisant face &#224 un choix de
        deux voies ou plus dans le sens de la marche.</li>

        <li><b>Aiguillage en Talon</b> Le Signal est
        situ&#233;e du c&#244;t&#233; de la double voie de l'aiguillage, face &#224 une seule voie dans le sens de la marche.
        .</li>
      </ul>

      </p> <p>Le cas d'un aiguillage en pointe orient&#233;e qui conduit &#224 deux
       " signaux prot&#233;g&#233;s " diff&#233;rents est &#233;galement trait&#233;.


      Si un seul Signal est utilis&#233;
      pour contr&#244;ler les deux embranchements, choisissez 
      " Aiguillage en Pointe ". Si un Signal diff&#233;rent contr&#244;le chaque voie,
      alors il suffit de choisir la branche "principale" ou "divergente" de l'aiguillage, comme
      requis pour chacun d'eux.</p>

      <p>Posez votre souris sur toute entr&#233;e ou &#233;l&#233;ment dans le volet de cr&#233;ation de SSL.
      pour obtenir un bref rappel d'aide "tooltip".</p> <p>

      </p> <p>Utilisez le bouton <strong>Appliquer</strong> pour cr&#233;er une nouvelle d&#233;finition SSL ou mettre &#224 jour
      une d&#233;finition existante.  Le bouton <strong>Supprimer</strong> supprimera la d&#233;finition SSL.
      </p>

      <p>Il est clair que le SSL ne couvrira pas les enclenchements compliqu&#233;s.
      et ne couvrira pas non plus la signalisation de vitesse vue sur certains
      prototypes. Cependant, lorsqu'il est combin&#233; avec les
       capacit&#233;s logiques de JMRI <a href=
      "../../../html/tools/Routes.shtml">Itin&#233;raires</a> et <a href=
      "../../../html/tools/Logix.shtml">Logix</a>, SSL peut &#234;tre utilis&#233;
      pour cr&#233;er un panneau CTC, comme le montre Bob Bucklew sur <a href=
      "http://www.quaker-valley.com/CTC/QV_CTCnew.html">son site web
      </a>.</p><a name="start" id="start"></a>

      <h2>D&#233;marrer</h2>

      <p>Suivez ces &#233;tapes pour cr&#233;er votre premier signal JMRI et
      vous familiariser avec l'interface utilisateur SSL. Pour commencer,
      cet exemple ne d&#233;finit qu'un seul Signal " virtuel " qui
      n'existe pas vraiment sur le r&#233;seau, et qui peut donc fonctionner avec n'importe quel
      type de mat&#233;riel de r&#233;seau. Voir la page d'aide <a href=
      "../../../../html/tools/signaling/index.shtml">Signalisation Principale 
      </a> pour obtenir des informations sur la fa&#231;on de configurer vos propres
      signaux.</p>

      <ol>
        <li>S&#233;lectionnez <b>Signaux de Signalisation</b> dans le menu PanelPro.
        <b>Outils &gt; Tableaux &gt; Signaux</b> menu.</li>

        <li>Dans la fen&#234;tre du tableau des Signaux qui appara&#238;t, cliquez sur le bouton
        <b>Ajouter...</b> pour commencer &#224 d&#233;finir un nouveau Signal.</li>

        <li>Dans le volet Ajouter un nouveau Signal qui s'affiche, choisissez le 
        type "Virtuel".</li>

        <li>Entrez un Nom Syst&#232;me tel que "IH1000".</li>

        <li>Cliquez sur <b>Cr&#233;er</b> pour entrer ce Signal dans le Tableau des Signaux.</li>

        <li>Entrez tous les Signaux que vous utiliserez pour
        ce test, en utilisant des noms diff&#233;rents. Le nom r&#233;el n'a pas
        important, ils doivent juste &#234;tre diff&#233;rents.</li>

        <li>Maintenant, s&#233;lectionnez <b>Logique Simple Signal...</b> dans le menu contextuel
        <b>Outils</b>.</li>

        <li>Remplir les diff&#233;rentes entr&#233;es pour correspondre aux exigences de votre signal.
        comme indiqu&#233; pr&#233;c&#233;demment.</li>

        <li>Cliquez sur <b>Appliquer</b> pour rendre cette entr&#233;e active.</li>

        <li>Veillez &#224 sauvegarder votre travail.</li>
      </ol>

      </p> <p>Vous venez de cr&#233;er une entr&#233;e SSL pour commander un signal.
      . C'est aussi simple que cela. Il vous a fallu plus de temps pour lire
      ce tutoriel que pour cr&#233;er votre premi&#232;re entr&#233;e SSL.<br>
      L'exemple suivant vous permettrait de construire une v&#233;ritable Logique Simple
      Signal pour les signaux connect&#233;s &#224 un type sp&#233;cifique de syst&#232;me DCC :</p>

      <ol>
        <li>S&#233;lectionnez <b>Tableaux &gt; Aiguillages</b> dans le <b>Menu Outils</b>.</li>

        <li>V&#233;rifiez pour &#234;tre s&#251;r que les sorties (adresses des Aiguillages)
        qui contr&#244;leront vos signaux sont dans le Tableau d'Aiguillages'. 
        Si ce n'est pas le cas, cliquez sur le bouton <b>Ajouter...</b> en bas
        de la table des Aiguillages.</li>

        <li>Dans la fen&#234;tre Ajouter un Nouvel Aiguillage qui appara&#238;t, saisissez un
        Nom Syst&#232;me, (par exemple "LT1") et "test" pour le Nom Utilisateur, puis
        cliquez sur <b>Cr&#233;er</b>.<br>
        <i>Note:</i> Tous les Noms Syst&#232;me des objets JMRI doivent respecter
        les r&#232;gles de nommage JMRI, en commen&#231;ant par un pr&#233;fixe en majuscule pour le
        le type de connexion DCC (par exemple, "L" pour LocoNet) suivi d'un T majuscule dans le cas des aiguillages 
        et l'adresse mat&#233;rielle r&#233;elle de l'aiguillage.</li>

        <li>Cliquer sur les <b>Direct/D&#233;vi&#233;</b> correspondants
        dans le tableau des aiguillages devrait maintenant faire en sorte que votre Signal
         change d'&#233;tat.</li>

        <li>S&#233;lectionnez <b> Signal</b> dans le menu <b>Outils &gt; Tableaux.
        &gt; Signaux</b> .</li>

        <li>Dans la fen&#234;tre du tableau des signaux qui appara&#238;t, cliquez sur.
        <b>Ajouter...</b> pour commencer &#224 d&#233;finir un nouveau signal.</li>

        <li>Dans la fen&#234;tre Ajouter un nouveau signal qui appara&#238;t, choisissez le
        type de signal correct pour correspondre &#224 votre mat&#233;riel. Les cases d'&#233;l&#233;ments 
        requis appara&#238;tront.</li>

        <li>Entrez un Nom Syst&#232;me, par exemple " LH152 ". <i>Note:</i>
        Les Noms Syst&#232;me Signaaux doivent commencer par le pr&#233;fixe de connexion
        plus "H" pour Head (c'est-&#224-dire CH, IH, LH, NH, XH, etc.) et &#234;tre suivis de l'adresse mat&#233;rielle 
        ("num&#233;ro") du signal.</li>

        <li>SEnsuite choisissez ou cr&#233;ez un ou plusieurs aiguillages qui vont
        commander ce signal. <i>Note:</i> Dans le cas de 
        signaux connect&#233;s SE8C, entrez simplement le premier num&#233;ro d'Aiguillage
        de chaque paire.
        Le deuxi&#232;me num&#233;ro d'Aiguillage est automatiquement connu.</li>

        <li>Cliquez sur <b>Cr&#233;er</b> pour entrer ce signal dans le tableau des Signaux.</li>


        li>Entrez toutes les signaux que vous allez utiliser.</li>

        <li>Maintenant, s&#233;lectionnez <b>Logique Simple Signal...</b> dans le menu <b>Outils</b> de PanelPro.</li>

        <li>Remplir les diff&#233;rentes entr&#233;es pour correspondre aux exigences
        de votre premier signal comme indiqu&#233; pr&#233;c&#233;demment.</li>

        <li>Cliquez sur <b>Appliquer</b> pour rendre cette entr&#233;e active.</li>

        <li>R&#233;p&#233;tez les &#233;tapes 13-14 pour chacune de vos signaux.</li>

        <li>Veillez &#224 sauvegarder votre travail. Voir <a href="../../../../html/apps/LoadStoreWork.shtml">.
      Chargement et stockage de votre travail</a>.</li>
      </ol>

      <a name="more" id="more"></a>
      <h2>Plus d'infos sur SSL</h2>

      <ul>
        <li>Consultez l'<a href=]
        "../../../../html/tools/signal/SimpleSignalExample.shtml">
        Exemple de logique de signal simple</a>.</li>

        <li><a href=
        "../../../../html/tools/signal/Logic.shtml">Fonds d'&#233;cran
        sur SSL</a></li>

<p>Traduction 2021-03-27</p>
      </ul>
      <!--#include virtual="/Footer.shtml" -->
    </div><!-- closes #mainContent-->
  </div><!-- closes #mBody-->
</body>
</html>
