<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">

<html lang="fr">
<head>
  <meta name="generator" content=
  "HTML Tidy for Mac OS X (vers 31 October 2006 - Apple Inc. build 15.17), see www.w3.org">
  <!-- Updated by Herv&#233; Blorec 2013-10-14-->

  <title>JMRI: SSL Documentation</title>
  <!-- Style -->
  <meta http-equiv="Content-Type" content=
  "text/html; charset=us-ascii">
  <link rel="stylesheet" type="text/css" href="/css/default.css"
  media="screen">
  <link rel="stylesheet" type="text/css" href="/css/print.css"
  media="print">
  <link rel="icon" href="/images/jmri.ico" type="image/png">
  <link rel="home" title="Home" href="/">
  <!-- /Style -->
</head>

<body>
  <!--#include virtual="/Header" -->
<div class="nomenu" id="mBody">
    <div id="mainContent">

      <h1>JMRI: Documentation Logique Simple Signal</h1>

      <h2><a name="contents" id="contents">Contenus</a></h2>

      <p>La documentation ci-dessous d&eacute;crit la Signalisation
      avec JMRI, et discute de la configuration des situations de
      base des signaux. La documentation est divis&eacute;e en
      sections; cliquez ci-dessous pour un acc&egrave;s facile
      &agrave; une section cot&eacute;es. Si vous
      pr&eacute;f&eacute;rez essayer avant de lire beaucoup, lire
      l<a href="#intro">'introduction &agrave; SSL</a> , puis
      cliquez sur <a href="#start">Mise en route</a> et suivez les
      instructions. Retour ici pour lire &agrave; propos de ce que
      vous faisiez.</p>

      <ul>
        <li><a href="#terms">Vocabulaire de base</a></li>

        <li><a href="#intro">Introduction &agrave; SSL</a></li>

        <li><a href="#SSL">SSL</a></li>

        <li><a href="#start">Mise en route</a></li>
      </ul>

      <h2><a name="terms" id="terms">Vocabulaire</a></h2>

      <p>Quelques termes de base:</p>

      <dl>
        <dt><b>Bras du Signal</b> ou <b>Signal</b></dt>

        <dd>Chaque unit&eacute; de signal individuel.</dd>

        <dt><b>Aspect</b></dt>

        <dd>La vitesse ou l'indication donn&eacute;e pour un
        itin&eacute;raire par une ou plusieurs t&ecirc;tes de
        signal ou bras.</dd>

        <dt><b>Marqueur</b></dt>

        <dd>Une t&ecirc;te de signal ou un bras qui ne change pas
        de couleur ou de position.</dd>

        <dt><b>Lumi&egrave;re</b></dt>

        <dd>La lampe individuelle dans un signal. Une
        lumi&egrave;re peut indiquer de multiples aspects si elle
        change de couleur comme dans projecteur, ou elle peut
        prendre plusieurs lumi&egrave;res pour indiquer un seul
        aspect, par exemple en position de signaux lumineux.</dd>

        <dt><b>M&acirc;t</b></dt>

        <dd>Le poteau sur lequel sont mont&eacute;s un ou plusieurs
        bras qui (normalement) contr&ocirc;le individuellement
        chaque voie.</dd>

        <dt><b>Signal Distant</b></dt>

        <dd>Un signal &eacute;loign&eacute; montrant les
        m&ecirc;mes aspects ou des aspect plus restrictif que le
        prochain signal dans la direction et l'itin&eacute;raire du
        voyage.</dd>
      </dl>

      <p>Quelques termes sp&eacute;cifiques &agrave; SSL et aux
      Signaux JMRI :</p>

      <dl>
        <dt><b>Tableau T&ecirc;te Signal</b></dt>

        <dd>la liste des signaux dans JMRI. Les signaux doivent
        d'abord &ecirc;tre ajout&eacute; dans le Tableau T&ecirc;te
        Signal avant qu'ils puissent &ecirc;tre inclus dans une
        entr&eacute;e de SSL ou Logix.</dd>

        <dt><b>Sortie Triple</b></dt>

        <dd>Une t&ecirc;te signal dont chaque aspect est
        directement entra&icirc;n&eacute; &agrave; partir d'une
        ligne individuelle de sortie (appel&eacute; un aiguillage).
        Chaque changement d'aspect n&eacute;cessite l'envoi de
        trois commandes.</dd>

        <dt><b>Sortie Double</b></dt>

        <dd>Une t&ecirc;te signal qui utilise seulement deux lignes
        de sortie pour indiquer 4 aspects de signal.
        Habituellement, ces aspects seront Approche, Libre, Stop,
        et Eteint. Le codage de sortie est tel qu'un aiguillage
        d&eacute;vi&eacute; indique l'arr&ecirc;t et qu'un autre
        d&eacute;vi&eacute; indique libre. Les deux sorties
        d&eacute;vi&eacute;es indiquent l'approche, et les deux
        directs sont sombres. Chaque changement d'aspect
        n&eacute;cessite l'envoi de deux commandes.</dd>

        <dt><b>SE8c</b></dt>

        <dd>Un signal contr&ocirc;l&eacute; par un aiguillage
        unique pour le changement d'aspect. Un changement de
        commande d'aiguillage change entre arr&ecirc;ter et claire,
        et la seconde commande aiguillage change entre approche et
        &eacute;teint.</dd>

        <dt><b>Virtuel</b></dt>

        <dd>les signaux virtuels sont des signaux internes &agrave;
        JMRI sans mat&eacute;riel r&eacute;el. Avant
        l'av&egrave;nement de Logix, les Signaux Virtuels
        &eacute;taient n&eacute;cessaires pour r&eacute;soudre des
        op&eacute;rations plus complexes qui ne pouvaient pas
        &ecirc;tre faites avec un simple SSL .</dd>

        <dt><b>Capteur Prot&eacute;g&eacute;</b></dt>

        <dd>Le prochain capteur du canton suivant le signal que
        vous contr&ocirc;lez dans la direction et
        l'itin&eacute;raire La "protection" est d'emp&ecirc;cher un
        train d'entrer dans un canton occup&eacute; sans
        avertissement.</dd>

        <dt><b>Signal prot&eacute;g&eacute;</b></dt>

        <dd>Le signal suivant celui que vous contr&ocirc;lez dans
        la direction et l'itin&eacute;raire. La "protection" est
        d'emp&ecirc;cher un train de s'adresser &agrave; un signal
        d'arr&ecirc;t sans avertissement suffisant pour lui
        permettre d'&ecirc;tre arr&ecirc;t&eacute; avant
        d'atteindre le signal "prot&eacute;g&eacute;".</dd>

        <dt><b>Nom Syst&egrave;me</b></dt>

        <dd>La repr&eacute;sentation interne JMRI pour le
        mat&eacute;riel r&eacute;el utilis&eacute; pour
        contr&ocirc;ler le signal. Cela varie en fonction de votre
        mat&eacute;riel, et doit correspondre &agrave; votre
        syst&egrave;me.</dd>
      </dl><a name="table" id="table"></a>

      <h2>Tableau T&ecirc;te Signal</h2><a href=
      "./images/SigTable.png"><img src="./images/SigTable.png"
      align="right" width="588" height="332" hspace="0" vspace=
      "0"></a>

      <p>Tous les signaux que JMRI conna&icirc;t peuvent &ecirc;tre
      r&eacute;f&eacute;renc&eacute;s en utilisant l'Outil "Tableau
      T&ecirc;te Signal" dans le menu de la plupart des programmes
      JMRI. Il y a huit colonnes dans la table:</p>

      <ul>
        <li>Le nom syst&egrave;me est attribu&eacute; au signal
        quand il est cr&eacute;&eacute;, et ne peut pas &ecirc;tre
        chang&eacute;.</li>

        <li>Si vous vous voulez que vos signaux portent des noms
        "lisibles" , vous pouvez cliquer dans la colonne "Nom
        Utilisateur" et modifier ces informations, mettez ce que
        vous voulez.</li>

        <li>Quand un signal change, pour une raison quelconque,
        l'apparence courante est montr&eacute;e dans le tableau
        dans la colonne "Etat". Vous pouvez &eacute;galement
        cliquer sur le bouton apparence pour faire d&eacute;filer
        les apparences disponibles: rouge, jaune, vert, rouge
        clignotant, clignotant jaune, vert clignotant, et
        sombre.</li>

        <li>La colonne "Commentaire" est pour votre usage pour
        enregistrer tout commentaire que vous jugerez
        peut-&ecirc;tre utile pour garder une trace de vos signaux.
        Il est &agrave; titre d' information seulement.</li>

        <li>Cliquez sur le bouton "Supprimer" dans une ligne
        sp&eacute;cifique pour supprimer le signal. N'oubliez pas
        d'enlever toutes les ic&ocirc;nes de signal associ&eacute;
        &agrave; ce signal et toutes les r&eacute;f&eacute;rences
        &agrave; ce signal. Utilisez cette touche avec
        pr&eacute;caution!</li>

        <li>La case &agrave; cocher dans "Allum&eacute;" vous
        permet de contr&ocirc;ler si le signal sur le r&eacute;seau
        est allum&eacute; (coch&eacute;) ou reste sombre (non
        coch&eacute;).</li>

        <li>La case &agrave; cocher dans la colonne "Tenu" indique
        la propri&eacute;t&eacute; du "lieu" du signal, et vous
        permet de le changer. Cette propri&eacute;t&eacute; est par
        exemple utilis&eacute; par la logique de la machine CTC**
        pour dire "Ne changez pas ce signal du rouge, m&ecirc;me
        s'il serait prudent de le faire, parce que je veux
        arr&ecirc;ter un train ici ".</li>

        <li>Cliquez sur le bouton "&eacute;diter" dans une
        rang&eacute;e pour afficher ou modifier les informations
        facultatives pour un signal. Notes: Le nom syst&egrave;me
        et le type ne peut pas &ecirc;tre chang&eacute;. Un seul
        signal peut &ecirc;tre &eacute;dit&eacute; &agrave; la
        fois.</li>
      </ul><a href="./images/SigAdd.gif"><img src=
      "./images/SigAdd.gif" align="right" width="181" height="218"
      hspace="0" vspace="0" alt=
      "panneau de figure simple logique signal"></a>

      <p>Pour d&eacute;finir un nouveau signal, cliquez sur le
      bouton <b>Ajouter ...</b>. Il vous sera demander le type de
      signal (sortie triple; Double sortie; SE8c; etc), et toutes
      les informations de configuration n&eacute;cessaire pour
      votre choix.</p>

      <p>Ces informations sont enregistr&eacute;es avec la
      configuration dans un fichier XML, au cours de l'installation
      du panneau de commande, Logix, itin&eacute;raires, et des
      choses similaires. Pour plus d'informations sur la
      cr&eacute;ation et l'affichage des panneaux, y compris la
      fa&ccedil;on de montrer les signaux sur vos panneaux, s'il
      vous pla&icirc;t voir les <a href=
      "../../../../html/apps/PanelPro/Panels.shtml">pages
      Panneaux</a>. <a name="intro" id="intro"></a></p>

      <h2>Introduction &agrave; SSL</h2>

      <p>SSL est un outil JMRI pour permettre l'installation rapide
      de la signalisation de base ABS*. Pour les op&eacute;rations
      plus complexes au-del&agrave; des capacit&eacute;s de SSL se
      r&eacute;f&eacute;rer &agrave; la section sur Logix.
      L'interface utilisateur de SSL est con&ccedil;u pour
      &ecirc;tre convivial pour tous les utilisateurs avec une
      familiarit&eacute; de base avec JMRI. SSL fournit un moyen
      pour la mise en place de signaux de base de mani&egrave;re
      intuitive, sans que l'utilisateur ait &agrave; se
      familiariser avec l'ensemble de la logique n&eacute;cessaire
      pour tenir compte des diff&eacute;rents aspects. <a name=
      "SSL" id="SSL"></a> <a name="logic" id="logic"></a></p>

      <h2>Logique Simple Signal</h2><a href=
      "../../../images/SslExample.png"><img src="../../../images/SslExample.png" align=
      "right" width="354" height="499" hspace="0" vspace="0" alt=
      "figure panneau logique simple signaux "></a> Une grande
      partie de la base de la signalisation ABS peut se
      r&eacute;sumer &agrave; "un signal passe au rouge quand un
      train ne peut pas p&eacute;n&eacute;trer en toute
      s&eacute;curit&eacute; dans le bloc qu'il prot&egrave;ge, il
      passe en jaune lorsque le bloc suivant le bloc
      prot&eacute;g&eacute; est occup&eacute; ". Bien que ce soit
      une simplification, il peut servir comme point de
      d&eacute;part pour comprendre la puissante logique de
      signalisation.

      <p>L'outil simple logique signal vous permet de configurer
      JMRI pour utiliser ce type de base de la logique ABS pour
      d&eacute;finir l'apparence d'un signal. Utilisation du
      panneau, vous entrez des informations sur:</p>

      <ul>
        <li><b>Nom du Signal</b> Le signal &eacute;tant
        pilot&eacute;. Entrez le nom utilisateur ou syst&egrave;me
        du signal que vous souhaitez contr&ocirc;ler, et cliquez la
        touche retour ou entrer. Le reste des champs sera rempli
        avec toutes les informations de commande qui sont
        d&eacute;j&agrave; pr&eacute;sentes.</li>

        <li><b>Capteur/s de Protection</b> Quels capteurs
        (d&eacute;tecteurs d'occupation) couvrent le canton
        imm&eacute;diatement apr&egrave;s le signal. Lorsque l'un
        de ces capteurs se montre "actif" le signal sera mis au
        rouge.</li>

        <li><b>Rouge Quand Aiguillage</b> Si le Canton contient un
        aiguillage, configurer le nom de l'aiguillage et utiliser
        le bouton de s&eacute;lection pour choisir si vous entrez
        sur la branche directe ou d&eacute;vi&eacute;e. Le signal
        sera mis au rouge lorsqurigthe l'aiguillage est
        bascul&eacute; sur l'autre voie.</li>

        <li><b>Signal Prot&eacute;g&eacute;</b> Le prochain signal
        auquel le train va arriver; ce signal sera mis en jaune si
        le prochain signal est rouge.</li>

        <li><b>Avec Clignotant Jaune</b> Si la case est
        coch&eacute;e, le signal sera fix&eacute; jaune clignotant
        (JMRI alterne entre &eacute;teint et jaune) si le
        prochaines signal prot&eacute;g&eacute; est jaune, ce qui
        donne quatre cantons de signalisation.</li>

        <li><b>Vitesse Limit&eacute;e</b> Si la case est
        coch&eacute;e, ce signal sera fix&eacute; au jaune qui est
        l'aspect le moins restrictif.</li>

        <li><b>Est Signal Distant</b> Si la case est coch&eacute;e,
        ce signal sera fix&eacute; &agrave; l'aspect le plus
        restrictif de ce signal ou le signal suivant
        prot&eacute;g&eacute;.</li>

        <li><b>Capteur &eacute;clairage d'approche</b> Le capteur
        qui contr&ocirc;le l'allumage de ce signal. Seuls les
        signaux de mat&eacute;riel r&eacute;el s'&eacute;teignent.
        Les indicateurs du panneau montreront l'aspect du signal
        normal. Laissez ce champ d'entr&eacute;e vide pour toujours
        afficher allum&eacute;.</li>

        <li><b>Aiguillage en Pointe</b> Le signal situ&eacute; sur
        la ligne &agrave; voie unique, face &agrave; un choix de
        deux ou plusieurs voies dans le sens du
        d&eacute;placement.</li>

        <li><b>Aiguillage en Talon</b> Les signaux situ&eacute;s
        sur la ligne &agrave; double voie, face &agrave; une seule
        voie dans le sens du d&eacute;placement.</li>
      </ul>

      <p>Le cas d'un aiguillage en pointe qui conduit &agrave; deux
      "Signaux prot&eacute;g&eacute;es" est &eacute;galement
      couvert bien que le listing ci-dessus ne le montre pas. Si un
      seul signal est utilis&eacute; pour contr&ocirc;ler les deux
      branches, alors choisissez "Aiguillage en Pointe ". Si un
      signal va contr&ocirc;ler chaque itin&eacute;raire, alors
      s&eacute;lectionnez simplement la branche" Principale" ou
      "Divergente" de l'aiguillage, tel que requis pour chacun
      d'eux.</p>

      <p>Posez votre souris sur n'importe quelle entr&eacute;e ou
      &eacute;l&eacute;ment dans la fen&ecirc;tre de
      cr&eacute;ation de SSL pour une br&egrave;ve "bulle d'aide"
      .</p>

      <p>Il est clair que ce ne seront pas couverts les
      enclenchements compliqu&eacute;s ni les vitesses de
      signalisation vu sur certains prototypes. Pour ces situations
      utiliser un combinaison de Logix et Itin&eacute;raires. Logix
      couvrira les conditions et les Itin&eacute;raires
      contr&ocirc;leront les actions &agrave; prendre.</p><a name=
      "start" id="start"></a>

      <h2>D&eacute;marrage</h2>

      <p>Suivez les &eacute;tapes suivantes pour cr&eacute;er un
      signal et se familiariser avec la fa&ccedil;on dont
      l'interface utilisateur SSL fonctionne. Cet exemple
      d&eacute;finit un signal "virtuel" qui n'existe pas vraiment
      sur le r&eacute;seau, de sorte qu'il peut fonctionner avec
      n'importe quel type de mat&eacute;riel r&eacute;seau. Voir la
      page sur <a href=
      "../../../../html/tools/signaling/index.shtml#table">les
      signaux</a> pour plus d'informations sur la fa&ccedil;on de
      configurer votre signal r&eacute;el.</p>

      <ol>
        <li>S&eacute;lectionnez <b>Tableau T&ecirc;te Signal</b>
        dans les <b>Outils</b>.</li>

        <li>Dans la fen&ecirc;tre Tableau T&ecirc;te Signal qui
        appara&icirc;t, cliquez sur <b>Ajouter</b> pour commencer
        &agrave; d&eacute;finir un nouveau signal.</li>

        <li>Dans la fen&ecirc;tre Ajouter Nouveau Signal qui
        appara&icirc;t choisissez le type du "signal virtuel".</li>

        <li>Entrez un nom de syst&egrave;me tels que IH1000.</li>

        <li>Cliquez <b>OK</b> pour entrer signal dans la Table
        T&ecirc;te Signal.</li>

        <li>Entrez tous les signaux que vous allez utiliser pour ce
        test, en utilisant des noms diff&eacute;rents. Le nom
        r&eacute;el n'est pas grave, ils ont juste &agrave;
        &ecirc;tre diff&eacute;rents. Maintenant,
        s&eacute;lectionnez</li>

        <li><b>Logique Simple Signal</b> dans le menu
        <b>Outils</b>.</li>

        <li>Remplissez les diff&eacute;rentes rubriques pour
        r&eacute;pondre &agrave; vos exigences de signaux
        d&eacute;j&agrave; montr&eacute; dans la section <a href=
        "#SSL">SSL</a>.</li>

        <li>Cliquez <b>Appliquer</b> pour rendre cette
        entr&eacute;e active.</li>

        <li>N'oubliez pas de sauvegarder votre travail.</li>
      </ol>

      <p>Vous venez de cr&eacute;er une entr&eacute;e de
      contr&ocirc;le SSL pour un signal. C'est aussi simple que
      cela. Il vous a fallu plus de temps pour lire ce tutoriel que
      pour cr&eacute;er l'entr&eacute;e SSL.</p>

      <p>*ABS: Bloc automatique<br>
      **CTC: commande manuelle des signaux et aiguillages</p>
      <!--#include virtual="/Footer" -->
    </div>
  </div>
</body>
</html>
