<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01//EN" "http://www.w3.org/TR/html4/strict.dtd">
<html lang="fr">
<head>
<!-- Copyright Joseph A. Ellis - TesserAct Studios -->
<!-- Copyright Bob Blackwell - afticarr@sympatico.ca 2007 -->
<!-- UpDated by Blorec Hervé 2011-09-06--> 

<title>JMRI: Mise &agrave; jour Manuels/Documents</title>

<!-- Style -->
  <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<LINK REL="stylesheet" TYPE="text/css" HREF="/css/default.css"
	MEDIA="screen">
<LINK REL="stylesheet" TYPE="text/css" HREF="/css/print.css"
	MEDIA="print">
<LINK REL="icon" HREF="/images/jmri.ico" TYPE="image/png">
<LINK REL="home" TITLE="Home" HREF="/">
<!-- /Style -->
</head>
<body>
<!--#include virtual="/Header" -->
  <div class="nomenu" id="mBody">
    <div id="mainContent">

<h1>Mise &agrave; jour Manuels/Documents JMRI</h1>

<div class="toc">
<ul>
  <li><a href="#screenshots">Cr&eacute;ation d'images &agrave; partir de captures d'&eacute;cran</a></li>
  <li><a href="#sizing">Dimensionnement et Enregistrement des images</a></li>
  <li><a href="#submitpage">Soumettre &agrave; Sourceforge</a></li>
</ul>
</div>

Les pages web JMRI et les &eacute;crans d&apos;aide sont &eacute;crits dans un sous-ensemble simple
de HTML.
La partie la plus importante du contenu est le texte brut
que les gens lisent, et les informations de formatage suppl&eacute;mentaires qui
est maintenue au minimum. Pour mettre &agrave; jour une page Web JMRI, vous modifiez
ceux-ci directement avec un &eacute;diteur de texte simple.

<p> Utiliser MS Word ou Front Page pour &eacute;diter ces documents .shtml n&apos;est pas une bonne id&eacute;e
car ils seront probablement ajouter &agrave; leurs propres codes de propri&eacute;t&eacute; de mise en forme ce qui
va g&acirc;cher les choses, peut-&ecirc;tre m&ecirc;me au point d&apos;&ecirc;tre inutilisable par JMRI. En outre,
ne pas renommer les fichiers, ou apporter des modifications &agrave; l&apos;information mise
en haut ou en bas. Toujours avec des changements de forme au texte dans le
corps principal du dossier, qui contient vraiment ce que &agrave; quoi les lecteurs doivent accorder une attention
toute particuli&egrave;re.

<p> Pour commencer, vous pouvez naviguer &agrave; l&apos;int&eacute;rieur du dossier du manuel DecoderPro et des fichiers de programme JMRI de votre ordinateur
Sur un syst&egrave;me Windows, l&apos;emplacement de ce dossier
ressemble &agrave; ceci - C <code>: \Program Files\JMRI\help\fr\manuel </code>.
Dans ce dossier un fichier appel&eacute; <code> index.shtml </code>. Ouvrez ce fichier avec
un &eacute;diteur de texte
et regarder autour. Si vous modifiez quelque chose, vous pouvez alors
ouvrir la page dans le syst&egrave;me d&apos;aide JMRI et voir &agrave; quoi elle ressemble
(soit de conserver une sauvegarde au cas o&ugrave; vous
souhaitez revenir &agrave; la page originale,
ou vous pouvez r&eacute;installer JMRI pour le restaurer)

<p>Pour ajouter une phrase ou fixer un libell&eacute;, vous venez de le faire avec l&apos;&eacute;diteur.
Pour ajouter une pause entre les paragraphes, par exemple, pour ajouter
un nouveau paragraphe, vous ins&eacute;rez un &quot;balise&quot;
qui indique au navigateur JMRI o&ugrave; ins&eacute;rer une rupture de paragraphe rupture: &lt;p&gt;.

<a name="screenshots"></a><h2>Cr&eacute;ation d&apos;images de captures d&apos;&eacute;cran</h2>
<h3>Pour Windows</h3>

Pour capturer une photo d&apos;&eacute;cran dans Windows, commencez par mettre en place la fen&ecirc;tre qui d&eacute;tient
ce que vous voulez capturer. Lui faire prendre le moins de place sur votre &eacute;cran tout en restant exploitable.
      Vous pouvez prendre une photo de la fen&ecirc;tre active (au lieu du bureau entier de votre ordinateur ), en appuyant sur la cl&eacute;
<code> &lt;Alt&gt; </code> et la cl&eacute;<code> &lt;Impr &eacute;cran&gt; </code> en m&ecirc;me
temps. (Note: En fonction de votre clavier, vous pourriez avoir besoin d&apos;appuyer sur le
<code> &lt;Fn&gt; </code> ou
<code> &lt;Function-Lock&gt; </code> cl&eacute;.) Ceci
met l'image sur votre "presse-papiers" et vous pouvez la coller dans un
programme d'&eacute;dition d'image comme Paint de Windows ou de Photoshop.

<h3>Pour Linux</h3>
Si votre distribution ne poss&egrave;de pas d&eacute;j&agrave; une application par d&eacute;faut qui prend en charge l&apos;
utilisation des touches <span style="font-family: monospace"> Impr &eacute;cran </span> et
<span style="font-family: monospace"> Alt + Impr &eacute;cran </span>  vous
pouvez installer <a href="http://www.kde.org/"> KSnapshot </a> ou votre applicaton favorite pour saisir votre fond d'&eacute;cran.

<h3>Pour Mac OS X</h3>

Apr&egrave;s avoir configur&eacute; votre photo, maintenez la touche
      <span style = "font-family: monospace"> &lt;Apple + Maj + 4&gt;</span>. Lorsque vous
les lib&eacute;rer en m&ecirc;me temps, le curseur devient un signe plus, et vous pouvez le faire glisser
 autour le zone que vous souhaitez. Quand vous relachez, vous avez un fichier image sur
votre bureau.

<h3> Utilisation d'une application Tierce Partie </h3>
J'aime
<a href="http://www.irfanview.com/main_download_engl.htm"> IrfanView </a> comme capteur d&apos;&eacute;cran,
      et il est gratuit. Avec lui, vous pouvez &eacute;galement inclure votre curseur de souris dans
votre instantan&eacute;. Vous pouvez &eacute;galement prendre une s&eacute;rie de photos facilement, et m&ecirc;me faire une
diaporama avec elles. Vous pouvez lui indiquer le format de fichier que vous voulez
et o&ugrave; vous voulez qu&apos;elles soient sauv&eacute;es avant de prendre la photo, ce qui rend
plus facile de travailler avec elles dans un programme comme Paint ou Photoshop.

<h2 name="sizing"> Dimensionnement et Enregistrement des Images </h2>

Toute modification que vous apportez &agrave; votre image doit &ecirc;tre effectu&eacute;e avant que vous utilisiez Amaya
pour l&apos;ins&eacute;rer dans votre document. Rappelez vous que si vous la changer, elle doit &ecirc;tre
r&eacute; ins&eacute;r&eacute;e. Assurez vous d&apos;enregistrer l&apos;image avec l&apos;une des extensions suivantes:
PNG, GIF, JPG, JPEG mais(pas BMP ou TIF), et ne pas utiliser d&apos;espaces ou de
lettres majuscules dans le nom. En r&egrave;gle g&eacute;n&eacute;rale, une bonne taille pour la largeur d&apos;une image est de 500
pixels ou moins, avec une r&eacute;solution web de 72 pixels par pouce. Si vous savez comment
redimensionner vos images, cela vous sera tr&egrave;s utile.


<h2 id="submitpage"> Soumettre &agrave; Sourceforge </h2>

<p>Si vous comprenez cela, vous &ecirc;tes pr&ecirc;t &agrave; nous aider &agrave; mettre &agrave; jour de nombreux
documents JMRI que nous utilisons &agrave; la fois pour le site JMRI et pour les fichiers d&apos;aide dans le
logiciel de la prochaine g&eacute;n&eacute;ration.

<p>
Lorsque vous envoyez vos modifications pour qu&apos;elles soient incluses dans les versions JMRI &agrave; venir, elles
sont soumises &agrave; une v&eacute;rification rapide et ensuite fusionn&eacute;es avec le contenu pr&eacute;c&eacute;dent.
La v&eacute;rification est effectu&eacute;e en utilisant des outils CVS pour trouver les pi&egrave;ces des
fichier qui ont &eacute;t&eacute; modifi&eacute;es.
Pour rendre cela plus facile, s&apos;il vous pla&icirc;t ne reformater pas les pages ou utiliser un
&eacute;diteur qui se d&eacute;place autour des lignes de sa propre initiative.

<h3>Pr&eacute;parer les fichiers</h3>

Le type de fichier correct &agrave; utiliser pour JMRI a l&apos;extension. shtml. Si vous avez
fait un .html ou .htm, vous pouvez changer l&apos;extension de vous-m&ecirc;me en .shtml
(ignorer l&apos;avertissement). Ne pas utiliser d&apos;espaces ou de majuscules dans vos
noms de fichiers. Si vous ne changez pas ou ajouter des images, il suffit de sauvegarder le fichier avec
son nom d&apos;origine, c&apos;est &agrave; dire &quot;index.shtml&quot;,
enregistrez le o&ugrave; vous pouvez le trouver facilement, et cliquez sur le lien ci-dessous
      <a href= "# submitpage"> Soumettre &agrave; Sourceforge </a>.</p>

<p>Si vous soumettez plus d&apos;un fichier &agrave; la fois (&agrave; savoir le .shtml et quelques
nouveaux ou des fichiers image modifi&eacute;s), alors vous devez d&apos;abord copier ces fichiers dans un nouveau
dossier quelque part sur votre disque dur, puis  compresser (ou Zip) le dossier. Pour
Windows XP, faites un clic droit surle dossier, puis Send To--- Compressed.

<h3> Envoyer &agrave; Sourceforge </h3>
Sourceforge est une communaut&eacute; de d&eacute;veloppeurs open-source et les b&eacute;n&eacute;voles qui travaillent dur
sur le projet du logiciel JMRI souhaiterait avoir votre aide  vous pouvez vous inscrire &agrave; SourceForge ou non.
Lorsque vous cliquez sur le lien ci-dessous &quot;Submit to Sourceforge&quot;
, vous serez redirig&eacute; vers une page qui a un lien  &quot;Add new
Artifact.&quot; (Ajouter un nouveau Artefact)
      Si vous faites cela sans &ecirc;tre un utilisateur connect&eacute;, vous pouvez soumettre
vos fichier (s) anonyme. Si vous envisagez de faire beaucoup d&apos;observations, nous vous sugg&eacute;rons
 d&apos;abord d&apos;utiliser  &quot;Log In&quot;, lien sur le c&ocirc;t&eacute; sup&eacute;rieur droit, puis
&quot;Create an Account.&quot;(Cr&eacute;er un compte) Cela vous permettra de garder une trace de ce que vous
avez soumis, et permettra aux autres de voir qui contribue et donne de son temps. Une fois que
vous vous &ecirc;tes connect&eacute; avec vos nouveau nom d&apos;utilisateur, vous pouvez retourner &agrave; la page appropri&eacute;e pour
revenir par deux fois dans votre navigateur. De toute fa&ccedil;on, lorsque vous cliquez sur le lien &quot;Ajouter
Nouveau Artefact &quot;, il vous suffit de fournir une br&egrave;ve description de ce que
vous envoyez, et ensuite t&eacute;l&eacute;charger votre fichier ou dossier compress&eacute;.

<p> Lien vers <a
href= "http://sourceforge.net/tracker/?group_id=26788&atid=388315"> Proposer &agrave;
SourceForge </a>.

<div>Ce document se trouve dans l'aide /fr/html/doc/technical/WebUpdate/UpdatingDocs.shtml
    
<!--#include virtual="/Footer" -->
      </div>
      </div>
</body>
</html>
