<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01//EN"
"http://www.w3.org/TR/html4/strict.dtd">
<!-- Updated by Herv&#233; Blorec  bzh56420@yahoo.fr 2013-11-02 -->

<html lang="fr">
<head>
  <meta name="generator" content=
  "HTML Tidy for Mac OS X (vers 31 October 2006 - Apple Inc. build 15.17), see www.w3.org">

  <title>JMRI: Canton Add/Edit Help</title>
  <meta http-equiv="Content-Type" content=
  "text/html; charset=us-ascii">
  <meta name="author" content="Bob Jacobsen">
  <meta name="keywords" content="JMRI help OCanton Table">
  <!-- Style -->
  <meta http-equiv="Content-Type" content=
  "text/html; charset=us-ascii">
  <link rel="stylesheet" type="text/css" href="/css/default.css"
  media="screen">
  <link rel="stylesheet" type="text/css" href="/css/print.css"
  media="print">
  <link rel="icon" href="/images/jmri.ico" type="image/png">
  <link rel="home" title="Home" href="/">
  <!-- /Style -->
</head>

<body>
  <!--#include virtual="/Header" -->
<div class="nomenu" id="mBody">
    <div id="mainContent">

      <h1>Cr&eacute;ation et modification OCantons, Portails et
      OChemins</h1>Commencez par entrer chaque Canton d'occupation
      de votre r&eacute;seau dans le <b>Tableau Canton
      d'occupations</b>.

      <div style="margin-left: 2em">
        <p><b>1.</b> Entrez un nom syst&egrave;me pour le OCanton.
        Si vous n'avez pas pr&eacute;facer l'entr&eacute;e avec
        "OB", il sera ajout&eacute; &agrave; votre entr&eacute;e
        automatiquement.</p>

        <p><b>2.</b> (optionnel) Entrez le nom utilisateur pour le
        OCanton.</p>

        <p><b>3.</b> entrer dans le nom syst&egrave;me ou le nom
        utilisateur de le capteur de d&eacute;tection pour le
        Canton. <i>Vous pouvez sauter cette entr&eacute;e et y
        revenir et entrerles informations plus tard.</i></p>

        <div style="margin-left: 2em">
          Note: <i>(Vous pouvez aussi lire cette note plus
          tard).</i> S'il y a plus d'un capteur qui d&eacute;tecte
          l'occupation du Canton. , faire un 'OU' avec l'ensemble
          et d&eacute;clencher un capteur interne simple pour
          utiliser cette entr&eacute;e. Par exemple, supposons que,
          LS10, LS11 et LS12 soient des capteurs de
          d&eacute;tection et IS100 est un capteur interne. En
          supposant que "Actif" signifie occup&eacute;,
          &eacute;crire une condition Logix avec des Variables
          d'&eacute;tat:

          <div style="margin-left: 2em">
            <div style="margin-left: 2em">
              &Eacute;tat Capteur "LS10" est Capteur Actif<br>
              &Eacute;tat Capteur "LS11" est Capteur Actif<br>
              &Eacute;tat Capteur "LS12" est Capteur Actif<br>
            </div>S&eacute;lectionnez <b>OU</b> comme
            op&eacute;rateur logique .<br>
            ajouter les Actions:<br>

            <div style="margin-left: 2em">
              Sur Changement pour Vraie, d&eacute;finir le Capteur,
              "IS100" &agrave; Actif .<br>
              Sur Changement pour faux, d&eacute;finir le Capteur,
              "IS100" &agrave; Inactif.<br>
            </div>Note: La ligne d'une nouvelle entr&eacute;e va
            retrouver sa position de tri comme ordonn&eacute; par
            le nom du syst&egrave;me . Pour continuer &agrave;
            modifier la ligne, chercher en haut de la
            fen&ecirc;tre. il restera en place tant qu'il a le
            m&ecirc;me nom syst&egrave;me .
          </div>
        </div>Ensuite, entrez les portails entre les cantons dans
        le <b>Tableau Portail</b> .

        <div style="margin-left: 2em">
          <b>4.</b> Pour chaque point entre les cantons que vous
          avez d&eacute;finis dans le tableau Canton d'occupation ,
          entrer une rang&eacute;e portail pour chaque portail
          (&eacute;cart) entre les deux cantons.

          <p>Une paire de cantons adjacents peut avoir plusieurs
          portails entre eux. Ainsi il est juste de donner &agrave;
          chacun un portail un nom unique, . Les noms Canton
          peuvent &ecirc;tre gliss&eacute;s dans le tableau Canton
          d'occupation pour enregistrer la saisie.</p>

          <div style="margin-left: 2em">
            Remarque: L'ordinateur vous informera de temps en temps
            jusqu'&agrave; ce que vous ayez entr&eacute; un Canton
            de chaque c&ocirc;t&eacute; du nom de portail. Il n'est
            pas important de savoir de quel c&ocirc;t&eacute; du
            portail vous entrez un nom de Canton, juste &ecirc;tre
            s&ucirc;r de rentrer les deux c&ocirc;t&eacute;s

            <p>Note: Il peut &ecirc;tre utile d'ouvrir le
            <b>Tableau des R&eacute;f&eacute;rences Crois&eacute;es
            Canton -Portail</b> pour v&eacute;rifier que tous les
            portails ont &eacute;t&eacute; saisis .</p>
          </div>
        </div>Ensuite, s'il y a des signaux &agrave; un portail,
        saisissez-les dans le <b>Tableau Signal</b>.

        <div style="margin-left: 2em">
          <b>5.</b> Entrer le nom syst&egrave;me ou utilisateur du
          signal. Il peut s'agir d'un M&acirc;t Signal ou
          T&ecirc;te Signal .

          <p><b>6.</b> Entrez le nom du canton <b><i>face</i></b>
          au signal dans la colonne <b>du Canton D'(Approche)</b> .
          Il est important que le Canton approchant du signal soit
          correctement nomm&eacute;. C'est le Canton qui permet de
          d&eacute;tecter quand un changement de vitesse peut
          &ecirc;tre n&eacute;cessaire.</p>

          <p><b>7.</b> Entrez le nom du portail ou le nom du Canton
          dont l'entr&eacute;e est prot&eacute;g&eacute;e .</p>

          <p><b>8.</b> Entrez un retard de quelques millisecondes
          &agrave; attendre apr&egrave;s &ecirc;tre entr&eacute;
          dans le canton d'approche avant de changer la vitesse du
          train. (Ce d&eacute;lai est utilis&eacute; seulement
          lorsque le signal indique un changement de vitesse.)</p>
        </div>Ensuite, identifier les Chemins dans chaque Canton .

        <div style="margin-left: 2em">
          <div style="margin-left: 2em">
            Rappel: Vous pouvez utiliser ' drag and drop ' pour
            saisir du texte. Lorsque vous s&eacute;lectionnez un
            &eacute;l&eacute;ment &agrave; faire glisser. , il peut
            requ&eacute;rir deux clics, l'un pour
            s&eacute;lectionner la ligne et un second pour
            s&eacute;lectionner l'entr&eacute;e de la colonne.
            Tenir le second clic vers le bas , vous pouvez faire
            glisser le texte &agrave; partir de cette ligne,
            colonne champs .
          </div><b>9</b>Se d&eacute;placer dans le Tableau Canton
          d'occupation ligne par ligne par rang&eacute;e. :

          <div style="margin-left: 2em">
            <b>9a</b>Appuyez sur le bouton <b>chemins</b> et ouvrez
            la table <b>Canton -Chemin</b> pour la ligne

            <p><b>9b.</b> Entrez un nom de chemin pour un chemin
            dans le canton de la ligne dans la colonne <b>Nom
            Chemin</b>.</p>

            <div style="margin-left: 2em">
              Remarque: Le nom du canton est entre guillemets dans
              la barre de titre de la table.
            </div><b>9c.</b> Entrez les noms des portails o&ugrave;
            le chemin entre et sort du Canton .

            <div style="margin-left: 2em">
              Note: Il n'est pas important de quel
              c&ocirc;t&eacute; du nom du chemin que vous entrez un
              nom portail. Les Embranchements en impasse auront un
              seul portail .
            </div>
          </div>
        </div>Enfin, compl&eacute;ter la d&eacute;finition de
        chaque Chemin dans chaque canton .

        <div style="margin-left: 2em">
          <b>10</b> Pour chaque chemin dans chaque <b>Tableau
          Canton- Chemin</b>, faire. :

          <div style="margin-left: 2em">
            <p><b>10a.</b> Pressez le bouton <b>Aiguillages</b> et
            ouvrez le tableau <b>Canton- Chemin - Aiguillage</b>
            pour chaque rang&eacute;e dans la table <b>Canton
            -Chemin</b></p>

            <p><b>10b.</b>Entrer le nom syst&egrave;me ou
            utilisateur d'un aiguillage dans le chemin.</p>

            <div style="margin-left: 2em">
              Remarque: Le nom du chemin et son canton sont entre
              guillemets dans la barre de titre de la table.
            </div>.

            <p><b>10c</b> Entrer la position de l'aiguillage dans
            la colonne <b>R&eacute;glage Aiguillage</b> - soit
            "droit" ou "d&eacute;vi&eacute;".</p>
          </div>
        </div>Tr&egrave;s probablement, vous avez rencontr&eacute;
        plusieurs bo&icirc;tes de dialogue vous invitant &agrave;
        corriger ceci ou cela, alors essayez de les
        r&eacute;soudre.

        <p>Maintenant, vous &ecirc;tes pr&ecirc;t &agrave;
        d&eacute;finir des itin&eacute;raires pour les
        Autorisations Restrictives. Bien s&ucirc;r, il y aura sans
        doute encore quelques erreurs ou des &eacute;l&eacute;ments
        manquants, mais la Fen&ecirc;tre "Cr&eacute;er Mandat"
        fournit un outil pour trouver et corriger.</p>

        <div style="margin-left: 2em">
          <b>11.</b> S&eacute;lectionnez <b>Cr&eacute;er un nouveau
          Mandat</b> depuis le menu <b>Mandat</b> dans un panneau
          de l'&Eacute;diteur de Panneau.
        </div>Pour lire comment les OCantons, Portails et OChemins
        peuvent &ecirc;tre utilis&eacute;s pour
        g&eacute;n&eacute;rer des itin&eacute;raires de train et de
        faire des scripts de trains automatis&eacute;s, voir
        <a href="../logix/Warrant.shtml">Mandat.</a>

        <p>Voir aussi <a href="../logix/WarrantTable.shtml">aide
        Tableau Mandat</a> pour plus de d&eacute;tails sur la
        cr&eacute;ation et l'&eacute;dition de Mandat.</p>
      </div>

    </div>
  </div>
</body>
</html>
