<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01//EN" "http://www.w3.org/TR/html4/strict.dtd">
<!-- $Id: Warrant.shtml 23180 2013-04-09 02:26:34Z pete_cressman $ -->
<!-- Translated by Herv&#233; Blorec bzh56420@yahoo.fr 2013-11-03 -->
<HTML LANG="fr">
<HEAD>
<TITLE>JMRI: Panel Help</TITLE>
<META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=iso-8859-1">
<META CONTENT="Bob Jacobsen" NAME="Author">
<META NAME="keywords" CONTENT="JMRI help Panel">

<!-- Style -->
<META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=iso-8859-1">
<LINK REL="stylesheet" TYPE="text/css" HREF="/css/default.css"
	MEDIA="screen">
<LINK REL="stylesheet" TYPE="text/css" HREF="/css/print.css"
	MEDIA="print">
<LINK REL="icon" HREF="/images/jmri.ico" TYPE="image/png">
<LINK REL="home" TITLE="Home" HREF="/">
<!-- /Style -->
</HEAD>

<BODY>
<!--#include virtual="/Header" -->
  <div class="nomenu" id="mBody">
    <div id="mainContent">

<H1>Mandat</h1>

Un Mandat est une collection d'informations suffisantes pour ex&#233;cuter un train automatis&#233;.
Il fixera les aiguillages pour un itin&#233;raire sp&#233;cifi&#233;e et conduire le train sur l'itin&#233;raire.
Lors de l'ex&#233;cution, en utilisant la d&#233;tection d'occupation du canton et de la configuration de signal, il
faire un meilleur effort pour commande la vitesse en fonction de l'aspect des signaux et maintenir le mouvement jusqu'&#224; ce que les
conditions d'occupation soient claires en avant.
Un Mandat JMRI est &#233;vocateur de ce qu'un Mandat fait sur un chemin de fer mod&#232;le, mais
il n'y a aucune intention de reproduire un mode particulier d'op&#233;ration de chemin de fer
. Elle est tout simplement l'id&#233;e de donner &#224; un syst&#232;me automatis&#233; le droits de circulation des trains pour
se d&#233;placer du point A au point B.
<p>
<b>Mandat</b>est d&#233;pendant de la description pr&#233;cise du r&#233;seau en termes de
<b>Ocantons</b>, <b>Portails</b>et <b>OChemins </b>. Ces &#233;l&#233;memts sont
cr&#233;&#233;s en utilisant les <b>Tableaux Canton d'Occupation</b>que vous trouverez sous
les menus <b>Outils</b>dans la fen&#234;tre PanelPro ou le menu de Commande du Panneau &#201;diteur <b>Ajouter les &#201;l&#233;ments</b>. En outre, ils peuvent &#234;tre cr&#233;&#233;s en utilisant les options de menu sous le Menu <b>Constructeur de Circuit</b>de l'&#201;diteur du Panneau de configuration</b>. Leurs d&#233;finitions
et comment les utiliser sont d&#233;crits dans
<a href="OBlockTable.shtml">les Tableaux Canton d'Occupation</a>.
<p>
Il peut &#234;tre plus facile de d&#233;finir <b>Ocantons</b>, <b>Portails</b>et <b>OChelins</b>&#224; l'aide de l'outil
<b>Constructeur de Circuit</b>trouv&#233; dans l'&#201;diteur de Panneau de Commande. Le Constructeur de Circuit
est un outil interactif qui cr&#233;e graphiquement Ocantons , Portails et chemins. le Constructeur de Circuit va aussi convertir les segments de voie et les ic&#244;nes d'aiguillages de votre r&#233;seau en ic&#244;nes
Indicatrices de voie et Indicatrices d'Aiguillage. Ces ic&#244;nes s'affichent en couleur l'
&#233;tat du Ocanton qu'ils repr&#233;sentent-si le circuit de voie du Ocanton est
occup&#233; ou non, si un Mandat l'a allou&#233; ou si un train
sous Mandat actuellement se d&#233;place sur le circuit. Le <b>Constructeur de Circuit</b>
est accessible sous le Menu <b>Constructeur de Circuit</b>de l'&#201;diteur du Panneau de Commande.
Des Instructions pour l'utilisation figurent dans
 <a href="..\display\CircuitBuilder.shtml">Le Constructeur de Circuit </a>.
</p>
</p>

<H2>Cr&#233;ation d'un Mandat</h2>
Afin de cr&#233;er un <b>Mandat</b>, vous devez d'abord avoir cr&#233;&#233; deux ou plusieurs Ocantons.
Ces cantons n'ont pas &#224; &#234;tre enti&#232;rement d&#233;finis, mais leur existence indique que vous &#234;tes
int&#233;ress&#233;s par l'utilisation d'unMandat.
Lorsque deux ou plusieurs Ocantons existent
l'&#233;diteur de panneau affichera un menu <b>Mandat</b> avec quatre
&#233;l&#233;ments de menu. Sinon, ce menu ne s'affiche pas. Les &#233;l&#233;ments du menu d'option sont:
<ul>
        <li><b>Liste Mandat</b>:-Ouvre un tableau de Mandat &#224; partir duquel vous
        pouvez contr&#244;ler les itin&#233;raires des Mandats et les trains exp&#233;di&#233;s.</li>
        <li><b>Modifier Mandat...</b>:-Affiche la liste des Mandats existants.
        La S&#233;lection d'une va ouvrir une fen&#234;tre d'&#233;dition des Mandats. L'utilisation de cette fen&#234;tre est expliqu&#233;e dans<A HREF="WarrantTable.shtml"> Cr&#233;er et &#233;diter des bons de souscription</A>.</Li>
        <li><b>Cr&#233;er un nouveau Mandat </b>:-Apr&#232;s avoir fourni les noms syst&#232;me et utilisateur de celle*ci
ouvre une fen&#234;tre d'&#233;dition d' un Mandat en blanc pour cr&#233;er un nouveau Mandat. Les
        op&#233;rations de ce cadre sont discut&#233;s dans<a HREF="WarrantTable.shtml"> Cr&#233;er et &#233;diter des bons de souscription</A>.</Li>
<li><b>Suivi des trains</b>:-Ouvre la fen&#234;tre o&#249; l'identit&#233; des trains peut &#234;tre
affich&#233;e quand ils se d&#233;placent d'un canton d'occupation &#224; l'autre.</li>
</ul>

<H2>Fonctions d'un Mandat</h2>

<H3>Cr&#233;ation d'itin&#233;raires</h3>
Un itin&#233;raire de Mandat est une s&#233;rie de chemins de canton reli&#233;s entre eux de mani&#232;re &#224; ce qu'un train
puisse se d&#233;placer &#224; travers. Un itin&#233;raire de Mandat est cr&#233;&#233; en choisissant d'abord un <b>
canton d'origine</b>, un chemin de d&#233;part et un portail pour quitter le canton originaire. Ensuite un
<b>canton destination</b> est choisi et un chemin sur lequel finir l'itin&#233;raire. Les cantons
sont choisis soit en tapant le nom du canton ou en le faisant glisser &#224; partir d'un affichage d'un Tableau
Ocanton. Un algorithme d'ordinateur d&#233;termine tous les cantons interm&#233;diaires et les chemins pour faire le trajet. Vous avez des options pour inclure ou &#233;viter des cantons sp&#233;cifi&#233;s dans l'itin&#233;raire.
<a HREF="WarrantTable.shtml"> Cr&#233;ation et &#233;dition de bons de souscription</A> a plus
d'informations sur la cr&#233;ation d'itin&#233;raires.</p>

<H3>Script pour l'Action du Train</h3>
La deuxi&#232;me partie d'un Mandat sont les commandes du r&#233;gulateur pour commander le train qui traverse l'itin&#233;raire. Ceci est fait en mettant un r&#233;gulateur &#224; l'&#233;cran en mode <i>apprentissage</i> qui enregistre toutes les commandes de r&#233;gulateur que vous faites lorsque vous conduisez le train sur l'itin&#233;raire. Ce script peut alors
&#234;tre rejou&#233; pour conduire le train automatiquement. Toutes les fonctions possibles du r&#233;gulateur peuvent &#234;tre enregistr&#233;es
et lues.

<H3>Personnalisation du Script</h3>
Le script peut &#234;tre modifi&#233; pour modifier les commandes enregistr&#233;es.Des &#233;v&#233;nements non r&#233;gulateur suppl&#233;mentaires
peuvent &#234;tre ajouter au script tel que le d&#233;clenchement ou la r&#233;ponse &#224; des capteurs externes.
<a HREF="WarrantTable.shtml"> Cr&#233;ation et &#201;dition de Mandat</A> contient plus
informations sur la cr&#233;ation et la personnalisation des scripts.</p>


<H2>Utilisation de la Liste des Mandats </h2>
L'&#233;l&#233;ment <b>Liste Mandat </b> du menu ouvre le <b>Tableau Mandat</b>. Chaque ligne est un
Mandat qui a &#233;t&#233; cr&#233;&#233; et enregistr&#233;. Les itin&#233;raires des Mandats  peuvent &#234;tre attribu&#233;s, &#224; savoir r&#233;serv&#233;s
pour ce Mandat, les aiguillages pour l'itin&#233;raire peuvent &#234;tre d&#233;finis et lorsque le Mandat est ex&#233;cut&#233;, son statut est repr&#233;sent&#233; et command&#233; en utilisant les colonnes de la table.

<H3>Colonnes dans le Tableau Mandat</h3>
<ul>
        <li><b>Mandat</b>:-Le nom du Mandat</li>
        <li><b>Itin&#233;raire</b>:-Le parcours du Mandat est r&#233;pertori&#233; dans une liste d&#233;roulante
en cliquant sur la cellule du tableau</li>
        <li><b>Nom de train</b>:-L'identification du train , comme indiqu&#233; dans la Liste. Cette cellule peut &#234;tre
&#233;dit&#233;e et son contenu est affich&#233; par lic&#244;ne indicatrice de voie lorsque le train
occupe le Ocanton. (Les Menu contextuel d'&#233;dition d'Ic&#244;nes Indicatrice de Voie ont une case &#224; cocher
pour activer cette fonction)</li>
        <li><b>Adresse DCC</b>:-L'adresse DCC de la locomotive ou du couplager. Cette cellule peut
&#234;tre modifi&#233;e pour correspondre &#224; la puissance actuelle de la motrice du train.</li>
        <li><b>Allouer</b>:-Un bouton qui se r&#233;serve l'itin&#233;raire pour le Mandat. Les Ic&#244;nes Indicatrices de Voie s'affichent en vert pour indiquer l'itin&#233;raire.</Li>
        <li><b>Lib&#233;rer</b>:-Un bouton qui supprime la r&#233;servation pour le Mandat</li>
        <li><b>D&#233;finir</b>:-Un bouton qui alloue et d&#233;finit les aiguillages pour l'itin&#233;raire du Mandat</li>
        <li><b>Ex&#233;cuter</b>:-Un bouton qui ex&#233;cute le train sur la route en fonction des commandes du r&#233;gulateur automatis&#233;. La vitesse consign&#233;e du train sera modifi&#233; en
fonction de l'occupation et des aspects des signaux rencontr&#233;s sur l'itin&#233;raire. Les Ic&#244;nes Indicatrices de voie affichent la position actuelle du train avec une couleur bleue.</li>
        <li><b>Commande/Statut</b>:-L'&#233;tat du Mandat est montr&#233;. Il a &#233;galement une zone de liste d&#233;roulante qui permet d'envoyer les commandes suivantes pour un train.
<b><i>Remarque</b>: Cette colonne a deux fonctions-Les messages d'&#233;tat et boutons de commande.</I>
        <ul>
        <li><b>Halte</b>- suspend momentan&#233;ment le train et suspend l'ex&#233;cution du
script de commande du r&#233;gulateur</li>
<li><b>CV</b>-Rampes jusqu'&#224; la vitesse du train &#224; son ancien niveau et
red&#233;marre le script de commande du r&#233;gulateur
<li><b>Re-Essai</b>-R&#233;p&#232;te le test pour savoir si un aspect du signal a chang&#233; ou
un canton occup&#233; l'avant a &#233;t&#233; lib&#233;r&#233;. ( Occasionnellement un changement de capteur peut &#234;tre
manqu&#233; en raison d'un court-circuit ou d'un dysfonctionnement du mat&#233;riel. Ce nouveau test peut permettre &#224; un train arr&#234;t&#233; de continuer.)
<li><b>Abandonner</b>-. Abandonner le script et lib&#233;rer le Mandat</li>
</ul>
        <li><b>Modifier</b>:-Un bouton qui ouvre une fen&#234;tre d'&#233;dition pour le Mandat,</li>
        <li><b>Supprimer </b>: -. Un bouton qui supprime le Mandat</li>
</ul></p>

<H3>Cr&#233;ation NX bons de souscription</h3>
Le Mandat d'un canton d'entr&#233;e &#224; un canton de sortie peut &#234;tre cr&#233;&#233; "&#224; la vol&#233;e " en utilisant la touche
<b>G&#233;n&#233;rer un Mandat NX </b>au plus bas
&#224; gauche de la table de liste deMandat. Cette fonctionnalit&#233; est particuli&#232;rement utile pour prendre des trains en circulation ou &#224; l'arr&#234;t sur le r&#233;seau visible pour et de la coulisse
<p>
Ce bouton ouvre une fen&#234;tre o&#249; les cantons d'occupation peuvent &#234;tre sp&#233;cifi&#233;s pour les cantons d'<b>origine</b>, de <b>destination</b>, <b>Via</b> et <b>&#201;vitez</b>. En cliquant sur l'Ic&#244;ne 
Indicatrice de voie d'un canton va ins&#233;rer le nom du canton dans les champs de texte du canton. Le
<i>premier clic</i>d&#233;finit le canton d'origine canton, le <i>second clic</i>le canton de destination,
le <i>troisi&#232;me</i> de Via le canton et le <i>quatri&#232;me</i> &#201;vitez le canton. Cette s&#233;quence est
r&#233;p&#233;t&#233; par module de 4. <a HREF="WarrantTable.shtml"> Cr&#233;ation et &#201;dition du Mandat</A>. contient plus
d'informations sur la cr&#233;ation d'itin&#233;raire.</p>
<p>
L' <b>adresse</b>, <b>vitesse</b> et <b>direction</b> de la machine sont &#233;galement situ&#233;s dans cette fen&#234;tre.
En appuyant sur le bouton 
<b>Ex&#233;cuter Mandat NX</b>calcule l'itin&#233;raire et dirige le train adress&#233;e &#224; la vitesse et la direction sp&#233;cifi&#233;es.</p>

<H2>Suivi des Trains</h2>
Le quatri&#232;me &#233;l&#233;ment du menu du Mandat sp&#233;cifi&#233;e ouvre le <b>Tableau Suivi</b>. En appuyant sur le bouton <b>Nouveau Suivi</b>  dans la fen&#234;tre suivante s'ouvre une bo&#238;te de dialogue pour entrer le nom du train et le Ocanton qu'il occupe. Presser le bouton cr&#233;e une ligne dans le tableau de suivi. La ligne indique le nom du train et le canton
qu'il occupe actuellement et le temps qu'il a occup&#233; le canton. Comme le train se d&#233;place d'
canton &#224; l'autre, ce statut est mis &#224; jour. L'Ic&#244;nes Indicatrice de voie peut afficher le nom du train.
<ul>
<b>Remarque :</b>Le menu contextuel <b>Modifier Ic&#244;ne</b> ouvre une bo&#238;te de dialogue pour que l'Ic&#244;ne Indicatrice de voie
a une boite a cocher<b>Affichage du nom du train lorsqu'il est occup&#233;</b> pour s&#233;lectionner d'afficher du texte pour le
Suivi du train ou d'une Mandat en cours d'ex&#233;cution.
</ul>
La fen&#234;tre dispose &#233;galement d'un bouton pour <b>Actualiser lees Infos du Suivi</b> pour interroger les suivis cot&#233;s dans le Tableau Suivi et un bouton <b>Choix Ocanton </b>pour afficher une liste de choix.</P>
<p>
L'emplacement du train peut &#234;tre r&#233;gl&#233; en tapant, en faisant glisser le nom du canton depuis la liste d&#233;roulante, ou en
cliquant sur une Ic&#244;ne Indicatrice de voie sur le panneau.</p>

<H2>Utilisation des Mandats dans Logix</h2>
Plusieurs des op&#233;rations qui peuvent &#234;tre faites &#224; partir de la liste des mandats et du cadre d'&#233;dition des bons de souscription
peut &#234;tre fait avec Conditionals Logix. Vous pouvez concevoir et mettre en &#339;uvre le panneau d'un r&#233;partiteur
en utilisant les variables d'&#233;tat des Mandats et les actions trouv&#233;es dans Logix.

<H3>Variables d'&#233;tat Mandat</h3>
Lorsqu'un mandat a &#233;t&#233; attribu&#233; ou est en cours, les variables d'&#233;tat suivantes peuvent &#234;tre test&#233;es
dans une condition Logix.
<ul>
        <li><b>Itin&#233;raire libre</b>:-Vrai lorsque tous les cantons dans l'itin&#233;raire du mandat ne sont pas affect&#233;s
        &#224; d'autres et ne sont pas occup&#233;s. Faux sinon.</Li>
        <li><b>Itin&#233;raire D&#233;fini</b>:-Vrai lorsque tous cantons dans l'itin&#233;raire du mandat sont attribu&#233;s et les
        aiguillages fix&#233;s pour ce mandat. Faux sinon.</Li>
        <li><b>Acheminement Attribu&#233;</b>:-Vrai lorsque tous cantons dans l'itin&#233;raire du mandat sont attribu&#233;s
        &#224; ce mandat. Faux sinon.</Li>
        <li><b>Itin&#233;raire occup&#233;</b>:-Vrai si aucun des cantons dans la voie du mandat, autre
        que l'origine canton , sont occup&#233;s. (En supposant le train de ce mandat occupe
        le canton d'origine). Faux sinon.</li>
        <li><b>Circulation du Train</b>:-Vrai lorsque le train pr&#233;cis&#233; dans le mandat est ex&#233;cut&#233;
        soit en mode d'apprentissage ou en mode d'ex&#233;cution automatique. Faux sinon.</Li>
</ul>

<H3>Actions Mandat</h3>
<ul>
        <li><b>Allouer mandat Itin&#233;raire</b>:-Alloue l'itin&#233;raire &#224; ce mandat</li>
        <li><b>D&#233;sallouer Mandat</b>:-lib&#232;re l'itin&#233;raire de ce mandat (seulement). Ce ne sera pas
         la lib&#233;ration de l'itin&#233;raire d'un mandat diff&#233;rent.</li>
        <li><b>D&#233;finir Aiguillages d'Itin&#233;raire</b>:-D&#233;finit les signaux et les aiguillages de l'itin&#233;raire aussi loin dans l'
         itin&#233;raire qu'il peut jusqu'&#224; ce qu'il atteigne une canton occup&#233; ou un canton allou&#233; &#224; un autre
         mandat.</li>
        <li><b>Train Auto Run</b>:-Ex&#233;cutez les commandes de r&#233;gulateur du train dans le mandat. Ceci
         devrait &#234;tre effectu&#233; uniquement lorsque le train occupe le canton d'origine.</li>
        <li><b>D&#233;finir ID Train</b>:-D&#233;finir le couplage de machine devant &#234;tre utilis&#233; depuis une ID Train depuis la Liste de Locomotives. Sinon, l'adresse DCC peut &#234;tre utilis&#233; pour identifier la machine.</Li>
        <li><b>D&#233;finir le Nom du Train</b>:-D&#233;finissez le nom du train &#224; afficher dans le marqueur loco
         indiquant la position actuelle du train lors de l'ex&#233;cution.</li>
        <li><b>Commandes Train</b>:-Envoyer une commande de contr&#244;le ( <b>Halt</b>, <b>CV</b>ou
        <b>Abort )</b>pour un train fonctionnant sous mandat.</li>
        <li><b>D&#233;finir Facteur R&#233;giulateur</b>:-D&#233;finir un multiplicateur pour le r&#233;glage du r&#233;gulateur enregistr&#233;e.
         Lorsque la machine ou le couplage de train est modifi&#233;e, plus ou moins de puissance peut &#234;tre n&#233;cessaire.</Li>
</ul>
<br>

<!-# include virtual = " / Pied de page " ->
</BODY>
</HTML>

