<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01//EN"
"http://www.w3.org/TR/html4/strict.dtd">
<!-- Translated by Herv&#233; Blorec bzh56420@yahoo. fr 2013-11-03 -->

<html lang="en">
<head>
  <meta name="generator" content=
  "HTML Tidy for Mac OS X (vers 31 October 2006 - Apple Inc. build 15.17), see www.w3.org">

  <title>JMRI: Panel Editor Help</title>
  <meta name="author" content="Pete Cressman">
  <meta name="keywords" content="JMRI help Panel Editor">
  <!-- Style -->
  <meta http-equiv="Content-Type" content=
  "text/html; charset=us-ascii">
  <link rel="stylesheet" type="text/css" href="/css/default.%20css"
  media="screen">
  <link rel="stylesheet" type="text/css" href="/css/print.%20css"
  media="print">
  <link rel="icon" href="/images/jmri.%20ico" type="image/png">
  <link rel="home" title="Home" href="/">
  <!-- /Style -->
</head>

<body>
  <!--#include virtual="/Header" -->
<div class="nomenu" id="mBody">
    <div id="mainContent">

      <h1>Cr&eacute;ation et &Eacute;dition de Mandat</h1>Un mandat
      contient les informations n&eacute;cessaires pour faire
      fonctionner un train. Cela comprend l'adresse de la
      locomotive DCC (s), l'itin&eacute;raire que le train
      empruntera, les r&eacute;glages aiguillages &agrave; travers
      l'itin&eacute;raire et les commandes de r&eacute;gulateur
      &agrave; utiliser &agrave; diff&eacute;rents points le long
      de la route-par exemple les vitesse, quand afficher
      lumi&egrave;res, klaxons sonores , cloches ou d'autres effets
      sonores.

      <div style="margin-left: 2em">
        <b>Remarque:</b> Le Mandat ne peut &ecirc;tre
        cr&eacute;&eacute; si la configuration PanelPro
        pr&eacute;sente moins deux OCantons d&eacute;finis.
      </div>Il y a trois &eacute;tapes dans la cr&eacute;ation d'un
      mandat, 1. d&eacute;finir l'itin&eacute;raire; 2.
      s&eacute;lectionner un train, et 3. enregistrer les commandes
      de r&eacute;gulateur.

      <h2>D&eacute;finir un Itin&eacute;raire
      Mandat&eacute;</h2>Les Itin&eacute;raires sont
      cr&eacute;&eacute;s en utilisant l'onglet <b>D&eacute;finir
      Itin&eacute;raire</b> dans la fen&ecirc;tre d'&eacute;dition
      des Mandats.P&gt;

      <h3>Origine,Destination, Via et &Eacute;viter les
      Cantons</h3>Le Canton d'Origine est &eacute;videmment
      o&ugrave; un train donn&eacute; va commencer cet
      Itin&eacute;raire et le chemin de d&eacute;marrage dans le
      bloc d'origine est la voie c'est sur-par exemple un chemin
      nomm&eacute; " D&eacute;part Voie n&deg;3" dans le Canton
      nomm&eacute; "Terminal Principal". Choisir le portail de la
      voie , par exemple le portail "Approche Ouest &agrave; # 3",
      o&ugrave; le train doit quitter le canton d'origine
      d&eacute;termine la direction du train sur
      l'itin&eacute;raire. Un algorithme informatique saura trouver
      les portails, les chemins et les cantons n&eacute;cessaires
      pour amener le train au canton de destination et le
      chemin-par exemple "Piste d'arriv&eacute;e n&deg;1 " dans le
      canton de destination.

      <p>Un itin&eacute;raire de mandat est cr&eacute;&eacute;e en
      s&eacute;lectionnant le canton et le chemin o&ugrave; le
      train va commencer son voyage et le portail par lequel il
      doit partir. Ensuite, vous s&eacute;lectionner le portail, le
      canton, le chemin et l'entr&eacute;e du portail o&ugrave; le
      train doit mettre fin &agrave; son voyage. Appuyez sur le
      bouton <b>Calculer l'itin&eacute;raire</b> et le l'ordinateur
      va d&eacute;terminer tous les chemins interm&eacute;diaires
      n&eacute;cessaires pour faire le voyage.</p>

      <div style="margin-left: 2em">
        <b>NOTE:</b> dans la partie sup&eacute;rieure droite de la
        fen&ecirc;tre Cr&eacute;er/modifier Cadre des mandats il y
        a un tableau r&eacute;pertoriant tous les OCantons que vous
        avez d&eacute;finis. Soit le nom syst&egrave;me ou
        utilisateur du canton peuvent &ecirc;tre gliss&eacute;s et
        d&eacute;pos&eacute;s dans les cantons de localisation sur
        le c&ocirc;t&eacute; gauche sup&eacute;rieur du cadre.
      </div>

      <ul>
        <li>
          <b>Emplacement d'Origine</b> :-se compose d'un champ de
          texte pour le <b>Nom Cantons</b> d'origine, un menu
          d&eacute;roulant pour s&eacute;lectionner le <b>Nom du
          Chemin</b> de d&eacute;part et un menu d&eacute;roulant
          pour s&eacute;lectionner le Nom du portail de sortie .

          <div style="margin-left: 2em">
            Le canton peut avoir plusieurs chemins et le chemin par
            d&eacute;faut montr&eacute; n'est peut-&ecirc;tre pas
            celui o&ugrave; vous comptiez voir le train de
            d&eacute;marrer. En outre, puisque les chemins ont
            g&eacute;n&eacute;ralement deux portails, le portail de
            sortie montr&eacute; n'est peut-&ecirc;tre pas celui
            que le train doit traverser lorsqu'il quitte le canton
            d'origine.
          </div>Le R&eacute;glage du Portail de Sortie
          d&eacute;termine la direction que le train va prendre .
          Il n'est plus n&eacute;cessaire d'indiquer la direction,
          puisque l'algorithme ne fournira que des
          itin&eacute;raires qui partent dans cette
          direction.li&gt;
        </li>

        <li>
          <b>Emplacement de Destination</b> :-Se compose d'un champ
          de texte pour le <b>Nom Canton</b> de destination et un
          menu d&eacute;roulant pour le <b>Nom du Chemin</b>
          terminal et un menu d&eacute;roulant pour
          s&eacute;lectionner le Nom du Portail d'entr&eacute;e .

          <div style="margin-left: 2em">
            Comme ci-dessus le canton peut avoir plusieurs chemins
            et le chemin o&ugrave; vous comptez voir le train de
            finir son parcours doit &ecirc;tre
            sp&eacute;cifi&eacute;. Il est important de
            pr&eacute;ciser le Portail d'entr&eacute;e de la
            destination. Ceci est n&eacute;cessaire quand le
            r&eacute;seau &agrave; une boucle de retournement
            permettant la voie de s'inscrire &agrave; partir de
            chaque extr&eacute;mit&eacute;. <i>Une erreur commune
            est o&ugrave; aucune route ne sera trouv&eacute;e est
            de sp&eacute;cifier un portail d'entr&eacute;e ou un
            chemin qui ne peut pas &ecirc;tre atteint par la
            direction prise au moment de quitter le Canton
            d'origine.</i>
          </div>

          <div style="margin-left: 2em">
            <b>Remarque :</b> lorsque un chemin est choisi, seuls
            les Portails de ce chemin sont affich&eacute;s dans
            l'les menus d&eacute;roulants des Portails
            d'entr&eacute;e et de Sortie. Ainsi, m&ecirc;me si le
            canton peut avoir de nombreux portails, vous ne verrez
            au plus que deux portails.
          </div>
        </li>

        <li><b>Via le Lieu</b> :-Se compose d'un champ de texte
        pour un canton le <b>Via Nom</b> et un menu
        d&eacute;roulant pour le <b>Nom du chemin</b> .
        Typiquement, il n'est pas n&eacute;cessaire d'entrer un nom
        de canton dans ce champ , car il est probable que
        l'algorithme d&eacute;tecte l'itin&eacute;raire que vous
        voulez. Cette entr&eacute;e est utilis&eacute;e quand il y
        a beaucoup d'itin&eacute;raires possibles de l'origine
        &agrave; la destination et que vous voulez seulement
        examiner les routes traversant un chemin particulier sur ce
        canton.</li>

        <li><b>&Eacute;viter Lieu</b> :-Se compose d'un champ de
        texte pour un canton le <b>&Eacute;vitez Nom</b> et un menu
        d&eacute;roulant pour l' <b>Nom du chemin</b> .
        Typiquement, cette entr&eacute;e est utilis&eacute;e quand
        il y a beaucoup itin&eacute;raires possibles de l'origine
        &agrave; la destination et que vous voulez seulement
        envisager les itin&eacute;raires qui ne passent pas par un
        chemin particulier sur ce canton.</li>

        <li style="list-style: none">Plus d'informations sur
        <b>OBCantons</b> , <b>Portails</b> et <b>OChemins</b> est
        disponible&agrave; l'adresse <a href=
        "OBlockTable.%20shtml">les Tableaux Cantons
        d'occupation</a>.

          <h3>Calculer et d&eacute;boguer</h3>Apr&egrave;s que les
          cantons et les chemins d'origine et de destination aient
          &eacute;t&eacute; choisis, appuyez sur le bouton
          <b>calculer Itin&eacute;raire</b> . La zone de texte
          "Recherche d'Itin&eacute;raire" affichera des
          statistiques sur le nombre de d'itin&eacute;raires et
          leur longueur en cantons qui ont &eacute;t&eacute;
          trouv&eacute;s lors de la recherche d'itin&eacute;raires.
          Le champ de texte " Nombre maximum de cantons dans
          l'itin&eacute;raire " limite jusqu'o&ugrave; l'ordinateur
          se penchera pour calculer les itin&eacute;raires. Le
          bouton <b>arr&ecirc;t</b> terminera la recherche d'
          itin&eacute;raires.

          <p>Apr&egrave;s que le bouton d'arr&ecirc;t ait
          &eacute;t&eacute; press&eacute; ou que l'ordinateur ait
          &eacute;puis&eacute; tous les iitin&eacute;raires qu'il a
          trouv&eacute; et leurs longueurs. Choisir un
          itin&eacute;raire en appuyant sur son bouton radio.
          Appuyant sur le bouton <b>Revoir</b> affichera pour vous
          pour l'examiner dans le Tableau Itin&eacute;raire. Chaque
          canton, chemin et portails utilis&eacute;s pour parcourir
          l'itin&eacute;raire est affich&eacute;.</p>Vous pouvez
          contr&ocirc;ler toutes les itin&eacute;raires de cette
          mani&egrave;re. Le choix d'un itin&eacute;raire en
          appuyant sur le bouton <b>S&eacute;lectionnez</b> fermera
          le dialogue et mettra en place l'onglet <b>Script
          Enregistrement/Lecture</b> . Si exactement une voie est
          trouv&eacute;e, la bo&icirc;te de dialogue liste est
          ignor&eacute;e.

          <p>fr&eacute;quemment, plus d'un itin&eacute;raire sera
          trouv&eacute; et la liste peut &ecirc;tre tr&egrave;s
          longue - Surtout quand la route est une
          r&eacute;p&eacute;tition en boucle. Si la liste est trop
          longue, il ya plusieurs fa&ccedil;ons pour pouvoir
          restreindre le nombre d'itin&eacute;raires
          trouv&eacute;s.</p>

          <ul>
            <li>1. Sp&eacute;cifiez un nombre maximal de cantons
            &agrave; utiliser dans un itin&eacute;raire en entrant
            un nombre dans le <b>Nombre Max de Cantonss dans
            Itin&eacute;raire</b> . L'ordinateur listera seulement
            les itin&eacute;raires avec ce nombre ou moins de
            cantons</li>

            <li>2. Sp&eacute;cifiez un canton interm&eacute;diaire
            <b>Via Emplacement</b> et le chemin qui doit &ecirc;tre
            inclus dans l'itin&eacute;raire. L'ordinateur calcule
            l'itin&eacute;raire avec cette restriction" doit
            inclure " et vous pr&eacute;senter uniquement des
            parcours &agrave; travers le canton "Via"
            sp&eacute;cifi&eacute; et le chemin.li&gt;</li>

            <li>3. Sp&eacute;cifiez un canton <b>&Eacute;vitez
            Emplacement</b> et le chemin qui ne doit pas &ecirc;tre
            sur la route. L'ordinateur n'&eacute;num&eacute;rera
            pas tous les itin&eacute;raires contenant ce canton et
            chemin "doivent &eacute;viter"</li>
          </ul>

          <p>Parfois, le message "Pas d'itin&eacute;raires
          trouv&eacute;s depuis le Canton d'Origine, chemin. . "etc
          s'affiche. R&eacute;pondre <b>Oui</b> &agrave; la
          question, "Afficher l'arbre de recherche ?" ouvrira une
          fen&ecirc;tre avec une description graphique de tous les
          chemins commen&ccedil;ant sur le canton Origine, chemin
          et portail de sortie. Trace que vous pourrez croire
          &agrave; un itin&eacute;raire probable en cliquant sur
          les n&oelig;uds. Chaque n&oelig;ud est un bloc de chemin
          et affichera son chemin et le nom du canton et les
          portails d'entr&eacute;e et de sortie qu'il utilise. A la
          fin de chaque branche, le n&oelig;ud feuille sera le
          point o&ugrave; l'itin&eacute;raire ne pouvait pas
          continuer. Normalement, ces feuilles sont des
          embranchements. Cependant, ce sont aussi les endroits
          o&ugrave; vous pouvez trouver une erreur ou omission que
          vous avez faite lors de la d&eacute;finition des
          OCantons, OChemins et portails. Comme vous tracez les
          tentatives d'itin&eacute;raires, vous pouvez constater
          que vous avez oubli&eacute; de saisir un chemin ou mal
          &eacute;tiquet&eacute; un portail correct pour un chemin.
          <i>Une erreur courante consiste &agrave; sp&eacute;cifier
          incorrectement le portail qui doit &ecirc;tre
          utilis&eacute; pour quitter le canton de d&eacute;part ou
          pour entrer dans le canton de destination.</i></p>

          <p>Lorsque vous &ecirc;tes satisfait de
          l'itin&eacute;raire, s&eacute;lectionnez l'onglet
          <b>Script d'enregistrement/lecture</b> .</p>

          <h2>Enregistrement et modification d'un
          Script</h2>L'enregistrement d'un script est fait &agrave;
          partir de l'onglet <b>Enregistrement/Lecture de
          Script</b> . Les boutons radio de cet onglet vous
          permettent de s&eacute;lectionner soit par
          l'itin&eacute;raire ou le tableau de commande du
          r&eacute;gulateur . Le Tableau Itin&eacute;raire montre
          les circuits de voie (OCantons, Portails et chemins) que
          le mandat d&eacute;finit. Le Tableau de Commande du
          R&eacute;gulateur montre chaque commande du
          r&eacute;gulateur qui est enregistr&eacute;e en "Mode
          d'Apprentissage". Apr&egrave;s l'enregistrement, le
          tableau peut &ecirc;tre modifi&eacute;. Des
          &eacute;l&eacute;ments suppl&eacute;mentaires sur cet
          onglet vous permettent de choisir la machine avec la
          puissance n&eacute;cessit&eacute;e par votre train et de
          tester et de modifier le script enregistr&eacute;.

          <h3>Choisir un Train</h3>Le champ <b>Nom Train</b> est
          utilis&eacute; pour fournir un nom qui peut &ecirc;tre
          affich&eacute; par l'Ic&ocirc;ne indicatrice de Voie
          quand le train se d&eacute;place le long du parcours du
          mandat. Si vous avez d&eacute;fini une liste de
          locomotives JMRI, les noms des trains sont
          affich&eacute;s dans la bo&icirc;te d&eacute;roulante
          <b>Liste des Machine</b> . La s&eacute;lection d'un nom
          de cette liste remplira des champs de texte <b>Nom
          Train</b> et <b>Adresse</b> et les affectera au mandat.

          <p>Une adresse DCC tap&eacute; dans le champ texte
          <b>Adresse</b> sera utilis&eacute; si oui ou non il se
          trouve dans l' Liste des Locomotives JMRI.</p>

          <h2>Mode d'apprentissage</h2>Les Commandes du
          R&eacute;gulateur sont cr&eacute;&eacute;es en
          enregistrant les commandes que vous envoyez &agrave; un
          train tout en op&eacute;rant manuellement &agrave; partir
          d'un r&eacute;gulateur &agrave; l'&eacute;cran dans
          <b>Mode Apprentissage</b> .

          <h3>R&eacute;gulateur en Mode Apprentissage</h3>Si un
          train a &eacute;t&eacute; assign&eacute;, c'est qu'il
          poss&egrave;de une adresse DCC valide dans le mandat,
          puis un r&eacute;gulateur peut &ecirc;tre acquis en
          appuyant sur la touche <b>D&eacute;marrer</b> . Cet
          acc&eacute;l&eacute;rateur actionnera le train et toutes
          les commandes r&eacute;gulateur seront
          enregistr&eacute;es jusqu'&agrave; ce que le bouton
          <b>Arr&ecirc;t</b> soit press&eacute;.

          <p>Le script apprentissage doit se fairoe avec un
          itin&eacute;raire compl&egrave;tement libre-Tous les
          aiguillages doivent &ecirc;tre r&eacute;gl&eacute;s pour
          l'itin&eacute;raire, tous les cantons inoccup&eacute;s
          (sauf origine), tout les signaux doivent &ecirc;tre
          r&eacute;gl&eacute;s pour une circulation libre et sans
          aucun changement au cours de la p&eacute;riode
          d'enregistrement . Lorsque le train est
          g&eacute;r&eacute; par la lecture du script, tout
          changement de l'aspect des signaux doivent &ecirc;tre
          prisen compte et la vitesse et les
          heuresprogramm&eacute;es devront en tenir compte</p>

          <p>En appuyant sur le bouton <b>Arr&ecirc;t</b> pour
          terminer l'enregistrement.</p>

          <h2>Mode Ex&eacute;cution</h2>En appuyant sur la touche
          <b>AutoRun</b> dans la bo&icirc;te <b>Ex&eacute;cuter
          Train</b> enverront les commandes du r&eacute;gulateur au
          train pr&eacute;cis&eacute; dans le mandat.

          <div style="margin-left: 2em">
            <b>NOTE :</b> Assurez-vous que le train se trouve sur
            le chemin du canton d'origine de l'itin&eacute;raire et
            que la direction de la machine est compatible avec la
            premi&egrave;re direction sp&eacute;cifi&eacute; dans
            les commandes du r&eacute;gulateur.
          </div>La bo&icirc;te <b>Ex&eacute;cuter Train</b> affiche
          chaque canton travers&eacute; par le train durant le
          trajet.

          <p>La d&eacute;tection d'occupation et les commandes
          synchronis&eacute;es &agrave; utiliser pour notifier un
          train quand il entre dans un canton d&eacute;pend d'une
          d&eacute;tection pr&eacute;cise de l'occupation. Si la
          d&eacute;tection d'occupation du r&eacute;seau n'est pas
          fiable , les trains automatis&eacute;s peuvent
          fonctionner avec des cons&eacute;quences inattendues. Les
          trains peuvent attendre ind&eacute;finiment lors d'une
          fausse d&eacute;tection. Le canton protection fait en
          entrant dans un bloc peut &ecirc;tre
          d&eacute;sactiv&eacute;. Les boutons radio suivants
          d&eacute;finissent ceci:</p>

          <ul>
            <li><b>Circuler avec la protection de Canton</b>
            :-Ex&eacute;cute le train avec la d&eacute;tection
            d'occupation lors de l'entr&eacute;e des cantons et des
            fonctions de synchronisation.li&gt;</li>

            <li><b>Circuler avec des cantons &eacute;teints</b>
            :-Le train circule comme d&eacute;crit pour les Cantons
            &Eacute;teints</li>
          </ul>

          <h2>Faire circuler des trains en Automatiques</h2>Les
          commandes du r&eacute;gulateur enregistr&eacute;es
          peuvent &ecirc;tre lues pour conduire le train. Lors de
          l'ex&eacute;cution automatique, une commandle
          suppl&eacute;mentaire du train peut se faire &agrave;
          travers trois choix : <b>Halte</b> , <b>Reprendre</b> et
          <b>Abandonner</b> . Comme le sugg&egrave;re le nom, ces
          commandes arr&ecirc;tent un train en automatique, le
          red&eacute;marrent ou abandonnent les commandes restantes
          du r&eacute;gulateur.

          <p>Bien qu'il existe des op&eacute;rations distinctes
          dans le Tableau Liste Mandats pour r&eacute;server un
          itin&eacute;raire mandat&eacute; (Attribuer) et
          d&eacute;finir les aiguillages et signaux (D&eacute;finir
          Itin&eacute;raire), ces op&eacute;rations n'ont pas
          &agrave; &ecirc;tre faites pour ex&eacute;cuter un train
          automatis&eacute;. Une session <b>AutoRun</b> peut
          commencer sans eux. Le train cherchera les allocation et
          les aiguillages &agrave; mesure qu'il avance sur
          l'itin&eacute;raire. Lors de la confrontation avec un
          canton occup&eacute; , le train va s'arr&ecirc;ter et
          attendre jusqu'&agrave; ce que le canton se
          d&eacute;gage. Lorsque le canton suivant est
          d&eacute;gag&eacute;, mais que le canton au-del&agrave;
          du bloc suivant est occup&eacute;, l' train va
          s'approcher &agrave; vitesse r&eacute;duite. De
          m&ecirc;me, si les portails ont &eacute;t&eacute;
          d&eacute;finis avec des T&ecirc;tes de signalisation ou
          des M&acirc;ts de signalisation prot&eacute;geant les
          cantons qu'ilsijoignent, le train va modifier sa vitesse
          selon l'apparence ou l'aspect du signal. Un train
          automatis&eacute; tentera d'obtenir l'attribution des
          deux cantons suivants chaque fois qu'il entre dans un
          canton. Il v&eacute;rifie &eacute;galement si le canton
          est occup&eacute; par un train inconnu et ne passe pas si
          le canton est occup&eacute;.</p>

          <p>Par mesure de s&eacute;curit&eacute;, chaque fois que
          le train mandat&eacute; a l'autorisation d'entrer dans le
          canton suivant, les aiguillages sont remis &agrave;
          z&eacute;ro. Avoir l'autorisation des signaux signifie
          que la r&eacute;initialisation des aiguillages ne devrait
          pas interf&eacute;rer avec toute la logique de
          verrouillage. En l'absence de signaux, l'occupation ou
          l'affectation &agrave; un autre mandat peuvent aussi
          refuser l'autorisation. C'est la plus restrictive de ces
          trois conditions qui donne au train automatis&eacute; la
          permission de continuer. Quand un tel refus est
          effac&eacute;, le train va se faire automatiquement. La
          seule chose qui l'emporte sur avoir la permission de
          proc&eacute;der est de savoir si l'utilisateur a
          d&eacute;fini la commande "Halte ". Le train ne bougera
          jusqu'&agrave; ce que l'utilisateur d&eacute;finisse "
          Reprendre ".</p>

          <p>Si un mandat est lanc&eacute; et que la canton de
          d&eacute;part n'est pas occup&eacute;, le mandat dera
          attendre jusqu'&agrave; ce que le canton soit
          occup&eacute;. Lorsque survient l'occupation, le mandat
          d&eacute;butera l'ex&eacute;cution aussi il est vital que
          le bon train, c'est &agrave; dire l'adresse
          indiqu&eacute;e dans le mandat, occupe le canton.</p>Le
          champ de texte <b>R&eacute;glage du R&eacute;gulateur</b>
          peut &ecirc;tre utilis&eacute; pour modifier le
          r&eacute;glage du r&eacute;gulateur par un rapport fixe
          pour toutes les commandes de vitesse-ou des commandes
          individuelles peuvent avoir leur r&eacute;glage
          r&eacute;gulateur ou les valeurs de temps
          &eacute;coul&eacute; chang&eacute;es en modifiant la
          table du r&eacute;gulateur.

          <h3>Tableau de Commande R&eacute;gulateur</h3>Le Tableau
          de Commande R&eacute;gulateur poss&egrave;de les colonnes
          suivantes :

          <ul>
            <li><b>ET(ms)</b> :-Le temps &eacute;coul&eacute; en
            millisecondes &agrave; attendre avant d'ex&eacute;cuter
            la commande R&eacute;gulateur.li&gt;</li>

            <li><b>Commande</b> :-La commande R&eacute;gulateur qui
            a &eacute;t&eacute; enregistr&eacute;e (direction,
            vitesse, ou appuyez sur le bouton ou le
            rejet).li&gt;</li>

            <li><b>Valeur</b> :-La valeur de la commande</li>

            <li><b>Canton</b> :-Le Canton du train occup&eacute;e
            lorsque la commande R&eacute;gulateur a
            &eacute;t&eacute; enregistr&eacute;e.li&gt;</li>
          </ul>

          <h3>Synchronisationn des Commandes aux Cantons
          fronti&egrave;res.</h3>Changer le couplage d'un train ou
          peut-&ecirc;tre m&ecirc;me un changement de
          temp&eacute;rature entre l'enregistrement et la lecture,
          peut entra&icirc;ner que le train n'effectue pas une
          commande R&eacute;gulateur au m&ecirc;me endroit sur
          l'itin&eacute;raire o&ugrave; le "Mode Apprentissage" les
          a enregistr&eacute;es pour ce train.

          <p>L'entr&eacute;e dans chaque canton est
          enregistr&eacute;e avec un marqueur "NoOp". Ces marqueurs
          sont utilis&eacute;s pour synchroniser le temps
          &eacute;coul&eacute; pour le fonctionnement automatique
          du train quand il entre dans un canton avec son temps de
          pr&eacute;sence enregistr&eacute;e dans le canton. Les
          commandes de r&eacute;gulateur du canton suivant seront
          retard&eacute;es jusqu'&agrave; ce que le train entre
          dans le canton si le train est arriv&eacute; en retard ,
          ou en sautant le temps &eacute;coul&eacute; et restant si
          le train arrive plus t&ocirc;t que pr&eacute;vu.</p>

          <p>Dans les cas extr&ecirc;mes o&ugrave; la
          synchronisation du bloc peut toujours ne pas &ecirc;tre
          satisfaisante. Vous pouvez &eacute;galement allonger ou
          raccourcir les temps de pr&eacute;sence pour un canton en
          &eacute;ditant les commandes de r&eacute;gulateur.</p>

          <p>Une autre option est d'utiliser le <b>R&eacute;glage
          R&eacute;gulateur</b> pour entrer un rapport pour
          multiplier le R&eacute;glage du R&eacute;gulateur et
          ainsi alimenter plus ou moins.</p>

          <div style="margin-left: 2em">
            <b>NOTE :</b> Le facteur d'ajustement du
            R&eacute;gulateur n'est pas sauvegard&eacute; de
            fa&ccedil;on permanente. La valeur par d&eacute;faut du
            multiplicateur est toujours de 1,0. Chaque fois qu'un
            facteur est voulu, il doit &ecirc;tre entr&eacute;
            manuellement &agrave; chaque fois que le mandat est
            ex&eacute;cut&eacute;.-<b>ou &ecirc;tre
            r&eacute;gl&eacute; par Logix</b> lorsque Logix est
            utilis&eacute; pour d&eacute;finir l'ID train et
            ex&eacute;cuter le mandat. Les commandes de
            r&eacute;gulateur enregistr&eacute;es et
            &eacute;dit&eacute;es sont les r&eacute;glages de base
            pour chaque cycle de mandat. ID Train et Facteur
            R&eacute;gulateur peuvent &ecirc;tre
            r&eacute;gl&eacute;s comme vous le souhaitez pour
            chaque ex&eacute;cution de mandat.
          </div>Si une mani&egrave;re plus pr&eacute;cise est
          n&eacute;cessaire pour avoir un &eacute;v&eacute;nement
          de script se produisant &agrave; un endroit particulier,
          voir la <b>Synchronisation Interne par des
          Ev&eacute;nements Externes</b> ci-dessous.

          <h3>&Eacute;dition des Commandes R&eacute;gulateurs
          Enregistr&eacute;es</h3>Les commandes de
          R&eacute;gulateur enregistr&eacute;es dans le <b>Mode
          Apprentissage</b> peuvent &ecirc;tre modifi&eacute;es ,
          toutefois, des pr&eacute;cautions doivent &ecirc;tre
          prises parce que des changements m&ecirc;me modestes des
          nouvelles commandes lorsqu'elles sontt
          ex&eacute;cut&eacute;es en lecture pourraient causer des
          &eacute;v&eacute;nements dramatiques. Il peut &ecirc;tre
          sage d' r&eacute;- enregistrer les commandes dans une
          nouvelle session de Mode d'Apprentissage si des
          changements importants sont apport&eacute;s.

          <p>Les commandes de r&eacute;gulateur enregistr&eacute;es
          s'ex&eacute;cutent en fonction du temps
          &eacute;coul&eacute; entre les commandes. Le temps
          &eacute;coul&eacute; (colonne ET ) peut &ecirc;tre
          modifi&eacute;, et m&ecirc;me la commande peut &ecirc;tre
          chang&eacute;. Les Lignes peuvent &ecirc;tre
          supprim&eacute;es et des lignes suppl&eacute;mentaires
          ins&eacute;r&eacute;s.</p>

          <p>Les lignes peuvent &ecirc;tre ins&eacute;r&eacute;es
          dans le Tableau Commande R&eacute;gulateur de sorte que
          le train peut d&eacute;finir l'&eacute;tat d'un capteur
          externe ou r&eacute;pondre &agrave; l' &eacute;tat
          &acirc;&euro;&lsaquo;&acirc;&euro;&lsaquo;d'un capteur
          externe. La protection de la circulation discut&eacute;
          dans les sections pr&eacute;c&eacute;dentes et les
          commandes de synchronisation d&eacute;pendent d'une
          d&eacute;tection d'occupation fiable. Si le r&eacute;seau
          est sujet &agrave; avoir de faux signaux de
          d&eacute;tection, alors le d&eacute;roulement
          automatis&eacute; sera insatisfaisant les trains peuvant
          attendre ind&eacute;finiment qu'un train fant&ocirc;me
          lib&egrave;re une occupation ou circule
          ind&eacute;finiment par la non r&eacute;ception d'un
          signal de synchronisation. Le train peut &ecirc;tre
          ex&eacute;cut&eacute; en utilisant les temps
          &eacute;coul&eacute;s entre les commandes et sautez la
          protection de canton mentionn&eacute; ci-dessus &agrave;
          savoir "Circuler avec des Cantons &Eacute;teints".</p>

          <h3>Modification de Commandes
          R&eacute;gulateur</h3>Toutes les colonnes du Tableau de
          Commandes R&eacute;gulateur peuvent &ecirc;tre
          modifi&eacute;es. Peut-&ecirc;tre que vous voulez
          retoucher les planning pour les coups de corne ou pour
          modifier les vitesses. Il suffit d'entrer les
          donn&eacute;es que vous souhaitez. Les valeurs dans le
          Tableau de Commande R&eacute;gulateur sont chang&eacute;s
          en tapant de nouvelles entr&eacute;es dans les cellules
          de la table.

          <p>Des lLignes peuvent &ecirc;tre ins&eacute;r&eacute;es
          ou supprim&eacute;es de la table &agrave; l'aide des
          boutons &agrave; droite de la table. Notez qu'une ligne
          ins&eacute;r&eacute;e a 0 temps &eacute;coul&eacute;
          depuis la pr&eacute;c&eacute;dente commande de sorte que
          vous pouvez ajuster cela en prenant du temps loin de soit
          la pr&eacute;c&eacute;dente ligne ou la ligne suivante et
          entrer dans la ligne ins&eacute;r&eacute;e. Aussi, quand
          une ligne est supprim&eacute;e, son temps
          &eacute;coul&eacute; est ajout&eacute;e &agrave; la
          dur&eacute;e de la ligne suivante. Ce d&eacute;faut de
          temps &eacute;coul&eacute;s pour l'insertion et la
          suppression de lignes sont saisies pour garder le temps
          &eacute;coul&eacute; total constant dans le canton.</p>

          <h3>&Eacute;v&eacute;nements D&eacute;clencheurs Externes
          &agrave; Partir de Scripts</h3>Des animations externes ou
          d'autres &eacute;v&eacute;nements peuvent &ecirc;tre
          d&eacute;clench&eacute;s par la saisie d'une
          commande<i>"D&eacute;finir Capteur"</i>" . Pour ce faire,
          ins&eacute;rer une ligne avec les mots <b>Set Sensor</b>
          dans le Colonne de commande et un nom de capteur valable
          dans la colonne <i>Canton</i>. La colonne <i>valeur</i>
          doit disposer de l'action que vous voulez que le capteur
          prenne au moment de son ex&eacute;cution -temps les mots
          "actif" ou "inactif". Saisir &eacute;galement le temps
          &eacute;coul&eacute; quand d&eacute;clencher le
          r&eacute;glage du capteur. Lors de la lecture lorsque
          cette commande est ex&eacute;cut&eacute;e l'&eacute;tat
          du capteur sera d&eacute;fini.

          <h3>Synchronisation Interne par des
          &Eacute;v&eacute;nements Externes</h3>Une ynchronisation
          suppl&eacute;mentaire peut &ecirc;tre faite dans un
          Canton. Par exemple arr&ecirc;ter un train &agrave; un
          ch&acirc;teau d'eau ou sur un dispositif de
          d&eacute;couplage ou pour une raison quelconque o&ugrave;
          l'utilisation du temps &eacute;coul&eacute; de la
          commande n'est pas assez pr&eacute;cis. Pour ce faire,
          ins&eacute;rer une ligne avec les mots <b>Wait Sensor</b>
          dans la colonne de commande et un nom de capteur valable
          dans la colonne <i>Canton</i>. La colonne <i>Valeur</i>
          doit disposer des mots d'action "actif" ou "inactif".
          Lors de la lecture lorsque cette commande est
          ex&eacute;cut&eacute;e le script fait une pause et le
          d&eacute;placement courant du train est maintenue
          jusqu'&agrave; ce que le capteur passe &agrave;
          l'&eacute;tat sp&eacute;cifi&eacute;. Lorsque cela se
          produit le script continue d'ex&eacute;cuter en accord
          avec le temps enregistr&eacute;e. Dans ce cas, le
          "capteur d'attente " peut &ecirc;tre un capteur optique
          plac&eacute; pour d&eacute;tecter &agrave; un point
          sp&eacute;cifique. Support de la commande " capteur
          d'attente " avec les commandes de vitesse , l' un avant
          avec une vitesse tr&egrave;s lente, l'un apr&egrave;s
          avec la vitesse 0 (ou -1 ). Le script devra alors avancer
          le train &agrave; la vitesse lente jusqu'&agrave; ce que
          le capteur permette la d&eacute;tection. Ensuite, le
          script se poursuit et la commande de vitesse de 0
          arr&ecirc;te le train.

          <p>De m&ecirc;me, le sscript et le train peuvent rester
          arr&ecirc;t&eacute; jusqu'&agrave; une deuxi&egrave;me
          commande "Capteur Attente" qui d&eacute;clenche le script
          pour continuer.</p>

          <p>Si le "capteur d'attente" est d&eacute;j&agrave;
          &agrave; l'&eacute;tat sp&eacute;cifi&eacute; lorsque la
          lecture ex&eacute;cute sa commande,le script
          continue.</p>

          <h3>S&eacute;quen&ccedil;age automatique de
          scripts</h3>Il est possible de lancer un autre script
          &agrave; partir d'un script. Pour ce faire,
          ins&eacute;rer une ligne avec les mots <b>Run Warrant</b>
          dans la colonne Commande et le nom d'un mandat dans la
          colonne <i>Canton</i>. cette commande lance le second
          mandat. Notez qu'un train &agrave; l'adresse
          indiqu&eacute;e dans la deuxi&egrave;me mandat doit
          &ecirc;tre plac&eacute; dans le canton de d&eacute;part
          du deuxi&egrave;me mandat.

          <p>Cette fonctionnalit&eacute; peut &ecirc;tre
          utilis&eacute;e pour boucler un train &agrave; plusieurs
          reprises en utilisant le m&ecirc;me nom de mandat. Si un
          script se termine avec le canton de destination
          &eacute;gal au canton d'origine, il se
          r&eacute;p&egrave;te pour le nombre de fois entr&eacute;
          dans la colonne <i>Valeur</i> . Si un nombre
          n&eacute;gatif est entr&eacute; dans le script, il se
          r&eacute;p&egrave;te ind&eacute;finiment jusqu'&agrave;
          ce qu'une commande d'abandon est manuellement
          publi&eacute;. Une autre possibilit&eacute; serait
          d'utiliser mandat " de A &agrave; B " et mandat " de B
          &agrave; A", o&ugrave; mandat " de A &agrave; B " court
          mandat " de B vers A " et mandat " de B &agrave; A" court
          mandat " de A &agrave; B " et chaque mandat
          sp&eacute;cifie le m&ecirc;me train Id et le m&ecirc;me
          nombre de r&eacute;p&eacute;titions.</p>

          <h3>Faire Circuler des Trains sur les Cantonss
          &Eacute;teints</h3>Le mode d'apprentissage et les
          fonctions du Mode Run peuvent &ecirc;tre utilis&eacute;s
          sur des Cantons qui n'ont pas des capteurs de
          d&eacute;tection. Cependant, sans d&eacute;tection, autre
          que le r&eacute;glage initial des aiguillages, le mandat
          ne peut pas r&eacute;initialiser les aiguillages ou de
          modifier sa vitesse alors que le train est en route. Cela
          signifie qu'il n'existe aucune protection au rouge des
          trains epertubant l'itin&eacute;raire ou d'aiguillage en
          cours de modification tandis que le train est en route.
          Par cons&eacute;quent la circulation des trains doit se
          faire avec prudence sur des cantons &eacute;teintss.

          <p>Notez que l'entr&eacute;e dans un canton &eacute;teint
          est d&eacute;tect&eacute; diff&eacute;remment d'un canton
          d'occupation. &Eacute;videmment, l'entr&eacute;e dans un
          bloc d'occupation est constat&eacute;e lorsque le canton
          d'occupation d&eacute;tecte l'occupation. Mais
          l'entr&eacute;e dans un bloc &eacute;teint peut
          &ecirc;tre seulement enregistr&eacute;e comme le moment
          o&ugrave; le canton d'occupation pr&eacute;c&eacute;dent
          ne montre aucune occupation. C'est que le temps
          &eacute;coul&eacute; pour l'entr&eacute;e dans un bloc
          &eacute;teint est enregistr&eacute; par la queue du
          train, pas par la t&ecirc;te.p&gt;</p>

          <h2>Sauvegarde Etc</h2>Il y a trois boutons en bas de la
          fen&ecirc;tre.

          <ul>
            <li><b>Sauvegarder</b> :-Enregistre le mandat afin
            qu'il puisse &ecirc;tre affich&eacute; dans la liste
            des mandats sur le Tableau Mandat. Une copie permanente
            du mandat est enregistr&eacute;e lorsque le panneau est
            enregistr&eacute; dans le fichier de
            configuration.</li>

            <li><b>Copie</b> :-Donne une copie du mandat</li>

            <li><b>Annuler</b> :-Annule toute modification qui
            pourrait avoir &eacute;t&eacute; faite</li>

            <li><b>Supprimer</b> :-Supprime le mandat lorsque le
            panneau est enregistr&eacute; dans le fichier de
            configuration.li&gt;</li>
          </ul><br>
        </li>
      </ul>
    </div>
  </div>
</body>
</html>
