# NodeConfigBundle.properties
#
# Default properties for the jmri.jmrix.cmri.serial.nodeconfig window

#WindowTitle    = Configurer C/MRI Nodes

BoxLabelNotes = Notes

LabelCardSize = Taille de la carte :
LabelNodeType = Type de n&#339;ud :
LabelDelay = D&#233;lai de r&#233;ception (DL) :
LabelPulseWidth = Largeur d'impulsion :
LabelMilliseconds = (millisecondes)

TipNodeAddress = Saisir l'adresse du n&#339;ud, num&#233;rotation &#224; partir de 0.
TipNodeType = S&#233;lectionnez le type de n&#339;ud C/MRI.
TipDelay = D&#233;lai entre les octets de r&#233;ception (unit&#233;s de 10 microsecondes), normalement 0.
TipPulseWidth = Largeur de l'impulsion pour la commande puls&#233;e de l'aiguillage (100 &#224; 10000 autoris&#233;s).
TipCardSize = S&#233;lectionne le nombre de bits par carte.
TipAddButton = Ajouter un nouveau n&#339;ud
TipEditButton = Editer un n&#339;ud existant
TipDeleteButton = Supprimer un n&#339;ud existant
TipDoneButton = S&#233;lectionner quand la configuration des n&#339;uds est termin&#233;e
TipUpdateButton = Modifier les informations sur les n&#339;uds
TipCancelButton = Arr&#234;ter l'&#233;dition sans modifier le n&#339;ud

BoutonAdd = Ajouter un n&#339;ud
ButtonEdit = Modifier un n&#339;ud
ButtonDelete = Supprimer un n&#339;ud
ButtonUpdate = Mettre &#224; jour le n&#339;ud

# La plus longue des trois lignes suivantes d&#233;termine la largeur de la fen&#234;tre.
NotesStd1 = Pour ajouter un nouveau n&#339;ud, entrez les informations et s&#233;lectionnez [{0}].
NotesStd2 = Pour modifier un n&#339;ud, entrez l'adresse du n&#339;ud, puis s&#233;lectionnez [{0}].
NotesStd3 = Pour supprimer un n&#339;ud, entrez l'adresse du n&#339;ud, puis s&#233;lectionnez [{0}].
# Ces trois lignes doivent &#234;tre plus courtes que la ligne la plus longue ci-dessus.
NotesEdit1 = Veuillez v&#233;rifier l'adresse du n&#339;ud avant de faire des changements.
NotesEdit2 = Pour modifier ce n&#339;ud, effectuez les modifications, puis s&#233;lectionnez [{0}].
NotesEdit3 = Pour quitter l'&#233;dition sans modifier ce n&#339;ud, s&#233;lectionnez [{0}].

CardTypeInput = Carte d'entr&#233;e
CardTypeOutput = Carte de sortie
CardTypeNone = Pas de carte

CardSize24 = 24 bits
CardSize32 = 32 bits

HeadingCardAddress = Adresse de la carte
HeadingCardType = Type de carte
HeadingPort = Bit de port -

# Les 3 lignes suivantes constituent un seul message, divis&#233; en trois parties pour s'adapter &#224; l'espace disponible.
HintCardTypePartA = Veuillez s&#233;lectionner le type de carte.
HintCardTypePartB = pour chaque carte occup&#233;e
HintCardTypePartC = adresse (sans espace).
# Les 3 lignes suivantes constituent un seul message, divis&#233; en trois parties pour s'adapter &#224; l'espace disponible.
HintCardTypePartD = S&#233;lectionnez 'No Card' dans la liste des cartes occup&#233;es.
HintCardTypePartE = carte restante inutilis&#233;e
HintCardTypePartF = adresses.
# Les 3 lignes suivantes constituent un seul message, divis&#233; en trois parties pour s'adapter &#224; l'espace disponible.
HintSearchlightPartA = Cliquez sur le premier bit de l'adresse de la carte.
HintSearchlightPartB = chaque oscillateur &#224; 2 fils
HintSearchlightPartC = signal du projecteur.
# Les 3 lignes suivantes constituent un seul message, divis&#233; en trois parties pour s'adapter &#224; l'espace disponible.
HintSearchlightPartD = Pas d'entr&#233;e n&#233;cessaire si pas de signal.
HintSearchlightPartE = oscillant &#224; 2 branches
HintSearchlightPartF = signaux de projecteurs.

# Toutes les lignes Errorxx ci-dessous doivent &#234;tre plus courtes que la plus longue ligne NotesStdx ci-dessus.
Error1 = Erreur - N&#339;ud avec adresse '
Error2 = ' existe d&#233;j&#224;, veuillez r&#233;essayer.
Error3 = Erreur lors de la cr&#233;ation d'un nouveau n&#339;ud. Le n&#339;ud n'a pas &#233;t&#233; ajout&#233;.
Error4 = Erreur - Aucun n&#339;ud avec l'adresse de n&#339;ud (UA) saisie, veuillez r&#233;essayer.
Error5 = Erreur - Mauvais caract&#232;re dans l'adresse du n&#339;ud (UA), veuillez r&#233;essayer.
Erreur6 = Erreur - L'adresse du n&#339;ud (UA) n'est pas comprise entre 0 et 127.
Error7 = Erreur - Mauvais caract&#232;re dans le d&#233;lai de r&#233;ception (DL), veuillez r&#233;essayer.
Error8 = Erreur - Le d&#233;lai de r&#233;ception (DL) doit &#234;tre positif, veuillez r&#233;essayer.
Error9 = Erreur - Le d&#233;lai de r&#233;ception (DL) ne peut pas d&#233;passer 65535, veuillez r&#233;essayer.
Error10 = Erreur - La d&#233;finition du projecteur n'est pas coh&#233;rente.
Error11 = Erreur - Toutes les cartes d'entr&#233;e et de sortie doivent pr&#233;c&#233;der la premi&#232;re "No Card".
Error12 = Erreur - Il s'agit d'une exigence de conception C/MRI.
Error13 = Erreur - USIC_SUSIC doit avoir au moins une carte d'entr&#233;e ou de sortie.
Error14 = Veuillez configurer les cartes d'entr&#233;e et de sortie et r&#233;essayer.
Error15 = Erreur - Les cartes USIC_SUSIC doivent &#234;tre soit 24 bits, soit 32 bits.
Error16 = Erreur - La largeur d'impulsion doit &#234;tre d'au moins 100, veuillez r&#233;essayer.
Error17 = Erreur - La largeur d'impulsion doit &#234;tre inf&#233;rieure &#224; 10000, veuillez r&#233;essayer.
Error18 = Erreur - Mauvais caract&#232;re dans la largeur d'impulsion, veuillez r&#233;essayer.

FeedBackAdd = Ajout d'un n&#339;ud C/MRI. Adresse du n&#339;ud =
FeedBackDelete = N&#339;ud C/MRI supprim&#233;. Adresse du n&#339;ud =
FeedBackUpdate = N&#339;ud C/MRI mis &#224; jour. Adresse du n&#339;ud =

ConfirmDelete1 = Êtes-vous s&#251;r de vouloir supprimer ce n&#339;ud ?
ConfirmDelete2 = Tous les capteurs, les aiguillages ou les lumi&#232;res avec cette adresse de n&#339;ud seront affect&#233;s.
ConfirmDeleteTitle = Confirmer la suppression
ConfirmUpdate1 = Cette modification r&#233;duira le nombre de cartes pour ce n&#339;ud.
ConfirmUpdate2 = Les adresses des capteurs, des aiguillages et des lampes peuvent &#234;tre affect&#233;es.
ConfirmUpdate3 = Êtes-vous s&#251;r de vouloir mettre &#224; jour ce n&#339;ud ?
ConfirmUpdateTitle = Confirmer la mise &#224; jour

Reminder1   = N'oubliez pas de sauvegarder sur le disque les informations relatives &#224; votre nouveau n&#339;ud C/MRI.
Reminder2   = Utilisez le bouton [{0}] dans la fen&#234;tre des pr&#233;f&#233;rences.
