<!doctype html public "-//w3c//dtd html 4.01//en" "http://www.w3.org/tr/html4/strict.dtd">
<!-- Updated by Blorec Herv&#233; le 2017-01-20-->
<html lang="fr">
<head>
 <title>JMRI Hardware Support - Chubb C/MRI</title>
 <meta name="Author" content="Bob Jacobsen, Egbert Broerse">
 <meta name="keywords" content="Bruce Chubb C/MRI Computer interface java model railroad JMRI install windows">
<!-- Style -->
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<link rel="stylesheet" type="text/css" href="/css/default.css" media="screen">
<link rel="stylesheet" type="text/css" href="/css/print.css" media="print">
<link rel="icon" href="/images/jmri.ico" type="image/png">
<link rel="home" title="Home" href="/">
<!-- /Style -->
</head>

<body>
<!--#include virtual="/Header" -->
<div id="mBody">
    <!--#include virtual="Sidebar" -->
    <div id="mainContent">
        <!-- Page Body -->

<h1>Prise en Charge Mat&#233;riel: Chubb C/MRI</h1>
<a name="contents"></a>

La documentation ci-dessous explique comment JMRI peut &#234;tre utilis&#233; avec C/MRI, et
comment d&#233;marrer avec la connexion d'un syst&#232;me C/MRI &#224; JMRI. Il suppose une base de
connaissance de JMRI (tel que document&#233; sur ce site web JMRI), et une certaine familiarit&#233;
avec C/MRI. Il est fortement recommand&#233; que les utilisateurs aient acc&#232;s au <b>  Manuel de l'utilisateur C/MRI, la version 3.0</b> de Bruce
Chubb car il contient une documentation d&#233;taill&#233;e sur le mat&#233;riel, qui n'est pas  disponible ailleurs. Puisque vous n'avez pas
besoin de programmer votre ordinateur si vous utilisez JMRI avec votre syst&#232;me C/MRI,
vous pouvez sauter sur les d&#233;tails de la programmation informatique lors de la consultation du Manuel de l'utilisateur C/MRI
. La documentation ci-dessous est divis&#233;e en sections; cliquer  sur un &#233;l&#233;ment pour
un acc&#232;s facile &#224; une section ci-dessous:
<ul><!-- TOC -->
<li><a href="#hardware">Mat&#233;riel</a></li>
<li><a href="#limitations">Limitations</a></li>
<li><a href="#intro">Introduction &#224; C/MRI sur JMRI</a>
	<ul><li><a href="#iobits">Bits d'Entr&#233;e et Sortie de C/MRI</a></ul></li>
<li><a href="#connecting">Connexion</a>
<ul>
    <li><a href="#smini">D&#233;marrer avec un n&#339;ud SMINI</a></li>
    <li><a href="#susic">D&#233;marrer avec une USIC ou SUSIC</a></li>
    <li><a href="#nodes"> G&#233;rer les n&#339;uds</a></li>
    <li><a  href="#numbers"> Num&#233;rotation utilis&#233;e dans les Noms Syst&#232;mes C/MRI</a></li>
    <li><a href="#alternate">Num&#233;rotation Alternative pour les Noms Syst&#232;mes</a></li>
    <li><a href="#options"> Options de Contr&#238;le des Aiguillages C/MRI</a></li>
    <li><a href="#signals"> C&#226;blage des signaux</a></li>
    <li><a href="#diagnostics">Diagnostique C/MRI</a></li>
    <li><a href="#sim"> Ex&#233;cuter JMRI lorsqu'il est d&#233;connect&#233; de votre syst&#232;me C/MRI</a></li>
</ul></li>
<li><a href="#tools">Outils JMRI C/MRI</a>
<ul>
	<li><a href="#diagnostics">Diagnostics C/MRI</a></li>
	<li><a href="#confignodes">Outil Configurer N&#339;uds</a></li>
</ul></li>
<li><a href="#documentation">Documentation</a></li>
</ul>

<a name="hardware"></a><h2>Mat&#233;riel pris en charge</h2>
<ul>
    <li>Chubb C/MRI USIC</li>
    <li>Chubb C/MRI SMINI</li>
    <li>Chubb C/MRI SUSIC</li>
</ul>

<a name="limitations"></a><h2>Limitations</h2>
<p>&#192; cette heure les interfaces IBEC et UBEC directement connect&#233;es ine sont pas prises en charge.</p>

<a name=intro></a><h2>Introduction &#224; C/MRI sur JMRI</h2>

<p>C/MRI est un syst&#232;me de lignes d'entr&#233;es/sorties digitales  qui peuvent &#234;tre
utilis&#233;es pour connecter un ordinateur &#224; r&#233;seau ferroviaire, permettant &#224; l'ordinateur
de surveiller et de commander les diff&#233;rents &#233;l&#233;ments du r&#233;seau. Le SUSIC (Super
Universal Serial Interface Card) est la carte contr&#238;leur pour un grand syst&#232;me num&#233;rique
 E/S, par l'interm&#233;diaire d'une carte m&#232;re, jusqu'&#224; 64 cartes d'entr&#233;es ou de sorties num&#233;riques , soit avec 24 ou 32 lignes 
d'entr&#233;e ou de sortie par carte. L'USIC est une ancienne version de la SUSIC. 
La carte Smini (Super Mini-n&#339;ud) est un n&#339;ud s&#233;rie autonome offrant un nombre fixe de 24 lignes d'entr&#233;e et 48 lignes de sortie. Un nombre 
d'autres cartes d'interface  sont disponibles dans le cadre de la C/MRI, mais elles doivent &#234;tre connect&#233;es
 &#224; votre ordinateur via une Smini, une SUSIC, ou une USIC. Par exemple, une carte
d&#233;tecteur d'occupation DCCOD de C/MRI se connecte &#224; la ligne d'entr&#233;e d'une Smini (ou SUSIC ou
USIC). Les r&#233;seaux qui utilisent C/MRI ont g&#233;n&#233;ralement plusieurs Smini
situ&#233;es &#224; diff&#233;rents endroits sur le r&#233;seau , et peut-&#234;tre une ou deux  SUSIC
situ&#233;es sur le panneaux CTC.</p>

<p>C/MRI n'est pas un syst&#232;me de commandee des trains. Vous pouvez ex&#233;cuter C/MRI avec un 
syst&#232;me de contr&#238;le de train DCC (tels que, Digitrax, Lenz, ou NCE) ou avec un syst&#232;me DC de contr&#238;le des trains
 Et vous pouvez utiliser avec votre JMRI avec le syst&#232;me C/MRI si vous utilisez
DCC ou DC pour contr&#238;ler les trains. Si vous contr&#238;lez vos trains avec un
syst&#232;me qui prend en charge JMRI, vous pouvez connecter votre syst&#232;me C/MRI et votre
syst&#232;me de contr&#238;le de train &#224; JMRI simultan&#233;ment, chacun avec sa propre ligne s&#233;rie d'entr&#233;e
dans votre ordinateur. La plupart des utilisateurs qui utilisent C/MRI ex&#233;cutent JMRI ayant des liens avec
&#224; la fois leur C/MRI et leur syst&#232;me de commande des trains. Il y a de nombreux avantages
&#224; le faire. JMRI vous permet de "m&#233;langer et comment" comment vous contr&#238;ler et surveiller les
choses sur votre r&#233;seau. Par exemple, vous pouvez basculer votre Aiguillage en utilisant des d&#233;codeurs 
statique sur votre syst&#232;me de commande des trains, et utiliser simultan&#233;ment les entr&#233;es de 
C/MRI pour fournir une r&#233;tro signalisation de l'Aiguillage vers JMRI.
JMRI est con&#231;u pour rendre les deux syst&#232;mes connect&#233;s compatibles.</p>

<p>Le Logiciel JMRI se compose d'une grande biblioth&#232;que, divis&#233; en 1) une
partie sp&#233;cifique, avec des sous-parties nombreuses, dont chacune communique avec un
syst&#232;me mat&#233;riel pris en charge, comme le syst&#232;me C/MRI, d'une mani&#232;re sp&#233;cifique , et 2) une
partie ind&#233;pendante du syst&#232;me o&#249; la plupart des caract&#233;ristiques de JMRI sont
mises en oeuvre. Ainsi, par exemple, si l'utilisateur fait quelque chose (peut-&#234;tre d&#233;terminer un
itin&#233;raire) pour pousser JMRI &#224; basculer un Aiguillage, l'action de l'utilisateur
aura lieu dans la partie ind&#233;pendante du syst&#232;me du logiciel, puis ce sera &#224; JMRI
d'envoyer la commande effective par la partie d&#233;pendante du syst&#232;me appropri&#233; pour le
syst&#232;me de mat&#233;riel de commande de l'Aiguillage particulier &#224; basculer. JMRI est con&#231;u
afin que les fonctionnalit&#233;s soient mises en oeuvre dans la partie ind&#233;pendante du syst&#232;me autant que
possible, avec l'aide de sous-parties JMRI d&#233;pendantes du syst&#232;me que lorsque c'est vraiment n&#233;cessaire.
L'acc&#232;s aux fonctionnalit&#233;s du syst&#232;me ind&#233;pendant se fait via les menus JMRI principaux, tels que
dans le menu Outils. L'acc&#232;s aux fonctionnalit&#233;s d&#233;pendant du syst&#232;me se fait via un menu intitul&#233;
pour le syst&#232;me mat&#233;riel pris en charge; les fonctionnalit&#233;s sp&#233;cifiques C/MRI sont accessibles via
le menu CMRI.</p>

<p>JMRI se pr&#233;sente aux utilisateurs via une application ayant plusieurs extr&#233;mit&#233;s, chacune
se concentrant sur un type d'utilisation, mais toutes bas&#233;es sur la m&#234;me biblioth&#232;que. 
L'application populaire DecoderPro se concentre sur la programmation DCC des
d&#233;codeurs, et n'est pas d'un grand d'int&#233;r&#234;t pour C/MRI. D'autre part, PanelPro
est l'application JMRI qui se concentre sur l'automatisation des r&#233;seaux, de la signalisation, et des panneaux CTC
. PanelPro est l'application la plus souvent utilis&#233;e avec C/MRI, et est
celle utilis&#233;e dans les <a  href="#smini"> exemples ci-dessous</a>. Comme toutes applications de JMRI
 utilisent la m&#234;me biblioth&#232;que, il est possible de faire fonctionner un panneau depuis
DecoderPro, ou m&#234;me programmer un d&#233;codeur DCC depuis PanelPro.
Ce n'est pas aussi facile que d'utiliser l'application cibl&#233;e.</p> 

<p>Les Biblioth&#232;ques JMRI ont une prise en charge int&#233;gr&#233;e pour le mat&#233;riel s&#233;rie C/MRI utilisant les
USIC, SUSIC et Smini. Chaque Smini, USIC ou SUSIC est un n&#339;ud  s&#233;rie capable de
communiquer de fa&#231;on autonome avec un ordinateur via un port s&#233;rie E/S. Plusieurs n&#339;uds C/MRI
 peuvent &#234;tre reli&#233;s entre eux en utilisant le protocole de communication RS485 dans un
configuration en cascade, de sorte qu'une seule ligne s&#233;rie sur votre ordinateur est
n&#233;cessaire. Pour que cela fonctionne, chaque n&#339;ud doit avoir une adresse diff&#233;rente, unique,
r&#233;gl&#233;e par les interrupteurs adresse sur la carte. Chaque n&#339;ud (USIC, SUSIC, ou
Smini) a besoin de recevoir une cha&#238;ne d'initialisation avant de pouvoir communiquer
avec un ordinateur. JMRI va automatiquement cr&#233;er et transmettre la cha&#238;ne d'initialisation n&#233;cessaire
lors de son d&#233;marrage, mais pour rendre cela possible, vous avez 
besoin de donner &#224; JMRI les d&#233;tails de votre  mat&#233;riel C/MRI mis en place. Nous faisons ce qui 
s'appelle la "configuration " de votre n&#339;ud C/MRI
( <a href="#nodes"> voir ci-dessous</a>). Si vous mettez plusieurs n&#339;uds C/MRI  en chaine, vous aurez
probablement besoin d'une carte de conversion C/MRI RS232/RS485 entre le bus RS485
 reliant les cartes et la ligne s&#233;rie RS232 pour se connecter &#224; votre
ordinateur. Si votre ordinateur ne dispose pas d'un port s&#233;rie RS232 (les ordinateurs les plus r&#233;cents
 n'en sont pas munis), vous pouvez vous connecter &#224; un port USB de l'ordinateur avec un c&#226;ble adaptateur USB-s&#233;rie
(<a href="../USBtoSerial.shtml"> cliquez ici pour l'aide</a>).</p>

<p>Les entr&#233;es C/MRI peuvent &#234;tre utilis&#233;es comme "Capteurs" JMRI, et la sortie C/MRI peut &#234;tre
pilot&#233;e
comme des "Aiguillages" ou des "Lumi&#232;res" JMRI ( <a href="#iobits"> voir ci-dessous</a>). Notez
que les entr&#233;es et sorties C/MRI sont parfois appel&#233;s "pins", parfois appel&#233;
"bits", et qu'on appelle parfois "lignes", tous sont des moyens &#233;quivalents de se r&#233;f&#233;rer &#224; la 
m&#234;me chose. C/MRI est un syst&#232;me de scrutation, ce qui signifie que la communication avec les n&#339;uds
C/MRI requi&#232;rent que l'ordinateur envoie p&#233;riodiquement un message &#224; chaque n&#339;uds
lui demandant de transmettre l'&#233;tat de ses bits d'entr&#233;e. JMRI commence l'interrogation d'un n&#339;ud lorsque au moins un Capteur a &#233;t&#233; 
mis en place pour se r&#233;f&#233;rer &#224; un bit entr&#233;e
de ce n&#339;ud. C'est cette action de scrutation qui maintient la LED sur votre adaptateur
Smini clignotante (&#224; un rythme &#233;lev&#233;).</p>

<a name=iobits></a><h3>Bits d'Entr&#233;e et de Sortie C/MRI</h3>

<p>JMRI consid&#232;re les  bits d'entr&#233;e de C/MRI comme des Capteurs. Les Capteurs apportent une contribution
    &#224; JMRI
Sur l'&#233;tat du r&#233;seau  - un bouton est enfonc&#233;, un bloc est occup&#233;,
etc. Dans JMRI, vous vous r&#233;f&#233;rez &#224; un bit d'entr&#233;e C/MRI (Capteur) par son "nom syst&#232;me",
CSnxxx, o&#249; nxxx est l'adresse du bit
( <a href="#numbers"> voir ci-dessous</a>). Avant de  pouvoir vous r&#233;f&#233;rer &#224; un Capteur dans JMRI,
il doit &#234;tre "cr&#233;&#233;". Un Capteur peut &#234;tre cr&#233;&#233; de diverses fa&#231;ons, y compris
automatiquement. Tous les Capteurs de JMRI qui ont &#233;t&#233; cr&#233;&#233;s peuvent &#234;tre consult&#233;s dans les
Tableaux Capteurs JMRI, accessibles en s&#233;lectionnant <b>Tableau Capteur</b> dans les options du
menu Outils. Un nouveau Capteur peut &#234;tre cr&#233;&#233; gr&#226;ce au Tableau Capteur comme illustr&#233;
<a href="#smini">  ci-dessous</a>. La cr&#233;ation d'un Capteur se r&#233;f&#233;rant &#224; un bit d'entr&#233;e particulier de C/MRI
, est appel&#233;e "affectation" du bit d'entr&#233;e. Chaque bit d'entr&#233;e ne peut &#234;tre
attribu&#233; qu'une seule fois, deux Capteurs diff&#233;rents ne peuvent pas se r&#233;f&#233;rer au m&#234;me  bit d'entr&#233;e
C/MRI. Un Capteur est "actif" lorsque son bit d'entr&#233;e est &#224; la masse
et "inactifs" lorsque son bit d'entr&#233;e est hors tension. <b>Donc quand vous voyez
"Capteur", penser "bit d'entr&#233;e" ou "ligne d'entr&#233;e".</b></p>

<p> JMRI se r&#233;f&#232;re aux bits de sortie C/MRI  comme les Aiguillages ou les lumi&#232;res. Les Aiguillages et
les lumi&#232;res sont allum&#233;s/&#233;teints par des interrupteurs que JMRI peut changer pour commander les choses sur
votre r&#233;seau. Pour faire r&#233;f&#233;rence &#224; un bit de sortie C/MRI comme un Aiguillage, utilisez le nom syst&#232;me
CTN, o&#249; Nxxx est l'adresse du bit de sortie
( <a href="#numbers"> voir ci-dessous</a>). Pour faire r&#233;f&#233;rence &#224; un bit de sortie C/MRI comme
la Lumi&#232;re, l'utilisation CLnxxx, o&#249; Nxxx est l'adresse du bit de sortie
( <a href="#numbers"> voir ci-dessous</a>). Les Aiguillages et les lumi&#232;res ont diff&#233;rentes m&#233;thodes
de se r&#233;f&#233;rer aux sorties C/MRI au sein de JMRI. Chaque m&#233;thode a ses
diff&#233;rentes options de commande. Toujours utiliser "Aiguillages" pour les sorties C/MRI
 utilis&#233;es pour la commande des Aiguillages et pour les sorties C/MRI  utilis&#233;es pour faire fonctionner
les signaux. Pour des raisons historiques, les bits de sortie C/MRI utilis&#233;s pour commander l'aspect des signaux sont d&#233;nomm&#233;s "Aiguillages",
 m&#234;me si les bits de sortie sont utilis&#233;s pour la commande de signaux lumineux
Utilis&#233; "Lumi&#232;res" pour faire r&#233;f&#233;rence aux bits de sortie C/MRI utilis&#233;s
pour les feux du TCO , des feux dans un d&#233;cor (&#233;clairage de la structure, des lumi&#232;res de la rue
, etc), et &#224; des fins sp&#233;ciales o&#249; les options de commande pour les feux doivent
r&#233;pondre &#224; vos besoins. <b> Ainsi, lorsque vous consultez la section "Aiguillage" ou "Lumi&#232;re" dans le cadre de
C/MRI, pense que "bit de sortie" ou "ligne de sortie".</b></p>

<p> Avant de pouvoir se r&#233;f&#233;rer &#224; un Aiguillage ou une Lumi&#232;re &#224; l'int&#233;rieur de JMRI,
l'Aiguillage ou
la Lumi&#232;re doit &#234;tre "cr&#233;&#233;". Un Aiguillage peut &#234;tre cr&#233;&#233; avec un certain nombre de moyens,
y compris automatiquement. Tous les Aiguillages JMRI qui ont &#233;t&#233; cr&#233;&#233;s peuvent &#234;tre
vus dans le Tableau Aiguillage JMRI, accessible en s&#233;lectionnant <b> Tableau Aiguillage</b>
dans le menu Outils. Un Aiguillage peut &#234;tre cr&#233;&#233; via le Tableau Aiguillage 
en cliquant sur "Ajouter" au bas du Tableau. Pareillement , une nouvelle Lumi&#232;re peut &#234;tre
cr&#233;&#233; par le Tableau Lumi&#232;re de JMRI en cliquant sur "Ajouter" au bas de ce
Tableau. Le Tableau Lumi&#232;re JMRI est accessible en s&#233;lectionnant <b> Tableau Lumi&#232;re</b>
dans le menu Outils. Tous les voyants JMRI qui ont &#233;t&#233; cr&#233;&#233;s sont r&#233;pertori&#233;s dans le
Tableau Aumi&#232;re JMRI . La cr&#233;ation d'un Aiguillage ou d'une Lumi&#232;re se r&#233;f&#232;re &#224; un bit de sortie particulier de C/MRI
,qui est appel&#233;e "affectation" . Chaque Lumi&#232;re ou Aiguillage est
li&#233; &#224; une ligne de sortie sp&#233;cifique via la partie adresse du Nom Syst&#232;me. 
</p>

<p>Un bit de sortie sp&#233;cifique peut &#234;tre consid&#233;r&#233; comme un Aiguillage ou une Lumi&#232;re, mais
pas les deux
&#224; la fois. Chaque bit de sortie ne peut &#234;tre attribu&#233; qu'une seule fois. Quand un nouvel Aiguillage
 ou une nouvelle lumi&#232;re C/MRI est cr&#233;&#233;, JMRI contr&#238;le que le bit de sortie sp&#233;cifi&#233; est disponible pour l'affectation.
 Si la demande du bit de sortie C/MRI est en cours d'utilisation par un Aiguillage ou une  lumi&#232;re, JMRI refusera de
cr&#233;er le nouvel Aiguillage ou le nouvel &#233;clairage. Notez que certains Aiguillage C/MRI ont la possibilit&#233;
 d'utiliser deux bits de sortie, l'un adress&#233;e et le suivant
( <a href="#options">voir ci-dessous</a>), et que les deux bits de sortie doivent &#234;tre
non affect&#233;s pour la cr&#233;ation r&#233;ussie d'un nouvel Aiguillage command&#233; par deux 
bits de sortie. La liste des affectations courantes C/MRI peut &#234;tre obtenue en s&#233;lectionnant 
<b>Liste affectations</b> dans le menu C/MRI.</p>

<a name="connecting"></a><h2>Connexion</h2>
<a name=smini></a><h3>Mise en route avec un n&#339;ud Smini</h3>

Il est plus facile d'essayer JMRI avec une carte Smini, car il y a peu
d'options &#224; configurer pour le mat&#233;riel C/MRI. Apr&#232;s avoir
physiquement connect&#233; Smini &#224; votre ordinateur, suivez la proc&#233;dure
ci-dessous pour configurer votre Smini comme un n&#339;ude C/MRI, et de tester une entr&#233;e et
un bit de sortie. (Cette proc&#233;dure suppose que rien n'est raccord&#233; &#224; la
broches d'entr&#233;e et de sortie de votre Smini, et que vous n'avez pas fait 
d'affectation pour ses bits.)
<ol>
<li>D&#233;marrez le programme PanelPro.
<li>Depuis le menu &#201;dition, s&#233;lectionnez <b>Pr&#233;f&#233;rences ...</b> et configurer:
    <ul>
    <li>Pour la connexion r&#233;seau s&#233;lectionnez "C/MRI".
    <li>pour le port s&#233;rie, s&#233;lectionnez le port  mat&#233;riel o&#249; votre mat&#233;riel C/RMI est raccord&#233;
    <li>S&#233;lectionnez la vitesse de transmission que votre syst&#232;me C/MRI utilise.
    <li>Cliquez sur le bouton "Configurer le n&#339;ud C/MRI". Sur le
        nouveau panneau qui s'ouvre:
        <ul>
        <li>Entrez votre adresse de n&#339;ud de SMINI. (0 est g&#233;n&#233;ralement utilis&#233; pour
            la premi&#232;re carte Smini, mais ce nombre est r&#233;gl&#233; par les 
            commutateurs d'adresse sur votre carte SMINI.)
        <li>S&#233;lectionnez "SMINI" pour le type de n&#339;ud.
        <li>Laissez DL &#224; z&#233;ro.
        <li>Cliquez sur "Ajouter N&#339;ud".
        <li>Cliquez "Termin&#233;".
        </ul></li>
    <li> Retour sur le panneau "Pr&#233;f&#233;rences ...", cliquez sur "Enregistrer", et dire oui
        quand il vous demande si vous voulez quitter.</li>
    </ul></li>
<li>Red&#233;marrez le programme. Vous devez affecter un bit d'entr&#233;e pour commencer
    la scrutation. S&#233;lectionnez <b>Tableau Capteur</b> dans le menu Outils, et proc&#233;der:
    <ul>
    <li>Cliquez "Ajouter ..." au bas du Tableau.
    <li> Dans la bo&#238;te de dialogue Ajouter un Nouveau Capteur:
        <ul>
            <li> Pour le Nom Syst&#232;me, entrez votre adresse CS1 si le N&#339;ud SMIMI a &#233;t&#233;
                0, ou encore entrer CSn001, o&#249; n est votre adresse du N&#339;ud SMINI
            <li> Le nom syst&#232;me et le nom utilisateur apparaissent dans le Tableau Capteur.
            <li> Pour le nom utilisateur entrer "Test".
            <li> Cliquer "OK".
        </ul></li>
 	    <li>Le Nom Syst&#232;me et Utilisateur doivent apparaitre dans le Tableau Capteur.
 		L'&#233;tat de votre Capteur dans le Tableau Capteur sera initialement
        "Inconnu", mais passera rapidement &#224; "Inactif"  lorsque la scrutation
        commence (en supposant que rien n'est raccord&#233; &#224; la broche d'entr&#233;e 1).</li>
    </ul>
    La LED d'&#233;mission et de r&#233;ception sur votre carte SMINI devrait maintenant
    clignoter, indiquant que l'ordinateur et lA SMINI dialoguent.</li>
<li>Pour v&#233;rifier que le bit d'entr&#233;e (Capteur) que vous avez attribu&#233; est au travail,
   relier la broche d'entr&#233;e 1  &#224; la borne de masse sur votre carte
    SMINI. Le Capteur doit basculer &#224; "Actif". L'&#233;tat du Capteur
    alterne entre "actif" et "inactif", selon que
    broche 1 est mise &#224; la terre ou non.</li>
<li>Pour v&#233;rifier que tout fonctionne sur le c&#238;t&#233; sortie, s&#233;lectionnez
     <b>Commande Aiguillage</b> dans le menu Outils. Lorsque les petites
    fen&#234;tres de configuration de l'Aiguillage s'ouvrent, proc&#233;der:
    <ul>
        <li>Pour l'Aiguillage, entrez CT1 si votre adresse n&#339;ud &#233;tait de 0, ou encore
        entrer CTn001, o&#249; n est votre adresse de n&#339;ud. (Ceci affecte 1 &#224; votre bit de sortie
        de votre SMINI comme un un Aiguillage.)</li>
        <li> Cliquez sur "Direct" ou "D&#233;vi&#233;" pour activer une ligne de sortie on et off.</li>
    </ul>
 	Si vous connectez un LED en s&#233;rie avec une r&#233;sistance (la valeur en ohms d&#233;pend
    de la tension continue appliqu&#233;e) &#224; 1 bit de sortie, vous
    &#234;tre en mesure de commuter la LED on et off en cliquant simplement sur "Droit "ou
    "D&#233;vi&#233; " dans la fen&#234;tre de commande de l'Aiguillage. Notez que les bits de sortie SMINI
    peuvent &#234;tre mis en place pour &#234;tre soit "absorbeurs de courant" ou " g&#233;n&#233;rateurs de courants".
    (cela d&#233;pend de la fa&#231;on dont votre SMINI est construite.) JMRI
    fonctionne de m&#234;me, ind&#233;pendamment du type de bits de sortie, mais le type
    de bits d&#233;termine la fa&#231;on dont vous raccordez votre LED. Si vos sorties
    bits sont "r&#233;cepteurs de courant" actuellement (le type le plus commun), relier le
    fil n&#233;gatif de votre LED &#224; la broche 1 de sortie, et la r&#233;sistance
    entre le fil positif de la LED et une source de courant continu (g&#233;n&#233;ralement
    3 &#224; 12 volts). Si votre bit de sortie est en "g&#233;n&#233;rateur de courant", relier
    le fil positif de votre LED sur la broche 1, et relier la
    r&#233;sistance entre le fil n&#233;gatif de la LED  et la masse actuelle.</li>
</ol>

<p>Vous avez maintenant un n&#339;ud  C/MRI configur&#233; et fonctionnel. Vous pouvez ajouter
plusieurs n&#339;uds, en revenant au dialogue Configurer le n&#339;ud C/MRI
(<a href="#nodes">voir ci-dessous</a>).</p>

<a name=susic></a><h3>D&#233;buter avec une USIC ou SUSIC</h3>

<p>Apr&#232;s avoir connect&#233; physiquement votre SUSIC (ou USIC) &#224; votre ordinateur,
suivez la proc&#233;dure ci-dessous pour configurer votre SUSIC (ou USIC) en tant que n&#339;ud C/MRI
, et de tester un bit d'entr&#233;e et un bit de sortie. La proc&#233;dure suppose
1) que cette SUSIC est le premier n&#339;ud C/MRI  connect&#233; &#224; votre
ordinateur, 2) que rien n'est raccord&#233; aux broches d'entr&#233;e de 
votre premi&#232;re carte d'entr&#233;e num&#233;rique, SUSIC, ou les broches de 
sortie de votre premiere SUSIC, et 3) que vous n'avez pas donn&#233; 
d'affectations aux bits de votre SUSIC.</p>
<ol>
<li> D&#233;marrez le programme PanelPro.
<li> Dans le menu Modification, s&#233;lectionnez <b>Pr&#233;f&#233;rences ...</b> et configurer:
    <ul>
    <li> Pour la connexion r&#233;seau s&#233;lectionnez "C/MRI".
    <li> pour le port s&#233;rie, s&#233;lectionnez le port que votre mat&#233;riel C/MRI utilise.
    <li> S&#233;lectionnez la vitesse en bauds que votre syst&#233;mes C/MRI utilise
	<li> Cliquez sur le bouton "Configurer C/MRI". Sur le
        nouveau panneau qui s'ouvre:
        <ul>
        <li> Entrez votre adresse de n&#339;ud SUSIC. (0 est g&#233;n&#233;ralement utilis&#233; pour
            le premier module SUSIC, mais  ce nombre est r&#233;gl&#233; par les
            commutateurs d'adresse sur votre carte contr&#238;leur SUSIC.)
        <li> S&#233;lectionnez "USIC_SUSIC" pour le type de n&#339;ud
        <li> Laissez DL &#224; z&#233;ro.
        <li> S&#233;lectionnez "24-bit" ou "32-bit" pour la taille de carte, suivant
            si vous avez la carte 'originale DIN et DOUT 24-bit ou 
			la plus r&#233;cente 32-bit            
        <li> Utilisez le Tableau ci-dessous pour configurer vos cartes et  dire &#224; JMRI
            quelle carte a des cartes d'entr&#233;es et celle qui a des cartes de sorties.
	 		Pour chaque carte que vous avez install&#233;, cliquez o&#249; il est
            dit "Sans carte" et s&#233;lectionnez "Carte d'Entr&#233;e" ou " carte de Sortie".
            Notez que les cartes d'entr&#233;e et de sortie peuvent &#234;tre dans n'importe quel ordre,
            mais il ne faut pas d'espaces vides avant celle qui suit 
			la derni&#232;re carte install&#233;e .
 			(Il s'agit d'une exigence mat&#233;riel de C/MRI.)
         <li> Cliquez sur "Ajouter N&#339;ud"
       <li>  Cliquez  "Termin&#233;"       
             </ul>
		<li> Retour sur le panneau,  "Pr&#233;f&#233;rences ... ", cliquez sur "Enregistrer", et dire oui quand
		il vous demande si vous voulez quitter.
		</ul>
  <li>Red&#233;marrez le programme. Vous devez affecter un bit d'entr&#233;e pour commencer
		la scrutation. S&#233;lectionnez <b>Tableau Capteur</b> dans le menu Outils, et continuez:
		<ul>
		<li> Cliquez "Ajouter ..." au bas du Tableau Capteur.
		<li> Dans la bo&#238;te de dialogue Ajouter un Nouveau Capteur:
		<ul>
		<li> Pour le Nom Syst&#232;me, entrez votre adresse CS1 si le n&#339;ud SUSIC a &#233;t&#233;
		0, ou encore entrer CSn001, o&#249; n est votre adresse du n&#339;ud de SUSIC.
		<li> Pour le Nom Utilisateur entrz Test".
		<li>Cliquez "OK".
		</ul>
	<li> Le Nom Syst&#232;me et le Nom Utilisateur appara&#238;tront dans le Tableau Capteur.
		L'&#233;tat de votre Capteur dans le Tableau Capteur sera initialement
		"Inconnu", mais passera rapidement &#224; "inactif"  lorsque la scrutation
		commence (en supposant que rien n'est raccord&#233; &#224; la broche d'entr&#233;e 1).
		</ul>
		La LED d'&#233;mission et de r&#233;ception sur votre carte contr&#238;leur SUSIC devrait 
		maintenant clignoter, indiquant que l'ordinateur et la SUSIC 
		dialoguent.
	<li>Pour v&#233;rifier que le bit d'entr&#233;e (Capteur) que vous avez attribu&#233; est au travail,
		relier la broche 1 d'entr&#233;e (la premi&#232;re broche d'entr&#233;e  sur la premi&#232;re
		carte d'entr&#233;e de votre SUSIC) pour diriger le courant &#224; la masse.SUSIC
		La sonde doit passer &#224; "Actif". L'&#233;tat du Capteur
		alterne entre "actif" et "Inactif", selon que
		broche 1 est mise &#224; la masse ou non.
     <li>Pour v&#233;rifier que tout fonctionne du c&#238;t&#233; de la sortie, s&#233;lectionnez
      <b>Commande Aiguillage</b> dans le menu Outils. Lorsque les petites
     Fen&#234;tre de configuration de l'Aiguillage s'ouvrent, proc&#233;der:
     <ul>
     <li>Pour l'Aiguillage, entrez CT1 si l'adresse de votre n&#339;ud SUSIC &#233;tait 0, ou
     Sinon, indiquez CTn001, o&#249; n est votre adresse de n&#339;ud de SUSIC. Celle ci
     attribue 1 bit de sortie (la premi&#232;re ligne de sortie carte sur 
	 votre SUSIC) &#224; l'Aiguillage .
     <li> Cliquez sur "Direct"ou "D&#233;vi&#233;" pour activer une ligne de sortie on et off.
   </ul>
     Si vous connectez une LED en s&#233;rie avec une r&#233;sistance (la valeur en ohms d&#233;pend
     de la tension continue appliqu&#233;e) &#224; 1 bit de sortie, vous
     &#234;tes en mesure de commuter la LED on et off en cliquant simplement sur "Direct "ou
     "D&#233;vi&#233;" dans la fen&#234;tre de contr&#238;le de l'Aiguillage. Sinon, vous pouvez utiliser
     un multim&#232;tre pour mesurer le courant sur un changement d'&#233;tat du bit 1  comme il est on et off.
</li>
	</ol>
<p> Vous avez maintenant un n&#339;ud C/MRI configur&#233; et fonctionnel. Vous pouvez ajouter
	plusieurs n&#339;uds, ou modifier la configuration de la carte DIN/ DOUT de ce n&#339;ud SUSIC,
	en revenant au dialogue de  Configuration du n&#339;uds C/MRI
	(<a href="#nodes">voir ci-dessous</a>).

	<a name=nodes></a><h3>Gestions des N&#339;uds</h3>

	<p>Chaque SMINI, USIC ou SUSIC est appel&#233; un "n&#339;ud". Avant d'utiliser C/MRI avec
	JMRI, vous devez dire &#224; JMRI les n&#339;uds que vous avez sur votre syst&#232;me et la
configuration de chaque n&#339;ud. Lorsque vous s&#233;lectionnez C/MRI dans les Pr&#233;f&#233;rences
de dialogue, un bouton "Configurer n&#339;uds C/MRI" est affich&#233;. Cliquez sur ce bouton
pour faire appara&#238;tre une bo&#238;te de dialogue pour entrer des informations de configuration de n&#339;ud. Vous pouvez
ajouter de nouveaux n&#339;uds ou mettre &#224; jour la configuration d'un n&#339;ud existant en revenant &#224; la
Pr&#233;f&#233;rence de dialogue (<b> Edition>Pr&#233;f&#233;rences ...</b>) ou en s&#233;lectionnant  <b>Configurer n&#339;uds
C/MRI</b> dans le menu CMRI. Assurez-vous de sauver vos pr&#233;f&#233;rences apr&#232;s avoir 
modifi&#233; la configuration de votre n&#339;ud.
Utilisez la bouton fonction "Enregistrer" dans la fen&#234;tre Pr&#233;f&#233;rences.</p>
<p>L'adresse d'un n&#339;ud est d&#233;finie en utilisant l'adresse des commutateurs sur votre carte C/MRI.
(adresses de n&#339;ud sont appel&#233;s UA dans les manuels C/MRI.) Les adresses de n&#339;ud doivent &#234;tre
unique pour chaque carte, mais ne doivent pas &#234;tre s&#233;quentiels. L'adresse de n&#339;ud est utilis&#233;e
dans le nom syst&#232;me JMRI pour r&#233;f&#233;rencer les bits d'entr&#233;e et de sortie appartenant &#224; ce
n&#339;ud (<a href="#numbers">voir ci-dessous</a>)</p>.
<p>La configuration des n&#339;uds C/MRI utilisant la bo&#238;te de dialogue de configuration est simple. Pour une
SMINI, il suffit d'entrer l'adresse de la carte d&#233;finie dans les commutateurs d'adresse sur le
carte SMINI, s&#233;lectionnez SMINI pour le type de N&#339;ud, et cliquez sur le bouton "Ajouter N&#339;ud"
. Pour une USIC ou SUSIC, entrez l'adresse du N&#339;ud, s&#233;lectionnez USIC_SUSIC,
cartes s&#233;lectionnez les cartes 24-bit ou 32-bit, puis dites &#224; JMRI quelle type de carte occupe tel emplacement
.</p>
<p>Pour chaque n&#339;ud, vous pouvez afficher une liste sommaire des bits C/MRI qui sont en
utilisation et ceux qui sont disponibles. S&#233;lectionnez Liste <b>Liste d'Affectations</b> dans le menu
CMRI pour faire appara&#238;tre un dialogue Liste des Affectations C/MRI. Ensuite, s&#233;lectionnez le
n&#339;ud int&#233;ressant dans la liste des n&#339;uds configur&#233;s, et si vous voulez
afficher les affectations des bits d'entr&#233;e ou de sortie. Les affectations  peuvent &#234;tre imprim&#233;es en cliquant sur le bouton Imprimer au 
bas de la fen&#234;tre de dialogue.</p>
<p>La<b> Liste Affectations</b> est utile pour v&#233;rifier que vous avez
configur&#233; le nombre exact de bits d'entr&#233;e et de sortie et l'adresse correcte du n&#339;ud
pour chaque n&#339;ud. Le logiciel Liste d'Affectation  travaille &#224; partir de l'actuel configuration 
C/MRI, si un n&#339;ud a &#233;t&#233; configur&#233;, il sera s&#233;lectionnable
dans le dialogue de la liste des affectations de C/MRI. Le Tableau d'affectation contient une ligne
pour chaque bit configur&#233; d'entr&#233;e ou sortie. Chaque ligne contient aussi une adresse
dans la colonne montrant quelle adresse utiliser pour chaque nom syst&#232;me C/MRI de JMRI .
L'impression vide de la liste d'affectation pour chaque n&#339;ud fournit un
document pratique &#224; utiliser dans la d&#233;termination des affectations des bits d'entr&#233;e/sortie.</p>

<a name=numbers></a><h3>Num&#233;rotation utilis&#233;e dans les Noms Syst&#232;mes C/MRI</h3>

<p>Les noms syst&#232;me C/MRI commencent par "C". Par exemple, "CS24" se r&#233;f&#232;re &#224; la 24eme ligne
        d'entr&#233;e, c'est un
"S" pour Sensor (Capteur), "CL35" se r&#233;f&#232;re &#224; la 35ieme  ligne de sortie ,
 "L" pour Light ( lumi&#232;re), et "CT38" se r&#233;f&#232;re &#224; la 38&#232;me ligne de sortie, un "T" pour Turnout (Aiguillage)(tous 
pour un n&#339;ud avec l'adresse de 0).</p>

<p> Chaque n&#339;ud, entr&#233;es et sorties est num&#233;rot&#233; s&#233;quentiellement &#224; partir de 1, sans
se soucier des types de cartes, ou du type de carte  qui est dans ce connecteur de carte.
Par exemple, si vous avez deux cartes d'entr&#233;e 24-bit, CS25 se r&#233;f&#232;re &#224; l'entr&#233;e de premi&#232;re
ligne sur la carte seconde entr&#233;e. Si vous avez deux cartes d'entr&#233;e 32-bit, CS25
se r&#233;f&#232;re &#224; la ligne d'entr&#233;e 25e sur la carte premi&#232;re entr&#233;e.</p>

<p> Chaque SMINI, USIC ou SUSIC (n&#339;ud) a une adresse unique fix&#233;e par ses commutateurs d'adresses et est entr&#233;e lorsque vous avez configur&#233; 
chaque n&#339;ud C/MRI
(<a href="#nodes"> voir ci-dessus</a>).
Les Capteurs et les Aiguillages sur le premier n&#339;ud (adresse 0) sont num&#233;rot&#233;es de 1 &#224;
999; Les Capteurs et les branchements sur le deuxi&#232;me n&#339;ud (adresse 1) sont num&#233;rot&#233;s 1001
&#224; 1999 etc ; Notez que les adresses de n&#339;ud peuvent &#234;tre s&#233;quentielles, mais ne sont pas
requises pour &#234;tre ainsi.</p>

<p>Par exemple:
	<ul>
	<li>Disons que vous avez une SMINI avec ses commutateurs adresse  r&#233;gl&#233; sur "2". Toutes les
	entr&#233;es et les sorties sur ce n&#339;ud seront num&#233;rot&#233;es &#224; partir de 2001.
     	<ul>
     	<li> CT2001 est la premi&#232;re broche de sortie
     	<li> CT2048 est la derni&#232;re broche de sortie
     	<li> CS2001 est la premi&#232;re broche d'entr&#233;e
     	<li> CS2024 est la derni&#232;re broche d'entr&#233;ee
  	 	</ul>
    <li> Si vous avez une USIC avec ses commutateurs adresse  r&#233;gl&#233; sur "1", elle aurra
    toutes les entr&#233;es et les sorties num&#233;rot&#233;s &#224; partir de 1001. Si elle a
    trois cartes d'entr&#233;e 24-bit, et deux cartes de sortie 24-bit, leur adresse sera:
     <ul>
     <li> CT1001 est la premi&#232;re  broche sur la premi&#232;re carte de sortie
     <li> CT1024 est la derni&#232;re  broche sur la premi&#232;re carte de sortie
     <li> CT1025 est la premi&#232;re  broche sur la 2&#232;me carte de sortie
     <li> CT1048 est la derni&#232;re  broche sur la 2&#232;me carte sortie
     <li> CS1001 est la premi&#232;re  broche sur la premi&#232;re carte d'entr&#233;e e
     <li> CS1024 est la derni&#232;re  broche sur la premi&#232;re carte d'entr&#233;e
     <li> CS1025 est la premi&#232;re  broche sur la 2&#232;me carte entr&#233;e
     <li> CS1049 est la premiere  broche sur la troisi&#232;me carte d'entr&#233;e
     <li> CS1072 est la derni&#232;re  broche sur la 3&#232;me carte d'entr&#233;
  	</ul>
Notez que ce n'est pas dans n'importe quel ordre que les cartes sont install&#233;es. &#231;a a &#233;t&#233;
configur&#233; lorsque vous avez mis en place le mat&#233;riel. JMRI s'est dit quel type de
carte est install&#233; dans ce connecteur USIC lorsque vous d&#233;finissez le n&#339;ud dans le dialogue de configuration
        C/MRI (<a href="#nodes">voir ci-dessus</a>).</li>
<li> vous avez un SUSIC avec son adresse commutateurs r&#233;gl&#233; sur "4", les entr&#233;es
et les sorties seront num&#233;rot&#233;es &#224; partir de 4001. Si elle a deux cartes entr&#233;es 32-bit
et de sortie &#224; deux 32-bit
, leur adresse sera:
     <ul>
     <li> CT4001 est la premi&#232;re broche sur la premi&#232;re carte de sortie
     <li> CT4032 est la derni&#232;re broche sur la premi&#232;re carte de sortie
     <li> CT4033 est la premi&#232;re broche sur la 2&#232;me carte de sortie
     <li> CT4064 est la derni&#232;re broche sur la 2&#232;me carte de sortie
     <li> CS4001 est la premi&#232;re broche sur la premi&#232;re carte d'entr&#233;e
     <li> CS4032 est la derni&#232;re broche sur la premi&#232;re carte d'entr&#233;e
     <li> CS4033 est la premi&#232;re broche sur la 2&#232;me carte d'entr&#233;e
     <li> CS4064 est la derni&#232;re broche sur la 2&#232;me carte d'entr&#233;e
     </ul>
    </li>
  </ul>

<p>Quand vous entrez une information Mat&#233;rielle dans la fen&#234;tre Ajouter Capteur,
vous pouvez Saisir l'ID du N&#339;ud, suivi par un":". Cette 
m&#233;thode peut aussi &#234;tre utilis&#233;e pour l'adressage alternatif/&#233;tendu.<br>
Donc pour un Capteur sur le n&#339;ud 2, broche 3 vous pouvez 
entrer la ligne suivante dans le champ d'adresse mat&#233;rie: <b>2:3</b></p>

<p>Pour r&#233;sumer, les broches d'entr&#233;e et de sortie sont &#233;tiquet&#233;es de mani&#232;re s&#233;quentielle
au sein de chaque n&#339;ud C/MRI. Pour compl&#233;ter l'adresse de bit, ajouter 1000 fois &#224;
l'adresse de station au  num&#233;ro de la broche num&#233;ro. Les adresses de n&#339;uds peuvent aller aussi haut que le mat&#233;riel C/MRI
le permet.</p>
<p> Pour un guide facile des adresses de broches d'entr&#233;e et de sortie, s&#233;lectionnez <b>
Liste Affectations</b> dans le menu pour acc&#233;der aux tables C/MRI des entr&#233;es et sorties affect&#233;es et libres pour chaque 
entr&#233;es et sorties disponibles pour chaque n&#339;ud. Chaque table a une ligne pour chaque  broche incluant une colonne d'adresse montrant quelle est 
l'adresse &#224; utiliser pour cette broche dans les noms syst&#232;me.</p>

<a name="alternate"></a><h3> Num&#233;rotation Compl&#233;mentaire pour les Noms Syst&#232;me</h3>

Un sch&#233;ma de rechange pour la num&#233;rotation dans les noms syst&#232;me de C/MRI a &#233;t&#233; d&#233;velopp&#233; pour
donner acc&#232;s aux utilisateurs au nombre total de lignes autoris&#233;es &#224; la conception de mat&#233;riel C/MRI.
Le syst&#232;me principal de num&#233;rotation (<a href="#numbers"> d&#233;crites ci-dessus</a>) permet
l'acc&#232;s &#224; 999 lignes d'entr&#233;e et de sortie sur chaque n&#339;uds. La conception de mat&#233;riel C/MRI,
toutefois, supporte beaucoup plus de bits pour les n&#339;uds USIC et SUSIC. La plupart des utilisateurs JMRI
n'auront jamais besoin de ce r&#233;gime compl&#233;mentaire, et doivent utiliser le syst&#232;me de num&#233;rotation principal.
<p>
Le r&#233;gime compl&#233;mentaire de num&#233;rotation est similaire au r&#233;gime principal de num&#233;rotation,
sauf l'adresse du n&#339;uds et les num&#233;ro de bits sont s&#233;par&#233;s par un "B",
et les deux adresse de n&#339;ud et le num&#233;ro de bits peuvent aller &#224; n'importe quelle valeur prise en charge par C/MRI.
Par exemple, CS1B13 se r&#233;f&#232;re &#224; la ligne d'entr&#233;e 13 d'un n&#339;ud avec l'adresse 1, et est
&#233;quivalent &#224; CS1013 du m&#233;canisme principal de num&#233;rotation. Aussi CT2B1109 se r&#233;f&#232;re &#224; la ligne de sortie
1109  d'un n&#339;ud avec l'adresse 2, et il n'y a pas d'&#233;quivalent dans le
 syst&#232;me principal de num&#233;rotation. Les utilisateurs peuvent utiliser indiff&#233;remment le sch&#233;ma de num&#233;rotation
pour les num&#233;ros de ligne jusqu'&#224; 999, mais il doit utiliser le syst&#232;me de num&#233;rotation pour les num&#233;ros compl&#233;mentaires pour les
 num&#233;ros de ligne sup&#233;rieur &#224; 999. Pour plus de facilit&#233; pour communiquer avec d'autres utilisateurs,
l'utilisation du sch&#233;ma de num&#233;rotation principale est recommand&#233;e, &#224; moins que des bits sup&#233;rieur &#224; 999
doivent &#234;tre adress&#233;s.

<a name="options"></a><h3>Options de Commande d'un Aiguillage par C/MRI</h3>

Les Aiguillages peuvent &#234;tre command&#233;s en utilisant un ou deux bits de sortie.
Lorsque l'Aiguillage est cr&#233;&#233; en utilisant l'option Ajouter dans le Tableau Aiguillage,
il est demand&#233; &#224; l'utilisateur si l'Aiguillage doit &#234;tre pilot&#233; par un
ou deux bits de sortie.
<p>
Si la sortie de commande 1 bit est s&#233;lectionn&#233;e, l'utilisateur doit s&#233;lectionner la commande d'&#233;tat "stable"
ou "puls&#233;". Si l'"&#233;tat stable" est s&#233;lectionn&#233;, alors le bit de sortie est r&#233;gl&#233;
"Off"pour DIRECT ("normal" dans les manuels C/MRI) ou "On "pour D&#233;VI&#233; ("inverse" dans les  manuels
C/MRI). Lorsque le bit de sortie est d&#233;termin&#233;, JMRI compare l'&#233;tat requis
&#224; l'&#233;tat indiqu&#233; par la valeur actuelle du bit de sortie. Si ces &#233;tats
diff&#233;rent, alors le bit de sortie est fix&#233; comme indiqu&#233; ci-dessus. Si ces &#233;tats
sont les m&#234;mes, cet &#233;tat est compar&#233; &#224; l'&#233;tat indiqu&#233; par les r&#233;tro-signalisations de l'Aiguillage.
Si les &#233;tats sont les m&#234;mes, aucune mesure n'est prise, puisque l'Aiguillage est d&#233;j&#224; dans
l'&#233;tat requis. Si les &#233;tats sont diff&#233;rents, l'Aiguillage a &#233;t&#233; sans doute
chang&#233; par quelque moyen distinct de JMRI. Afin de s'assurer que l'Aiguillage est effectivement
mis &#224; l'&#233;tat requis, le bit de sortie est d'abord modifi&#233; pour correspondre &#224; l'&#233;tat
indiqu&#233; par les informations de l'Aiguillage, puis une seconde plus tard il est chang&#233; &#224; nouveau pour
correspondre &#224; l'&#233;tat demand&#233;. Ceci garantit un changement d'&#233;tat pour les dispositifs de commande des Aiguillages qui
 n&#233;cessitent un changement d'&#233;tat pour d&#233;placer actuellement l'Aiguillage.  
<p>
Si une sortie avec 1 bit de commande puls&#233;e est s&#233;lectionn&#233;e, le bit de sortie est "Off" lorsque
rien ne se passe. Lorsque l'&#233;tat D&#233;VI&#233; est demand&#233;e, cette demande est
compar&#233;e &#224; l'&#233;tat connu de l'Aiguillage (qui suit les r&#233;tro-signalisations de l'Aiguillage).
Si l'&#233;tat connu indique que l'Aiguillage est d&#233;j&#224; dans l'&#233;tat requis,
rien n'est fait. Si l'&#233;tat connu est diff&#233;rent de l'&#233;tat requis, alors
le bit est "puls&#233;e". Une "pulse" se compose de bits &#233;tant mis &#224; "On" pour une
seconde, puis revient &#224;  "Off  . 
<p>
Si la commande par deux bits de sortie est s&#233;lectionn&#233;e, le bit r&#233;f&#233;renc&#233; dans le nom syst&#232;me d'Aiguillage
(voir ci-dessus) et le bit suivant dans la s&#233;quence sont utilis&#233;s pour contr&#238;ler l'Aiguillage.
Par exemple, si CT33 a deux bits de sorties de commande, les bits 33e et 34e
 sont utilis&#233;s pour commander l'Aiguillage. Si la commande  des deux bits de sorties est s&#233;lectionn&#233;e, l'utilisateur
doit s&#233;lectionner la commande par &#233;tat "stable" ou "puls&#233;". La Commande de l'&#233;tat stable
devrait &#234;tre s&#233;lectionn&#233; pour les moteur d'Aiguillage &#224; d&#233;crochage, comme les Tortoises, si il est
command&#233; selon la recommandation dans le manuel utilisateur version 3.0, page 3-12  de Chubb .
 Avec le contr&#238;le de l'&#233;tat d'&#233;quilibre, pour DIRECT, le premier bit est
r&#233;gl&#233;e sur "OFF" et le second bit est r&#233;gl&#233; sur "ON", pour D&#233;VI&#233;, l'&#233;tats des bits sont
invers&#233;, c'est &#224; dire, le premier bit est r&#233;gl&#233; sur "ON" et le second bit est r&#233;gl&#233; sur "OFF". 
  <p>
Si la commande avec deux bits de sortie avec commande impulsionelle est demand&#233;e, les deux bits sont "Off"
quand rien ne se passe. Lorsque DIRECT  ou D&#233;VI&#233; est demand&#233;e, cette demande est compar&#233;e
 &#224; l'&#233;tat connu de l'Aiguillage (qui suit les r&#233;tro-signalisations de l'Aiguillage). Si
l'&#233;tat connu indique que l'Aiguillage est d&#233;j&#224; dans l'&#233;tat requis,
rien n'est fait. Si l'&#233;tat connu est diff&#233;rent de l'&#233;tat requis, alors
le premier bit est puls&#233; si DIRECT est demand&#233;, ou le second bit est puls&#233; si
D&#233;VI&#233; est demand&#233;. Dans les deux cas, une "impulsion" consiste en un cr&#233;neau port&#233;
 &#224; "On" pendant une seconde, puis revient &#224; la position "Off".
<p><I> Notez que d'avoir une commande deux bits de sortie, impose la cr&#233;ation d'un
 Aiguillage en utilisant le bouton "Ajouter" dans le Tableau Aiguillage.</I>
<p>
Enfin, l'option "invers&#233;" peut &#234;tre s&#233;lectionn&#233;e. Ce contr&#238;le de
la fa&#231;on dont le mat&#233;riel le CMRI met en oeuvre le "On " et "Off" utilis&#233; dans le
description ci-dessus. Normalement (l'option inverser n'est pas pas s&#233;lectionn&#233;e),
"ON" se r&#233;f&#232;re &#224; un "1" pour le mat&#233;riel; pour la norme mat&#233;riel C/MRI,
tire la broche de sortie vers la masse et lui permet de recevoir du courant. "Off"
correspond &#224; un "0 "pour le mat&#233;riel, en mettant la broche de sortie hors tension,
et de le faire arr&#234;ter par manque de courant.
<p>
Lorsque "inverser" est s&#233;lectionn&#233;, "On " se traduit par un "0" envoy&#233; au mat&#233;riel, et
"Off" se traduit par un "1" . Cela provoque la r&#233;action du mat&#233;riel avec
la polarit&#233; oppos&#233;e.

<h3>C&#226;blage</h3>
<a name="usb"></a><h4>Utilisation des adaptateurs USB-s&#233;rie</h4>
<p>La plupart des syst&#232;mes C/MRI utilise les signaux &#233;lectriques R485 pour communiquer entre 
les n&#339;uds et l'ordinateur. Il y a plusieurs fa&#231;ons de les g&#233;n&#233;rer:
<ol>
<li> Si votre ordinateur &#224;a un port s&#233;rie int&#233;gr&#233; ( connexion RS232 ), vous pouvez utiliser 
un convrtisseur RS232 vers RS485. Il y en a un que construire comme 
&#233;l&#233;ment du syst&#232;mes C/MRI, ou vous pouvez en achetez un.
<li>Si votre ordinateur a un port USB, vous pouvez acheter un adaptateur
commercial USB vers R485 et l'utiliser.
<li>Si votre ordinateur a un port USB et que vous avez un adaptateur 
RS232 ver RS485, vous pouvez installer un adaptateur ( quelques fois appel&#233;
un "convertisseur USB vers s&#233;rie" ), puis connectez la sortie RS232 de celui-ci &#224;
l'entr&#233;e RS232 du convertisseur RS232 vers RS485.
Notez que si vous utilisez un convertisseur Chubb RS232-RS485, quelques 
adaptateurs USB-RS232 demanderont que vous connectiez certains fils de 
commande RS232qui sont pas manipul&#233;s par le convertisseur Chubb:

	<ul>
	<li>DSR - DTR ( pins 4 et 6 sur le connecteur DB9 )	
	<li>RTS - CTS ( pins 7 et 8 sur le connecteur DB9 )
	</ul>
</ol>
<p>
Dans tous les cas, la ligne de communication finira par appara&#238;tre 
comme un port s&#233;rie sur votre ordinateur. Dans Windows, c'est un port COM, 
pour les autres ordinateurs il est nomm&#233; &#233;quipement s&#233;rie. Vous aurez &#224; s&#233;lectionner
le bon lors de la configuration de JMRI.

<a name="net"></a><h4>Utilisation d'une Connexion R&#233;seau</h4>

<p>JMRI vous permet de vous connecter &#224; un n&#339;ud C/MRI&#224; travers une
connexion r&#233;seau. JMRI communique via le 
protocole TCP/IP
&#224; travers un r&#233;seau par uns adaptateur r&#233;seau-s&#233;rie, 
qui convertit la connexion r&#233;seau en un flux 
s&#233;rie qui va alors &#224; travers un convertisseur RS485 au(x) n&#339;ud(s) C/MRI.
<p>
L'adaptateur r&#233;seau - s&#233;rie est souvent appel&#233; 
un "<a href="../TerminalServer.shtml">serveur termina</a>".Il est aussi appel&#233; 
une "Box Lantronicx" Apr&#232;s un d&#233;but de fabrication de celles-ci, ainsi elles 
sont maintenant disponible depuis de multiples sources. L'adaptateur 
doit &#234;tre configur&#233; avec les param&#232;tres s&#233;rie correctes pour 
votre syst&#232;me C/MRI, incluant la bonne vitesse, 8 bits de donn&#233;e, pas de parit&#233;. 
Vous aurez probablement besoin d'un adaptateur RS232 - RS485 sur la sortie de votre 
adaptateur r&#233;seau.
<p>
Certains amateurs ont &#233;galement construit des n&#339;uds C/MRI 
qui ont des connexions Ethernet natives. JMRI communique
 avec eux via une connexion TCP/IP directe utilisant le protocole C/MRI, 
mais dans ce cas il n'y a pas besoin d'un convertisseur RS485.
<p>
Pour configurer JMRI pour utiliser une connexion r&#233;seau, allez &#224; l'&#233;cran 
des Pr&#233;f&#233;rences, onglet Connexion. Apr&#232;s avoir s&#233;lectionn&#233; C/MRI pour le System Manufacturer, 
S&#233;lectionnez "Network Interface" pour le System Connection. Puis entrez l'adresse IP
( ou le nom du n&#339;ud, s'il en a un ) de votre adaptateur r&#233;seau - s&#233;rie dans le 
champ IP Address / Host Name field. S'il utilise un num&#233;ro de port non standard,
cochez la case Additional Configuration Settings et entrez le num&#233;ro du port. 
Cliquez Enregistrer et red&#233;marrez le programme.

<a name="signals"></a><h4>C&#226;blage Signaux</h4>
<p>
JMRI peut travailleravec les m&#233;thodes les plus populaire de c&#226;blage
des signaux pour le mat&#233;riel C/MRI ( il y en a une certaine quantit&#233;! )
Pour avoir des informations sur comment configurer vos signaux 
pour le programme, voir le page
<a href="Signals.shtml">signaux C/MRI</a>. 

<a name="sim"></a><h3>Ex&#233;cution de JMRI lorsqu'il est d&#233;connect&#233; de votre syst&#232;me C/MRI</h3>

<p>JMRI scrute continuellement, le mat&#233;riel C/MRI pour les changements d'&#233;tat.
Si un ou plusieurs n&#339;uds C/MRI ne r&#233;pondent pas, &#233;ventuellement leurs entr&#233;es (Capteurs)
sont mis &#224; l'&#233;tat INCONNU pour indiquer que JMRI a perdu le contact avec
ces dispositifs sur le r&#233;seau.
<p>
Bien que ce soit la bonne chose &#224; faire quand vous &#234;tes vraiment connect&#233; au
mat&#233;riel et tenter de faire fonctionner le r&#233;seau, il peut l'obtenir de la mani&#232;re o&#249; vous &#234;tes
en cours d'ex&#233;cution JMRI sans vos connexions r&#233;seau.
Par exemple,Vous pouvez le faire, travailler sur vos panneaux tout en &#233;tant
loin du r&#233;seau, ou alors que le r&#233;seau doit &#234;tre mis hors tension pour une raison quelconque.
<p>
Pour r&#233;pondre en utilisant JMRI sans une connexion active au r&#233;seau,
dans le JMRI 2.3.2 une version connexion "C/MRI Simulateur" connexion a &#233;t&#233; mis &#224; disposition
dans les pr&#233;f&#233;rences.
<p>
<i>S'il vous pla&#238;t notez que ce n'est valable que pour les utilisateurs qui ont d&#233;j&#224; un connexion de travail
C/MRI configur&#233;e. S'il vous pla&#238;t ne pas essayer d'
utiliser le simulateur CMRI avant de configurer une connexion valide de mat&#233;riel C/MRI,
cela ne fonctionnera pas.</i>
<p>
Une fois que vous avez votre connexion C/MRI configur&#233;e, quand votre mat&#233;riel n'est
pas disponible, vous pouvez simplement aller dans les Pr&#233;f&#233;rences JMRI, s&#233;lectionnez "C/MRI Simulator",
Enregistrer les pr&#233;f&#233;rences, quitter et red&#233;marrer. Ne pas modifier d'autres param&#232;tres !
<p>
Lorsque le mat&#233;riel de la C/MRI est &#224; nouveau disponible, rendez-vous dans les pr&#233;f&#233;rences JMRI,
s&#233;lectionnez "C/MRI Serial", enregistrer les Pr&#233;f&#233;rences, quitter et red&#233;marrer.

<a name="tools" id="tools"></a><h2>Outils JMRI pour C/MRI</h2>
<img src="images/CMRImenu416.png" alt="Config Pane" align="right" height="162" width="213">
<p>Le menu CMRI contient 5 outilss:

<a name="monitor" id="monitor"></a><h3>CMRI Monitor</h3>
<p>Listes toutes les Commandes S&#233;rie vues sur la connexion.

<a name="sendcommand"></a><h3>Envoi Commande</h3>
<a href="images/CMRIMonitor.png">
<img src="images/CMRIMonitor.png" alt="Monitor Pane" height="112" width="350"></a>&nbsp;
<a href="images/CMRISendSerialCommand.png">
<img src="images/CMRISendSerialCommand.png" alt="Monitor Pane" height="73" width="123"></a>

<a href="images/CMRIDiagnostic.png">
<img src="images/CMRIDiagnostic.png" alt="Diagnostic Pane" height="164" width="235" align="right"></a>

<a name="diagnostics" id="diagnostics"></a><h3>Ex&#233;cuter Diagnostic</h3>
<p>
JMRI prends en charge les deux proc&#233;dures de diagnostics automatis&#233;es mentionn&#233;es au 
chapitre 6 du <b>Manuel Utilisateur C/MRI, Version 3.0</b> de Bruce Chubb. Les diagnostics 
sont utilis&#233;s pour v&#233;rifier le fonctionnement de votre mat&#233;riel C/MRI. Ces proc&#233;dures 
automatis&#233;es sont command&#233;es via un dialogue disponible en s&#233;lectionnant 
<b><a href="../../../package/jmri/jmrix/cmri/serial/diagnostic/DiagnosticFrame.shtml">Ex&#233;cuter Diagnostic</a></b> 
dans le menu C/MRI.<br>
Le <strong>Test Wraparound</strong> n&#233;cessite un c&#226;ble de test circulaire sp&#233;cial, et 
le <strong>Output Test</strong> n&#233;cessite une carte test de sortie sp&#233;ciale. 
Les deux &#233;quipements sont d&#233;crits dans le manuel r&#233;f&#233;renc&#233; ci-dessus. Aucune autre connexion aux 
bits d'entr&#233;es ou de sorties sur les cartes devant &#234;tre test&#233;es ne doit &#234;tre faite quand ces tests 
sont effectu&#233;s. Les diagnostics sont faciles &#224; utiliser. Suivez simplement les instructions pr&#233;sent&#233;es 
dans le dialogue Ex&#233;cuter Diagnostic C/MRI. Les erreurs trouv&#233;es sont report&#233;es dans la fen&#234;tre 
d'&#233;tat du dialogue.</p>

<a href="images/CMRIConfigNodesSMINI.png">
<img src="images/CMRIConfigNodesSMINI.png" alt="Config Pane" align="right" height="202" width="218"></a> 
<a href="images/CMRIConfigNodesUSIC.png">
<img src="images/CMRIConfigNodesUSIC.png" alt="Config Pane" align="right" height="202" width="218"></a>
<a name="confignodes"></a><h3><a href="../../../package/jmri/jmrix/cmri/serial/nodeconfig/NodeConfigFrame.shtml">Configurer les N&#339;uds C/MRI</a></h3>
<p>S&#233;lectionnez "Configure C/MRI Nodes" depuis le menu C/MRI, et depuis la liste d&#233;roulante en haut &#224; droite, choisissez soit un type de N&#339;uds SMIM ou SUSIC &#224; configurer. Ensuite entrez un num&#233;ro de n&#339;ud dans le champ &#224; gauche et cliquez sur une des petites cases pour configurer une sortie sp&#233;cifique.<br>
Cliquez "Edit Node" pour actualiser, puis fermez le volet.

<h3>Liste d'Affectations</h3>
<a href="images/CMRIList.png">
<img src="images/CMRIList.png" alt="List Pane" height="140" width="212"></a>

<a name="documentation" id="documentation"></a><h2>Documentation</h2>

<h3>Aide JMRI</h3>
    <ul>
    <li><a href="Signals.shtml">Signaux C/MRI</a></li>
    </ul>

<h3>Autres Infos</h3>
<p>Pour une info compl&#233;mentaire  sur C/MRI ( incluant le Manuel Utilisateur c/MRI), 
voir:</p>
    <ul>
    <li>Le site web <a href="http://www.jlcenterprises.net/">JLC Enterprises</a></li>
    <li>Le site de discussion <a href="https://groups.yahoo.com/neo/groups/CMRI_Users/info">C/MRI users Yahoo group</a></li>
    <li>Le site web <a href="http://www.easeeinterfaces.com">Easee Interfaces</a>.</li>
    </ul>

<!--#include virtual="/Footer" -->
  </div><!-- closes #mainContent-->
 </div> <!-- closes #mBody-->
</body>
</html>
