<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01//EN"
"http://www.w3.org/TR/html4/strict.dtd">
<!-- Translated by Blorec Herv&#233; le 2011-15-07-->
<html lang="fr">
<head>
<meta name="generator" content=
"HTML Tidy for Mac OS X (vers 31 October 2006 - Apple Inc. build 15.17), see www.w3.org">
<title>Basic throttle window usage</title>
<meta name="keywords" content=
"JMRI decoderpro dcc nmra throttlepro">
<meta name="Description" content=
"Throttle documentation for JMRI project">
<meta name="Keywords" content="JMRI">
<meta name="Author" content="Lionel Jeanson">
<meta name="Language" content="fr">
<meta name="Robots" content="Index, Follow">
<meta name="Revisit-After" content="7 Days">
<!-- The combination of "Define" and {Header,Style, Logo and Footer} comments --><!-- are an arbitrary design pattern used by the update.pl script to --><!-- easily replace the common header/footer code for all the web pages --><!-- delete the following 2 Defines if you want to use the default JMRI logo --><!-- or change them to reflect your alternative logo --><!-- Style -->
<meta http-equiv="Content-Type" content=
"text/html; charset=us-ascii">
<link rel="stylesheet" type="text/css" href="/css/default.css"
media="screen">
<link rel="stylesheet" type="text/css" href="/css/print.css" media=
"print">
<link rel="icon" href="/images/jmri.ico" type="image/png">
<link rel="home" title="Home" href="/"><!-- /Style -->
</head>
<body>
<!--#include virtual="/Header" -->
<div id="mBody"><!--#include virtual="Sidebar" -->
<div id="mainContent">
<h1>L'utilisation de la Fen&ecirc;tre R&eacute;gulateur</h1>
<img src="images/BasicThrottleWindow.png" alt=
"BasicThrottleWindow.png"><br>
<h2>Structure de Base d'une Fen&ecirc;tre R&eacute;gulateur</h2>
Il ya trois panneaux (ou sous-fen&ecirc;tres) associ&eacute;s
&agrave; chacune des fen&ecirc;tres R&eacute;gulateurs . Ils sont
identifi&eacute;s comme &eacute;tant:<br>
<ul>
<li>Le panneau de configuration &mdash; contient un curseur
d'acc&eacute;l&eacute;rateur pour contr&ocirc;ler la vitesse de la
locomotive, d'un s&eacute;lecteur de marche avant et
arri&egrave;re, une bouton d'arr&ecirc;t d'urgence et un bouton
Arr&ecirc;t (principalement utilis&eacute; pour les
d&eacute;codeurs son).</li>
<li>Le panneau Fonction &mdash; est utilis&eacute; pour associer
les touches de fonction avec les fonctions de sortie active du
d&eacute;codeur.</li>
<li>Le panneau Adresse &mdash; est utilis&eacute; pour identifier
l'adresse du d&eacute;codeur, et d' exp&eacute;dition ou de
lib&eacute;rationr de l'adresse identifi&eacute;e.</li>
</ul>
Notez que ces trois panneaux sont en fait des fen&ecirc;tres
d&eacute;finies au sein d'une fen&ecirc;tre globale, chacun de ces
panneaux contient ses propres boutons "minimiser" et "fermer"
&mdash; ainsi ils peuvent &ecirc;tre redimensionn&eacute;s. Vous
pouvez effectivement minimiser un ou plusieurs de ces panneaux dans
la fen&ecirc;tre du r&eacute;gulateur. Lorsque une de ces
sous-fen&ecirc;tres est ferm&eacute;e, elle peut &ecirc;tre
r&eacute;ouverte par le biais <a href=
"ThrottleWindowMenus.shtml">du menu Affichage</a> .<br>
<br>
Pour plus de d&eacute;tails sur l'utilisation du R&eacute;gulateur
<a href="ThrottleWindowMenus.shtml">voir l&agrave;, les menus de la
fen&ecirc;tre</a> .<br>
Pour plus de d&eacute;tails sur l'utilisation du r&eacute;gulateur
<a href="ThrottleToolBar.shtml">voir l&agrave;, barre d'outils de
la fen&ecirc;tre</a> .<br>
Pour plus de d&eacute;tails sur l'utilisation des
pr&eacute;f&eacute;rences manettes <a href=
"ThrottlesPreferencesPane.shtml">voir l&agrave;, les
pr&eacute;f&eacute;rences de R&eacute;gulateur</a> .<br>
<br>
Pour un contr&ocirc;le<a href="AdvancedThrottleControl.shtml">,
avanc&eacute; d'un R&eacute;gulateur,</a><br>
<h2>Panneau Adresse - Attribuer une adresse du d&eacute;codeur
&agrave; un R&eacute;gulateur</h2>
<br>
La premi&egrave;re chose a faire pour activer les options ou les
boutons quand la fen&ecirc;tre devient active, est d'assigner
l'adresse d'un d&eacute;codeur dans le "Panneau d'adresses". Il y a
deux fa&ccedil;ons pour accomplir cela.<br>
Saisissez manuellement l'adresse du d&eacute;codeur dans la grande
zone de texte ou s&eacute;lectionnez une entr&eacute;e Liste
(Roster) existante par l'interm&eacute;diaire du menu COMBOX, puis
cliquez sur le bouton "D&eacute;finir"(Set).<br>
Lorsque vous saisissez manuellement une adresse, n'oubliez pas de
cliquer sur le bouton Validation (Set). Sans cette &eacute;tape,
toutes les actions du r&eacute;gulateurs sont
d&eacute;sactiv&eacute;es.<br>
<br>
Notez qu'il y a une option dans le <a href=
"ThrottlesPreferencesPane.shtml">panneau des
pr&eacute;f&eacute;rences R&eacute;gulateurs</a> qui permettra un
regard automatiques de retour dans la Liste DB quand une adresse
est entr&eacute;e, et &eacute;ventuellement d&eacute;clencher
automatiquement l'affichage d'un jeu de r&eacute;gulateurs, si
aucune entr&eacute;e Roster correspondante n'est
trouv&eacute;e.<br>
Apr&egrave;s qu'une adresse ait &eacute;t&eacute;
s&eacute;lectionn&eacute;e, toutes les autres commandes et options
de la fen&ecirc;tre r&eacute;gulateur seront activ&eacute;es:<br>
<ul>
<li>Envoi &mdash; Communication de l'adresse du d&eacute;codeur
vers la centrale de commande en mode "exp&eacute;dition" .
Habituellement, une seule adresse peut &ecirc;tre dans
l'&eacute;tat d'exp&eacute;dition vers la centrale de commande
&mdash; toutes les autres sont soit "utilis&eacute;es" ou
"inactives" (lib&eacute;r&eacute;). Les commandes et les options de
la fen&ecirc;tre de R&eacute;gulateur deviendront
d&eacute;sactiv&eacute;es jusqu'&agrave; ce qu'une autre adresse
soit "D&eacute;finie"(Set).</li>
<li>Programme - ouvre un programmateur DecoderPro en
Mode&mdash;ops-mode (programmation sur la voie principale)
DecoderPro programmateur en Mode&mdash;ops pour la locomotive
s&eacute;lectionn&eacute;e. Il est seulement actif quand une
entr&eacute;e de registre a &eacute;t&eacute;
s&eacute;lectionn&eacute;e sur le r&eacute;gulateur.</li>
</ul>
<h2>Panneau de configuration &mdash; Faisons circuler un train</h2>
Maintenant que vous avez cr&eacute;&eacute; une adresse pour le
r&eacute;gulateur, vous devriez &ecirc;tre capable de faire
circuler le train sur votre r&eacute;seau (si votre r&eacute;seau
est actif et que l'adresse que vous avez entr&eacute;e est valide
pour une locomotive sur la voie). Vous devez faire cela en
utilisant le "Panneau Contr&ocirc;le" .<br>
<ul>
<li>Le curseur de contr&ocirc;le de la vitesse
d'acc&eacute;l&eacute;ration.</li>
<li>Le bouton de direction marche avant et arri&egrave;re.</li>
<li>Le STOP! Ce bouton enverra un message d'arr&ecirc;t d'urgence
(vitesse de DCC &agrave; -1) &agrave; la locomotive.</li>
<li>l'Arr&ecirc;t (Idle) va arr&ecirc;ter la locomotive
progressivement (vitesse de DCC &agrave; 0) (si le d&eacute;codeur
a ses rampe d'acc&eacute;l&eacute;ration ou de freinage
activ&eacute;es, la locomotive permettra d'acc&eacute;l&eacute;rer
ou de ralentir en cons&eacute;quence. Si aucune valeur dynamique
n'est activ&eacute;e, la loco va acc&eacute;l&eacute;rer ou
ralentir brusquement .).</li>
</ul>
Attention o&ugrave; vous cliquez avec le pointeur de votre souris
dans le Panneau de configuration. Si vous cliquez n'importe
o&ugrave; &agrave; proximit&eacute; du curseur, votre loco peut
d&eacute;marrer d'une fa&ccedil;on inattendue (voir plus bas). Si
vous cliquez n'importe o&ugrave; sur les mots "Avant" ou
"Arri&egrave;re", vous pouvez changer la direction du train
<h3>Configuration du volet Panneau de Contr&ocirc;le</h3>
<img src="images/ControlPanelPreferences.png" alt=
"ControlPanelPreferences.png"><br>
Ce volet accessible par un clic droit dans le volet Panneau de
configuration et l'ouverture entr&eacute;e du menu
Propri&eacute;t&eacute;s<br>
<h2>Le Groupe Fonction</h2>
<p>Le Groupe dispose de 28 touches de Fonctions disponibles par
R&eacute;gulateur. La plupart des d&eacute;codeurs actuellement ne
traitent pas les 28 fonctions. Le panneau de fonction affiche les
boutons en deux groupes, appuyez sur la touche "*" dans le coin
gauche dans la partie inf&eacute;rieure pour voir la
deuxi&egrave;me s&eacute;rie de boutons de fonction.</p>
<p>Cliquer sur les boutons de fonctions en corr&eacute;lation avec
l'apui sur les m&ecirc;mes boutons de fonction sur un
r&eacute;gulateur &agrave; main. La fonction F0 est normalement
utilis&eacute; pour les feux.</p>
<p>Il s'agit de la fonctionnalit&eacute; de base du Groupe de
fonction. Tous les boutons fonctionnent comme une bascule
marche/arr&ecirc;t &mdash; cliquez une fois pour activer "Marche"
et cliquez de nouveau pour basculer sur "Arr&ecirc;t".</p>
<h3>Fonction bouton configuration volet</h3>
<img src="images/FunctionButtonProperties.png" alt=
"FunctionButtonProperties.png"><br>
Ce volet s'il est accessible par un clic droit dans le volet
AddressPanel, sur une Touche de Fonction sp&eacute;cifique et
ouvrant une entr&eacute;e du menu Propri&eacute;t&eacute;s.<br>
<br>
Notez que pour les R&eacute;gulateurs qui ont une Liste
associ&eacute;e, il est pr&eacute;f&eacute;rable de d&eacute;finir
ces param&egrave;tres dans la Fonction <a href=
"RostersMediaPane.shtml">volet &eacute;tiquettes dans
DecoderPro</a> . (Mais si vous les modifiez ici, vous pouvez
toujours exporter ces changements gr&acirc;ce &agrave; <a href=
"ThrottleWindowMenus.shtml">l'exportation dans le menu
entr&eacute;es de la Liste</a> )<br>
<br>
<ul>
<li>Num&eacute;ro de la fonction &mdash; associe le bouton avec un
num&eacute;ro de fonction</li>
<li>texte &mdash; personnalisation du texte de l'&eacute;tiquette
du bouton</li>
<li>Taille de la police &mdash; taille du texte affich&eacute; sur
le bouton</li>
<li>verrouillable &mdash; indique si le bouton agit comme un
interrupteur &agrave; bascule "Marche/Arr&ecirc;t" , ou comme un
commutateur momentan&eacute;</li>
<li>Visible &mdash; indique si le bouton est visible dans la
fen&ecirc;tre Panneau Fonction</li>
</ul>
Par d&eacute;faut, le Num&eacute;ro de Fonction est associ&eacute;
au num&eacute;ro de bouton o&ugrave; vous avez initialement fait un
clic droit dessus. Par exemple, dans les chiffres indiqu&eacute;s
ci-dessus, le num&eacute;ro de la fonction "3" (F3) est en cours
d'&eacute;dition. Il est recommand&eacute; que vous laissez ce
num&eacute;ro comme il est, cependant, vous pouvez changer cela en
un num&eacute;ro de fonction diff&eacute;rent si vous voulez
vraiment. Un exemple de pourquoi vous voudrez peut-&ecirc;tre le
faire est si vous voulez vraiment que le bouton "lumi&egrave;res"
&mdash; qui est g&eacute;n&eacute;ralement F0 (situ&eacute; comme
le dernier bouton/bas par d&eacute;faut) &mdash; soit situ&eacute;
aussi sur le premier bouton dans le panneau de fonction.<br>
<br>
<span style="font-weight: bold;">Attention!</span> Si toutes les
modifications sont fait pour le champs "Num&eacute;ro de la
fonction", v&eacute;rifiez pour vous assurer que deux boutons ne
soient pas affect&eacute;s au m&ecirc;me num&eacute;ro de fonction
&mdash; certaines cons&eacute;quences ind&eacute;sirables
oeurraient se produire.<br>
<br>
Les Champ Texte seront les bienvenus et modifi&eacute;s. Par
d&eacute;faut, ils sont d&eacute;fini pour un r&eacute;gulateur
&agrave; main similaire : F1 ... F2 F3 ... ... etc le contenu du
champ est assez largement ouverte &agrave; l'imagination,
cependant, il va &ecirc;tre un point o&ugrave; la longueur du texte
ne va pas s'adapter au bouton. Le champ Taille de la police est
disponible aussi pour aider &agrave; obtenir le texte voulu pour
l'adapter au bouton. Un peu d'exp&eacute;rimentation sera
n&eacute;cessaire ici pour d&eacute;terminer ce qui semble bon pour
vous &mdash; et ce sera bon<br>
.<br>
La case &agrave; cocher verrouillable peut &ecirc;tre un peu
d&eacute;routante au premier abord. Lorsqu'elle est activ&eacute;e
&mdash; Comme elle l'est par d&eacute;faut &mdash; cela signifie
simplement que lorsque le bouton est cliqu&eacute; , il va se
"verrouiller" lui-m&ecirc;me soit dans un &eacute;tat "marche" ou
un &eacute;tat "arr&ecirc;t". Autrement dit, le bouton agira comme
un interrupteur &agrave; bascule&mdash; cliquez une fois pour
activer la fonction "marche"; cliquez &agrave; nouveau pour activer
la fonction "arr&ecirc;t". l' oppos&eacute; de cette action est ce
qui arrive lorsque la case &agrave; cocher est
d&eacute;sactiv&eacute;e. Puis le bouton agit comme un interrupteur
momentan&eacute; &mdash; fournissant une commande passag&egrave;re
"marche" pour aussi longtemps que le bouton de la souris est
cliqu&eacute;e maintenue sur le bouton. Lorsque le bouton de la
souris est rel&acirc;ch&eacute;, une commande "arr&ecirc;t" est
envoy&eacute; &agrave; la fonction. Un bon exemple de l'endroit
o&ugrave; on pourrait vouloir l'utiliser c'est lors de la
personnalisation d'une configuration d'un r&eacute;gulateur pour un
d&eacute;codeur sonore. La corne/sifflet est plus proche du
fonctionnel lorsque cette option est d&eacute;sactiv&eacute;e.
Selon la vitesse du syst&egrave;me informatique et le
syst&egrave;me DCC, un clic court et rapide donnerait un bref coup
de klaxon ou de coup de sifflet. Maintenez la touche un peu plus
longtemps produirait un coup de sifflet plus long.<br>
<br>
La case &agrave; cocher Visible permet de "retirer" les boutons
inutiles. Par d&eacute;faut, tous les boutons de fonction sont
activ&eacute;s comme "visible" de sorte qu'ils puissent
&eacute;videmment &ecirc;tre vus. Mais s'il y a une seule fonction
d'utilis&eacute;e &mdash; par exemple les "lumi&egrave;res" (F0)
&mdash;, alors cette option fournit les capacit&eacute; &agrave;
"cacher" l'ensemble des autres boutons.<br>
<br>
<span style="font-weight: bold;">Attention!</span>
D&eacute;sactiver la case &agrave; cocher "Visible" doit &ecirc;tre
l'une des derni&egrave;res &eacute;tapes effectu&eacute;es pendant
ce processus de personnalisation. La raison en est qu'une fois que
le bouton est marqu&eacute; comme "invisible" (en supprimant la
case &agrave; cocher), il est en effet invisible pour l'utilisateur
et ne peut pas donc obtenir la "Fonction Modifier bouton" par un
clic droit avec la souris . Pour rendre tous les boutons visibles
<a href="ThrottleWindowMenus.shtml">s&eacute;lectionner "View-&gt;
Show Toutes les touches de fonction. "</a><br>
<br>
<br>
<h2>Jynstruments</h2>
Voir <a href="../scripting/Jynstruments.shtml">l&agrave; pour plus
d'informations sur Jynstruments</a> .<br>
<br>
La fen&ecirc;tre du R&eacute;gulateur est jynstrumentable, en
particulier avec des commandes de fonction plus
avanc&eacute;es.<br>
<br>
A l'heure actuelle <a href=
"http://jmri.org/jython/Jynstruments/ThrottleFrame/">3
&eacute;chantillons Jynstruments sont livr&eacute;s</a> , un pour
la lumi&egrave;re, l'un pour la corne et un pour le sifflet
(fonction 0, 1 et 2). Mais ce n'est qu'un &eacute;chantillon, ayez
un oeil sur le code et personnaliser le pour vos besoins
sp&eacute;cifiques sur votre d&eacute;codeur.<br>
<br>
<span style="font-style: italic;">Notez que la barre d'outils
Fen&ecirc;tre R&eacute;gulateur est Jynstrumentable aussi, donc ici
nous d&eacute;posons le Jynstruments sur</span> <span style=
"font-style: italic;">le contenu fen&ecirc;tre</span> <span style=
"font-style: italic;">lui-m&ecirc;me, non pas sur la barre
d'outils.<br></span></div>
<!--#include virtual="/Footer" --></div>
</body>
</html>
