<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01//EN" "http://www.w3.org/TR/html4/strict.dtd">
<!-- UpDated by Blorec Herv&#233; 2013-10-04-->
<html lang="fr">
<head>
  <title>Throttle: Introduction</title>
  <meta name="keywords" content="JMRI decoderpro dcc nmlaissezra throttle throttlepro">
  <meta name="Description" content="Throttle documentation for JMRI project">
  <meta name="Author" content="Paul Fraker (paul@frakers.com)">
  <meta name="Language" content="fr">
  <meta name="Robots" content="Index, Follow">
  <meta name="Revisit-After" content="7 Days">
  <!-- The combination of "Define" and {Header,Style, Logo and Footer} comments -->
  <!-- are an arbitrary design pattern used by the update.pl script to -->
  <!-- easily replace the common header/footer code for all the web pages -->
  <!-- delete the following 2 Defines if you want to use the default JMRI logo -->
  <!-- or change them to reflect your alternative logo -->
  <!-- Style -->
  <meta http-equiv="content-type" content="text/html; charset=iso-8859-1">  <link rel="stylesheet" type="text/css" href="/css/default.css" media="screen">
  <link rel="stylesheet" type="text/css" href="/css/print.css" media="print">
  <link rel="icon" href="/images/jmri.ico" type="image/png">
  <link rel="home" title="Home" href="/">
  <!-- /Style -->
</head>

<body>
<!--#include virtual="/Header" -->
<!--#include virtual="Sidebar" -->

<div id="mainContent">
<h1>Introduction: Qu'est ce que l'Outil R&#233;gulateur</h1>

<p>L'outil <b>R&#233;gulateur JMRI</b> est juste l'un des nombreux outils num&#233;riques ferroviaires 
qui font partie du Projet <b>JMRI</b>. Il a la capacit&#233; de faire circuler une locomotive &#233;quip&#233;e de d&#233;codeur DCC
 autour d'un r&#233;seau en utilisant un clavier et une souris d'ordinateur
pour la commande au lieu d'un r&#233;gulateur &#224; main. Cet outil offre plusieurs 
caract&#233;ristiques communes avec la plupart des r&#233;gulateurs manuels, y compris le
capacit&#233; de commander les fonctions de la lumi&#232;re et du son.</p>

<p> Ce guide de l'utilisateur est destin&#233; &#224; pr&#233;senter &#224; ceux qui ne connaissent pas l'outil r&#233;gulateur
. Apr&#232;s la lecture &#224; travers les sections identifi&#233;es ci-dessous, et en essayant l'outil r&#233;gulateur
sur vos propres r&#233;seaux, il faut esp&#233;rer qu'il va augmenter votre plaisir du 
mod&#233;lisme ferroviaire en DCC.</p>

<h1>Mise &#224; jour Version documentaire du R&#233;gulateur
</span></h1>

<p>S'il vous pla&#238;t noter que cette documentation a &#233;t&#233; mise &#224; jour, reportez-vous aux liens ci-dessous:</p>
<ul>
  <li>Le <a href="ToolsMenuThrottleEntry.shtml">Menu R&#233;gulateur dans JMRI</a></li>
  <li>La <a href="BasicThrottleWindow.shtml">Fen&#234;tre R&#233;gulateur elle-m&#234;me</a></li>
  <li>Les <a href="ThrottleWindowMenus.shtml">Menus Fen&#234;tre R&#233;gulateur</a></li>
  <li>La <a href="ThrottleToolBar.shtml">Fen&#234;tre barre d'outils R&#233;gulateur</a></li>
  <li>La <a href="AdvancedThrottleControl.shtml">Fen&#234;tre commandes R&#233;gulateur</a></li>
  <li>La <a href="ThrottlesListWindow.shtml">Liste des Fen&#234;tres R&#233;gulateurs</a></li>
    <li>Le <a href="ThrottlesPreferencesPane.shtml">Volet pr&#233;f&#233;rences R&#233;gulateurs</a><br>

    <p style="margin-left:0em">Voir aussi:<br>
   </p>
 </li>
</ul>
<ul>
  <li>Les <a href="RostersMediaPane.shtml">Panneaux M&#233;dia et Fonction label dans Decoder Pro</a></li>
  <li><a
    href="../../../package/jmri/jmrit/scripting/Jynstruments.shtml">Jynstruments</a></li>
  <li><a href="../../../package/jmri/jmrit/scripting/Jynstruments.shtml"></a><a
    href="../../../package/jmri/jmrit/throttle/HowToJMRIOrientedThrottle.shtml">Comment construire un R&#233;gulateur orient&#233; JMRI</a>.</li>
</ul>

<h1>Comment utiliser ce Guide</h1>

<p> Ce guide utilisateur a &#233;t&#233; mis en place presque comme un guide de formation. Chaque lien dans la section de 
la colonne de gauche est organis&#233; comme un livre. Si vous &#234;tes nouveau dans l'utilisation des
r&#233;gulateurs, suivez chaque chapitre de la section dans l'ordre et le texte vous guidera
&#224; travers le processus &#233;tape par &#233;tape, y compris l'ouverture d'une nouvelle configuration r&#233;gulateur
, sa personnalisation, puis en enregistrant tout votre dur labeur.</p>

<p> Si vous avez d&#233;j&#224; trouv&#233; les outils de configuration des r&#233;gulateurs, mais cherchez
plus d'informations sur eux, alors j'esp&#232;re qu'il y a une section ou deux qui puissent
&#233;galement vous apporter de l'aide. La liste des chapitres et sections seront toujours disponibles dans les
 colonnes de gauche de toutes les pages tout en regardant ce guide. Il y a aussi un couple
de boutons de navigation en bas de chaque page. Ceux-ci vous am&#232;nent au
chapitres suivant ou pr&#233;c&#233;dent, ou &#224; la table principale de la page du contenu (voir la prochaine
paragraphe).</p>

<p> Dans la liste des liens fournis sur la gauche, et situ&#233;e &#224; la conclusion de
chaque page chapitre, il y a un lien identifi&#233; comme <a href= "ThrottleTOC.shtml"
title= "Allez &#224; la table des mati&#232;res"><i><strong> TOC</strong></i></a> ou <a
href= "ThrottleTOC.shtml"
title= "Allez &#224; la table des mati&#232;res"><i><strong> Table des Mati&#232;res
</strong></i></a>. Ce lien m&#232;ne &#224; une table d&#233;di&#233;e decontenus des pages
. Certains peuvent trouver plus facile de naviguer en utilisant cette page. Cependant, le
colonne de gauche contient tous les liens disponibles contenus dans la page TOC .</p>

<p class="important"><b style="color: #FF0000"> Note importante</b>:De multiple
programmeurs sont impliqu&#233;s dans le d&#233;veloppement du code de ce projet. Certains travaux
sur le "front end" du code (qui est l'interface que vous voyez sur votre
&#233;cran d'ordinateur), et d'autres travaillent sur le "back end" du logiciel pour 
chaque besoin particulier de chaque syst&#232;me DCC . Bien que le "front end" doit rester
constant &#224; travers tous les syst&#232;mes, il peut y avoir de l&#233;g&#232;res diff&#233;rences exp&#233;riment&#233;es sur
votre syst&#232;me informatique et de DCC notamment en comparaison &#224; ce qui est d&#233;crit et
pr&#233;sent&#233; dans ce guide utilisateur.<br>

<br>
<b>Les exemples et les r&#233;f&#233;rences indiqu&#233;s dans ce guide sont bas&#233;es sur la version 1.5.3
du logiciel, fonctionnant sous Microsoft Windows 2000 Professionnel avec un
Syst&#232;me Digitrax.</b></p>

<p> Utilisez ces liens pour avancer soit au chapitre suivant pour une introduction &#224;
l'outil r&#233;gulateur, ou pour afficher le tableau complet de la table des mati&#232;res</p>

<table border="0" width="100%" cellpadding="0" cellspacing="0">
  <tbody>
    <tr>
      <td align="right">&nbsp;</td>
      <td><img src="images/spacer.gif" width="30" height="10"></td>
      <td align="center"><b><a href="ThrottleTOC.shtml"
        title="Jump to the Table Of Contents page">TOC</a></b></td>
      <td><img src="images/spacer.gif" width="30" height="10"></td>
      <td align="left"><b><a href="ThrottleChapter1.shtml"
        title="Advance to the next chapter"><img width="18" height="18"
        src="images/RightArrow2.jpg"></a></b></td>
   </tr>
 </tbody>
</table>
<br>

<!--#include virtual="/Footer" -->
 </div>
</body>
</html>
