<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01//EN" "http://www.w3.org/TR/html4/strict.dtd">
<!-- Updated by Blorec Herv&#233; 2017-01-07-->
<html lang="fr">
<head>
  <title>Throttle: Open/Configure a Throttle Window </title>
  <meta name="keywords" content="JMRI decoderpro dcc nmra throttlepro">
  <meta name="Description" content="Throttle documentation for JMRI project">
  <meta name="Keywords" content="JMRI">
  <meta name="Author" content="Paul Fraker (paul@frakers.com)">
  <meta name="Robots" content="Index, Follow">
  <meta name="Revisit-After" content="7 Days">
  <!-- Style -->
  <meta http-equiv="content-type" content="text/html; charset=iso-8859-1">
  <link rel="stylesheet" type="text/css" href="/css/default.css" media="screen">
  <link rel="stylesheet" type="text/css" href="/css/print.css" media="print">
  <link rel="icon" href="/images/jmri.ico" type="image/png">
  <link rel="home" title="Home" href="/">
  <!-- /Style -->
</head>

<body>
<!--#include virtual="/Header" -->
<div id="mBody">
    <!--#include virtual="Sidebar" -->
    <div id="mainContent">
        <!-- Page Body -->

<h1>Mise &#224; jour Version de la documentation du R&#233;gulateur</h1>

<p>S'il vous pla&#238;t noter que cette documentation a &#233;t&#233; mise &#224; jour. Version Actuelle:</p>
<ul>
  <li>Le <a href="ToolsMenuThrottleEntry.shtml">Menu R&#233;gulateur dans JMRI</a></li>
  <li>La <a href="BasicThrottleWindow.shtml">Fen&#234;tre R&#233;gulateur elle-m&#234;me</a></li>
  <li>Les <a href="ThrottleWindowMenus.shtml">Menus Fen&#234;tre R&#233;gulateur</a></li>
  <li>La <a href="ThrottleToolBar.shtml">Barre d'outils de la Fen&#234;tre R&#233;gulateur</a></li>
  <li>Les <a href="AdvancedThrottleControl.shtml">Commandes de la Fen&#234;tre  R&#233;gulateur</a></li>
  <li>La <a href="ThrottlesListWindow.shtml">Liste Fen&#234;tre R&#233;gulateurs</a></li>
  <li>Le <a href="ThrottlesListWindow.shtml"></a><a
    href="ThrottlesPreferencesPane.shtml">Volet pr&#233;f&#233;rences R&#233;gulateurs</a></li>
</ul>

<h1>Ouvrir une nouvelle fen&#234;tre R&#233;gulateur</h1>

<p> Ce chapitre vous guidera &#224; travers le processus d'ouverture d'une nouvelles
fen&#234;tre de configuration de R&#233;gulateur puis l'ex&#233;cuter avec une locomotive sur votre r&#233;seau. Pour 
ce guide, nous allons utiliser une locomotive qui a &#233;t&#233;
&#233;quip&#233;e d'un d&#233;codeur sonore. L'adresse du d&#233;codeur dans nos exemples est ici
<b>8251</b>. Si vous suivez le processus avec une locomotive de votre propre parc alors que vous
lisez ceci, il suffit de remplacer "8251" par votre adresse d&#233;codeur Loco partout o&#249; "8251" est
&#233;crit. </p>

<p> Donc nous allons commencer.</p>

<table border="0" width="100%" cellpadding="0" cellspacing="0">
  <tbody>
    <tr>
      <td valign="top" align="center"><p
        style="text-align: center; font-size: xx-small"><img width="163"
        height="82" src="images/jmri004.jpg" title="New Throttle"><br>
        Figure 2-1: Menu Option Nouveau R&#233;gulateur </p>
      </td>
      <td><img width="10" height="20" src="images/spacer.gif"> </td>
      <td valign="top" align="left"><p>La premi&#232;re chose que nous voulons faire est d'
         ouvrir une fen&#234;tre R&#233;gulateur. Comme indiqu&#233; dans le <a
         href= "ThrottleChapter1.shtml"
         title= "Retour &#224; revoir le chapitre 1"> chapitre pr&#233;c&#233;dent </a>, c'est fait
          en s&#233;lectionnant les options suivantes dans la
         fen&#234;tre principale primaire: </p>
         <ul type="square">
           <li><strong> Outils </strong> </li>
           <li> <strong>R&#233;gulateurs  </strong> </li>
           <li> <strong>Nouveau R&#233;gulateurs </strong> </li>
        </ul>
      </td>
    </tr>
  </tbody>
</table>
<br>
<br>
<a name="StructWin"></a> 

<h2>Structure d'une fen&#234;tre R&#233;gulateurs </h2>

<p> Il y a <i>trois panneaux</i> (ou sous-fen&#234;tres) associ&#233;s &#224; chaque
Fen&#234;tre de r&#233;gulateur. Ils sont identifi&#233;s comme suit: </p>

<ul>
  <li>Le <b>Panneau de commande</b> contient un curseur d'acc&#233;l&#233;ration pour commander la vitesse des
      locomotives, d'un s&#233;lecteur de marche avant et arri&#232;re, un bouton d'action d'arr&#234;t d'urgence,
     et un Bouton d'action Inoccup&#233; (Idle) (principalement utilis&#233; pour les d&#233;codeurs &#233;quip&#233;s de son ). <br>
     <br>
   </li>
   <li>Le <b>Panneau Fonction</b> est utilis&#233; pour associer les touches de fonction avec
     les fonctions de sortie actives du d&#233;codeur.<br>
     <br>
   </li>
  <li>Le <b>Panneau Adresse</b> est utilis&#233; pour identifier l'adresse du d&#233;codeur, et pour dispatcher
     ou lib&#233;rer l'adresse identifi&#233;e. <br>
     <br>
   </li>
</ul>

<p class="important"> <b>Important!</b> Ces trois panneaux sont actuellement des
fen&#234;tres d&#233;finies dans une fen&#234;tre d'ensemble. S'il vous pla&#238;t noter que chacun de ces panneaux
contient ses propres boutons "minimiser" et "fermer" ainsi le panneau peut &#233;galement &#234;tre
redimensionn&#233;. Vous pouvez effectivement r&#233;duire un ou plusieurs de ces panneaux dans la
Fen&#234;tre R&#233;gulateur. Ceci avait besoin d'&#234;tre soulign&#233; car si vous cliquez accidentellement
sur l'un des boutons, le panneau dispara&#238;t. </p>

<p style="text-align: center; font-size: xx-small"><img width="323"
height="464" src="images/jmri011.jpg"
title="JMRI Throttle New Default Window"><br>
Figure 2-2: Nouvelle Fen&#234;tre R&#233;gulateur </p>

<a name="WinConfig"></a>
<h1>Configurer le Nouveau R&#233;gulateur </h1>

<p> Maintenant que nous avons r&#233;ussi &#224; ouvrir la fen&#234;tre du R&#233;gulateur, la prochaine chose
nous devons faire est de configurer le r&#233;gulateur pour qu'il soit op&#233;rationel. Nous allons faire cela en deux
&#233;tapes. La premi&#232;re sera d'assigner l'adresse du d&#233;codeur de la locomotive. S'il vous pla&#238;t noter
Figure 2-2 ci-dessus que tous les panneaux sont bien d&#233;sactiv&#233;s. C'est ainsi
car il n'y a pas encore d'adresse affect&#233;es. Apr&#232;s l'&#233;tablissement d'une adresse, les
autres options sur les panneaux seront activ&#233;es. </p>
<a name="AddressPanel"> </a>

<h2> Affecter une adresse D&#233;codeur &#224; un R&#233;gulateur </h2>

   <table border="0" width="100%" cellpadding="0" cellspacing="0">
     <tbody>
       	<tr>
         <td valign="top"><p>  La premi&#232;re chose &#224; faire avant tout, est d'attribuer une
           adresse de d&#233;codeur dans le <b>"Panneau Adresse"</b>". Il y a deux fa&#231;ons
           pour le faire. </p>
           	<ol>
             	<li> Saisissez manuellement l'adresse du d&#233;codeur dans la grande zone de texte,
               	puis cliquez sur le bouton <big>"Valider"</big>(Set). <br>
                <p class="important"> <b>Important!</b> lors de la saisie manuelle
                d'une adresse, n'oubliez pas de cliquer sur le bouton <big>Valider</big> .
                Sans cette &#233;tape, toutes les actions du r&#233;gulateur restent d&#233;sactiv&#233;es.</p>
             	</li>
             	<li> Ou, utilisez la liste d&#233;roulante pour choisir parmi la liste de l'inventaire (comme
              	indiqu&#233; dans la figure &#224; droite).<br>
                S'il vous pla&#238;t noter que lorsque vous s&#233;lectionnez une locomotive de cette liste, il suffit
             	de lire l'adresse des d&#233;codeurs &#224; partir de le fichier inventaire. Il ne fait pas actuellement 
		        <u>pas</u> de r&#233;f&#233;rence crois&#233;e avec n'importe quel fichier de configuration de
                r&#233;gulateurs sauvagard&#233;s.</li>
           	</ol>
         </td>
         <td> <img width="20" height="40" src="images/spacer.gif"> </td>
         <td valign="top" align="center"> <p
           style = "text-align: center; font-size: xx-small"> <img width = "207"
           height = "228" src = "images/jmri015.jpg" title = "S&#233;lection de l'adresse"> <br>
           Figure 2-3: S&#233;lection d'adresse </p>
         </td>
       </tr>
       <tr>
         <td colspan="3"><img width="40" height="10" src="images/spacer.gif"></td>
       </tr>
       <tr>
        <td valign="top">
    	<p> Apr&#232;s qu'une adresse ait &#233;t&#233; s&#233;lectionn&#233;e, toutes les autres commandes et options de
        la fen&#234;tre du r&#233;gulateur deviennent actives. Deux autres boutons d'option sont aussi devenu actifs dans le 
	    "<b>Panneau Adresse</b>". Ils sont d&#233;crit comme  ...</p>

           <ul>
             <li><strong>Dispatcher</strong> Renvoie l'adresse du d&#233;codeur
               &#224; la centrale dans un mode "Dispatcher". Habituellement, une seul
               adresse peut &#234;tre en &#233;tat dispatch &#224; la centrale. Toutes les
               autres sont soit "utilis&#233;es" ou "inactives". Les commandes et les
               options dans la fen&#234;tre r&#233;gulateur seront d&#233;sactiv&#233;es jusqu'&#224; ce qu'une autre
               adresse soit <big>"Valid&#233;e"</big>.
             </li>
             <li><strong>Lib&#233;ration</strong> &#8212; Communique l'adresse du d&#233;codeur  &#224;
               la centrale comme "n'&#233;tant plus n&#233;cessaire". Les commandes et les
               options dans la fen&#234;tre  r&#233;gulateur seront d&#233;sactiv&#233;es jusqu'&#224; ce qu'une autre
              adresse soit <big>"Valid&#233;e"</big>.
	        </li>
          </ul>
        </td>
        <td> </td>
        <td> </td>
        </tr>
    </tbody>
  </table>

<table>
  <tbody>
    <tr>
      <td><img width="20" height="40" src="images/spacer.gif"> </td>
      <td valign="top" align="center"><p
        style="text-align: center; font-size: xx-small"><img width="199"
        height="129" src="images/jmri032.jpg"
        title="Example of Address Panel option buttons"><br>
        Figure 2-4: Panneau Adresse<br>
        (avec une adresse active) </p>
      </td>
    </tr>
  </tbody>
</table>

<a name="ControlPanel"></a> 
<h2>Panneau de configuration - Faisons Circuler un train </h2>

  <table border="0" width="100%" cellpadding="0" cellspacing="0">
    <tbody>
      <tr>
        <td align="left" valign="top"><p> Maintenant que vous avez &#233;tabli une
          Adresse pour le R&#233;gulateur, vous devriez &#234;tre en mesure de faire rouler un train sur votre
          r&#233;seau (si votre r&#233;seau est actif et que l'adresse que vous avez entr&#233;e est valide
          pour la locomotive sur la voie). Pour cela, utilisez le "<b>Panneau de Commandes</b>" 
	      (voir figure 2-5). Mais voici o&#249; les choses deviennent un peu plus d&#233;licates.</p>

          <p>Il y a de multiples combinaisons de syst&#232;mes DCC et de plates-formes
          informatiques qui donnent de l&#233;g&#232;res diff&#233;rences dans les fonctionnalit&#233;s des
          r&#233;gulateurs. Les programmeurs travaillent dur pour essayer d'obtenir
          que ces r&#233;gulateurs fonctionnent &#224; l'identique. Mais en raison de ces
          diff&#233;rences, vous pouvez d&#233;couvrir que tout ce qui est not&#233; dans le
          le texte suivant ne fonctionnera pas tel que d&#233;fini pour votre syst&#232;me.</p>

          <p class="important"> <b>Important!</b> Le "Panneau de Commandes" doit
          avoir le "focus" pour qu'il devienne actif (et utilisable). En d'autres
          termes, la barre de fen&#234;tre doit &#234;tre active. Si vous suivez ce que dit ce
          texte avec votre propre locomotive et juste entrer une adresse
          dans le Panneau d'Adresses, vous d&#233;couvrirez que le Panneau d'Adresse est la
          fen&#234;tre avec le focus actuel. Aucune des actions clavier ou souris
          d&#233;crites ci-dessous ne d&#233;placera le train jusqu'&#224; la mise au point du Panneau de Commandes. 
	  Pour faire du Panneau de Commandes la fen&#234;tre active, utilisez le pointeur de votre souris
          pour cliquer quelque part dans le Panneau de Commandee. </p>
        </td>
        <td> <img width="20" height="40" src="images/spacer.gif"></td>
        <td valign="top" align="center"><p
          style = "text-align: center; font-size: xx-small"><img width = "99"
          height = "330" src ="images/jmri033.jpg" 
          title= "Exemple du Panneau de configuration"> 
          Figure 2-5: Panneau de configuration </p>  
      </td>
      </tr>
    </tbody>
  </table>
<br>

  <table width="100%" border="2" cellpadding="2" cellspacing="2">
     <tbody>
       <tr>
         <td> <p
           style = "color: # FF0000; font-size: medium; font-weight: bold"> Attention
           o&#249; vous cliquez avec le pointeur de votre souris dans le Panneau de configuration. </p> 
           <ul>
             <li> <b>Si vous cliquez n'importe o&#249; &#224; proximit&#233; du curseur, votre loco peut avoir
               des r&#233;actions improvis&#233;e (voir plus bas).</b><br>
             </li>
             <li> <b>Si vous cliquez n'importe o&#249; sur les mots "Avant" ou "Arri&#232;re",
               vous activez cette action ce qui n'est pas trop mauvais sauf si
               La locomotive est en marche dans la direction oppos&#233;e.</b> <br>
             </li>
             <li><b>Selon la taille de votre r&#233;solution d'&#233;cran, si vous essayez de
               cliquez sur la barre de fen&#234;tre elle-m&#234;me, vous risquez de fermer 
               la fen&#234;tre de Panneau de Configuration ou le minimiser. Ce qui pourrait bien s&#251;r
               imm&#233;diatement perturber tout nouvel utilisateur.</b>
             </li>
          </ul>

         <p> Alors, en cliquant d'abord dans le Panneau de Contr&#244;le pour en faire la
          fen&#234;tre "active" avec le focus, et sachant  que votre loco est
           arr&#234;t&#233;e, il est sugg&#233;r&#233; de cliquer sur le bouton "Inactif" (si vous savez
           pourquoi votre loco est arr&#234;t&#233;e), ou dans la zone avant ou arri&#232;re
           (en fonction bien s&#251;r de l'orientation actuelle de la loco). En d'autres
           termes vous voulez cliquer quelque part dans l'int&#233;rieur des fronti&#232;res de la
           Fen&#234;tre du Panneau de Commandes &#8212;sans que la loco ne fasse quelque chose que
           vous ne voulez pas qu'elle fasse.</p>

           <p> Apr&#232;s un peu d'exp&#233;rimentation, vous d&#233;couvrirez ce qui est
           confortable pour votre utilisation. Le seul point que nous essayons de faire ici
           est que de nombreux nouveaux utilisateurs seront frustr&#233;s de ne pas obtenir imm&#233;diatement 
           avec leur r&#233;gulateur de pouvoir d&#233;placer leur loco. Ne r&#233;alisant pas que le
           Panneau de Commandes n'est pas s&#233;lectionn&#233;. Ou ils ont cliqu&#233; sur un
           bouton de fonction  (plus sur ceux ci-dessous), ce qui change alors la
          fen&#234;tre  "active" sur le panneau de Fonction.</p>
         </td>
       </tr>
     </tbody>
   </table>

<a name="StandardActions"></a>
<h3> Clavier de Commandes </h3>

     <p> Il ya un groupe de touches d'action sur le clavier qui ont &#233;t&#233; d&#233;finies comme
     "<b>standard</b>" sur tous les syst&#232;mes DCC et plates-formes informatiques. Ils sont
     identifi&#233;s dans le tableau suivant:</p>

      <table width="100%" border="2" cellpadding="2" cellspacing="2">
       <tbody>
         <tr>
           <td align="center"><p
             style = "color: #000080; font: bolder; font-size: large"> TOUCHE * </p>
           </td>
           <td align="center"> <p
             style = "color: #000080; font: bolder; font-size: large"> ACTION </p>
           </td>
         </tr>
         <tr>
           <td align="center"> <p
             style = "color: #0000CD; font: bolder; font-size: large p ">+</>
           </td>
          <td> Augmente la vitesse de 1 cran &#224; chaque pression sur la touche </td>
         </tr>
         <tr>
           <td align="center"> <p
             style = "color: #0000CD; font: bolder; font-size: large p ">-</p>
           </td>
           <td> Diminue la vitesse de 1 cran &#224; chaque pression sur la touche </td>
         </tr>
         <tr>
           <td align="center"> <p
             style = "color: #0000CD; font: bolder; font-size: large p ">*</p>
           </td>
           <td> Inactif (vitesse r&#233;gl&#233;e &#224; 0, tout dynamisme de vitesse est activ&#233;) </td>
         </tr>
         <tr>
           <td align="center"> <p
             style = "color: #0000CD; font: bolder; font-size: large p ">/</p>
           </td>
           <td>Arr&#234;t Urgence! (stoppe instantan&#233;ment la locomotive) </td>
         </tr>
         <tr>
           <td align="center"> <p
             style = "color: #0000CD; font: bolder; font-size: large"> fl&#232;che haut </p>
           </td>
           <td> Vers l'avant 
          </tr>
          <tr>
           <td align="center"><p
             style = "color: #0000CD; font: bolder; font-size: large"> fl&#232;che bas </p>
           </td>
           <td>vers l'arri&#232;re</td>
         </tr>
         <tr>
           <td align="center"><p
             style = "color: #0000CD; font: bolder; font-size: large">fl&#232;che Gauche
            </p>
           </td>
           <td>Augmente la vitesse d'un cran pour chaque pression sur la touche</td>
         </tr>
         <tr>
           <td  align="center"> <p
             style = "color: #0000CD; font: bolder; font-size: large">fl&#232;che  Droite
            </p>
           </td> 
           <td> Diminue la vitesse d'un cran pour chaque pression sur la touche </td>
         </tr>
         <tr> 
           <td align="center"> <p
             style = "color: #0000CD; font: bolder; font-size: large"> Page Haut </p>
           </td>
             <td>Augmente la vitesse d'environ 10% pour chaque pression sur la touche</td>
         </tr>
         <tr>
          <td align="center"><p
            style="color: #0000CD; font: bolder; font-size: large">Page Bas</p>
          </td>
          <td>Diminue la vitesse d'environ 10 % pour chaque pression sur la touche
          </td>
        </tr>
    </tbody>
    </table>   

    <p class="important"><b>Remarque:</b> * Les touches implicites not&#233;es ci-dessus (avec l'
     exception des touches fl&#233;ch&#233;es) sont celles qu'on trouve sur le pav&#233; num&#233;rique du
     clavier. Pour les ordinateurs portables et autres claviers qui n'ont pas de
     pav&#233; num&#233;rique s&#233;par&#233;, l'exp&#233;rimentation de votre part peut &#234;tre n&#233;cessaire pour trouver la
     combinaison correcte de touches. Les touches fl&#233;ch&#233;es sont habituellement trouv&#233;es group&#233;es dans leur
     propre zone s&#233;par&#233;e.</p>

     <p>L'Utilisation standards des touches actions sont assez faciles. Apr&#232;s avoir rendu le
     Panneau de Commandes actif, &#224; chaque clic sur la touche <big>+</big> sur le clavier num&#233;rique
     la vitesse de votre locomotive doit augmenter. Chaque clic sur la touche 
     <big>-</big> du pav&#233; num&#233;rique devrait diminuer la vitesse de votre
     locomotive. Pour amener la locomotive &#224; l'arr&#234;t, un simple clic de
     <b>/</b> sur le clavier num&#233;rique va r&#233;gler la vitesse de la locomotive &#224;
     z&#233;ro. </p>

     <p> Bien s&#251;r, en plus des actions standard du clavier, ce n'est pas la peine d'avoir une souris
 	 si vous ne pouvez pas l'utiliser pour commander vos trains. Alors maintenant, nous allons discuter
	 comment d&#233;placer votre locomotive en utilisant la souris de votre ordinateur. </p>

<a name="MouseControl"></a> 
<h3>Commande de la Souris </h3>

     <p> Vous pouvez effectuer toutes les actions du clavier not&#233;es ci-dessus en utilisant votre
     pointeur de la souris dans la fen&#234;tre Panneau de Commandes. Nous allons commencer par d&#233;finir les  marche
     Avant, marche Arri&#232;re, Arr&#234;t et Inactif. Ils sont assez simples &#224; utiliser. </p>

     <table width="100%" border="2" cellpadding="2" cellspacing="2">
       <tbody>
         <tr>           <td align="center"><p
             style = "color: #000080; font: bolder; font-size: large"> BOUTON </p>
           </td>
           <td align="center"> <p
             style = "color: #000080; font: bolder; font-size: large">ACTION </p>
           </td>
         </tr>
         <tr>
           <td align="center"> <p
             style = "color: #0000CD; font: bolder; font-size: large"> <b>Avant</b></p>
           </td>
           <td> Change la direction de la locomotive vers l'avant. </td>
         </tr>
         <tr>
           <td align="center"> <p
             style = "color: #0000CD; font: bolder; font-size: large">  <b>Inverser</b> </p>
           </td>
           <td> Change la direction de la locomotive vers l'arri&#232;re. </td>
         </tr>
         <tr>
           <td align="center"><p
             style = "color: #0000CD; font: bolder; font-size: large"> <b>ARRET URGENCE</b></p>
           </td>
           <td> cliquer sur ce bouton effectue un arr&#234;t physique imm&#233;diat 
             de la locomotive. Si une fonction de freinage dynamique est activ&#233;e pour
             le d&#233;codeur, elle sera ignor&#233;e, arr&#234;tant la locomotive imm&#233;diatement. Lorsque vous utilisez un 	  	       d&#233;codeur de son (comme un Soundtraxx DSD-150), le d&#233;codeur a une "action d'arr&#234;t du son" (comme dans
             les d&#233;codeurs diesel), le bruit du moteur associ&#233; chutera en l'occurence  </td>
       </tr>
	<tr>
          <td align="center"><p
            style="color: #0000CD; font: bolder; font-size: large"><b>Inactif</b></p>
</td>
<td> cliquer sur ce bouton, r&#233;gle la vitesse de la locomotive &#224; 0. 
Si une fonction de freinage dynamique est activ&#233;e pour le d&#233;codeur, elle
sera toujours active, ralentissant la locomotive jusqu'&#224; l'arr&#234;t. Lorsque
un d&#233;codeur de son (comme un Soundtraxx DSD-150)est utilis&#233;, le son moteur
 basculera sur son &#233;tat "inactif". </td> 
       </tr>
      </tbody>
    </table>

<a name="SliderBar"></a> 

<h4>LA BARRE CURSEUR </h4>

      <p> Le curseur peut fonctionner diff&#233;remment pour chaque utilisateur en fonction de
      plusieurs facteurs. Ce guide de l'utilisateur ne va pas  essayer d'identifier l'ensemble des
      diff&#233;rentes possibilit&#233;s. Au lieu de cela, il va identifier plusieurs
      moyens principaux que le curseur peut utiliser. Au moins un de ces
      moyens doit vous convenir. Vous pourriez d&#233;couvrir que votre configuration peut en utiliser
      plusieurs. Un peu d'exp&#233;rimentation de votre part sera peut-&#234;tre n&#233;cessaire. </p>
      <ol>
        <li> <strong> M&#233;thode Curseur 1 </strong>
          <ul>
            <li> cliquer n'importe o&#249; au-dessus de la position actuelle du curseur
              AUGMENTE la vitesse de la loco de la valeur d'un cran. Par exemple, si la
               vitesse actuelle de la locomotive est de 23, puis un seul clic
              fera progresser la vitesse &#224; 24. Un autre clic va augmenter la
              la vitesse &#224; 25. Un autre clic ... pour acc&#233;l&#233;rer &#224; 26. Une autre ... &#224; la vitesse
              27. Et ainsi de suite ... jusqu'&#224; ce qu'il atteigne l'&#233;tapes vitesse maximale pour
              votre syst&#232;me. Cette action a le m&#234;me effet que l'utilisation des
              <big>+</big> sur le clavier num&#233;rique. <br>
              <br>
            </li>
            <li> cliquer n'importe o&#249; en dessous de la position actuelle du  curseur 
              DIMINUE la vitesse de la loco de la valeur d'un cran. Par exemple, si la
              vitesse actuelle de la locomotive  est de 21, puis un seul clic
              va diminuer la vitesse &#224; 20. Un autre clic va diminuer la
              la vitesse &#224; 20. Un autre clic ... pour ralentir au cran 19. Et ainsi de suite ... jusqu'&#224; ce que
              qu'il atteigne le palier de vitesse  0. Cette action a le m&#234;me effet que l'action sur le
              <big>-</big> sur le clavier num&#233;rique <br>
              <br>
             </li>
           </ul>
           <p class="important"> <b>Remarque:</b>cliquer trop loin en dessous du curseur
           (surtout quand pr&#232;s du fond de la barre de curseur) peut ne pas avoir
          d'effet parce que vous &#234;tes r&#233;ellement cliquant sur l'option "Avant".
           Par cons&#233;quent, il est sugg&#233;r&#233; que lorsque la vitesse diminue avec cette
           m&#233;thode, que vous cliquiez sur le mot "Inactif" &#8212; pas sur le bouton d'arr&#234;t d'urgence
           (STOP!)  mais le mot "Inactif" situ&#233; &#224; l'extr&#233;mit&#233; inf&#233;rieure de la
           rampe du curseur. </p>
           <br>
           <br>

           <p class="important"> <b>:Remarque </b>Si le d&#233;codeur a ses courbes d'acc&#233;l&#233;ration
           ou de freinage activ&#233;es, la locomotive va acc&#233;l&#233;rer ou ralentir
          en cons&#233;quence. Si aucune valeur dynamique n'est activ&#233;e, la loco va acc&#233;l&#233;rer
            ou ralentir brutalement. </p>
           <br>
           <br>
           <br>
         </li>
       <li> <strong>Curseur M&#233;thode 2 </strong>   
      
          <ul>
            <li>Cliquez et maintenez le bouton gauche de la souris sur le pointeur du curseur
               puis faites-le glisser &#224; la vitesse que vous souhaitez, puis rel&#226;chez le bouton de la souris
                Ceci enverra une commande "vitesse r&#233;gl&#233; sur" au
               d&#233;codeur.
               </li>
           </ul>
           <p class="important"> <b>Remarque:</b>Si le d&#233;codeur a ses courbes d'acc&#233;l&#233;ration
           ou de freinage activ&#233;e, la locomotive va acc&#233;l&#233;rer ou ralentir
           en cons&#233;quence. Si aucune valeur dynamique n'est activ&#233;e, la loco va acc&#233;l&#233;rer
            ou ralentir brusquement &#224; la vitesse r&#233;gl&#233;e lorsque le bouton de la souris a &#233;t&#233;
           lib&#233;r&#233;. </p>
         </li>
         <li> <strong> Curseur M&#233;thode 3</strong>
           <ul>
             <li> cliquer n'importe o&#249; au-dessus de la position actuelle du curseur
               va augmenter le curseur &#224; l'endroit o&#249; le souris
               pointeur de la souris a &#233;t&#233; cliqu&#233;. Par exemple, si 
               r&#233;glage de la vitesse &#233;tait d'environ 25% de la barre du curseur et le
               pointeur de la  souris est plac&#233; &#224; proximit&#233; du point d'environ 75% du
               curseur lorsque vous cliquez dessus, la vitesse de la locomotive va passer 
               &#224; environ 75%. <br>
               <br>
             </li>
             <li>Cliquer n'importe o&#249; en dessous de la position  actuelle du curseur
               va diminuer le curseur &#224; l'endroit o&#249; le pointeur de la souris
               a &#233;t&#233; cliqu&#233;. Par exemple, si le
               r&#233;glage de la vitesse &#233;tait d'environ 50% de la barre du curseur et le
               pointeur de la souris est positionn&#233; &#224; environ autour du point 25% sur le
               curseur lorsque vous cliquez dessus, puis la vitesse de la locomotive va passer
               &#224; environ 25%. </li>
          </ul>
          
          <p class = "important"> <b>Remarque : </b>Si le d&#233;codeur a ses courbes d'acc&#233;l&#233;ration
           ou de freinage activ&#233;es, la locomotive va acc&#233;l&#233;rer ou ralentir
           en cons&#233;quence. Si aucune valeur dynamique n'est activ&#233;e, la loco va acc&#233;l&#233;rer
          ou ralentir brutalement. </p>
           <br>
           <br>

           <p class="important"> <b>Remarque:</b>Cliquer trop loin en dessous du curseur
           (surtout quand pr&#232;s du fond de la barre de curseur) peut ne pas avoir
          d'effet parce que vous cliquez sur l'option "Avant".
           Par cons&#233;quent, il est sugg&#233;r&#233; que lorsque la vitesse doit diminuer avec cette
           m&#233;thode, que vous cliquiez sur le mot "Inactif" &#224; l'extr&#233;mit&#233; inf&#233;rieure de la
           la course du curseur. </p>
	</li>
      </ol>
    
      <table border="2" width="90%" cellpadding="2" cellspacing="2">
        <tbody>
          <tr>            <td><p
              style="font: bold; color: #FF0000; font-size: large">IMPORTANT! </p>

               <p> La meilleure fa&#231;on d'arr&#234;ter une locomotive par l'une des m&#233;thodes
               d&#233;crites ci-dessus est tout simplement de cliquer sur le bouton <b>"Inactif"</b>
               situ&#233; au bas de la fen&#234;tre du Panneau de Contr&#244;le. </p>

               <p> Ou plus brutalement, vous pouvez &#233;galement cliquer sur le bouton 
               <b
               style = "font; gras; color: # FF0000; font-size: large">ARR&#202;T URGENCE!</b>
               </p>
             </td>
           </tr>
         </tbody>
       </table>
      
       <p> Si vous avez d&#233;couvert que votre syst&#232;me fonctionne d'une mani&#232;re diff&#233;rente
       parmi tous ceux indiqu&#233;s ci-dessus, alors vous avez simplement trouv&#233; un autre
       m&#233;thode.</p>

<a name="Acquiring"></a> 

<h2> L'acquisition d'une Locomotive Enregistr&#233;e </h2>

   <p> Lorsque l'adresse du d&#233;codeur est d'abord "<big>D&#233;finie</big>", le logiciel demande
   l'&#233;tat actuel du d&#233;codeur. Cela inclut la direction actuelle de la
   locomotive, sa vitesse actuelle, et les boutons de fonction qu'ils soient On ou Off. Le
   logiciel sera r&#233;gl&#233;e &#224; la direction actuelle et identfiera toutes les fonctions
   qui sont "actives" (dans l'&#233;tat "On" ). Mais, si la locomotive est en mouvement, la 
   la vitesse de la loco n'est pas &#233;tablie sur le curseur de Commande de Vitesse. </p>

   <p class="important"> <b>Remarque:</b>A ce moment, le curseur ne correspond
   <u>pas</u> automatiquement &#224; la vitesse r&#233;elle. Ceci est important pour
   comprendre quelles mesures vous allez voir quand vous cliquez d'abord
   sur la barre de curseur de vitesse. Lors de la premi&#232;re <big>"Validation"</big> d'une adresse de d&#233;codeur,
   le curseur est r&#233;gl&#233; sur la position z&#233;ro (0). Donc, si vous avez acquis une
   locomotive qui est en fait en d&#233;placement et que vous cliquez sur la barre du curseur, il 
   va r&#233;gler la vitesse &#224; z&#233;ro (ou l&#224; o&#249; vous cliquez et r&#233;glez le curseur
  ). <br>
   <br>
   Une am&#233;lioration future de la fonction r&#233;gulateur sera de synchroniser les
   pointeur de la barre curseur en cons&#233;quence. Jusque-l&#224;, m&#233;fiez-vous de cette petite
   r&#233;action. </p>

<a name="FunctionPanel"></a> 
<h2>Le Panneau Fonction </h2>

   <table border="0" width="100%" cellpadding="0" cellspacing="0">
     <tbody>
      <tr> 
          <td valign="top"><p> Le Panneau dispose de 28 boutons de Fonction
           disponibles pour chaque fen&#234;tre du r&#233;gulateur. La plupart des d&#233;codeurs ne sont actuellement pas
           &#233;quip&#233;s de 28 fonctions. Le panneau affiche les boutons de fonction de deux
           groupes, appuyez sur la touche "*" dans le coin inf&#233;rieur gauche pour voir les
           deuxi&#232;me s&#233;rie de boutons de fonction. </p>

           <p> Cliquer sur les boutons de fonctions en corr&#233;lation avec l'appui sur les m&#234;mes
           bouton de fonction sur un r&#233;gulateur &#224; main. La fonction F0 est normalement
           utilis&#233; pour les feux. </p>

           <p> Ceci est la fonctionnalit&#233; de base du Panneau de Fonction. Tous les boutons
           fonctionnent comme une bascule marche/arr&#234;t Cliquez une fois pour activer "On" et cliquez de nouveau
           &#224; tourner "Off". </p>

           <p> Le chapitre suivant fournit des fonctionnalit&#233;s plus avanc&#233;es pour la personnalisation
          des boutons du Panneau de Fonction. </p>
         </td>
         <td> <img width="20" height="40" src="images/spacer.gif"> </td>
         <td valign="top" align="center"> <p
           style = "text-align: center; font-size: xx-small"> <img  width= "208"
           height = "250" src = "images/jmri034.jpg"
           title= "Example of the Function Panel"> <br>
           Figure 2-6: Le Panneau Fonction </p>
                  </td>
      </tr>
    </tbody>
  </table>

<p>Si vous lisez cette page de haut en bas comme un manuel de formation, &#224; sa
conclusion, vous devriez &#234;tre en mesure de ...</p>
<ul>
   <li> ouvrir une nouvelle fen&#234;tre de r&#233;gulateur </li>
   <li> &#233;tablir un d&#233;codeur avec une adresse active </li>
   <li> faire fonctionner une locomotive &#224; son rythme </li>
   <li> et activer les lumi&#232;res (et toute autre fonction activ&#233;e pour votre
     d&#233;codeur) </li>
</ul>

<p> Le prochain chapitre sera d'identifier les caract&#233;ristiques des r&#233;gulateurs qui peuvent &#234;tre personnalis&#233;es 
afin de rendre l'exp&#233;rience de votre r&#233;seau num&#233;rique encore plus agr&#233;able. </p>

<table border="0" width="100%" cellpadding="0" cellspacing="0">
  <tbody>
    <tr>
      <td align="right"><dl>
          <dt><a href="ThrottleChapter1.shtml"
          title="Return to the previous chapter"><img width="18" height="18"
          src="images/LeftArrow2.jpg"></a></dt>
        </dl>
      </td>
      <td><img src="images/spacer.gif" width="30" height="10"> </td>
      <td align="center"><b><a href="ThrottleTOC.shtml"
        title="Jump to the Table Of Contents page">TOC</a></b> </td>
      <td><img src="images/spacer.gif" width="30" height="10"> </td>
      <td align="left"><b><a href="ThrottleChapter3.shtml"
        title="Advance to the next chapter"><img width="18" height="18"
        src="images/RightArrow2.jpg"></a></b> </td>
    </tr>
  </tbody>
</table>

        <!--#include virtual="/Footer" -->
    </div><!-- closes #mainContent-->
</div> <!-- closes #mBody-->
</body>
</html>
