<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01//EN" "http://www.w3.org/TR/html4/strict.dtd">
<!-- Updated by Blorec Herv&#233;  2017-01-10-->
<html lang="fr">
<head>
	<title>Tools Throttle Menu</title>
	<meta name="keywords" content="JMRI decoderpro dcc nmra throttle throttlepro">
	<meta name="Description" content="Throttle documentation for JMRI project">
	<meta name="Author" content="Lionel Jeanson">

	<!-- Style -->
	<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
	<link rel="stylesheet" type="text/css" href="/css/default.css" media="screen">
	<link rel="stylesheet" type="text/css" href="/css/print.css" media="print">
	<link rel="icon" href="/images/jmri.ico" type="image/png">
	<link rel="home" title="Home" href="/">
	<!-- /Style -->
</head>

<body>
<!--#include virtual="/Header" -->
<div id="mBody">
    <!--#include virtual="Sidebar" -->
    <div id="mainContent">
        <!-- Page Body -->

<h1>Menu Outils R&#233;gulateur</h1>
<img src="images/Toolsmenuentry.png" alt="Menu R&#233;gulateur">

<h2>Nouveau R&#233;gulateur:</h2>
Cr&#233;er une <a href="BasicThrottleWindow.shtml">nouvelle fen&#234;tre R&#233;gulateur</a> avec un r&#233;gulateur disponible et vide &#224; l'int&#233;rieur.

<h2>Sauver Configuration R&#233;gulateur:</h2>
Enregistrer les r&#233;gulateurs actuels,l'agencement des fen&#234;tres, aussi bien les r&#233;gulateurs internes, et les 
propri&#233;t&#233;s de la fen&#234;tre de la liste des r&#233;gulateurs.<br >

<h2>Charger Configuration R&#233;gulateur:</h2>
Charger une configuration de fen&#234;tres de r&#233;gulateurs, tel que d&#233;fini ci-dessus.<br >
Seront &#233;galement charg&#233;es des configurations des r&#233;gulateurs des versions pr&#233;c&#233;dentes de JMRI. (<2.7.9)

<h2> Enregistrer en tant que Configuration par d&#233;faut: </h2>
Enregistrer la disposition du r&#233;gulateur actuel comme &lt;dossier Pr&#233;f&#233;rences JMRI&gt;/throttleJMRI_ThrottlePreference.xml

<h2>Charger la  Configuration par d&#233;faut du r&#233;gulateur: </h2>
Charge &lt;Le dossier Pr&#233;f&#233;rences JMRI &lt;/throttleJMRI_ThrottlePreference.xml si il existe. <br>
		
<h3>Fusionner des fen&#234;tre R&#233;gulateurs</h3>
		
<p>Les fichiers de configuration R&#233;gulateur peuvent consister en une fen&#234;tre de r&#233;gulateur unique (pour commander une seule 
locomotive ou une adresse de couplage), ou elle peut contenir des multiples panneau de r&#233;gulateur. Dans tous les cas, lors de 
l'ouverture d'un fichier de configuration de r&#233;gulateur, JMRI v&#233;rifie pour voir si des panneaux existants de R&#233;gulateurs 
actifs sont d&#233;j&#224; ouverts. Si aucune n'est trouv&#233;e, le fichier est ouvert, comme une ouverture de configuration simple 
(expliqu&#233; ci-dessus). </p>
			
<p style="text-align: center; font-size: xx-small;">
			
<p>Cependant, quand une ou plusieurs panneau de R&#233;gulateur sont d&#233;j&#224; ouverts &#224; l'&#233;cran, le 
programme va ouvrir une bo&#238;te de dialogue suivante:</p>
<p style="text-align: center; font-size: xx-small;">
			<img src="images/jmri035.jpg" title="Merge Dialog Box" border="0" height="125" width="354" ><br>
			Figure 4-5: Merge Dialog Box
			</p> 						
avec 3 boutons			
	<ul>
	<li><strong>Fusionner</strong> &#8212; quitte les panneaux r&#233;gulateur actifs actuellement ouverts en place et ouvre le 
	r&#233;gulateur(s) contenu dans le dossier de configuration choisi.</li>
	<li><strong>Remplacer</strong> &#8212; ferme le bas du panneau actif du r&#233;gulateur ouvert
	(s) et ouvre le panneau de r&#233;gulateur (s) d&#233;finit dans le fichier de configuration choisi. </li>
	<li> <strong>Annuler</strong> &#8212;annule la demande d'"Ouverture" et ferme cette fen&#234;tre de dialogue .</li>
	</ul>
			
<p style="font-style: italic;" class="important">
			Remarque: Ne confondez pas l'action qui se produit ici avec toute tentative d'&#233;craser vos fichiers 
sauvegard&#233;s de configuration de r&#233;gulateur. Les actions ci-dessus n'ont aucun effet sur la configuratrion des 
fichiers sauvegard&#233;s de r&#233;gulateur eux-m&#234;mes. La seule action "fusionner" et "remplacer" qui se produit est tout simplement 
sur votre &#233;cran.
			</p>

			<hr >
<h2>Pr&#233;f&#233;rences R&#233;gulateurs:</h2>
Ouvrez le <a href="ThrottlesPreferencesPane.shtml">Volet Pr&#233;f&#233;rences r&#233;gulateurs.</a>

<!--#include virtual="/Footer" -->
      </div><!-- closes #mainContent-->
    </div> <!-- closes #mBody-->
</body>
</html>
