# WiThrottleBundle_fr.properties
#
# Translated by Herv\u00e9 BLOREC <bzh56420@yahoo.fr> le 2013-8-23

# for WiThrottlesListModel

LabelDeviceName = Nom de l'appareil:
LabelAddress = Adresse:


# Pour UserInterface
LabelPending = attente ...
LabelAdvertising = Publicit\u00e9 WiThrottle v {0} sur:
LabelClients = Clients:
LabelNone = aucun

MenuMenu = WiThrottle
MenuMenuStart = D\u00e9marrer le serveur
MenuMenuStop = Arr\u00eater le serveur
MenuMenuPrefs = Pr\u00e9f\u00e9rences ...
MenuMenuFilter = Itin\u00e9raires & Aiguillages ...

RosterGroupLabel = Liste Roster Groupe
RosterGroupToolTip = Les Locomotives de ce groupe de liste pourront \u00eatre s\u00e9lectionn\u00e9es dans les appareils Wi-Fi

# Pour les pr\u00e9f\u00e9rences
TitleWiThrottlePreferences = WiFi Pr\u00e9f\u00e9rences R\u00e9gulateur

TitleDelayPanel = eStop
LabelUseEStop = Utilisation eStop
LabelEStopDelay = secondes jusqu'\u00e0 eStop
ToolTipUseEStop = ON pour arr\u00eater la loco choisie, si la connexion est perdue


TitleFunctionsPanel = Boutons de fonction
LabelMomF2 = F2 toujours momentan\u00e9e
ToolTipMomF2 = Off fixe F2 pour suivre l'action de \u00abverrouillage\u00bb situ\u00e9e dans les \u00e9tiquettes de fonction de chaque entr\u00e9e de la liste


TitleNetworkPanel = R\u00e9seau
LabelUseFixedPortNumber = Utilisation port fixe
LabelNotFixed = automatique
ToolTipUseFixedPortNumber = Off pour permettre la s\u00e9lection automatique du port
TitlePortWarningDialog = Entr\u00e9e non valide
WarningInvalidPort = Num\u00e9ro de port doit \u00eatre compris entre 1024 et 65535.


TitleControllersPanel = Contr\u00f4les autoris\u00e9s
LabelTrackPower = Alimentation Voie
ToolTipTrackPower = Autoriser les p\u00e9riph\u00e9riques Wi-Fi \u00e0 contr\u00f4ler l'alimentation des voies

LabelTurnout = Aiguillages
ToolTipTurnout = Autoriser les p\u00e9riph\u00e9riques Wi-Fi pour commander les aiguillages

LabelRoute = Itin\u00e9raires
ToolTipRoute = Autoriser les p\u00e9riph\u00e9riques Wi-Fi pour commander les itin\u00e9raires

LabelConsist = Couplage
LabelWiFiConsist = Format NMRA 
LabelDCCConsist = DCC sp\u00e9cifique \u00e0 la marque
ToolTipConsist = Autoriser les p\u00e9riph\u00e9riques Wi-Fi pour faire et se d\u00e9faire les couplages
ToolTipWiFiConsist = Les Couplages ont de meilleures performances avec les r\u00e9gulateurs WiFi
ToolTipDCCConsist = Les Couplages ont de meilleurs r\u00e9sultats avec les r\u00e9gulatereurs des fabricants DCC


ButtonSave = Enreg
ButtonApply = Appl
ButtonCancel = Annuler
LabelApplyWarning = Pour les nouvelles pr\u00e9f\u00e9rences \u00e0 appliquer, tous les r\u00e9gulateurs doivent \u00eatre ferm\u00e9s et r\u00e9ouverts.

# Pour ControllerFilterFrame

ButtonSelectAll = Tout inclure
ButtonDeselectAll = ne rien inclure
ButtonSelectByUserName = Inclure Utilisateur Nomm\u00e9

ToolTipTurnoutTab = limite les aiguillages contr\u00f4lables par les appareils WiFi.
ToolTipRouteTab = limite les itin\u00e9raires contr\u00f4lables par les appareils WiFi.
ToolTipCancel = Fermer la fen\u00eatre sans enregistrer les modifications.
ToolTipSave = Enregistrer les modifications apport\u00e9es au fichier panneau.

LabelTurnoutTab = S\u00e9lectionner les aiguillages doivent \u00eatre contr\u00f4l\u00e9es par des dispositifs WiFi.
LabelRouteTab = S\u00e9lectionnez Itin\u00e9raires \u00eatre contr\u00f4l\u00e9es par des dispositifs WiFi.


