<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01//EN"
"http://www.w3.org/TR/html4/strict.dtd">

<html lang="fr">
<head>
<!-- Updated by Blorec Herv&#233; 2017-01-12-->
<title>JMRI Hardware Support - XPressNet LZV100 Configuration Tool</title>

<!-- Style -->
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<link rel="stylesheet" type="text/css" href="/css/default.css" media="screen">
<link rel="stylesheet" type="text/css" href="/css/print.css" media="print">
<link rel="icon" href="/images/jmri.ico" type="image/png">
<link rel="home" title="Home" href="/">
<!-- /Style -->
</head>

<body>
<!--#include virtual="/Header" -->
<div id="mBody">
 <!--#include virtual="Sidebar" -->
 <div id="mainContent">
  <!-- Page Body -->

<h2>Outil deCconfiguration XPressNet LZV100 </h2>
<img src="images/LZV100ConfigurationUtility.jpg" alt="LZV100 Configuration 
Tool Image">
<p>
L'outil de configuration LZV100 est utilis&#233; pour configurer la LZV100 travers une interface informatique
LI100 ou LI101 .
<p>
Commen&#231;ant par le haut, nous avons des informations de configuration pour la
partie Alimentation de la Centrale LZV100.
<p>
Le menu d&#233;roulant s&#233;lectionne la tension voie.
<p>
La seconde liste d&#233;roulante  indique si le "E-Line" doit &#234;tre Active ou
Inactive. Quand elle est active l'Alimentation des Centrales utilise cette interface pour couper le r&#233;seau
quand il y a un court-circuit, ou comme un arr&#234;t d'urgence.

<h4>Boutons</h4>

<p>
A partir du c&#244;t&#233; gauche de l'&#233;cran dans la premi&#232;re rang&#233;e de boutons, le
bouton "Write to LZV100"(Ecrire &#224; LZV100), &#233;crira les r&#233;glages au-dessus de cette ligne sur le LZV100.
<p>
Le bouton "Reset to Factory Defaults"(Reset aux param&#232;tres par d&#233;faut)" r&#233;initialise l'<b>&#233;cran </b>
aux r&#233;glages d'usine par d&#233;faut. Ceci n'envoie pas d'instruction de r&#233;initialisation &#224; la LZV100.

<p>
Le dernier bouton, &#233;tiquet&#233; "Close" va fermer l'&#233;cran, sans envoyer
d'information &#224; la LI101F.
<p>
La deuxi&#232;me rang&#233;e de boutons contient des options pour la Centrale.<br>
<strong>Ces options travaille aussi avec la LV100.</strong>
<p>
Le bouton "Reset Command Station"(Reset station de commande) envoie &#224; l'adresse de locomotive
0 des instructions de fonction indiqu&#233;e dans le manuel LZV100 pour une commande
de r&#233;initialisation de la Centrale. Ceci permet de r&#233;initialiser la Centrale aux parm&#224;tres d'usine.
Voir le manuel LZV100 pour plus d'informations pour savoir exactement ce que
cela fait.
<p>
Le bouton "Auto/Manual mode toggle" envoie &#224; la locomotive &#224; l'adresse 0 des instructions fonction indiqu&#233; dans le Manuel LZV100
 pour basculer entre le mode de d&#233;marrage manuel et automatique. Dans le mode Manuel
, la LZV100 fonctionnera sur toutes les fonctions des locomotives qui &#233;taient en service la
derni&#232;re fois que la LZV100 a &#233;t&#233; allum&#233;e. En mode Automatique, les locomotives
reprendront &#233;galement la vitesse et les r&#233;glages de direction pr&#233;c&#233;dents .

<p>Retour &#224; la page <a href="index.shtml">Aide XPressNet</a>

<hr>
Paul Bender<br>
paul.bender@acm.org

<!--#include virtual="/Footer" -->
 </div><!-- closes #mainContent-->
</div> <!-- closes #mBody-->
</body>
</html>
