<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<html lang="fr">
<head>
 <!-- Updated by Blorec Herv&#233;  2017-01-12-->
<title>JMRI Hardware Support - XPressNet - Lenz Feedback Bus Addressing</title>

<!-- Style -->
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<link rel="stylesheet" type="text/css" href="/css/default.css" media="screen">
<link rel="stylesheet" type="text/css" href="/css/print.css" media="print">
<link rel="icon" href="/images/jmri.ico" type="image/png">
<link rel="home" title="Home" href="/">
<!-- /Style -->
</head>

<body>
<!--#include virtual="/Header" -->
<div id="mBody">
  <!--#include virtual="Sidebar" -->
  <div id="mainContent">
    <!-- Page Body -->

      <h1>Bus Adressant les R&eacute;tro-Signalisation Lenz</h1>Sur
      les syst&egrave;mes de Lenz, la r&eacute;tro-signalisation
      des p&eacute;riph&eacute;riques d'entr&eacute;e est
      assur&eacute;e par le bus de r&eacute;tro-signalisation.
      L'entr&eacute;e disponible &agrave; partir du bus FeedBack
      (r&eacute;tro-signalisation) est fournie par le LR100 Lenz et
      le Codeurs de R&eacute;tro-Signalisation LR101 ou
      d&eacute;codeurs d'accessoires Lenz qui fournissent une
      capacit&eacute; de r&eacute;tro-signalisation (le LS100 par
      exemple)

      <h2>Adressagedes D&eacute;codeurs d'Accessoires avec
      XPressNet dans JMRI</h2>

      <p>Chaque d&eacute;codeur d'accessoires est abord&eacute; en
      lui donnant une adresse dans l'espace d'adresse allou&eacute;
      par le NMRA pour les d&eacute;codeurs d'accessoires. Cela
      autorise aux d&eacute;codeurs d'accessoires les adresses de 1
      &agrave; 1024.</p>

      <p>Dans les outils JMRI, vous pouvez pr&eacute;fixer
      l'adresse avec XT pour dire que le syst&egrave;me
      d&eacute;codeur est accessible via un syst&egrave;me base
      XPressNet . Si vous avez seulement un syst&egrave;me
      bas&eacute; XPressNet de configur&eacute;, vous pouvez
      simplement utiliser l'adresse et le programmes affectera
      automatiquement un pr&eacute;fixe XT pour vous.</p>

      <p>Sur le bus Feedback (R&eacute;tro-signalisations), les
      d&eacute;codeurs d'accessoires sont autoris&eacute;s &agrave;
      occuper les adresses 1 &agrave; 64. Depuis le retour des
      d&eacute;codeurs &eacute;quip&eacute;s que Lenz fournit en
      fait comprennent 4 d&eacute;codeurs d'accessoires, cet espace
      d'adressage limit&eacute;s en r&eacute;alit&eacute;,
      correspond &agrave; l'adresse d&eacute;codeur accessoire 1
      &agrave; 256.</p>

      <p>Pour calculer avec ce dispositif de r&eacute;troaction
      l'Adresses o&ugrave; r&eacute;side un de vos d&eacute;codeurs
      d'accessoires arrondir au multiple de 4 suivant, et divisez
      ce nombre par quatre.</p>

      <p>Par exemple, si vous avez un d&eacute;codeur d'accessoires
      avec l'adresse 121, le prochain multiple de 4 est de 124. 124
      divis&eacute; par 4 est de 31, donc ce d&eacute;codeur est
      inclus avec l'adresse de r&eacute;troaction 31. &lt;/
      p&gt;</p>

      <p>La r&eacute;tro-signalisation des d&eacute;codeurs
      d'accessoires est g&eacute;r&eacute;e automatiquement par
      l'outil des aiguillages fournis avec JMRI. Si l'aiguillage
      est &eacute;quip&eacute; de r&eacute;tro-signalisation,
      l'outil aiguillage, le tableau aiguillage, ou un panneau de
      contr&ocirc;le ne sera pas mise &agrave; jour de
      jusqu'&agrave; ce que la r&eacute;ponse du bus de
      r&eacute;tro-signalisation indique que l'aiguillage a
      &eacute;t&eacute; d&eacute;plac&eacute;. &lt;/ p&gt;</p>

      <p>Le statut des d&eacute;codeurs qui ne d&eacute;clarent pas
      la r&eacute;tro-signalisation est g&eacute;r&eacute; par
      l'attente d' un message de r&eacute;ponse avant de changer le
      statut du d&eacute;codeur</p>

      <h2>Adressage du Bus de R&eacute;tro-signalisations des
      Capteurs Lenz dans JMRI</h2>

      <p>Les Codeurs Lenz LR100 et LR101 de
      r&eacute;tro-signalisations sont autoris&eacute;s &agrave;
      avoir des r&eacute;tro-signalisation adresses de 1 &agrave;
      128. Lenz Recommande &agrave; partir de l'adresse 65 et pour
      &eacute;viter les conflits avec aiguillages fournissant une
      r&eacute;tro-signalisation.</p>

      <p>NOTE: le LR100 a en fait 16 entr&eacute;es, et prends
      jusqu'&agrave; deux adresses.</p>

      <p>Chaque r&eacute;tro-signalisation comprend un encodeur 8
      entr&eacute;es. Ces entr&eacute;es sont soit sur ou hors
      tension. Chaque entr&eacute;e est num&eacute;rot&eacute;e de
      1 &agrave; 8 sur le retour codeur.</p>

      <p>Pour d&eacute;terminer quelle adresse
      r&eacute;tro-signalisation est rapport&eacute;e par le
      dispositif, vous devez conna&icirc;tre l'adresse de
      l'encodeur de r&eacute;tro-signalisation, et qu'elle
      entr&eacute;e vous utilisez. Consultez la documentation de
      Lenz pour d&eacute;terminer comment le programme trouve les
      Adresse encodage R&eacute;tro-signalisation. Cela peut
      &ecirc;tre fait avec le codeur en place sur le
      r&eacute;seau.</p>

      <p>Pour calculer l'adresse d'un capteur, il faut soustraire 1
      de l'adresse de l'encodeur de r&eacute;tro-signalisation ,
      multipliez ce r&eacute;sultat par 8, puis ajoutez
      l'entr&eacute;e num&eacute;ro que vous utilisez.</p>

      <p>Par exemple, si vous utilisez le contact 3 sur un retour
      codeur avec l'adresse 99, 99 - 1 = 98. 98 * 8 = 784. 784+3 =
      787. L'adresse des r&eacute;tro-signalisations que vous allez
      utiliser est 787.</p>


<h1>Structure Mat&#233;rielle: XPressNet - Bus Lenz d'adressage des R&#233;tro-Signalisation </h1>
<p>
Sur les syst&#232;mes Lenz, la r&#233;tro-signalisation des p&#233;riph&#233;riques d'entr&#233;e est assur&#233;e par le Bus de &#233;tro-signalisation.

L'entr&#233;e disponible &#224; partir du bus FeedBack (r&#233;tro-signalisation) est fournie par le LR100 Lenz
et le Codeurs de R&#233;tro-Signalisation LR101 ou d&#233;codeurs d'accessoires Lenz qui fournissent une capacit&#233; de r&#233;tro-signalisation (le LS100 par exemple).


<h2>Adressage des D&#233;codeurs d'Accessoires avec XPressNet dans JMRI </h2>
<p>
Chaque d&#233;codeur d'accessoires est adress&#233; en lui donnant une adresse dans l'espace d'adresse 
allou&#233; par le NMRA pour les d&#233;codeurs d'accessoires. Cela autorise aux d&#233;codeurs d'accessoires
les adresses de 1 &#224; 1024.
</p>
<p>
Dans les outils JMRI, vous pouvez pr&#233;fixer l'adresse avec XT pour dire que le syst&#232;me
d&#233;codeur est accessible via un syst&#232;me bas&#233; sur XPressNet. Si vous avez seulement un syst&#232;me bas&#233; 
XPressNet configur&#233;, vous pouvez simplement utiliser l'adresse et le
programmes affectera automatiquement un pr&#233;fixe XT pour vous.
</p>
<p>
Sur le bus Feedback (R&#233;tro-signalisations), les d&#233;codeurs d'accessoires sont autoris&#233;s &#224; occuper les adresses
1 &#224; 64. Depuis le retour des d&#233;codeurs &#233;quip&#233;s que Lenz fournit actuellement
comprennent 4 d&#233;codeurs d'accessoires, cet espace d'adressage limit&#233; en r&#233;alit&#233;,
correspond &#224; l'adresse d&#233;codeur accessoire de 1 &#224; 256.
</p>
<p>
Pour calculer avec ce dispositif de r&#233;troaction l'Adresses o&#249; r&#233;side un de vos d&#233;codeurs d'accessoires
arrondir au multiple de 4 suivant, et divisez ce
nombre par quatre.
</p>
<p>
Par exemple, si vous avez un d&#233;codeur d'accessoires avec l'adresse 121, le prochain
multiple de 4 est de 124. 124 divis&#233; par 4 &#233;gale  31, donc ce d&#233;codeur est inclus
avec l'adresse de r&#233;troaction 31.
</p>
<p>
La r&#233;tro-signalisation des d&#233;codeurs d'accessoires est g&#233;r&#233;e automatiquement par les outils aiguillage fournis avec JMRI. 
Si l'aiguillage est &#233;quip&#233; de r&#233;tro-signalisation, l'Outil Aiguillage, le Tableau Aiguillage, ou un panneau de commande
 ne mettra pas &#224; jourl'&#233;tat de l'aiguillage de jusqu'&#224; ce que la r&#233;ponse du bus de r&#233;tro-signalisation indique 
que l'aiguillage a &#233;t&#233; chang&#233;.
</p>
<p>
Le statut des d&#233;codeurs qui ne d&#233;clarent pas la r&#233;tro-signalisation est g&#233;r&#233; par l'attente d'
un message de r&#233;ponse avant de changer le statut du d&#233;codeur

<h2>Adressage du Bus de R&#233;tro-signalisations Lenz des Capteurs dans JMRI </h2>
<p>
Les Encodeurs de R&#233;tro-signalisations Lenz LR100 et LR101  sont autoris&#233;s &#224; avoir des adresses de r&#233;tro-signalisation 
 de 1 &#224; 128. Lenz Recommande de commencer &#224; l'adresse 65 et pour
&#233;viter les conflits avec les aiguillages fournissant  une r&#233;tro-signalisation.
</p>

<p>NOTE: le LR100 a actuellement 16 entr&#233;es, et  prends jusqu'&#224; deux adresses.</p>

<p>
Chaque encodeur de r&#233;tro-signalisation comprend 8 entr&#233;es. Ces entr&#233;es sont soit On
ou Off. Chaque entr&#233;e est num&#233;rot&#233;e de 1 &#224; 8 sur l'Encodeur de R&#233;trosignalisation.
</p>
<p>
Pour d&#233;terminer quelle adresse de r&#233;tro-signalisation est rapport&#233;e par le dispositif, vous devez
conna&#238;tre l'adresse de l'encodeur de r&#233;tro-signalisation, et qu'elle entr&#233;e vous
utilisez. Consultez la documentation de Lenz pour d&#233;terminer comment le programme trouve les
Adresse des Encodeur de R&#233;tro-signalisation. Cela peut &#234;tre fait avec l'Encodeur en place sur
le r&#233;seau.</p>
<p>
Pour calculer l'adresse d'un capteur, il faut soustraire 1 de l'adresse de l'encodeur de r&#233;tro-signalisation, 
multipliez ce r&#233;sultat par 8, puis ajoutez num&#233;ro de l'entr&#233;e que vous utilisez.</p>
<p>
Par exemple, si vous utilisez le contact 3 sur un Encodeur de R&#233;tro-signalisation avec l'adresse
99, 99 - 1 = 98. 98 * 8 = 784. 784+3 = 787. L'adresse des r&#233;tro-signalisations que vous allez utiliser
est 787.</p>
<p>
Dans le champ adresse mat&#233;riel du volet "Add Sensor" vous pouvez entrer 
l'adresse de l'encodeur, suivi par par le contact s&#233;par&#233; par un ":"<br>
Ainsi pour un caapteur sur l'encodeur de r&#233;trosignalisation adresse 99, contact 3, vous entrerez <b>99:3</b></p>
<p>
Dans les outils JMRI, vous pouvez pr&#233;fixer l'adresse avec XS pour dire au syst&#232;me
que le Capteur est accessible via un syst&#232;me bas&#233; XPressNet. Si vous n'avez seulement qu'un
syst&#232;me bas&#233; XPressNet  configur&#233;, vous pouvez simplement utiliser l'adresse et le
programmes affectera automatiquement un pr&#233;fixe XS pour vous</p>

<p>Retour &#224; la page <a href="index.shtml">Aide XPressNet</a></p>

<hr>
Paul Bender<br>
paul.bender@acm.org

<!--#include virtual="/Footer" -->
 </div><!-- closes #mainContent-->
</div> <!-- closes #mBody-->
</body>
</html>
