# LRouteTableBundle_fr.properties
#
# Default properties for the jmri.jmrit.beantable. LRoute GUI elements
#
# Translated by Herv\u00e9 BLOREC <bzh56420@yahoo.fr> le 2016-6-03

LRouteAddTitle = Ajouter LItin\u00e9raire
LRouteEditTitle = Modifier LItin\u00e9raire
Type = Type
SetAction = D\u00e9finir Action
SetTrigger = \u00c9tat D\u00e9clencheur

SystemNameHint = Entrez le nom syst\u00e8me du nouveau  LItin\u00e9raire par exemple, D\u00e9finir LignePrincipale .
UserNameHint = Entrez le nom utilisateur pour le nouveau LItin\u00e9raire, par exemple, Effacer LignePrincipale.
BasicTab = LItin\u00e9raire basique
BasicTabHint = Inscrire le nom de cet LItin\u00e9raire
Guide 1 = Tab1: Nom de  LItin\u00e9rairel' LItin\u00e9raire, s\u00e9lectionner les param\u00e8tres des autres onglets, puis revenez ici et utilisez les boutons en bas.
Guide2 = Tab2: S\u00e9lectionnez les appareils que vous voulez contr\u00eeler et les actions que vous voulez qu'ils effectuent.
Guide3 = Tab3: S\u00e9lectionnez les p\u00e9riph\u00e9riques que vous souhaitez utiliser comme d\u00e9clencheurs et leurs \u00e9tats de d\u00e9clencher les actions du Tab2 ci-dessus.
Guide4 = Tab4: Autres param\u00e8tres de LItin\u00e9raire - Capteurs d'Alignement, des scripts et des fichiers audio, verrrouillages, etc
Set = D\u00e9finir LItin\u00e9raire
PlaySound = Jouer un fichier son:
RunScript = Ex\u00e9cuter le script:
SetLocks = d\u00e9finir des verrous
Lock = verrouiller les Aiguillages lorsque les d\u00e9clencheurs s'allument.

TriggerTab = D\u00e9clencheurs/Commandes (entr\u00e9e)
TriggerTabHint = S\u00e9lectionnez les d\u00e9clencheurs \u00e0 inclure pour cet LItin\u00e9raire
InputTitle = S\u00e9lectionnez l'\u00e9tat des D\u00e9clencheurs d'Entr\u00e9e pour cet LItin\u00e9raire
MiscTab = Alignement/Verrous/etc
MiscTabHint = S\u00e9lectionner les scripts et fichiers son, Capteurs d'alignement, d'autres param\u00e8tres
MiscTitle = Actions Additionnelles LItin\u00e9raire 
LRouteType = Type Logix LItin\u00e9raire
NewRoute = Nouveau m\u00e9thode
NewRouteHint = Tous les d\u00e9clencheurs et les v\u00e9tos activ\u00e9s dans une seule Condition.
OldRoute = Ancien m\u00e9thode
OldRouteHint = Chaque d\u00e9clencheur a une seule Condition avec droit de v\u00e9to non activ\u00e9.
Initialize = Initialiseur
InitializeHint = D\u00e9finit un Logix qui s'ex\u00e9cute avant tous les autres Logixs pour initialiser les appareils au moment du chargement.
ActionTab = Actions (sortie)
ActionTabHint = S\u00e9lectionner les Actions visant \u00e0 inclue pour cet LItin\u00e9raire
OutputTitle = S\u00e9lectionner l'\u00e9tats des Actionde Sortie \u00e0 d\u00e9finir pour cet LItin\u00e9raire

PickInput = Choisir Capteurs, Aiguillages, Lumi\u00e8res et/ou des signaux pour les variables de d\u00e9clenchement :
PickOutput = Choisir Capteurs, Aiguillages, Lumi\u00e8res et/ou des signaux pour les actions \u00e0 d\u00e9finir :
PickAlign = Entrer Capteurs pour indiquer l'alignement de Capteurs, Aiguillages, Lumi\u00e8res et/ou des signaux :

Alignment = Alignement
AlignSensor = Capteurs Align\u00e9s
AlignTurnout = Aiguillages Align\u00e9s
AlignLight = Lumi\u00e8res Align\u00e9
AlignSignal = Signaux Align\u00e9s
AlignAll = Tous Align\u00e9s

#SetActive = D\u00e9finir Capteur Actif
#SetInactive = D\u00e9finir Capteur Inactif
#SetToggle = Activ\u00e9 sur Bascule
#SetThrown = D\u00e9finir Aiguillage D\u00e9vi\u00e9
#SetClosed = D\u00e9finir Aiguillage Droit
#SetLightOn = D\u00e9finir Lumi\u00e8re Allum\u00e9e
#SetLightOff = D\u00e9finir Lumi\u00e8re \u00e9teinte
SetEnable = Activer \u00e9tat
SetDisable = D\u00e9sactiver \u00e9tat
#SetLit = D\u00e9finir Signal Allum\u00e9
#SetHeld = D\u00e9finir Signal Tenu
SetClear = Effacer Signal Tenu
#SetDark = D\u00e9inir Signal \u00e9teint
#SetRed = D\u00e9inir Signal Rouge
#SetFlashRed = D\u00e9finir Signal Clignotant Rouge
#SetYellow = D\u00e9finir Signal Jaune
#SetFlashYellow = D\u00e9finir signal Clignotant Jaune
#SetGreen = D\u00e9finir Signal Vert
#SetFlashGreen = D\u00e9finir Signal Clignotant Vert

#OnChange = Sur le Changement
#OnActive = Sur Actif
#OnInactive = Sur Inactif
#VetoActive = V\u00e9to Lorsque Actif
#VetoInactive = V\u00e9to lorsqu'il est Inactif
#OnThrown = Sur D\u00e9vi\u00e9
#OnClosed = Sur Droit
#VetoThrown = V\u00e9to quand D\u00e9vi\u00e9
#VetoClosed = V\u00e9to quand Droit
#OnLit = Sur Allum\u00e9
OnUnLit = Sur \u00e9teint
#VetoLit = V\u00e9to lorsqu'il est Allum\u00e9
VetoUnLit = V\u00e9to lorsqu'il est \u00e9teint
#OnRed = Sur Rouge
#OnFlashRed = Sur Rouge Clignotant
#OnYellow = Sur Jaune
#OnFlashYellow = Sur Jaune Clignotant
#OnGreen = Sur Vert
#OnFlashGreen = Sur Clignotant Vert
#OnDark = Sur \u00e9teint
#OnHeld = Sur Manuel
#VetoOnRed = V\u00e9to Quand Rouge
#VetoOnFlashRed = V\u00e9to Quand Rouge Clignotant
#VetoOnYellow = V\u00e9to Quand Jaune
#VetoOnFlashYellow = V\u00e9to Quand Jaune Clignotant
#VetoOnGreen = V\u00e9to Lorsque Vert
#VetoOnFlashGreen = V\u00e9to lorsque Vert Clignotant
#VetoOnDark = V\u00e9to Quand \u00e9teint
#VetoOnHeld = V\u00e9to lorsque Manuel
#VetoOnLit = V\u00e9to lorsqu'il est allum\u00e9

createInst = Pour cr\u00e9er un nouvel LItin\u00e9raire entrez la d\u00e9finition, puis cliquez sur 'Cr\u00e9er'.
editInst = Pour modifier un LItin\u00e9raire existant, entrez le nom syst\u00e8me, puis cliquez sur 'Modif LItin\u00e9raire'.
updateInst = Pour changer cet LItin\u00e9raire, faire les changements ci-dessus, puis cliquez sur "Mise \u00e0 jour".
cancelInst = Pour quitter le mode Modifier sans changer cet LItin\u00e9raire, cliquez sur 'Annuler'.
EnterNames = S'il vous pla\u00eet entrer un nom syst\u00e8me et un nom utilisateur.
DuplicateUser = Un Logix avec ce nom utilisateur existe d\u00e9j\u00e0.
DuplicateSys = Un Logix avec ce nom syst\u00e8me existe d\u00e9j\u00e0.
CreateHint = Ajouter un nouveau LItin\u00e9raire \u00e0 partir des donn\u00e9es saisies ci-dessus
EditHint = Entrez un nom LItin\u00e9raire \u00e0 modifier et appuyez sur
DeleteHint = Supprimer l'LItin\u00e9raire dans les Noms Syst\u00e8me
UpdateHint = Mettre \u00e0 jour cet LItin\u00e9raire utilisant les donn\u00e9es saisies ci-dessus

EditDiff = Diff\u00e9rence de Modification

TypeWarn = L'item d'action "{0}" sur la Condition "{1}" ne peut pas \u00eatre modifi\u00e9 dans LItin\u00e9raire
OnChangeWarn = L'item d'action "{0}" est d\u00e9clench\u00e9 diff\u00e9remment des autres actions sur la Condition "{1}".
TypeWarnVar = La Variable d'Etat "{0}" sur la condition "{1}" ne peut pas \u00eatre modifi\u00e9 dans LItin\u00e9raire
AlignWarn1 = L'\u00e9l\u00e9ment d'action d'alignement "{0}" \u00e0 condition "{1}" a un type d'action qui ne peut \u00eatre modifi\u00e9.
AlignWarn2 = Les Capteurs " {0} " et " {1} " sur la Condition " {2} " sont tous deux utilis\u00e9s pour le m\u00eame alignement.
LockWarn1 =  "{0}" Aiguillages pr\u00e9vu pour verrouiller sur la Condition "{1}", mais il a {2} points d'action.
LockWarn2 = L'item d'action "{0}" sur la Condition "{1}" a un type d'action qui ne peut \u00eatre modifi\u00e9 (d\u00e9finissez le verrouillage pr\u00e9vu).
LockWarn3 = L'Aiguillage "{0}" sur la Condition "{1}" ne devrait pas \u00eatre verrouill\u00e9
NoAlign = Il n'y a pas de sorties s\u00e9lectionn\u00e9es pour l'alignement Capteur {0} pour indiquer {1}.

addErr = LItin\u00e9raire impossible
noAction=Aucun \u00e9l\u00e9ments d'Action nonv\u00e9to de s\u00e9lectionn\u00e9s. Acc\u00e9dez \u00e0 l'onglet "Actions".
noVars = Pas d'\u00e9l\u00e9ments de commande de s\u00e9lectionn\u00e9s. Acc\u00e9dez \u00e0 l'Onglet "D\u00e9clencheurs/Commandes".
badInitTrigger = Le D\u00e9clencheur de Commande d'Initialisation doit \u00eatre un Capteur ou un Aiguillage. Acc\u00e9dez \u00e0 l'Onglet "D\u00e9clencheurs/Commandes"
