# SectionTransitTableBundle.properties
#
# Revision $Revision$
#
# Japanese properties for the jmri.jmrit.beantable.SectionTableAction and
#     jmri.jmrit.beantable.TransitTableAction GUI elements not contained in 
#     jmri.jmrit.beantable.BeanTableBundle.properties
# Translated by Sakae Akanuma <sakaeakanuma@gmail.com>
#
# This file is part of JMRI.
#
# JMRI is free software; you can redistribute it and/or modify it under
# the terms of version 2 of the GNU General Public License as published
# by the Free Software Foundation. See the "COPYING" file for a copy
# of this license.
#
# JMRI is distributed in the hope that it will be useful, but WITHOUT
# ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or
# FITNESS FOR A PARTICULAR PURPOSE.  See the GNU General Public License
# for more details.

SectionSystemNameHint = \u65B0\u898F\u30BB\u30AF\u30B7\u30E7\u30F3\u306E\u30B7\u30B9\u30C6\u30E0\u540D\u3092\u5165\u529B\u3057\u3066\u4E0B\u3055\u3044\u3002\uFF08\u4F8B\uFF1AIY13\uFF09
SectionUserNameHint = \u30BB\u30AF\u30B7\u30E7\u30F3\u306E\u30E6\u30FC\u30B6\u30FC\u540D\u3092\u5165\u529B\u3057\u3066\u4E0B\u3055\u3044\u3002\uFF08\u4F8B\uFF1A\u77E2\u677F\uFF0D\u7247\u5CA1\uFF09
SectionCreateButtonHint = \u30A8\u30F3\u30C8\u30EA\u30FC\u3092\u30C1\u30A7\u30C3\u30AF\u3059\u308B\u3068\u65B0\u898F\u30BB\u30AF\u30B7\u30E7\u30F3\u304C\u4F5C\u6210\u3055\u308C\u307E\u3059\u3002
SectionUpdateButtonHint = \u3053\u306E\u30BB\u30AF\u30B7\u30E7\u30F3\u3092\u66F4\u65B0
BlockTableMessage = \u30BB\u30AF\u30B7\u30E7\u30F3\u5185\u30D6\u30ED\u30C3\u30AF\u6570 (\u6700\u4F4E\uFF11\u500B\u5FC5\u8981)
SectionFree = FREE
SectionForward = \u524D\u9032
SectionReverse = \u53CD\u8EE2
SectionFirstBlock = \u5148\u982D\u30D6\u30ED\u30C3\u30AF
SectionLastBlock = \u6700\u5F8C\u5C3E\u30D6\u30ED\u30C3\u30AF

TransitSystemNameHint = \u65B0\u898F\u30C8\u30E9\u30F3\u30B8\u30C3\u30C8\u306E\u30B7\u30B9\u30C6\u30E0\u540D\u3092\u5165\u529B\u3057\u3066\u4E0B\u3055\u3044\u3002\uFF08\u4F8B\uFF1AIZ13\uFF09
TransitUserNameHint = \u30C8\u30E9\u30F3\u30B8\u30C3\u30C8\u306E\u30E6\u30FC\u30B6\u30FC\u540D\uFF08\u4F8B\uFF1A\u4E57\u5BA2\u8D70\u308C\uFF09
SectionTableMessage = \u30C8\u30E9\u30F3\u30B8\u30C3\u30C8\u5185\u306E\u30BB\u30AF\u30B7\u30E7\u30F3\u6570 (\u6700\u4F4E\uFF11\u500B\u5FC5\u8981)
TransitIdle = IDLE
TransitAssigned = ASSIGNED
TransitStartBlock = Start Block
TransitEndBlock = \u6700\u5F8C\u5C3E\u30D6\u30ED\u30C3\u30AF
ButtonDuplicate = \u8907\u88FD
SequenceColName = Order
SectionName = \u30BB\u30AF\u30B7\u30E7\u30F3
ActionColName = \u30B9\u30DA\u30B7\u30E3\u30EB\u30A2\u30AF\u30B7\u30E7\u30F3
DirectionColName = \u65B9\u5411
AlternateColName = Alternate
Primary = \u30D7\u30E9\u30A4\u30DE\u30EA
Alternate = Alternate
Pause = Pause for 
Wait = \u958B\u59CB\u5F85\u3061
AddNextButton = \u6B21\u306E\u30BB\u30AF\u30B7\u30E7\u30F3\u3092\u8FFD\u52A0
DeleteSectionsButton = \u3059\u3079\u3066\u306E\u30BB\u30AF\u30B7\u30E7\u30F3\u3092\u524A\u9664
DeleteSectionsButtonHint = Press to delete all Sections in above table and start again.
PrimarySectionBoxHint = Select a Section to add from this list, then press Add Next Section.
AlternateSectionBoxHint = Select a Section to add as an alternate to the above Section.
AddPrimaryButton = \u6B21\u306E\u30BB\u30AF\u30B7\u30E7\u30F3\u3092\u8FFD\u52A0
AddPrimaryButtonHint = Press to add the Section selected at the left to this Transit
AddAlternateButton = Add Alternate Section
AddAlternateButtonHint = Press to add the Section selected at the left as an alternate to the above Section.

CreateSectionButton = \u30BB\u30AF\u30B7\u30E7\u30F3\u751F\u6210
UpdateSectionButton = \u30BB\u30AF\u30B7\u30E7\u30F3\u66F4\u65B0
CancelButtonHint = \u30AD\u30E3\u30F3\u30BB\u30EB\u3092\u62BC\u3059\u3068\u65B0\u898F\u4F5C\u6210\u307E\u305F\u306F\u66F4\u65B0\u304C\u53D6\u308A\u6D88\u3055\u308C\u307E\u3059\u3002
DeleteAllBlocksButton = \u30D6\u30ED\u30C3\u30AF\u5168\u6D88\u53BB
DeleteAllBlocksButtonHint = Press to delete all Blocks in the above table and start again.
BlockBoxHint = Select a Block to add from this list, then press Add Selected Button.
AddBlockButton = \u9078\u629E\u3057\u305F\u30D6\u30ED\u30C3\u30AF\u3092\u8FFD\u52A0
AddBlockButtonHint = Press to add the Block selected at the left.
Unknown = \u4E0D\u660E
None = <\u7121\u3057>

LayoutEditorBoxHint = Select a Layout Editor panel, then select radio button to use it.
SetManuallyHint = Select this radio button to allow manual editing of Entry Point direction.
SetAutomaticHint = Select this radio button for automatic setting of Entry Point direction.
EntryPointTable = Table of Entry Points
SetManually = \u624B\u52D5\u3067\u30BB\u30C3\u30C8
UseConnectivity = Set Using Connectivity from Layout Editor Panel:
FromBlock = \u30D6\u30ED\u30C3\u30AF\u9032\u5165\u5143
TravelDirection = \u9032\u884C\u65B9\u5411
DirectionNote = Note: FORWARD direction is from the top Block toward the bottom Block.

DirectionSensorLabel = \u65B9\u5411\u30BB\u30F3\u30B5\u30FC (\u30AA\u30D7\u30B7\u30E7\u30F3)
ForwardSensor = Forward Sensor:
ForwardSensorHint = Enter forward sensor name (system or user).
ReverseSensor = Reverse Sensor:
ReverseSensorHint = Enter reverse sensor name (system or user). 
StoppingSensorLabel = Stopping Sensors (Optional)
ForwardStopSensor = Forward Stopping Sensor:
ForwardStopSensorHint = Enter forward stopping sensor name (system or user).
ReverseStopSensor = Reverse Stopping Sensor:
ReverseStopSensorHint = Enter reverse stopping sensor name (system or user). 

Tools = Tools
ValidateAllSections = Validate All Sections
SetupDirectionSensors = Set Direction Sensors in Logic
RemoveDirectionSensors = Remove Direction Sensors from Logic

ErrorTitle = Error
MessageTitle = Message
ChoiceTitle = Choose Panel
Message1 = Sections require Blocks and Paths. Please define them before creating Sections.
Message2 = \u30A8\u30E9\u30FC - Cannot create a new Section. System name or user name is not unique.
Message3 = \u30A8\u30E9\u30FC - Cannot update. The new user name is already in use for another Section.
Message4 = \u30A8\u30E9\u30FC adding block to Section. Please press Cancel and try again.
Message5 = \u30A8\u30E9\u30FC - \u8FFD\u52A0\u3059\u308B\u3079\u304D\u30D6\u30ED\u30C3\u30AF\u304C\u3042\u308A\u307E\u305B\u3093\u3002
Message6 = \u30A8\u30E9\u30FC - \u30BB\u30AF\u30B7\u30E7\u30F3\u306F\u5C11\u306A\u304F\u3068\u3082\uFF11\u3064\u306E\u30D6\u30ED\u30C3\u30AF\u304C\u5FC5\u8981\u3067\u3059\u3002\u30D6\u30ED\u30C3\u30AF\u3092\u8FFD\u52A0\u3057\u3066\u518D\u65BD\u884C\u3057\u3066\u304F\u3060\u3055\u3044\u3002
Message7 = \u30A8\u30E9\u30FC - Could not provide forward sensor. Please correct forward sensor name and try again.
Message8 = \u30A8\u30E9\u30FC - Could not provide reverse sensor. Please correct reverse sensor name and try again.
Message9 = \u30A8\u30E9\u30FC - Forward and reverse sensors must be different. Please try again.
Message10 = \u30A8\u30E9\u30FC - \u30A8\u30F3\u30C8\u30EA\u30FC\u30DD\u30A4\u30F3\u30C8\u306E\u65B9\u5411\u304C UNKNOWN. Please assign direction of all Entry Points.
Message11 = Please choose a Layout Editor panel to define connectivity.
Message12 = Warning - Tool request cancelled because you cancelled\n instead of choosing a Layout Editor panel as required.
Message13 = Request cancelled. This tool requires a Layout Editor panel\n to define connectivity.  Please create or load one and try again.
Message14 = {0} error messages issued when validating Sections. \nSee error log for details.
Message15 = All Sections were checked. No errors found.
Message16 = There are no Sections in the Section Table.

Message21 = \u30C8\u30E9\u30F3\u30B8\u30C3\u30C8\u306F\u30BB\u30AF\u30B7\u30E7\u30F3\u3092\u5FC5\u8981\u3068\u3057\u307E\u3059\u3002\u30C8\u30E9\u30F3\u30B8\u30C3\u30C8\u3092\u4F5C\u6210\u3059\u308B\u524D\u306B\u30BB\u30AF\u30B7\u30E7\u30F3\u3092\u5B9A\u7FA9\u3057\u3066\u304F\u3060\u3055\u3044\u3002
Message22 = \u30A8\u30E9\u30FC - \u65B0\u898F\u30C8\u30E9\u30F3\u30B8\u30C3\u30C8\u3092\u4F5C\u6210\u3067\u304D\u307E\u305B\u3093\u3002\u30B7\u30B9\u30C6\u30E0\u540D\u304B\u30E6\u30FC\u30B6\u30FC\u540D\u306F\u65E2\u306B\u4F7F\u7528\u3055\u308C\u3066\u3044\u307E\u3059\u3002
Message23 = \u30C8\u30E9\u30F3\u30B8\u30C3\u30C8\u306F50\u500B\u4EE5\u4E0A\u306E\u30BB\u30AF\u30B7\u30E7\u30F3\u306B\u5272\u308A\u5F53\u3066\u308B\u3053\u3068\u306F\u51FA\u6765\u307E\u305B\u3093\u3002
Message24 = \u30A8\u30E9\u30FC - \u8FFD\u52A0\u3059\u3079\u304D\u4ED6\u306E\u30BB\u30AF\u30B7\u30E7\u30F3\u304C\u3042\u308A\u307E\u305B\u3093\u3002
Message25 = \u30A8\u30E9\u30FC - \u8FFD\u52A0\u3059\u308B\u3079\u304D\u30BB\u30AF\u30B7\u30E7\u30F3\u304C\u3042\u308A\u307E\u305B\u3093\u3002
