<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01//EN" "http://www.w3.org/TR/html4/strict.dtd">
<html lang="fr">
<head>
<!-- Copyright Bob Jacobsen 2008 -->
<!-- UpDated by Blorec Herv&#233; le 2013-09-02-->
<title>JMRI: Affichage des Voies en couleurs</title>

<!-- Style -->
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<link rel="stylesheet" type="text/css" href="/css/default.css" media="screen">
<link rel="stylesheet" type="text/css" href="/css/print.css" media="print">
<link rel="icon" href="/images/jmri.ico" TYPE="image/png">
<link rel="home" title="Home" href="/">
<!-- /Style -->
</head>

<body>
<!--#include virtual="/Header" -->
    <div id="mBody">
<!--#include virtual="Sidebar" -->
<div id="mainContent">

<h1>JMRI: Affichage des Voies en couleurs</h1>

Ceux qui font du mod&#233;lisme de chemin de fer moderne pourraient vouloir un panneau de contr&#244;le 
qui affiche une Vue "sch&#233;matique" de leur r&#233;seau de chemin de fer, avec des segments individuels 
qui changent de couleur en fonction de l'occupation des voies.
PanelPro peut le faire pour vos panneaux. Il existe deux approches de base:

<UL>
<LI> Utilisez le nouvel
"<a href="../../../package/jmri/jmrit/display/LayoutEditor.shtml"> Editeur de R&#233;seau </a>"
pour cr&#233;er votre panneau. Il vous permet de
<a href="../../../package/jmri/jmrit/display/EditTrackSegment.shtml"> dessiner des segments des voies </a>
et
de <a place href="../../../package/jmri/jmrit/display/EditLayoutTurnout.shtml"> placer des aiguillages  </a>
sur l'&#233;cran, puis de les configurer afin qu'ils
changent de couleur en fonction de <a href="../../../package/jmri/jmrit/display/EditLayoutBlock.shtml"> l'occupation </a>.

<LI>Si vous utilisez l'"&#233;diteur de panneau" original, vous pouvez &#233;galement configurer des ic&#244;nes capteur pour changer 
la couleur de votre voie. Cette technique est d&#233;crite sur cette page.
</UL>

<H3>Arri&#232;re Plan</h3>

PanelPro d&#233;tecte l'&#233;tat de &#233;quipements sur le r&#233;seau, y compris si une voie est occup&#233;e, en utilisant des "capteurs". 
Selon le mat&#233;riel (syst&#232;me DCC, etc) que vous avez sur votre r&#233;seau, ces dispositifs peuvent &#234;tre diff&#233;rents, mais 
pour autant que le programme le sache, ils ont tous un travail identique: dire au programme que le d&#233;tecteur de 
canton est dans l'un des quatre &#233;tats:
<UL>
<LI>INACTIF (Inactive) - Le segment de voie est libre
<LI>ACTIF - (Active) Le segment de voie contient tout ou partie d'un train
<LI>INCONNU (Unknow) - La programme ne  conna&#238;t pas actuellement l'&#233;tat de ce capteur, g&#233;n&#233;ralement
parce que le programme vient de d&#233;marrer et n'a pas encore vu son message
<LI>INCOHERENT(Inconsistent - Une erreur s'est pass&#233;, et plut&#244;t que de vous donner une valeur qui peut
&#234;tre erron&#233;, nous disons simplement que nous sommes dans le doute.
</UL>

Pour un "SensorIcon" particulier &#224; un certain endroit sur l'&#233;cran, PanelPro associe une image diff&#233;rente &#224; chacun 
de ces &#233;tats. Lors des changements d'&#233;tat, la bonne image est plac&#233;e sur l'&#233;cran.
<P>
Donc, le probl&#232;me de base est d'avoir les bonnes images &#224; mettre sur l'&#233;cran.

<h3>Les Instructions pas &#224; pas</h3>

<OL>
<LI>
Dessinez l'arri&#232;re plan de base de votre panneau, y compris les voies. Obtenez les
couleurs, positions, etc, correctes, parce que revenir plus tard n&#233;cessitera de refaire
plusieurs &#233;tapes.
<br>
<IMG src="../../../images/tracksegments/WhiteTrack.gif">
<LI>

Prenez votre programme de dessin pr&#233;f&#233;r&#233; et d&#233;couper les petits morceaux d'image qui correspondent &#224; des blocs. Si vous 
avez plusieurs blocs de m&#234;mes formes et tailles exactes , vous n'avez qu'&#224; en faire des copies.
<br>
<IMG src="../../../images/tracksegments/WhiteArc.gif">
<IMG src="../../../images/tracksegments/WhiteLine.gif">
<IMG src="../../../images/tracksegments/WhiteTO.gif">

<LI>
Vous pourrez utiliser ces images pour les color&#233;es pour voir l'occupation. Par exemple, si vous voulez les avoir jaunes 
indiquant que la voie est occup&#233;e, blancs indiquant voie libre, et rouges indiquant des erreurs, vous devez copier les 
nouvelles images et cr&#233;er des versions avec des couleurs appropri&#233;es. (Note: Assurez-vous de conserver une copie de l'image 
originale de tous les segments de voies qui contiennent un aiguillage)
<BR>
<IMG src="../../../images/tracksegments/YellowArc.gif">
<IMG src="../../../images/tracksegments/RedArc.gif">
<IMG src="../../../images/tracksegments/WhiteArc.gif">
<lI>
Maintenant, cr&#233;ez le panneau &#224; l'aide de ces images, comme d&#233;crit dans les
<A HREF="PanelPro.shtml"> tutoriels </a>..

</OL>

Pour les aiguillages, la situation est un peu plus compliqu&#233;e. La plupart des gens voudront repr&#233;senter les <i> deux, 
</i>l'occupation <i> et </i> la position de l'aiguillage. Nous avons besoin encore de quelques &#233;tapes pour le faire.

<OL>

<LI>
Cr&#233;er des image de capteur pour les Voies tel que d&#233;crit ci-dessus

<OL>

<LI>

<BR>
<IMG src="../../../images/tracksegments/YellowTO.gif">
<IMG src="../../../images/tracksegments/RedTO.gif">
<IMG src="../../../images/tracksegments/WhiteTO.gif">
<LI>
Maintenant, nous cr&#233;ons des images qui vont se modifier pour voir les position de l'aiguillage. Nous voulons 
cr&#233;er des images qui sont transparentes o&#249; les voies, &#224; l'exception d'une couleur de fond un peu plus claire, 
repr&#233;sentent les position de l'aiguillage.
<BR>
<IMG src="../../../images/tracksegments/TranTOc.gif">
<IMG src="../../../images/tracksegments/TranTOt.gif">
<BR>
Ici la couleur grise repr&#233;sente les parties transparentes de l'image; si on le place sur une des images du capteur, 
la couleur des capteurs de voie brillera &#224; travers.

<li>
Maintenant, cr&#233;ez le panneau &#224; l'aide de ces images, comme d&#233;crit dans les  <A  HREF="PanelPro.shtml">tutoriels  </a>. 
Le fonctionnement normal (que nous allons changer ci-dessous) est d'avoir des capteurs &#224; l'avant des aiguillages &#224; 
l'&#233;cran. Cela signifie qu'il sera plus facile si vous ajoutez la position des ic&#244;nes des aiguillages d'abord, 
puis les ic&#244;nes du capteur.

<LI>
Pour d&#233;placer les ic&#244;nes capteur derri&#232;re les ic&#244;nes d'aiguillage, vous devez &#233;diter le fichier de panneau et de 
changer leur "niveau". Ouvrez votre fichier dans un &#233;diteur de texte (pas Microsoft Word, qui va essayer d'interpr&#233;ter
les XML et faire des choses incroyablement stupides avec eux).

<LI>
Trouvez les lignes de votre capteur et de l'aiguillage en recherchant le nom du capteur et de l'aiguillage, par exemple, 
LS33 et LT120. Vous trouverez deux lignes (qui peuvent &#234;tre s&#233;par&#233;es, selon la fa&#231;on dont vous avez cr&#233;&#233; les groupe) qui 
ressemblent &#224; ceci:

<PRE>
    &lt;turnouticon turnout="LT120" x="20" y="30" level="7" 
closed="resources/icons/smallschematics/tracksegments/os-righthand-west-closed.gif" 
thrown="resources/icons/smallschematics/tracksegments/os-righthand-west-thrown.gif" 
unknown="resources/icons/smallschematics/tracksegments/os-righthand-west-unknown.gif" 
inconsistent="resources/icons/smallschematics/tracksegments/os-righthand-west-error.gif" 
rotate="0" forcecontroloff="false" class="jmri.jmrit.display.configurexml.TurnoutIconXml" /&gt;
    &lt;sensoricon sensor="LS33" x="20" y="30" level="10" 
active="resources/icons/smallschematics/tracksegments/circuit-occupied.gif" 
inactive="resources/icons/smallschematics/tracksegments/circuit-empty.gif" 
unknown="resources/icons/smallschematics/tracksegments/circuit-error.gif" 
inconsistent="resources/icons/smallschematics/tracksegments/circuit-error.gif" 
rotate="0" forcecontroloff="false" momentary="false" class="jmri.jmrit.display.configurexml.SensorIconXml" /&gt;
</PRE>

Notez le "niveau" des attributs qui sont &#224; 7 et 10 respectivement. (Les nombre sup&#233;rieur sont plus vers l'"Avant", et cacher 
des choses avec des valeurs "inf&#233;rieur "). Juste &#233;changez ces valeurs, et enregistrez le fichier.
</OL>


Puisque vous couper les petites images &#224; partir de votre diagramme de voie, elles devront &#234;tre retourn&#233;es ensemble de 
fa&#231;on transparente sur l'&#233;cran.
<P>
Maintenant le panneau doit afficher les ic&#244;nes pour le capteur d'occupation et l'aiguillage qui fonctionnent ind&#233;pendamment 
et montrer &#224; la fois les position (en suivant les ligne) et les occupation (gr&#226;ce &#224; la couleur) de cet aiguillage.  

<!--#include virtual="/Footer" -->
    </div>
</body>
</html>

