<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">

<html lang="fr">
<head>
  <meta name="generator" content=
  "HTML Tidy for Mac OS X (vers 31 October 2006 - Apple Inc. build 15.17), see www.w3.org">
  <!-- Copyright Bob Jacobsen 2008 -->
  <!-- Updated by Blorec Herv&#233;  2013-09-02-->

  <title>JMRI: PanelPro, Fabriquer de Panneaux de Commande</title>
  <!-- Style -->
  <meta http-equiv="content-type" content=
  "text/html; charset=us-ascii">
  <link rel="stylesheet" type="text/css" href="/css/default.css"
  media="screen">
  <link rel="stylesheet" type="text/css" href="/css/print.css"
  media="print">
  <link rel="icon" href="/images/jmri.ico" type="image/png">
  <link rel="home" title="Home" href="/"><!-- /Style -->
</head>

<body>
  <!--#include virtual="/Header" -->

  <div id="mBody">
    <!--#include virtual="Sidebar" -->

    <div id="mainContent">
      <h1>JMRI: PanelPro, Une Application pour Fabriquer de
      Panneaux de Commande</h1>Les biblioth&egrave;ques JMRI
      contiennent l'application PanelPro pour la cr&eacute;ation de
      simples tableaux de commande. Cette page d&eacute;crit cette
      application, et comment l'utiliser.

      <p>PanelPro propose deux m&eacute;thodes distinctes pour
      cr&eacute;er des panneaux de contr&ocirc;le.</p>

      <ul>
        <li>L' <a href=
        "../../../package/jmri/jmrit/display/PanelEditor.shtml">&Eacute;diteur
        de Panneau</a> vous permet de dessiner un panneau
        exactement comme vous le voulez, puis les pi&egrave;ces
        anim&eacute;es pour montrer l'&eacute;tat de votre
        r&eacute;seau et vous laissez cliquez dessus pour la
        commande.</li>

        <li><a href=
        "../../../package/jmri/jmrit/display/LayoutEditor.shtml">Editeur
        de R&eacute;seau</a> fournit des outils pour dessiner votre
        r&eacute;seau tout en construisant la logique des signaux,
        etc. Il limite un peu la fa&ccedil;on dont le panneau
        apparait, mais il peut vous faire &eacute;conomiser
        beaucoup de temps lors votre premier sch&eacute;ma.</li>
      </ul>

      <h2>Lequel utiliser? L'&Eacute;diteur de R&eacute;seau ou
      l'&Eacute;diteur de Panneau?</h2>

      <p>L'&Eacute;diteur de R&eacute;seau cr&eacute;e un
      "Sch&eacute;ma" qui est une <i>description logique</i> de
      votre mise en r&eacute;seau enti&egrave;r. Vous n'avez qu'un
      seul sch&eacute;ma, car il n'est pas possible pour le
      logiciel de raccorder des &eacute;l&eacute;ments de voie
      ensemble au-del&agrave; des limites entre plusieurs
      R&eacute;seau. Un R&eacute;seau, construit avec
      l'&Eacute;diteur de R&eacute;seau, peut &ecirc;tre
      utilis&eacute; pour contr&ocirc;ler directement des
      &eacute;l&eacute;ments tels que les aiguillages et les
      signaux; en effet de nombreux utilisateurs le trouvent
      tr&egrave;s appropri&eacute; pour cette t&acirc;che. Mais, il
      est principalement con&ccedil;u pour l'automatisation et
      semi-automatisation au sein de JMRI. Par exemple, vous pouvez
      utiliser l'&Eacute;diteur de R&eacute;seau, pour construire
      une description de votre voie et ses cantons et signaux. Le
      logiciel peut fonctionner automatiquement comment configurer
      vos signaux bas&eacute;s sur la position des aiguillages et
      si les cantons sont occup&eacute;s, et les r&egrave;gles
      appropri&eacute;es &agrave; votre chemin de fer (c.-&agrave;
      d s&eacute;lectionner les r&egrave;gles de signalisation
      bas&eacute;es sur les diff&eacute;rentes pratiques de
      l'entreprise!, et pas besoin de savoir comment cr&eacute;er
      les r&egrave;gles pour relier les signaux &agrave;
      l'&eacute;tat d'aiguillages, les cantons et d'autres
      signaux!). En outre, le sch&eacute;ma de description de votre
      chemin de fer peut &ecirc;tre utilis&eacute; par des scripts
      tels que AutoDispatcher2 pour contr&ocirc;ler automatiquement
      vos trains. Il ya beaucoup d' outils de JMRI qui
      n&eacute;cessitent une description de votre r&eacute;seau et
      la description est issue du sch&eacute;ma construit dans
      l'&Eacute;diteur de R&eacute;seau, L'&Eacute;diteur de
      R&eacute;seau, a beaucoup de r&egrave;gles internes sur la
      fa&ccedil;on dont la voie est connect&eacute;e, la
      d&eacute;nomination des cantons, etc. Afin de fonctionner, il
      existe des contraintes sur l'apparence
      d'&eacute;l&eacute;ments de voie et comment ils sont
      utilis&eacute;s.</p>

      <p>L'Editeurs de Panneau construit un <i>contr&ocirc;le
      graphique</i> des panneaux. Vous pouvez avoir autant de
      panneaux que vous le souhaitez, couvrant autant ou aussi peu
      de votre r&eacute;seau que vous le souhaitez, avec des
      chevauchements dans la r&eacute;gion ou la
      fonctionnalit&eacute; si n&eacute;cessaire. Les panneaux
      peuvent &ecirc;tre des diagrammes montrant l'&eacute;tat de
      la voie et des signaux, ou ils pourraient &ecirc;tre des
      Panneaus prototype de signalisation et de Dispatcheur. Ou
      toute autre chose que vous trouverez utile pour
      contr&ocirc;ler votre r&eacute;seau, vous avez une
      flexibilit&eacute; totale sur leur apparence. Il y a
      plusieurs normes graphiques d&eacute;finies
      distribu&eacute;es avec JMRI, mais il est souvent
      n&eacute;cessaire de refaire quelques-uns des
      &eacute;l&eacute;ments&agrave; partir d'un logiciel graphique
      externe pour importer au format GIF ou PNG. Ceux-ci
      pourraient &ecirc;tre le panneau arri&egrave;re-plan, ou les
      ic&ocirc;nes pour fixer des &eacute;l&eacute;ments actifs
      (commutateurs, leviers, l'&eacute;tat de la piste, signaux,
      etc) qui sont ensuite plac&eacute;es sur le panneau.</p>

      <p><a href=
      "http://quaker-valley.com/CTC/JMRI%20Panel%20Tutorial.gif"><img src="http://quaker-valley.com/CTC/JMRI%20Panel%20Tutorial.gif"
      align="right" height="216" width="313"></a> Beaucoup
      d'utilisateurs utilisent les deux avec l'&Eacute;diteur de
      R&eacute;seau pour la cr&eacute;ation sch&eacute;matique de
      panneaux pour g&eacute;rer la configuration r&eacute;elle des
      signaux et l'&Eacute;diteur de Panneau fournissant les
      apparences d&eacute;sir&eacute;es. Par exemple, Bob Bucklew a
      pr&eacute;par&eacute; un tutotiel en trois parties <a href=
      "http://www.quaker-valley.com/CTC/JMRI_Panel_Tutorial.html"></a>
      qui d&eacute;crit comment Panel Pro et l'&Eacute;diteur de
      R&eacute;seau peuvent &ecirc;tre utilis&eacute; ensenble.</p>

      <p>SVP voir notre <a href=
      "http://jmri.org/community/examples/Gallery.shtml">page
      gallery</a> pour des exemples pour voir comment des
      mod&eacute;listes ont utilis&eacute; ceci sur leur propre
      r&eacute;seau. Voir aussi un exemple d'utilisation de
      PanelPro pour <a href=
      "http://jmri.org/community/examples/Modules.shtml">des
      r&eacute;seaux modulaires</a>. L'application <a href=
      "http://cats4ctc.org/">CATS</a> de Rodney Black est un autre
      outil pour cr&eacute;er des panneaux de contr&ocirc;le de
      style moderne.</p>

      <h2>L'Editeur de Panneau</h2><img src=
      "../../../images/PiecedPanel.gif" alt="Screen shot of panel"
      width="292" height="107" hspace="0" vspace="0"> <a href=
      "../../../images/CornwallPanelLit.gif"><img src=
      "../../../images/CornwallPanelLit.gif" alt=
      "screen shot of Cornwall panel" width="333" height="200"
      hspace="0" vspace="0"></a><br>
      Utilisation de l'&Eacute;diteur Panneau JMRI, vous pouvez
      faire un panneau de commande avec l'aspect et le
      fonctionnement que vous souhaitez.

      <p>Un panneau est compos&eacute; d'une ou plusieurs images de
      fond, sur laquelle sont dessin&eacute;es des ic&ocirc;nes
      pour repr&eacute;senter les aiguillages, les signaux, des
      capteurs et sur le r&eacute;seau. Vous pouvez construire le
      fond avec de petites ic&ocirc;nes (&agrave; gauche
      ci-dessus), ou fournir un dessin d&eacute;taill&eacute; que
      vous avez cr&eacute;&eacute; dans un programme de dessin
      (&agrave; droite ci-dessus).</p>

      <p>Vous pouvez utiliser ces outils pour configurer des
      panneaux assez compliqu&eacute; pour les grands
      sch&eacute;mas . L'exemple ci-dessus &agrave; partir du
      <a href=
      "http://kc.pennsyrr.com/layouts/kulp/index.html">chemin de
      fer de Cornwall de Nick Kulp</a> . Il y a une <a href=
      "http://jmri.org/community/examples/Panels-Cornwall/Cornwall.html">
      page sur le site Web principal</a> qui le d&eacute;crit en
      d&eacute;tail. Pour un autre exemple, voir la page <a href=
      "http://jbritton.pennsyrr.com/control_panels.ws4d">Jerry
      Britton</a> d&eacute;crivant comment il contr&ocirc;le son
      r&eacute;seau. Il y a aussi une <a href=
      "http://www.ownry.com/html/how_operations.html">page
      d&eacute;crivant le panneau</a> pour le <a href=
      "http://www.ownry.com/index.html">Navigation Oregon
      Washington &amp; Railway de Kent William</a> . Quaker Valley
      Lines de Robert Bucklew et &eacute;galement la construction
      d'un <a href=
      "http://www.quaker-valley.com/CTC/QV_CTCnew.html">panneau de
      CTC</a> utilisant PanelPro. (Il s'agit d'un panneau de
      deuxi&egrave;me g&eacute;n&eacute;ration avec des fonctions
      avanc&eacute;es, il y a aussi une page d&eacute;crivant en
      <a href="http://www.quaker-valley.com/CTC/QV_CTC.html">plus,
      le panneau simple</a> ) _</p>

      <p>De plus, reportez - vous &agrave; la <a href=
      "../../tools/signaling/index.shtml">page de signalisation</a>
      Pour plus d'informations sur la logique &agrave; ajouter pour
      exploiter les signaux de votre r&eacute;seau pour la commande
      de votre panneau.</p>

      <h3>Le Fonctionnement du Panneau</h3>cliquer sur un symbole
      d'aiguillage, le commande de direct &agrave;
      d&eacute;vi&eacute; et vice-versa. Un aiguillage a
      &eacute;galement des &eacute;tats "inconnu" et
      "incoh&eacute;rent", repr&eacute;sent&eacute;s respectivement
      par une ic&ocirc;ne avec un point d'interrogation et un X .
      Celles-ci repr&eacute;sentent un &eacute;tat o&ugrave; aucune
      information n'a &eacute;t&eacute; re&ccedil;ue, et o&ugrave;
      l'information est intrins&egrave;quement contradictoire (par
      exemple, &agrave; la fois direct et d&eacute;vi&eacute; dans
      le m&ecirc;me temps).

      <p>Cette commande peut &ecirc;tre utilis&eacute;e de diverses
      fa&ccedil;ons. Par exemple, vous pouvez avoir une ic&ocirc;ne
      d'aiguillage couvrant un aiguillage sur un sch&eacute;ma.
      Lorsque vous cliquez dessus, l'aiguillage sur le
      r&eacute;seau va recevoir l'ordre de changer, et le diagramme
      de la voie montre de quel c&ocirc;t&eacute; le train est
      dirig&eacute;. Ou vous pourriez utiliser des ic&ocirc;nes qui
      montrent un levier vers la droite ou vers la gauche, et de
      cr&eacute;er un groupe qui ressemble &agrave; un classique
      panneau des US&amp;S .</p>

      <p>Les "capteurs" peuvent &ecirc;tre utilis&eacute;s pour
      repr&eacute;senter les indicateurs d'occupation ou d'autres
      entr&eacute;es. L'ic&ocirc;ne par d&eacute;faut est un petit
      cercle, avec la couleur utilis&eacute;e pour
      repr&eacute;senter l'&eacute;tat du capteur. Ceux- ci
      r&eacute;pondent automatiquement aux changements sur le
      r&eacute;seau. Cliquer sur un capteur entra&icirc;ne
      l'alternance du capteur entre les &eacute;tats "actifs" et
      "inactifs" . Avec les ic&ocirc;nes par d&eacute;faut, actif
      est un cercle vert et inactif est un cercle vide. Ceux-ci
      visent &agrave; repr&eacute;senter un panneau indicateur
      allum&eacute;/noir. Un cercle rouge repr&eacute;sente
      l'&eacute;tat "Ignorer ", utilis&eacute; lorsque aucune
      information n'a encore &eacute;t&eacute; re&ccedil;ue du
      r&eacute;seau.</p>

      <h3>Cr&eacute;er un Panneau</h3>Ceux-ci sont fabriqu&eacute;s
      avec une "&Eacute;diteur de Panneau", qui vous permet de
      placer des images pour repr&eacute;senter les aiguillages,
      les capteurs (sur certains syst&egrave;mes) et les voies.

      <p>Le reste de cette page vous prom&egrave;ne &agrave;
      travers le processus. Si vous souhaitez voir les
      vid&eacute;os d'animation qui montrer comment chacune de ces
      choses sont r&eacute;ellement effectu&eacute;es sur
      l'&eacute;cran d'ordinateur, s'il vous pla&icirc;t voir la
      <a href="http://www.rr-cirkits.com/Clinics/Clinics.html">page
      vid&eacute;o de Dick Bronson</a>.</p>

      <p>Vous d&eacute;marrez l'&eacute;diteur en
      s&eacute;lectionnant "Nouveau Panneau ..." puis
      "&Eacute;diteur de Ppanneau" dans le menu "Panneaux" sur la
      fen&ecirc;tre principale. Vous aurez un panneau de commande
      vide, ainsi que les fen&ecirc;tre de l'&eacute;diteur:<br>
      <a href="../../../images/paneleditor.gif"><img src=
      "../../../images/paneleditor.gif" alt=
      " Capture d'&eacute;cran de l'&eacute;diteur de palettes "
      width="208" height="364" hspace="0" vspace="0" align=
      "right"></a></p>

      <p>Depuis le haut, il contient:</p>

      <ul>
        <li>Deux champs texte pr&eacute;cisant o&ugrave; (en
        pixels) de nouveaux composants seront ins&eacute;r&eacute;s
        sur le panneau. Vous pouvez g&eacute;n&eacute;ralement
        ignorer ceux-ci, car une fois les composants
        ins&eacute;r&eacute;s, vous pouvez les faire glisser en
        utilisant la touche m&eacute;ta (Apple, commande, etc)
        enfonc&eacute;e.</li>

        <li>Un bouton pour choisir une image de fond. Les
        capacit&eacute; de dessin de l'&eacute;diteur est
        rudimentaire et va probablement le rester pendant une
        longue p&eacute;riode. Pour cr&eacute;er des panneaux de la
        CTC, diagrammes de voie complexes, etc, il est plus facile
        de les dessiner dans un autre programme et de les
        ins&eacute;rer comme image de fond pour un panneau de
        contr&ocirc;le JMRI.</li>

        <li>Un bouton pour ajouter une &eacute;tiquette de texte.
        Mettre le texte souhait&eacute; dans le champ et cliquez
        sur le bouton. Vous pouvez glisser l'&eacute;tiquette
        autour apr&egrave;s l'avoir ins&eacute;r&eacute;e, mais
        vous ne pouvez actuellement pas modifier le texte
        ult&eacute;rieurement.</li>

        <li>Un bouton pour ajouter une ic&ocirc;ne comme un label.
        Il s'agit d'un moyen d'ajouter des symboles de voies, etc.
        Pour s&eacute;lectionner l' ic&ocirc;ne, cliquez sur le
        bouton "Modifier l'ic&ocirc;ne ..." pour faire
        appara&icirc;tre un panneau &eacute;diteur
        d'ic&ocirc;nes.<br>
        <a href="../../../images/iconeditor.gif"><img src=
        "../../../images/iconeditor.gif" alt=
        " Capture d'&eacute;cran de r&eacute;dacteur d'ic&ocirc;ne "
        width="148" height="214" hspace="0" vspace="0" align=
        "right"></a><br>
        L'ic&ocirc;ne actuelle est affich&eacute;e en haut. Pour la
        changer, utilisez l'arbre dans le bas de la fen&ecirc;tre
        pour s&eacute;lectionner une nouvelle, puis cliquez sur
        l'ic&ocirc;ne en haut du panneau &eacute;diteur
        d'ic&ocirc;nes pour charger l'ic&ocirc;ne
        s&eacute;lectionn&eacute;e. Il s'agit d'un m&eacute;canisme
        g&eacute;n&eacute;ral: Toute ic&ocirc;ne d'une
        fen&ecirc;tre de l'&eacute;diteur ic&ocirc;ne peut
        &ecirc;tre remplac&eacute;e en s&eacute;lectionnant celle
        qui vous int&eacute;resse et en cliquant sur l'ic&ocirc;ne
        devant &ecirc;tre remplac&eacute;e.</li>

        <li>Deux sections pour l'ajout d'aiguillages reli&eacute;s
        &agrave; droite ou &agrave; gauche. Ceux-ci fonctionnent
        effectivement de la m&ecirc;me fa&ccedil;on , seulement
        avec des ic&ocirc;nes diff&eacute;rentes pour
        repr&eacute;senter les &eacute;tats de l'aiguillage. Entrez
        le num&eacute;ro de l'aiguillage (par exemple 23) et
        cliquez sur "Ajouter aiguillage:". Si vous
        pr&eacute;f&eacute;rez un graphique diff&eacute;rent pour
        les &eacute;tats droit(close) et
        d&eacute;vi&eacute;(thrown), vous peuvent changer leurs
        ic&ocirc;nes comme d&eacute;crit ci-dessus.</li>

        <li>Une section pour ajouter un capteur.<a href=
        "../../../images/iconeditor.gif"><img src=
        "../../../images/iconeditor.gif" alt=
        "Screen shot of icon editor" width="148" height="214"
        hspace="0" vspace="0" align="right"></a><br>
        Tapez le num&eacute;ro de capteur (par exemple 74) dans le
        champ et cliquez sur "Ajouter capteur:".</li>
      </ul>Il y a &eacute;galement des boutons pour ajouter des
      objets plus avanc&eacute;s, y compris un cadran d'horloge, et
      cases &agrave; cocher qui contr&ocirc;lent le fonctionnement
      du panneau. Plus d'informations sur ceux-ci est disponible
      sur la <a href=
      "../../../package/jmri/jmrit/display/PanelEditor.shtml">page
      d'aide &Eacute;diteur de Panneau</a>.

      <p>Apr&egrave;s avoir obtenu le panneau comme vous le
      souhaitez, vous pouvez utiliser l'entr&eacute;e "Enregistrer
      Panneau ..." dans le menu "Panneaux" pour l'&eacute;crire
      dans un fichier XML.</p>

      <h3>Ic&ocirc;nes Disponibles</h3>La biblioth&egrave;que
      contient beaucoup d'ic&ocirc;nes JMRI contributives pour
      repr&eacute;senter les panneaux CTC, les LED, etc. Vous
      peuvent les parcourir avec l'arbre dans le bas du cadre
      &eacute;diteur. Peut-&ecirc;tre le meilleur moyen de voir ce
      &agrave; quoi chacune ressemble est de la s&eacute;lectionner
      dans l'arborescence, puis cliquez sur l'ic&ocirc;ne &agrave;
      c&ocirc;t&eacute; de l'ic&ocirc;ne "Ajouter ". Elle est
      charg&eacute;e.

      <p>Vous pouvez &eacute;galement cr&eacute;er vos propres
      ic&ocirc;nes et les utiliser en les s&eacute;lectionnant dans
      la section "Fichier".</p>

      <p>Pour des petits bouts de piste, par exemple,connecter des
      aiguillages, vous pouvez vouloir</p>
      <pre>
  resources -&gt; icons -&gt; small schematics -&gt; tracksegments
</pre>puis block.gif, etc

      <p>Nous devons faire un meilleur travail d'organisation des
      ic&ocirc;nes disponibles!</p>

      <h3>Manipulation d'Ic&ocirc;nes</h3>Pour d&eacute;placer une
      ic&ocirc;ne dans le panneau, vous "m&eacute;ta-tirer ". Sur
      un Mac, c'est "la touche cmd et faites glisser le curseur",
      sur Windows pourrait &ecirc;tre la touche de Windows ou de
      commande. Ou cela peut &ecirc;tre un glisser- droit.
      D&eacute;sol&eacute;, je n'ai pas de machine Windows ici pour
      le d&eacute;couvrir. Pour Linux Glisser+clic droit.

      <p>Il y a aussi un menu contextuel (ctrl-clic sur Mac) qui
      fournira diverses fa&ccedil;ons de manipuler l'ic&ocirc;ne.
      Il vous permettra de la faire tourner de sorte qu'elle pointe
      dans la direction que vous voulez. Les &eacute;tiquettes de
      texte peuvent avoir leur police, la taille et la couleur
      chang&eacute;e. Vous pouvez &eacute;galement supprimer des
      ic&ocirc;nes du panneau avec le menu contextuel.</p>

      <h3>Autres types de panneaux</h3>Parce que c'est &agrave;
      base d'ic&ocirc;nes, vous peuvez cr&eacute;er des panneaux
      qui ressemblent &agrave; ce que vous voulez. Par exemple, au
      lieu d'utiliser des ic&ocirc;nes sch&eacute;matique de voie
      pour les aiguillages, vous pourriez utiliser de petites
      images des niveaux et des plaques sur la machine de la CTC.
      Ceux-ci vous donneraient des leviers "m&eacute;caniques" que
      vous pourriez basculer avec un clic. Cela peut &ecirc;tre un
      prototype, ou peut &ecirc;tre simplifi&eacute; pour faciliter
      le fonctionnement et le rendre plus rapide, comme vous
      pr&eacute;f&eacute;rez.

      <p>Il est &eacute;galement possible de cr&eacute;er un groupe
      o&ugrave; les "voies" changent de couleur pour indiquer si la
      voie est occup&eacute;e. La proc&eacute;dure &agrave; suivre
      est d&eacute;crite sur une <a href="ColorTrack.shtml">page
      s&eacute;par&eacute;e</a>.</p>

      <h2>Utilisation de l'&Eacute;diteur de
      R&eacute;seau</h2><a href=
      "../../../package/jmri/jmrit/display/images/EnhancedPanel.gif"><img src="../../../package/jmri/jmrit/display/images/EnhancedPanel.gif"
      align="right" alt="screen shot of layout editor panel" width=
      "296" height="86" hspace="0" vspace="0"></a> L' <a href=
      "../../../package/jmri/jmrit/display/LayoutEditor.shtml">Editeur
      de R&eacute;seau</a> vous aide &agrave; cr&eacute;er de
      simples panneaux sch&eacute;matiques, et met en place
      simultan&eacute;ment la logique de canton et de signalisation
      n&eacute;cessaire au fonctionnement du r&eacute;seau. Sa
      force r&eacute;side dans sa capacit&eacute; &agrave; saisir
      la fa&ccedil;on dont les voies sont reli&eacute;es, chaque
      canton est situ&eacute; et comment chaque signal est
      li&eacute; &agrave; des cantons. D'autre part, il
      pr&eacute;voit une capacit&eacute; limit&eacute;e de
      personnaliser la mani&egrave;re dont le panneau
      appara&icirc;t.

      <p><a href=
      "../../../package/jmri/jmrit/display/images/OvalLayoutEditMode.gif">
      <img src=
      "../../../package/jmri/jmrit/display/images/OvalLayoutEditMode.gif"
      align="right" alt=
      "capture d'&eacute;cran du panneau l'&eacute;diteur mise en page"
      width="271" height="85" hspace="0" vspace="0"></a> Vous
      pouvez &eacute;diter via "Edit Mode", ce qui rend les
      connexions entre les &eacute;l&eacute;ments et le
      sch&eacute;ma visible (voir figure &agrave; droite). Par
      exemple, vous pouvez cliquer sur le cercle au milieu d'un
      segment de voie et s&eacute;lectionnez le d&eacute;tecteur
      d'occupation associ&eacute;s (capteurs) sur le sch&eacute;ma.
      Une fois que vous avez fait cela, la couleur du segment de
      voie sur l'&eacute;cran va changer lorsque la voie est
      occup&eacute;e. Vous pouvez configurer les couleurs
      utilis&eacute;es, la largeur des lignes de titre, et d'autres
      d&eacute;tails de la pr&eacute;sentation.</p>

      <p>Pour plus d'informations, s'il vous pla&icirc;t voir
      <a href=
      "../../../package/jmri/jmrit/display/LayoutEditor.shtml">la
      page d'aide &eacute;diteur R&eacute;seau</a>.</p>

      <h2>Communiquer avec les Syst&egrave;mes
      Multiples</h2>PanelPro peut communiquer avec plus d'un
      syst&egrave;me de commande de r&eacute;seau. Par exemple, le
      chemin de fer Cornwall mentionn&eacute; ci-dessus utilise du
      mat&eacute;riel de C/MRI pour la d&eacute;tection de
      l'&eacute;tat des cantons et des aiguillages, sur le
      r&eacute;seau, mais pilote la position des aiguillages
      gr&acirc;ce &agrave; un syst&egrave;me DCC Digitrax.

      <p>Pour configurer le programme pour dialoguer avec plusieurs
      syst&egrave;mes, il suffit de s&eacute;lectionner le premier
      dans la partie standard du panneau des
      pr&eacute;f&eacute;rences, et s&eacute;lectionnez la seconde
      dans les <a href=
      "../../../package/apps/TabbedPreferences.shtml#advanced">pr&eacute;f&eacute;rences
      avanc&eacute;es</a> . Pour plus d'informations, voir la
      <a href="../../../package/apps/TabbedPreferences.shtml">page
      d'aide</a> du panneau des pr&eacute;f&eacute;rences.</p>

      <p>Si vous ajoutez un aiguillage, un capteur ou signal sur un
      panneau en utilisant seulement un num&eacute;ro, par exemple
      "23", il sera attribu&eacute; au premier syst&egrave;me sur
      le panneau pr&eacute;f&eacute;rences. Pour acc&eacute;der au
      2&egrave;me syst&egrave;me, vous devrez utiliser les <a href=
      "../../doc/Technical/Names.shtml">noms de syst&egrave;me</a>
      JMRI. Par exemple, si la deuxi&egrave;me pi&egrave;ce jointe
      est sur un syst&egrave;me LocoNet, vous vous
      r&eacute;f&eacute;rez &agrave; un aiguillage LocoNet tel que
      LT13, un capteur LocoNet tel que LS21, etc. Voir la page sur
      les <a href="../../doc/Technical/Names.shtml">noms</a> pour
      plus d'informations.</p><!--#include virtual="/Footer" -->
    </div>
  </div>
</body>
</html>
