
<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01//EN" "http://www.w3.org/TR/html4/strict.dtd">
<html lang="fr">
<head>
<!-- Copyright Bob Jacobsen 2008 -->
<!--Updated by Herv&#233; BLOREC <bzh56420@yahoo.fr> on 2016-07-04 -->
<title>JMRI: Creating Control Panels </title>

<!-- Style -->
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<link rel="stylesheet" type="text/css" href="/css/default.css" media="screen">
<link rel="stylesheet" type="text/css" href="/css/print.css" media="print">
<link rel="icon" href="/images/jmri.ico" TYPE="image/png">
<link rel="home" title="Home" href="/">
<!-- /Style -->
</head>

<body>
<!--#include virtual="/Header" -->
<div id="mBody">
	<!--#include virtual="Sidebar" -->

	<div id="mainContent">
		<!-- Page Body -->

<h1>JMRI:Cr&#233;ation Panneaux de Commandes</h1>
Les librairies JMRI contiennent un syst&#232;me de cr&#233;ation de panneaux de commandes. Il est grandement personnalisable, et vous 
permet ce commander votre r&#233;seau directement depuis le panneau.

<h2>Contenu d'un panneau</h2>
<img src="../../../images/PiecedPanel.gif" alt="Screen shot of panel" align="right" width="292" height="107" hspace="0"
vspace="0">

<p>
Cliquer sur un symbole d'aiguillage le bascule de droit &#224; d&#233;vi&#233; et vice-versa.
Un aiguillage peut avoir aussi les &#233;tats "inconnu" ou "incoh&#233;rent", repr&#233;sent&#233;s par un ? ou un X respectivement. 
Ceux-ci repr&#233;sentes un &#233;tat o&#249; aucune information n'a &#233;t&#233; re&#231;ue, et o&#249; l'information est 
int&#233;rieurement incoh&#233;rente ( par exemple direct et d&#233;vi&#233; en m&#234;me temps).
<p>
Les "Capteurs" peut &#234;tre utilis&#233; pour repr&#233;senter des capteurs d'occupation ou autres entr&#233;es. L'ic&#244;ne par 
d&#233;faut est un petit cercle, avec la couleur utilis&#233;e pour repr&#233;senter l'&#233;tat du capteur. Dans l'exemple ci-dessus 
il y a sept capteurs pilot&#233;s par des indicateurs d'occupation.
Cliquer sur un capteur bascule le capteur entre l'&#233;tat "actif" et "inactif".
Avec les ic&#244;nes par d&#233;faut, actif est un cercle vert et inactif est un cercle vide.
Ils sont destin&#233;s &#224; repr&#233;senter un indicateur de panneau allum&#233;/&#233;teint.  Un cercle rouge repr&#233;sente 
l'&#233;tat "inconnu", utilis&#233; quand aucune information n'a &#233;t&#233; re&#231;ue depuis le r&#233;seau.

<h2>Cr&#233;ation d'un Panneau</h2>
(Nick Kulp pr&#233;sente un bon tutoriel sur ce sujet durant Mars 2004; ses diapositives sont 
<a href="http://jmri.org/community/clinics/NickKulpMarch2004/index.html">disponibles sur le site web principal JMRI</a>.
Dick Bronson a fourni plusieurs introductions anim&#233;es &#224; PanelPro sur
<a href="http://www.rr-cirkits.com/Clinics/Clinics.html">ses propres pages web</a>.

<p>
Les panneaux sont r&#233;alis&#233;s avec un "&#201;diteur de Panneau", qui vous permet de placer des images repr&#233;sentant les 
aiguillages, les capteurs (sur certains syst&#232;mes) et les voies.

<p>
Vous d&#233;marrez l'&#233;diteur en s&#233;lectionnant  "Nouveau Panneau...", puis "&#201;diteur de Panneau" depuis le menu "Panneau" sur
la fen&#234;tre principale.  
Vous obtiendrez un panneau de commande vierge, plus la 
fen&#234;tre de l'&#233;diteur:
<a href="../../../images/paneleditor.gif">
<img src="../../../images/paneleditor.gif" 
alt="Screen shot of panel editor" align=RIGHT width="208" height="364" hspace="0" vspace="0"></a>
<p>
<a NAME="editor">
Depuis le haut, celle-ci contient :</a>
	<ul>
	<li>Deux champs textes sp&#233;cifiants o&#249;(en pixels) doivent &#234;tre ins&#233;rer les nouveaux composants sur le panneau.
	Vous pouvez g&#233;n&#233;ralement ignorer ceci, car une fois que les composants ont &#233;t&#233; ins&#233;r&#233;s, vous pouvez 	
	les faire glisser, En tenant enfonc&#233; la m&#233;ta Touche.
	<li>Un bouton pour choisir une image de fond.  Les capacit&#233;s de l'&#233;diteur de dessin sont rudimentaires 
	et susceptibles de le rester pendant une longue p&#233;riode. Pour cr&#233;er un panneau CTC, des diagrammes de voie complexes, 
	etc, il est plus facile des les cr&#233;er dans d'autres programmes et de les ins&#233;rer comme une image de fond pour un panneau 
	de commande JMRI. 

	<li>Un bouton pour ajouter du texte. Mettez le texte d&#233;sir&#233; dans le champ et cliquez le bouton. Vous pouvez d&#233;placer 
	le texte apr&#232;s l'avoir ins&#233;rer, mais, vous ne pouvez pas actuellement modifier le texte plus tard.

	<li>Un bouton pour ajouter une ic&#244;ne comme un label. C'est une possibilit&#233; pour ajouter des symboles de voies, etc. Pour 
	voir ou s&#233;lectionner l'ic&#244;ne, cliquer sur le bouton "&#201;diter ic&#244;ne...".

	<li>Deux sections pour ajouter des aiguillages li&#233;s &#224; gauche ou &#224; droite. Ceux-ci travaillent actuellement de la 	
	m&#234;me mani&#232;re, avec seulement diff&#233;rentes ic&#244;nes pour repr&#233;senter les &#233;tats des aiguillages. Entrez le 
	num&#233;ro de l'aiguillage (exemple: 23) et cliquer "Ajouter aiguillage:". Si vous pr&#233;f&#233;rez un graphisme diff&#233;rent 	
	pour les &#233;tats directs ou d&#233;vi&#233;s, vous pouvez changer leurs ic&#244;nes avec le bouton "&#201;diter ic&#244;nes".

	<li>Une section pour ajouter un capteur.  
	Taper le num&#233;ro du capteur ( exemple: 74 ou LS74) dans le champs et cliquer "Ajouter au Panneau".

	<li>Une section pour ajouter un feu de signalisation. Taper le num&#233;ro du feu de signalisation dans le champs et cliquez 
	"Ajoutez au Panneau" .
</ul>

<p>
Chacun d'eux a &#233;galement unun bouton "&#201;diter ic&#244;nes..." qui vous permet de s&#233;lectionner 
quelle ic&#244;ne doit &#234;tre montr&#233;e pour l'aiguillage, le capteur, etc, que vous &#234;tes en train d'ajouter. 
<p>
Apr&#232;s avoir obtenu le panneau de la mani&#232;re que vous voulez, vous pouvez utiliser l'entr&#233;e "Enregistrer panneau..." dans 
le menu "Panneaux" pour l'&#233;crire dans un fichier XML.

<h3>Ic&#244;nes</h3>
L'&#233;diteur de panneau est &#224; base d'ic&#244;ne. La librairie JMRI contient beaucoup d'ic&#244;nes de contribution pour 
repr&#233;senter les panneaux CTC, LED, etc. Vous pouvez naviguer &#224; travers elles avec l'arbre dans le bas de l'&#233;diteur de 
cadre. Peut-&#234;tre que le meilleur moyen de voir ce que &#224; quoi chacune ressemble est de la s&#233;lectionner dans l'arbre,puis 
cliquez sur l'ic&#244;ne &#224; c&#244;t&#233; du bouton "Ajouter icône". Ce qui la chargera. .
<p>
Pour des petits bouts de voie, exemple pour connecter des aiguillages, vous pourriez vouloir 
<pre>
 resources -> icons -> small schematics ->tracksegments
</PRE>
Puis block.gif, etc.

<p>
Nous devons faire un meilleur travail d'organisation de ces...

<h3>Autres types de panneaux</h3>

Parce que c'est &#224; base d'ic&#244;nes, vous pouvez cr&#233;er des panneaux qui ressemblent &#224; ce que vous
voulez.  Par exemple, au lieu d'utiliser des ic&#244;nes de voie sch&#233;matiques pour les aiguillages, vous pouvez utiliser des 
petites images, des leviers et des plaques sur la machine CTC. Ceci vous donnera des leviers "m&#233;caniques" que vous pourrez 
basculer avec un clic.
 <p>
Pour rendre ceci r&#233;ellement ais&#233;, nous avons besoin d'avoir un meilleur &#233;diteur. Et faire un vrai panneau CTC demandera 
de meilleurs signaux logiques pour manipuler les boutons cod&#233;s, etc.  
Si vous avez des avis sur la mani&#232;re dont cela devrait fonctionner, s'il vous pla&#238;t envoyez vos commentaires!

<h2>Utilisation du panneau</h2>

Pour commander le changement d'&#233;tat d'un aiguillage ( exemple droit vers d&#233;vi&#233;), cliquez sur lui.
<p>
Pour le d&#233;placer, vous le "meta-glisser". Sur un Mac c'est d'appuyer sur la touche Cmd et de glisser avec le curseur de la souris; 
sur Windows, ce pourrait &#234;tre la touche Windows ou la touche de Ctrl.  
Ou ce pourrait &#234;tre un glisser-droit.  D&#233;sol&#233;, je n'ai pas de machine Windows ici pour le tester. Pour Linux Glisser
+clic droit.
<p>
Il y a aussi un menu d&#233;roulant(ctrl - clic sur un Mac) qui vous permet de pivoter l'ic&#244;ne afin qu'elle pointe dans la 
direction que vous voulez.</p>

<!--#include virtual="/Footer" -->
  </div><!-- closes #mainContent-->
 </div> <!-- closes #mBody-->
</body>
</html>
