<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01//EN" "http://www.w3.org/TR/html4/strict.dtd">
<html lang="fr">
<head>
<!-- Copyright Bob Jacobsen 2008 -->
<!-- $Id$ -->
<!-- UpDated  by Blorec Herv&#233; 2013-09-29-->
<title>JMRI: Aspect Signaling</title>

<!-- Style -->
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<link rel="stylesheet" type="text/css" href="/css/default.css" media="screen">
<link rel="stylesheet" type="text/css" href="/css/print.css" media="print">
<link rel="icon" href="/images/jmri.ico" TYPE="image/png">
<link rel="home" title="Home" href="/">
<!-- /Style -->
</head>

<body>
<!--#include virtual="/Header" -->
    <div id="mBody">
<!--#include virtual="Sidebar" -->
<div id="mainContent">


<H1>JMRI: Aspect de la Signalisation</H1>
<p class=subtitle>
La Signalisation contr&#244;le de mani&#232;re prototypique
</p>

<a href="images/Rule282.png">      <img height="241" width="159" src="images/Rule282.png" align="right">
</a>
 Le Syst&#232;mes de signalisation Prototypical pr&#233;sente des "aspects" au conducteur 
pour lui dire comment faire fonctionner son train.
L'aspect "Stop" , par exemple, est assez simple: arr&#234;ter le train.
L'aspect "Approche au ralenti"  indique quelque chose de plus compliqu&#233;:
"Proc&#233;der &#224; l'approche du signal suivant &#224; vitesse moyenne".
Chaque aspect est associ&#233; &#224; un "indication", qui est habituellement
codifi&#233; dans le livre de r&#232;gle du chemin de fer.
<p>
Diff&#233;rents signaux peuvent
montrent un aspect en utilisant diff&#233;rentes combinaisons de
lumi&#232;res, les positions du s&#233;maphore, et/ou des pancartes; on les appelle
"apparences". Par exemple, l'aspect  "stop" sera une lumi&#232;re rouge simple
sur un m&#226;t de signal avec une lampe, rouge au-dessus des lampes rouges pour un m&#226;t de signal
avec deux lampes, etc.
</p>

  

<h2>JMRI Support pour l'Aspect de Signalisation</h2>

Le support original JMRI pour les signaux a &#233;t&#233; par l'interm&#233;diaire
"t&#234;tes de signals", qui pourrait &#234;tre r&#233;gl&#233; &#224; des
apparences (couleurs) particuli&#232;res.
<p>

En commen&#231;ant par JMRI 2.9.1 (d&#233;but 2010),
JMRI contient &#233;galement
"<a href="SignalMasts.shtml"> m&#226;t signal  </a>"qui sont 
des objets qui repr&#233;sentent un
 signal entier, pas seulement une t&#234;te individuelle. Un m&#226;t de signal
peut fonctionner avec des t&#234;tes multiples, telles que requises pour faire une signalisation prototypique compl&#232;te
bas&#233;e sur des aspects. Lorsque son "aspect" est r&#233;gl&#233;
par exemple "Approche au ralenti", il g&#232;re les op&#233;rations de mise en page
n&#233;cessaires pour faire que les signaux sur le r&#233;seau apparaissent correctement.

<p>
<a
href="../../../package/jmri/jmrit/beantable/SignalMastTable.png">
     <img src ="../../../package/JMRI/jmrit/beantable/SignalMastTable.png "
         height = "86" width = "338" align = "right">
</a>
Les M&#226;ts de signaux sont configur&#233;s via la
<a href="../../../package/jmri/jmrit/beantable/SignalMastTable.shtml"> table M&#226;t de signal  </a>
Vous pouvez en ajouter de nouveaux avec le bouton "Ajouter ..." 
sur la table, qui vous emm&#232;ne &#224; la
<a href="../../../package/jmri/jmrit/beantable/SignalMastAddEdit.shtml"> fen&#234;tre "Ajouter m&#226;t de signal"  </a>.
Pour ajouter un m&#226;t de signal, vous sp&#233;cifirez
quel genre de syst&#232;me de signalisation il utilisera
( <a href="#systems">voir ci-dessous </a>),
le type de signal sp&#233;cifique tel que "feux doubles" ou "nain &#224; double t&#234;te"
et quelle t&#234;te signal il va conduire.

<p>
De la table, vous pouvez d&#233;finir des m&#226;ts de signaux individuels pour
tous les aspects qu'ils sont capables 
d'afficher en cliquant dans "l'aspect" colonne.

<p>
Les M&#226;ts de signaux peuvent &#234;tre test&#233;s de deux mani&#232;res (dans les conditions) et exploitation(Action) via Logix. Lorsque vous modifiez une Condition Logix
ou une action, vous devez taper le nom du m&#226;t des signaux et tapez Entr&#233;e/retour
afin que le programme puissent rechercher les aspects possibles de ce signal de m&#226;t en particulier.

<p>
Vous pouvez &#233;galement ajouter une ic&#244;ne de m&#226;t de signal dans l'&#233;diteur de Panneau de la mani&#232;re habituelle
. L'ic&#244;ne affichera les images de la d&#233;finition de l'apparence
pour ce m&#226;t de signal particulier.

<h2>Logique m&#226;t de Signal</h2>
Depuis JMRI 2.11.7 (mi 2011), JMRI contient un outil "<a href="SignalMastLogic.shtml"> Logique m&#226;t de signal </a>", qui
permet &#224; la logique de signalisation  d'&#234;tre construite entre les m&#226;ts de signaux sur le r&#233;seau.
La logique m&#226;t de signal va utiliser les &#233;tats de cantons, des aiguillages, des capteurs et autres M&#226;ts de
Signal pour d&#233;terminer quelle apparence un m&#226;t de signalisation doit afficher.
 Si le tracé a été établi sur l'éditeur de réseau et les SignalMasts ont
été placés sur le panneau à l'aide des différents outils, il est possible pour tous
la logique de M&#226;t de Signalisation d'&#234;tre construite de manière dynamique, avec peu d'intervention de l'utilisateur.
 
<h2> Syst&#232;mes de Signalisation Disponibles</h2>

Les utilisateurs JMRI ont fourni un certain nombre de syst&#232;mes de signalisation pr&#233;-d&#233;finis:
<dl>
<dt> <a href="../../../../../xml/signals/basic/index.shtml"> base </a>
     <dd> un ensemble non prototypiques des aspects et des apparences que la plupart des
         mod&#233;listes comprendront facilement.
<dt> <a href="../../../../../xml/signals/AAR-1946/index.shtml"> AAR-1946 </a>
     <dd>livre r&#232;gle de 1946 Association am&#233;ricaine des chemins de fer 
<dt> <a href="../../../../../xml/signals/BR-2003/index.shtml"> BR-2003 </a>
     <dd> livre de r&#232;gles British Rail 2003 
<dt><a href="../../../../../xml/signals/CSX-1998/index.shtml">CSX-1998</a>
    <dd>CSX 1998 rule book
<dt> <a href="../../../../../xml/signals/DB-HV-1969/index.shtml"> DB HV 1969 </a>
     <dd> 1969 Deutsche Bundesbahn "Einheitsbauform" Home Signal/Distant signal (Hauptsignal/Vorsignal) r&#233;vision du syst&#232;me
<dt><a href="../../../../../xml/signals/NYCS-1937/index.shtml">NYCS-1937</a>
    <dd>New York Central System 1937 rule book
<dt><a href="../../../../../xml/signals/SLSF-1973/index.shtml">SLSF-1973</a>
    <dd>SLSF (Frisco) 1973 rule book
<dt> <a href="../../../../../xml/signals/SPTCO-1960/index.shtml"> SPTCO-1960 </a>
     <dd> Livre des r&#232;glements 1960 Southern Pacific Railway et la Compagnie de transport 
</dl>

Il y a des instructions pour la cr&#233;ation de vos propres d&#233;finitions de syst&#232;me signal
sur
<a href="DefineNewAspects.shtml"> une page s&#233;par&#233;e </a>.
Si vous cr&#233;ez une nouvelle d&#233;finition pour une autre voie ferr&#233;e prototype ou une &#233;poque,
S'il vous pla&#238;t, faites contribuer le nouveau projet afin que nous JMRI
puissions le distribuer avec les futures versions du projet aux
autres d'utilisateur. Comme les d&#233;finitions de d&#233;codeur dans DecoderPro, nous avons
plusieurs d&#233;finitions de syst&#232;me de signal, les plus utile du programme 
que les gens passent du temps &#224; am&#233;liorer. Nous avons tous &#224;
gagner de cette mani&#232;re!

 <h2> Acc&#232;s &#224; l'information Aspect du code </h2>

Un programme (en Java ou Python) peut avoir acc&#232;s &#224; l'
informations aspect de deux fa&#231;ons. Si elle a une r&#233;f&#233;rence
&#224; un SignalMast sp&#233;cifiques "m", il peut utiliser
<code> <pre>
    m.getValidAspects ()
</pre> </code>
pour obtenir la liste des noms aspect que ce m&#226;t de signal peut afficher.
Le programme peut alors acc&#233;der &#224; la d&#233;finition du syst&#232;me du signal avec
<code> <pre>
    SignalSystem sys = m.getSignalSystem ()
     </pre> </code>
et ensuite se renseigner sur les propri&#233;t&#233;s de l'aspect:
<code> <pre>
    sys.getProperty ("Effacer", "vitesse");
</pre> </code>
o&#249; le premier argument est le nom d'aspect (l'utilisation, par exemple,
<code> m.getAspect () </code> pour obtenir l'aspect actuel sur le m&#226;t)
et le second est une propri&#233;t&#233; sp&#233;cifique.
Les propri&#233;t&#233;s peuvent &#234;tre d&#233;finies par programmation, par exemple par
<code> m.setProperty ("Effacer", "vitesse", "69");</code>
ou les charg&#233;es automatiquement &#224; partir des &#233;l&#233;ments dans le fichier
<a href="DefineNewAspects.shtml"> aspect.xml </a>
qui d&#233;finit le syst&#232;me de signalisation sp&#233;cifiques.

<p>
En plus des propri&#233;t&#233;s globales d'un aspect, il
peut &#233;galement y avoir des propri&#233;t&#233;s locales d'un type de m&#226;t de signal sp&#233;cifique.
Un exemple de ceci est l'image d'ic&#244;ne par d&#233;faut: L'image d'un
m&#226;t de signal &#224; deux t&#234;tes est diff&#233;rent de celui d'un m&#226;t de signal une t&#234;te,
m&#234;me si elles repr&#233;sentent tous les deux "Effacer".
<p>
Pour obtenir celles-ci:
<code> <pre>
    . m.getAppearanceMap () getProperty ("clear", "IMAGELINK");
</pre> </code>
Autrement dit, c'est en disant "Obtenir l'info apparence pour ce m&#226;t,
puis v&#233;rifiez la propri&#233;t&#233; imagelink de l'aspect Clair ".

<p>
Alternativement, si vous connaissez le nom du syst&#232;me du signal dans l'utilisation,
vous pouvez aller directement &#224; lui par l'InstanceManager:
<code> <pre>
    SignalSystem sys = InstanceManager.signalSystemManagerInstance () getSystem ("basic");
</pre> </code>
<li>
<li>
Lexique:
<li>* SignalMast = M&#226;t de Signalisation
<li>* SignalHead = T&#234;te de signal (1 lampe)
<li>* Aspect= couleur du feu
<li>* Apparence (du M&#226;t)= ce qu'il signifie ex: Rappel de ralentissement
.
<!--#include virtual="/Footer" -->
</body>
</html>

