
<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//FR"
"http://www.w3.org/TR/html4/loose.dtd">

<html lang="fr">
<head>
  <meta name="generator" content=
  "HTML Tidy for Mac OS X (vers 31 October 2006 - Apple Inc. build 15.17), see www.w3.org">

  <title>JMRI: Signal Groups Documentation</title>
  <meta name="author" content="Bob Jacobsen, Egbert Broerse">
  <meta name="keywords" content=
  "model railroad JMRI decoderpro panelpro signal">
  <!-- Style -->
  <meta http-equiv="Content-Type" content=
  "text/html; charset=ISO-8859-1">
  <link rel="stylesheet" type="text/css" href="/css/default.css"
  media="screen">
  <link rel="stylesheet" type="text/css" href="/css/print.css"
  media="print">
  <link rel="icon" href="/images/jmri.ico" type="image/png">
  <link rel="home" title="Home" href="/">
  <!-- /Style -->
</head>

<body>
  <!--#include virtual="/Header.shtml" -->
  <div id="mBody">
    <!--#include virtual="Sidebar.shtml" -->
    <div id="mainContent">
      <!-- Page Body -->

      <h1>IRMJ : Groupes de signaux </h1>

      <p>Les groupes de signaux sont utilis&#233;s pour d&#233;finir un certain nombre de Feux de Signalisation,
      o&#249; un seul Feu de Signalisation peut &#234;tre &#233;clair&#233; &#224; la fois
      , en fonction du statut du m&#226;t de signalisation associ&#233;
      et un ensemble de conditions.

      <h3>Application</h3>

      <p>Les Groupes de Signaux seront utilis&#233;s lorsque des indicateurs suppl&#233;mentaires
      (affichages) sont utilis&#233;s pour soutenir le m&#226;t de signalisation principal, tel
      que:</p>

      <ul>
        <li><a href="#junction">Indicateurs de Direction</a></li>

        <li><a href="#route">Indicateurs d'Itin&#233;raire</a></li>

        <li><a href="#speed">Indicateurs de Vitesse </a></li>
      </ul>

      <p>Ces indicateurs fournissent des informations compl&#233;mentaires &#224; ce
      qui n'est pas donn&#233; par le M&#226;t de Signalisation principal. 
      Les indicateurs sont fr&#233;quemment observ&#233;s en Europe continentale et au Royaume-Uni
      .</p>

      <h4><a name="junction" id="junction">Indicateurs de Direction
      </a></h4><img src=
      "../../../package/jmri/jmrit/beantable/images/SignalGroup1.png"
      align="right" width="30" height="90" hspace="0" vspace="0"
      alt="Junction Indicator figure">

      <p>Un Indicateur de Direction peut &#234;tre configur&#233; pour afficher n'importe quoi
      de 1 &#224; 6 itin&#233;raires divergents. Un seul indicateur
      se trouve souvent l&#224; o&#249; une ligne secondaire diverge d'une
      ligne principale. Des indicateurs multiples se trouveront dans 
      des domaines tels que l'approche des gares et des triages, o&#249;
      plusieurs itin&#233;raires peuvent &#234;tre emprunt&#233;s. L'indicateur de direction informe
      le conducteur qu'il s'appr&#234;te &#224; prendre un itin&#233;raire diff&#233;rent et
      devra donc adapter sa vitesse en fonction de la
      signalisation.<br>
      Les indicateurs de direction eux-m&#234;mes seront configur&#233;s selon un
      ensemble donn&#233; d'aiguillages pour cette jonction.

      <h4><a name="route" id="route">Indicateurs d'Itin&#233;raire</a></h4>

      <p>Un indicateur d'itin&#233;raire tel qu'utilis&#233; au Royaume-Uni, affichera un num&#233;ro
      ou lettre. On les trouve principalement rattach&#233;s aux signaux
      &#224; l'approche d'une gare et affiche vers quel quai
      Le train a &#233;t&#233; achemin&#233;. &#201;tant donn&#233; la complexit&#233; de certaines
    la gare, il peut y avoir plusieurs types d'itin&#233;raires 
    qui pourraient &#234;tre emprunt&#233;s depuis le signal jusqu'&#224; la destination.
      Ainsi, un indicateur de direction ne pourrait pas &#234;tre utilis&#233; lorsqu'il est li&#233; &#224;
      les positions des aiguillages. En outre, l'indicateur de direction
      ne traitent que 6 itin&#233;raires diff&#233;rents, et certaines gares ont
      plus de 6 plateformes.<br>
      Par cons&#233;quent, l'indicateur d'itin&#233;raire ne peut afficher qu'une
      destination &#224; la fois. L'affichage d'un itin&#233;raire n'indiquent 
      n&#233;cessairement que le conducteur suivra le m&#234;me itin&#233;raire
      pour se rendre &#224; la plateforme de destination.</p>

      <h4><a name="speed" id="speed">Indicateurs de Vitesse
      </a></h4><a href=
      "https://mysite.du.edu/~jcalvert/railway/belgian.htm"><img
            src="../../../package/jmri/jmrit/beantable/images/speedindicbelg40.gif"
      align="right" width="60" height="119" hspace="0" vspace="0"
      alt="Indicateur de vitesse par J. Calvert"></a>

      <p>Un indicateur de vitesse tel qu'utilis&#233; en hollande (Prorail) et en Belgique
      (NMBS/SNCB) affichera un chiffre &#233;clair&#233; au-dessous
      du feu  de signalisation principal, par exemple un "4" limite la vitesse maximale
      &#224; 40 km/h.</p><a name="table" id="table"></a>

      <h3>Le tableau des groupes de signaux</h3><a href=
      "../../../package/jmri/jmrit/beantable/images/SignalGroupTable.png"><img
            src="../../../package/jmri/jmrit/beantable/images/SignalGroupTable.png"
      align="right" width="386" height="168" hspace="0" vspace="0"
      alt="Tableau des groupes de signaux"></a>

      <p> Des Groupes de Signaux JMRI  peuvent &#234;tre cr&#233;&#233;s et &#233;dit&#233;s en utilisant le
      <a href=
      "../../../package/jmri/jmrit/beantable/SignalGroupTable.shtml">
      Tableau  groupes de signaux</a>. Vous acc&#233;dez &#224; cet outil &#224; partir de la page Outils &gt;
      Tableaux &gt; Menu des groupes de signaux de la plupart des programmes JMRI
      programmes.<br>
      Dans le tableau des groupes de signaux, vous pouvez cr&#233;er, modifier et supprimer
      les groupes de signaux individuels. Vous modifiez les param&#232;tres d'un signal
      en cliquant sur le bouton "Modifier" dans le groupe correspondant
      .<br>
      Plus d'informations sur la configuration des groupes de signaux et un <a href=
      "../../../package/jmri/jmrit/beantable/SignalGroupTable.shtml#exemple">
      Exemple</a> peut &#234;tre trouv&#233; sur le site <a href=
      "../../../package/jmri/jmrit/beantable/SignalGroupTable.shtml">
      Tableau des groupes de signaux page d'aide</a>.</p><a name="add" id=
      "add"></a>

      <h3>Cr&#233;er un groupe de signaux</h3>

      <p>Vous ajoutez un nouveau groupe de signaux en cliquant sur le bouton "Ajouter...".
      au bas du tableau des groupes de signaux,  ce qui vous am&#232;ne &#224; l'&#233;cran <a href=
      "../../../package/jmri/jmrit/beantable/SignalGroupAddEdit.shtml">
      Panneau "Ajouter un groupe de signaux" </a>.</p>

      <h3>Contmmander un Groupe de Signaux</h3>

      <p>Les informations du Tableau des Groupes de Signaux sont utilis&#233;es par la
      Logique M&#226;ts de Signalisation pour calculer le comportement sp&#233;cifi&#233; d'un
      Groupe des Signaux. Vous pouvez le tester en modifiant manuellement l'un des 
      Feux de Signalisation d'un indicateurs dans le <a href=
      "../../../package/jmri/jmrit/beantable/SignalHeadTable.shtml">
      Tablau de Feux de Signalisation</a>.</p>

      <h2>Sauvegarde et Rechargement de la Configuration</h2>Les informations des Groupes de Signaux
      sont enregistr&#233;es dans le cadre de la configuration de JMRIJ dans un
      fichier XML, ainsi que la configuration du panneau de commande et d'autres choses similaires.
      Pour stocker vos panneaux dans le m&#234;me fichier (recommand&#233;), s&#233;lectionnez
      <b>Fichier &gt; Stocker &gt; Stocker la configuration et les panneaux vers
      Fichier...</b> ou s&#233;lectionner <b>Panneaux &gt; Stocker les panneaux...</b> dans
      la fen&#234;tre principale de JMRI

      <p>Pour plus d'informations sur la cr&#233;ation et l'affichage des panneaux,
      y compris la mani&#232;re d'afficher les signaux sur vos panneaux, veuillez consulter les 
      <a href="../../apps/PanelPro/Panels.shtml">pages d'Aide sur les panneaux
      </a>.</p>

      <p>Retour &#224; la <a href="index.shtml#tools">page d'Aide Signalisation Principale
      </a>.</p>
      <p>Traduction 2021-02-12</p>
      <!--#include virtual="/Footer.shtml" -->
    </div><!-- closes #mainContent-->
  </div><!-- closes #mBody-->
</body>
</html>
