
<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//FR"
"http://www.w3.org/TR/html4/loose.dtd">

<html lang="fr">
<head>
  <meta name="generator" content=
  "HTML Tidy for Mac OS X (vers 31 October 2006 - Apple Inc. build 15.17), see www.w3.org">

  <title>JMRI: Signal Heads Documentation</title>
  <meta name="author" content="Bob Jacobsen, Egbert Broerse">
  <meta name="Date.Modified" content="20161218">
  <meta name="keywords" content=
  "turnout model railroad JMRI decoderpro panelpro">
  <!-- Style -->
  <meta http-equiv="Content-Type" content=
  "text/html; charset=ISO-8859-1">
  <link rel="stylesheet" type="text/css" href="/css/default.css"
  media="screen">
  <link rel="stylesheet" type="text/css" href="/css/print.css"
  media="print">
  <link rel="icon" href="/images/jmri.ico" type="image/png">
  <link rel="home" title="Home" href="/">
  <!-- /Style -->
</head>

<body>
  <!--#include virtual="/Header.shtml" -->
  <div id="mBody">
    <!--#include virtual="Sidebar.shtml" -->
    <div id="mainContent">
      <!-- Page Body -->

      <h1>JMRI : Feux de Signalisation</h1>

      <p>Les Feux de Signalisation sont la fa&#231;on dont JMRI repr&#233;sente
      les lumi&#232;res/LED individuelles dans un signal sur votre r&#233;seau. JMRI s'occupe des 
      Feux de Signalisation comme un type sp&#233;cifique de sorties qui peuvent &#234;tre fix&#233;es &#224;
      diff&#233;rentes couleurs : Rouge, Jaune, Vert, Jaune Clignotant, etc.
      En fonction du mat&#233;riel utilis&#233; pour connecter le signal  de  votre mod&#232;le au syst&#232;me DCC,
      le programme d&#233;ploie une technique diff&#233;rente
      pour activer ou d&#233;sactiver chacune de ces couleurs..<br>
      Les Feux de Signalisation peuvent &#234;tre utilis&#233;s pour construire des m&#226;ts de signalisation &#224; l'aide de l'
      <a href="SignalMasts.shtml">Outil M&#226;ts de Signalisation</a>. Selon
       la fa&#231;on dont vos signaux sur le r&#233;seau sont connect&#233;s au
      Syst&#232;me DCC, les Feux de Signalisation font normalement partie d'un m&#226;t de signalisation,
      mais <a href=
      "../../../package/jmri/jmrit/beantable/SignalMastAddEdit.shtml">
      certains mat&#233;riels de signalisation</a> sont capables de prendre en charge plusieurs aspects
      directement, et ne n&#233;cessiteront pas l'utilisation d'un Feu de Signalisation individuel. <a name="table" id="table"></a></p>

      <h3>La Table des Feux de Signalisation</h3><a href=
      "../../../package/jmri/jmrit/beantable/images/SigHeadTable.png"><img src="../../../package/jmri/jmrit/beantable/images/SigHeadTable.png"
      align="right" width="447" height="177" hspace="0" vspace="0"
      alt="Signal Head Table figure"></a> 
      <!-- La section suivante est tir&#233;e de, et devrait &#234;tre maintenue en coh&#233;rence avec -->
       
      <!-- help/en/package/jmri/jmrit/beantable/SignalHeadTable.html -->
       Toutes les Feux de Signalisation connus par  JMRI peuvent &#234;tre r&#233;f&#233;renc&#233;s
      en utilisant l'outil "Table des Feux de Signalisation" dans le menu Outils de la plupart
      des programmes JMRI.

      <p>Pour plus d'informations sur la configuration des Feux de Signalisation avec le
      Table des Feux de Signalisation, veuillez consulter la <a href=
      "../../../package/jmri/jmrit/beantable/SignalHeadTable.shtml">
      Page d'aide de la Table des Feux de Signalisation</a>. <a name="add" id=
      "add"></a></p>

      <h3>Cr&#233;er une Feu de Signalisation</h3><a href=
      "../../../package/jmri/jmrit/beantable/images/SignalHeadAdd1.png"><img src="../../../package/jmri/jmrit/beantable/images/SignalHeadAdd1.png"
      align="right" width="127" height="200" hspace="0" vspace="0"
      alt="Add Signal Head window figure"></a>

      <p>Pour d&#233;finir un nouveau Feu de Signalisation, cliquez sur le bouton <a href=
      "../../../package/jmri/jmrit/beantable/SignalAddEdit.shtml">Ajouter...</a>
      en bas de la Table des Feux de Signalisation. Cela permettra de
      vous demander le type de Feu de Signalisation et tout autre renseignement,
      ces informations sont n&#233;cessaires pour le type s&#233;lectionn&#233;.<br>
      Plus d'informations sur la <a href=
      "../../../package/jmri/jmrit/beantable/SignalAddEdit.shtml">Page d'aide Ajout
      de Feux de Signalisation </a>.</p>

      <h3><a name="edit" id="edit">Modifier un Feu de Signalisation existant
      </a></h3>

      <p>Cliquez sur le bouton <b>Modifier</b>.
      &#224; droite de l'en-t&#234;te de la Table Feu de Signalisation pour ouvrir la fen&#234;tre d'&#233;dition 
      du Feu de Signalisation.</p>

      <p>Une fois qu'un Feu de Signalisation a &#233;t&#233; d&#233;fini, son type de connexion
      et le nom du syst&#232;me ne peut &#234;tre modifi&#233;. Vous pouvez ignorer les Feux de Signalisation
      que vous avez d&#233;finis et que vous n'utilisez pas ; ils ne font pas de mal.
      Si vous le pr&#233;f&#233;rez, vous pouvez supprimer un Feu de Signalisation de la liste
      en cliquant sur le bouton Supprimer. Enregistrez une copie du
      Fichier de configuration JMRI comme sauvegarde, lire attentivement
      le message d'avertissement qui appara&#238;t en cas d'utilisation du Feu de Signalisation
      par d'autres parties de JMRI !

      <h3>Commande d'un Feu de Signalisation</h3>Autre que le r&#233;glage manuel
      l'apparition d'un Feu de Signalisation &#224; partir de la table de Feu de Signalisation 
      en cliquant sur l'&#233;tat actuel d'un Feu dans la colonne Apparence
      et en s&#233;lectionnant un &#233;tat dans la bo&#238;te combin&#233;e qui s'ouvre,
      Les Feux de Signalisation peuvent &#234;tre command&#233;s automatiquement par JMRI
      de diff&#233;rentes mani&#232;res, notamment :

      <ul>
        <li><a href="AspectSignaling.shtml">Aspect Signalisation</a>,
        la m&#233;thode la plus polyvalente pour afficher les diff&#233;rents types 
        de r&#232;gles de signalisation de nombreux chemins de fer am&#233;ricains et &#233;trangers,
        automatiquement en tenant compte de l'&#233;tat des Aiguillages et des
        (Occupation) Capteurs;</li>

        <li>Via <a href="../Logix.shtml">Logix</a>, une mani&#232;re graphique
        de conmmander les Feux de Signalisation avec des &#233;nonc&#233;s 
        logiques simples</li>

        <li>By <a href="../scripting/index.shtml">Scripts</a>,
        utiliser un langage de programmation complet pour faire ce que 
        vous voulez;</li>

        <li>Utilisation du <a href=
        "../../../package/jmri/jmrit/blockboss/BlockBossFrame.shtml">
        Logique Signal Simple</a> Outil, pour la signalisation de base de BAL
        dutype nord-am&#233;ricain (plus facilement accessible via le
        premi&#232;re m&#233;thode).</li>
      </ul>

      <h2>Sauvegarde et rechargement de la configuration</h2>

      <p>Les informations du Feux de Signalisation sont conserv&#233;es dans votre <i>
      configuration de r&#233;seau</i>, ainsi que les aiguillages, les feux, les capteurs,
      configuration du panneau de commande, etc.<br>
        Sauvegarder ces informations sur le disque, permettant de <a href=
      "../../../package/jmri/jmrit/display/PanelMenuHelp.shtml"> les recharger
      </a> la prochaine fois que vous lancez JMRI, utilisez <b>Sauvegarder Configuration...</b>
      dans le menu <b>Fichier</b> en haut de la Table Feux de Signalisationx (ou
      autres tableaux dans le menu Outils), ou s&#233;lectionnez <b>Sauvegarder
      Panneau...</b> dans le menu <b>Panneau</b>...</p>
      <p>Pour plus d'informations sur la cr&#233;ation et l'affichage des panneaux,
      y compris la fa&#231;on de montrer les signaux sur vos panneaux, veuillez consulter les
      <a href="../../apps/PanelPro/Panels.shtml">Pages Panneaux</a>.</p>

      <p>Retour &#224; la page d'aide <a href="index.shtml#tools">Signalisation Principale
     </a>.</p>
	<p>Traduction 2021-02-13</p>

      <!--#include virtual="/Footer.shtml" -->
    </div><!-- closes #mainContent-->
  </div><!-- closes #mBody-->
</body>
</html>

    

