<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01//EN" "http://www.w3.org/TR/html4/strict.dtd">
<html lang="fr">
<head>
<!-- Updated by Blorec Herv&#233; 2016-09-15-->
  <title>JMRI: Feux de Signalisation</title>

<meta name="Author" content="Bob Jacobsen, Egbert Broerse">
<meta name="Date.Modified" content="20160323"/>
<meta name="keywords" content="turnout model railroad JMRI decoderpro panelpro">

<!-- Style -->
  <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
  <link rel="stylesheet" type="text/css" href="/css/default.css" media="screen">
  <link rel="stylesheet" type="text/css" href="/css/print.css" media="print">
  <link rel="icon" href="/images/jmri.ico" type="image/png">
  <link rel="home" title="Home" href="/">
<!-- /Style -->
</head>

<body>
<!--#include virtual="/Header" -->
<div id="mBody">
    <!--#include virtual="Sidebar" -->
    <div id="mainContent">
        <!-- Page Body -->
<h1>JMRI: Feux de Signalisation</h1>

			<p>
			Les Feux de Signalisations sont la mani&#232;re pour JMRI de repr&#233;senter les lampes/LEDs individuelles dans un signal sur votre r&#233;seau. IRM g&#232;re les Feux de Signalisations comme une sorte sp&#233;cifique 
		 	de sorties qui peuvent &#234;tre configur&#233;es pour des couleurs vari&#233;es: Rouge, Jaune, Vert, Flash Jaune, etc. D&#233;pendant du mat&#233;riel utilis&#233; pour connecter vos signaux miniatures au syst&#232;me DCC, Le programme d&#233;ploie diff&#233;rentes techniques pour commuter ces couleurs on/off. <br>
			Les Feux de Signalisations peuvent &#234;tre utilis&#233;s pour construire des M&#226;ts de Signalisation avec l'utilisation de l'<a href="SignalMasts.shtml">Outil M&#226;ts de Signalisation</a>. D&#233;pendant de la fa&#231;on dont vos signaux sur le r&#233;seau sont connect&#233;s au syst&#232;me DCC, les Feux de Signalisations sont normalement une partie des M&#226;t de Signalisation, mais <a href="../../../package/jmri/jmrit/beantable/SignalMastAddEdit.shtml">un peu de mat&#233;riel de signalisation</a> est capable d'accepter de multiple Aspects directement, et ne requi&#232;rent pas l'utilisation de Feux de Signalisations Individuels.  

<a name="table"></a><h3>Le Tableau Feu de Signalisation</h3>

<a href="../../../package/jmri/jmrit/beantable/images/SigHeadTable.png"><img
		src="../../../package/jmri/jmrit/beantable/images/SigHeadTable.png" align="right" width="467" height="178" hspace="0"
		vspace="0" alt="Signal Head Table figure"></a>
<!-- The following section is taken from, and should be kept consistent with -->
<!-- help/fr/package/jmri/jmrit/beantable/SignalHeadTable.html -->

Tous les Feux de Signalisation que JMRI connait peuvent &#234;tre r&#233;f&#233;renc&#233;s 
en utilisant le Tableau Feux de Signalisation dans le menu Outils de la plupart des programmes JMRI.
<p>

		pour des infos suppl&#233;mentaires sur la configuration des Feux de Signalisation avec le Tableau 
Feu de Signalisation, SVP voir la 
		<a href="../../../package/jmri/jmrit/beantable/SignalHeadTable.shtml">la page d'aide Tableau Feu de Signalisation</a>.

	<a name="add"></a><h3>Cr&#233;ation d'un Feu de Signalisation</h3>
		<a href="../../../package/jmri/jmrit/beantable/images/SignalHeadAdd1.png"><img
				src="../../../package/jmri/jmrit/beantable/images/SignalHeadAdd1.png" align="right" width="127"
				height="200" hspace="0" vspace="0" alt="Add Signal Head window figure"></a>

<p>Pour d&#233;finir un nouveau Feu de Signalisation, cliquez sur le bouton 
		<a href="../../../package/jmri/jmrit/beantable/SignalAddEdit.shtml">Ajouter...</a>en bas du Tableau Feu de Signalisation. Cela vous demandera le type de  Feu de Signalisation et toute information suppl&#233;mentaire n&#233;cessaire pour le type s&#233;lectionn&#233;. 
			<br>
Il y a plus d'information sur la 
		<a href="../../../package/jmri/jmrit/beantable/SignalAddEdit.shtml">page d'aide Ajout Feu de Signalisation</a>. 

<a name="edit"></a><h3>Modification d'un Feu de Signalisation Existant</h3>
		<p>Cliquez sur le bouton <b>Modifier</b> &#224; droite du Tableau Feu de Signalisation pour ouvrir la fen&#234;tre Modifier Feu de Signalisation. 
<p>Une fois qu'un Feu de Signalisation a &#233;t&#233; d&#233;fini, son Type de connexion et le Nom Syst&#232;me ne peuvent plus &#234;tre chang&#233;s. Vous pouvez ignor&#233; le Feu de Signalisation que vous avez d&#233;fini 
et ne pas l'utiliser; il ne nuit pas en quoi que ce soit. Si vous le pr&#233;f&#233;rez, vous pouvez effacer un Feu de Signalisation du Tableau Feu de Signalisation en cliquant le bouton Effacer. Sauvegarder 
une copie du fichier de configuration JMRI comme une sauvegarde d'abord et lire attentivement le message d'avertissement qui appara&#238;t si le Feu de Signalisation est utilis&#233; par d'autres parties de JMRI! 
   
<h3>Commander un Feu de Signalisation</h3>

		En dehors du r&#233;glage manuel de l'Aspect d'un Feu de Signalisation du Tableau Feu de Signalisation en cliquant sur le bouton "Apparence" dans la colonne &#201;tat, les Feux de Signalisation peuvent &#234;tre contr&#244;l&#233;s automatiquement par JMRI de diverses fa&#231;ons, y compris:
<ul>
	<li><a href="AspectSignaling.shtml">Aspect Signalisation</a>, la m&#233;thode la plus polyvalente pour afficher les diff&#233;rentes de signalisation r&#233;alistes issues des Livres de R&#232;glements de nombreux chemins de fer am&#233;ricains et &#233;trangers, entra&#238;n&#233;e automatiquement par l'&#233;tat des Aiguillages et des Capteurs ( occupation ); 
	<li>Via <a href="../Logix.shtml">Logix</a>, une m&#233;thode graphique de commande de Feux de Signalisation avec de simples &#233;tats logiques ;
	<li>Par des <a href="../scripting/index.shtml">Scripts</a>, utilisation d'un langag complet de programmation pour faire ce que vous voulez; 
	<li>Utilisation de la <a href="../../../package/jmri/jmrit/blockboss/BlockBossFrame.shtml">Logic Simple Signal</a> Outil, pour une signalisation BAL type d'Am&#233;rique du Nord ( plus facilement disponible via la premi&#232;re m&#233;thode ).
</ul>

<h2>Sauvegarde et Rechargement de la Configuration</h2>

L'information Feu de Signalisation est sauvegard&#233;e comme une partie de la configuration JMRI dans un fichier XML, ainsi que la configuration du panneau de commande et d'autres choses semblables. Pour plus d'informations sur la cr&#233;ation et l'affichage des panneaux, y compris la fa&#231;on de montrer des signaux sur vos panneaux, SVP voir les <a href="../../apps/PanelPro/Panels.shtml">pages Panneaux</a>.

<p>Retour &#224; la <a href="index.shtml#tools">page principale d'aide Signalisation</a>.</p>

<!--#include virtual="/Footer" -->
    </div><!-- closes #mainContent-->
  </div> <!-- closes #mBody-->
</body>
</html>
