<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01//EN" "http://www.w3.org/TR/html4/strict.dtd">
<!-- Updated by Herv&#233; Blorec 2016/09/17 -->
<html lang="fr">
<head>
  <meta name="generator" content=
  "HTML Tidy for Mac OS X (vers 31 October 2006 - Apple Inc. build 15.17), see www.w3.org">
  <!-- Copyright Bob Jacobsen 2008 -->

  <title>JMRI: Simple Signal Logic Example</title>
  <!-- Style -->
  <meta http-equiv="Content-Type" content="text/html; charset=us-ascii">
  <link rel="stylesheet" type="text/css" href="/css/default.css" media="screen">
  <link rel="stylesheet" type="text/css" href="/css/print.css" media="print">
  <link rel="icon" href="/images/jmri.ico" type="image/png">
  <link rel="home" title="Home" href="/">
  <!-- /Style -->
</head>

<body>
<!--#include virtual="/Header" -->
<div id="mBody">
    <!--#include virtual="Sidebar" -->
    <div id="mainContent">
        <!-- Page Body -->

<h1>JMRI: Exemple Logique de Signal Simple</h1>

<p class="important">N'utilisez pas l'outil Logique Signal Simple (SSL) quand vous avez d&#233;j&#224; construit les M&#226;ts de Signalisation et la Logique M&#226;t de Signalisation la plus avanc&#233;e dans le m&#234;me fichier de Panneau/Configuration.</p> 
<p>    
Cette page donne un exemple d'utilisation de la <a href="../../../package/jmri/jmrit/blockboss/BlockBossFrame.shtml">Logique Signal Simple</a> JMRI 
( en raccourci: SSL ) pour commander les Feux de Signalisation raccord&#233;s &#224; un circuit SE8c Digitrax. Ceci fonctionne &#233;galement pour
d'autres types de signaux mat&#233;riels &#224; <i>feu simple</i>, y compris les LEDs connect&#233;es aux d&#233;codeurs de fonctions, syst&#232;mes 
C/MRI etc.<br> 
SVP Essayez notre <a href="#example1">exemple pr&#234;t-&#224;-servir</a> comme un d&#233;part pour <a href="#setup">configurer votre propre SSL</a>.  
<p>
La mod&#233;lisation de signalisation ferroviaire sur un mod&#232;le peut &#234;tre fait de diff&#233;rentes fa&#231;ons,
allant de "feux rouges" pour terminer par l'&#233;mulation d'une signalisation particuli&#232;rement r&#233;aliste 
d'un recueil de r&#232;glement. Pour plus d'informations sur les diverses possibilit&#233;s, 
S'il vous pla&#238;t voir la
<a href="index.shtml"> page de Signalisation JMRI</a>.

<a id="example1"></a><h2>Exemple Pr&#233;d&#233;finis</h2>

Un exemple pr&#233;d&#233;finie de SSL est fourni dans l'installation de JMRI ( voir la
<a href="http://jmri.org/download"> page de t&#233;l&#233;chargement </a> ) pour plus d'informations sur le t&#233;l&#233;chargement.
Pour utiliser cet exemple:
<ul>
<li> D&#233;marrez le programme PanelPro, et s&#233;lectionnez "Pr&#233;f&#233;rences..." dans le menu &#201;dition ( depuis le menu PanelPro sur OS X ). 
Sur le panneau qui s'ouvre, cliquez sur Connexions &#224; gauche et s&#233;lectionnez "Digitrax" comme Fabricant Syst&#232;me et "LocoNet Simulateur" comme Connexion Syst&#232;me.
Cliquez sur "Enregistrer" en bas &#224; gauche du volet Pr&#233;f&#233;rences et quitter PanelPro. Cela vous permettra de reprendre l'exemple (qui
utilise des adresses LocoNet pour les Feux de Signalisation, Aiguillages et Capteurs), m&#234;me lorsque
votre ordinateur n'est pas connect&#233; &#224; un r&#233;seau .
<li> Red&#233;marrez le programme PanelPro.
<li> Depuis le menu "Panneaux", s&#233;lectionnez "Ouvrir " et naviguez jusqu'au
 fichier "SE8cSignalExample.xml" dans le r&#233;pertoire  <a href="../../../../../xml/layout/">JMRI/xml/layout/</a>.
Notez que vous pouvez avoir &#224; regarder autour de ce dossier, c'est dans le
m&#234;me endroit que l&#224; o&#249; vous avez install&#233; le programme..<a href="images/StartPanel.png"><img src="images/StartPanel.png" align="right" width="317" height="173" hspace="0" vspace="2" alt="Demo screen at startup"></a></li>
<li>
Vous devriez maintenant voir un simple Panneau Sch&#233;matique pour un r&#233;seau compos&#233; d'une boucle
de voie et une voie d'&#233;vitement.
<p>
Parce qu'il n'y a pas de connexion &#224; un r&#233;seau r&#233;el, l'&#233;tat des Capteurs et des
Aiguillages n'est pas initialement connus. Cet exemple montre ceci, en affichant les ic&#244;nes
Capteurs comme  Rouge, et les ic&#244;nes Aiguillage comme [?] signifiant "non connect&#233; de toute fa&#231;on", 
&#201;tant donn&#233; que la Logique Signal Simple n'est pas encore s&#251;r de savoir si les Cantons sont occup&#233;s ni comment 
sont les aiguillages, il montre le rouge sur tous les Feux de Signalisation.
<p>
Vous pouvez cliquer sur les ic&#244;nes pour changer l'occupation et le
statut de l'aiguillage, ou utiliser un autre outil (par exemple le "Tableau Aiguillage") pour faire cela.
<p> Cliquez sur chacun des ic&#244;nes Aiguillage pour les mettre en position direct. Cliquez sur les
ic&#244;nes Capteurs pour les configurer "Inoccup&#233;s", ce qui est montr&#233; comme un cercle
Gris, ( Occup&#233;e serait indiqu&#233; par un cercle Jaune)</li>
<li>
L'&#233;cran devrait maintenant ressembler &#224; l'image vers la droite.
<a href="images/SensorsCleared.png"><img src="images/SensorsCleared.png" align="right" width="317" height="173" hspace="0" vspace="2" alt="Demo screen in clear state"></a>
Les signaux sur la voie d'&#233;vitement sont Rouges, car les aiguillage sont mis en direct. 
Tous les signaux sur la ligne principale sont verts.
<p>
Si vous "survolez" avec le curseur sur un &#233;l&#233;ment, une info-bulle s'affiche avec des informations
sur l'&#233;l&#233;ment. Par exemple, un  des Aiguillage pourrait voir " Aiguillage 1 (LT1)".
LT1 est le "Nom Syst&#232;me" pour cet aiguillage. Dans ce cas, il
signifie "L'aiguillage LocoNet avec l'adresse 1". "L'Aiguillage 1" est un "Nom Utilisateur",
qui peut &#234;tre tout ce que vous voulez qu'il soit aussi longtemps qu'il est unique sur votre panneau. Vous pouvez modifier ceux-ci avec le
" Tableau Aiguillage" dans le menu Outils--> Tableaux --> Aiguillage.<br>
Les Feux de Signalisation et les Capteurs
sont identifi&#233;s par l'usage de noms similaires ( voir la
<a href="../../doc/Technical/Names.shtml">page d'aide JMRI sur les Noms Syst&#232;mes et la D&#233;nomination</a> ).</li>
<li>
Vous pouvez maintenant cliquer sur les ic&#244;nes Capteurs pour apprendre comment les Signaux r&#233;agiraient
en pr&#233;sence d'un train. Par exemple, l'image vers la droite
montre un train entrant en voie d'&#233;vitement par la gauche. Il s'agit de
de rencontrer un signal jaune &#224; l'entr&#233;e de l'&#233;vitement, qui lui demande d'
&#234;tre pr&#234;t &#224; s'arr&#234;ter &#224; un signal Rouge &#224; l'extr&#233;mit&#233; de 
l'&#233;vitement.<br><a href="images/SensorTuroutsSet.png"><img src="images/SensorTuroutsSet.png" align=right width="317" height="173" hspace="0" vspace="2" alt="Demo screen with two trains"></a>
Notez que l'arri&#232;re de ce train est prot&#233;g&#233; par un signal Rouge,  qui a
son tour, est prot&#233;g&#233; par un signal Jaune dans le canton pr&#233;c&#233;dent.
Un autre train est juste en train de quitter
sur la voie principale en allant vers la droite.

<li>
Si vous &#234;tes int&#233;ress&#233; &#224; la fa&#231;on dont le programme communique avec une carte de signalisation
Digitrax SE8c, vous pouvez ouvrir l'outil "Moniteur LocoNet"
dans le menu Digitrax. <br>
Dans le volet qui s'ouvre, vous pouvez voir que cliquer sur une ic&#244;ne d'aiguillage envoie un 
message LocoNet pour d&#233;placer l'Aiguillage. Cliquer sur une ic&#244;ne Capteurs
envoie un message comme si un canal d'un capteur BDL16  avait vu
un changement dans l'occupation. Si l'un de ces messages entra&#238;ne
une modification de la signalisation, le programme enverra des
messages &#224; ces canaux correspondants SE8c pour modifier leur sorties.
Par exemple, lorsque le train dans l'image pr&#233;c&#233;dente entre dans le
canton sur le c&#244;t&#233; droit (Canton 1), les messages sont les suivants:
<pre><!-- Updated for panel included in JMRI 4.1.3 -->
  Sensor LS1  (Block 1) is Hi.  (BDL16 #1, DS1; DS54/64/SE8c #1, AuxA/A1/DS01)
  Requesting Switch at LT285 () to Thrown (output On).
  Requesting Switch at LT291 () to Thrown (output On).
  Requesting Switch at LT282 () to Thrown (output On).
</pre>
Les trois messages de commutation fixent les signaux  5B, D et 4C au Rouge, Rouge et Jaune, respectivement.
<li>
Pour apprendre comment les signaux sont configur&#233;s en SSL, ouvrez l'&#233;l&#233;ment
"Logique Signal Simple" dans le menu Outils..<a href="../../../images/SslExample.png"><img
        src="../../../images/SslExample.png" align="right" width="469" height="287" hspace="0" vspace="0"
        alt="Simple Signal Logic Window"></a>
Dans le volet qui s'ouvre, entrez un Nom de Signal ( Feu ), par exemple "Section 5A" en haut du
champ de texte et frapp&#233; Retour. Vous devriez obtenir quelque chose
comme l'image vers la droite (cliquez pour l'agrandir en taille r&#233;elle).
"Section 5A" est le nom du Signal ( Feu ) de protection de
l'Aiguillage "LT2", l'entr&#233;e droite de la voie d'&#233;vitement.
<ul>
<li>Il est d&#233;fini ici comme un signal "Aiguillage en Pointe".
<li>Il prot&#232;ge le Capteur "LS7" en virant au Rouge lorsque le Capteur
d&#233;tecte un train dans le Canton surveill&#233; par LS7.
<li> Il regarde l'&#233;tat de l'Aiguillage "LT2".<br>
Pour Prot&#233;ger le Signal: Quand l'aiguillage LT2 est "Direct" le signal "Section 5A" devra &#234;tre Jaune quand le Feu de Signalisation LH261, localis&#233; sur la voie principale entre les deux aiguillages, est Rouge.<br>
Pour Prot&#233;ger le Signal: Quand l'aiguillage LT2 est "D&#233;vi&#233;" le signal " Section 5A" devra &#234;tre Jaune quand le signal LH263 &#224; l'entr&#233;e de la voie
d'&#233;vitement est Rouge
 <li>
La case "Avec Flash Jaune" n'est pas s&#233;lectionn&#233;e dans notre exemple, mais si elle l'&#233;tait, le signal "Section 5A"
prot&#233;gerait un signal Jaune plus loin en affichant un Flash jaune. 
<li>
Si vous s&#233;lectionnez la case "Signal Distant", le 
Feu de Signalisation que vous command&#233; ici est programm&#233; pour montr&#233; la m&#234;me Apparence ou une plus restrictive 
que le signal suivant, au lieu montrer peut-&#234;tre une plus rapide. Au lieu de montrer Jaune avant un Rouge, elle 
montrera un Rouge.
</ul>
Vous pouvez changer n'importe lequel de ces r&#233;glages et cliquer "Appliquer" en bas du volet pour le rendre 
actif, puis cliquez sur le Panneau exemple pour voir comment les nouvaux r&#233;glages agissent.
</ul>

    <a name="setup"></a>
<h2>Configurer votre propre exemple </h2>
L'ensemble complet des &#233;tapes de cr&#233;ation de cet exemple sont:
<ol>
<li>Lancer et configurer l'application PanelPro. Red&#233;marrez pour que 
vos pr&#233;f&#233;rences prennent effet.
<br>
Pour plus d'informations sur le lancement et la configuration de 
PanelPro, s'il vous pla&#238;t voir la
<a href="../../apps/PanelPro/PanelPro.shtml">page web d'aide PanelPro</a>.

<li>Renseignez le programme &#224; propos de vos capteurs.
  <ul>
  <li> Dans le menu Outils, ouvrez l'outil Tableaux --> Capteur".
  <li>Si vous avez un syst&#232;me DCC Digitrax avec vos
      d&#233;tecteurs d'occupation connect&#233;s &#224; LocoNet, avec juste
      l'alimentation des voies Off et On utilisant soit un r&#233;gulateur s&#233;rie-DT
      ou le volet " Commande Alimentation" dans le menu Outils.
      PanelPro capturera toutes les adresses des capteurs depuis le trafic
      LocoNet r&#233;sultant.
   <li> Pour des r&#233;seaux avec un Syst&#232;me de Connexion diff&#233;rent, utilisez le bouton "Ajouter" en bas du Tableau Capteur pour cr&#233;er les capteurs n&#233;cessaires.
   </ul>

<li>Enregistrez votre travail en s&#233;lectionnant "Sauvegarder Panneaux..." depuis le menu "Panneaux" ,
taper un nom de fichier, et frapper "Enregistrer". (Vous voudrez peut-&#234;tre le faire souvent!)

<li>Renseignez le programme &#224; propos de votre ordinateur pilotant les aiguillages.
    <ul>
        <li>Dans le menu Outils, ouvrez l'outil "Tableaux Aiguillage"--> "Aiguillages".
        <li>Si vous avez un syst&#232;me Digitrax DCC, mettre
        d&#233;vi&#233; ou direct chaque Aiguillage depuis un r&#233;gulateur.
        PanelPro capturera toutes les adresses Aiguillages &#224; partir
		du trafic LocoNet r&#233;sultant.
        <li>Vous pouvez &#233;galement utiliser le bouton "Ajouter..." dans le Tableau Aiguillage pour ouvrir
        un volet et entrer de nouveaux Aiguillages.
        <li>Le volet "Commande Aiguillage..." dans le menu Outils cr&#233;e &#233;galement une nouvelle
        entr&#233;e d'aiguillage pour chaque aiguillage que vous manipulez.
    </ul></li>

    <li>Si vous avez des Feux de Signalisation connect&#233;s aux sorties "aiguillage-type"
    signalez aussi au programme l'existence de ces adresses aiguillage. (Utilisateurs de SE8c sauter cette &#233;tape)</li>

    <li><a name="definesignals"></a>Renseignez PanelPro &#224; propos de l'adressage de vos signaux.
    <a href="../../../package/jmri/jmrit/beantable/images/SigHeadTable.png"><img
    src="../../../package/jmri/jmrit/beantable/images/SigHeadTable.png" align="right" width="312" height="119"
    hspace="0" vspace="0" alt="Signal Head Table Figure"></a>

    <ul>
      <li>Dans le menu Outils, ouvrez l'outil "Tableau Feu de Signalisation".
      <li>Cliquez sur le bouton
      "<a href="../../../package/jmri/jmrit/beantable/SignalAddEdit.shtml"> Ajouter ...</a>"
      en bas &#224; gauche du tableau pour afficher un volet. En haut il y a plusieurs propositions pour le type de driver du Feu de Signalisation:
    	<dl>
      <dt> Sortie Triple
      <dd>C'est  un Feu de signalisation avec des lumi&#232;res rouge/jaune/vert qui
      sont pilot&#233;s par trois sorties s&#233;par&#233;es.
      Les sorties sont pilot&#233;es par la logique aiguillageJMRI et
      apparaissent dans le Tableau Aiguillage.
      <br>Pour configurer l'un d'eux,
      entrez le nom que vous voulez lui donner ( g&#233;n&#233;ralement quelque chose comme IH2, ), et
      les num&#233;ros d'adresses des trois sorties qui pilotent les lampes ( comme "258" etc. ).
      <dt> Sortie Double
      <dd>Un type de Connexion de Feu de Signalisation avec avec des lumi&#232;res qui
      sont pilot&#233;es par deux connexions de sortie.
      Les deux sorties pilotent les feux rouges et verts s&#233;par&#233;ment; PanelPro
      va les combiner &#224; la fois On pour faire le jaune.
      Les sorties sont entra&#238;n&#233;s par la logique aiguillage JMRI et
      apparaissent dans le Tableau Aiguillage.
      <br>
      Pour configurer l'un d'eux,
      entrez le nom que vous voulez lui donner ( g&#233;n&#233;ralement quelque chose comme IH2 ), et
      les num&#233;ros d'adresses des deux sorties qui pilotent les lampes ( comme "258" etc. ).
      <dt>SE8c 4 Aspects
      <dd>Il s'agit d'un Type de Connexion or un Feu de Signalisation pilot&#233; par un d&#233;codeur SE8c Digitrax.
      <br>
      Entrez la partie inf&#233;rieure des deux "adresses d'Aiguillage" auxquelles ce Feu de Signalisation
      r&#233;pond. Par exemple, si c'est le premier Feu de Signalisation sur la premi&#232;re
      carte SE8c, vous pouvez la contr&#244;ler en configurant les aiguillages 257 et 258 avec
      votre r&#233;gulateur. Entrez "257" dans la case deu Num&#233;ro de Laiguillage dans le volet.
      <br>
      Note: Le circuit SE8c doit &#234;tre configur&#233; de sorte que le "4&#232;me spect"  soit "&#201;teint";
      JMRI va g&#233;rer tout ce qui est n&#233;cessaire pour les clignotants.
      <dt>Et beaucoup plus
		<dd>D'autres options de pilotage de signal sont "D&#233;codeur de Signal DCC" et "Acela", parmi beaucoup d'autres, ( Vous pouvez faire d&#233;filer vers le haut ou vers le bas pour les voir toutes ). <br>voir la <a href="SignalHeads.shtml">page d'aide Feux de Signalisation</a> pour plus d'information sur chaque.
      </dl>
      Une fois que vous avez d&#233;fini les options, cliquez 'OK". Vous pouvez
      utilisez ce volet r&#233;p&#233;titivement pour entrer tous les Feux de Signalisation que vous avez.</li>
	</ul>

    <li>Configurer votre logique de signalisation en utilisant l'Outil "Logique Signal Simple".<br>
    Ouvrez l'outil "Logique Signal Simple" depuis le menu "Outils". Vous obtiendrez un volet
		avec un nombre de champs:
		<a href="../../../images/SslExample.png"><img src="../../../images/SslExample.png" align=right
                                                          width="469" height="287" hspace="2" vspace="0"
                                                      alt="Simple Signal Logic Window"></a>
		<ul>
		<li>Dans la case du haut, entrez le nom du Feu de Signalisation que vous souhaitez configurer.
		<li>Les boutons radio ci-dessous qui s&#233;lectionnent une des quatre utilisations possibles
		pour ce signal:
			<ul>
			<li>"Sur le Canton unique" - ce signal prot&#232;ge l'extr&#233;mit&#233; d'une droite &#224;
			travers le canton, sans aiguillage signal&#233;
			<li>"Sur la branche principale de l'aiguillage en Talon" - ce signal est le long de
			l'itin&#233;raire principal pour traverser un aiguillage, qui est d&#233;fini comme la direction
			prise par les trains lorsque l'aiguillage est "Direct". C'est la protection de la partie 
			mobile de l'aiguillage de sorte que les trains s'arr&#234;tent avant de traverser
			un aiguillage mal orient&#233;.
			<li>"Sur la voie D&#233;vi&#233;e de l'Aiguillage en Talon" - ce signal est le long
			la voie d&#233;vi&#233;e d'un aiguillage, qui est d&#233;finie comme la direction
			prise par les trains lorsque l'aiguillage est fix&#233; &#224; "D&#233;vi&#233;".  C'est la protection 
			de l'&#233;quipement mobile de l'aiguillage de sorte que les trains s'arr&#234;tent avant de traverser
			un aiguillage mal orient&#233;.
			<li>"Aiguillage en Pointe" - ce signal est pour prot&#233;ger les
 			points de sortie du Talon d'un Aiguillage. Selon que l'aiguillage est
			"D&#233;vi&#233;" ou "Direct", le train va prendre deux voies diff&#233;rentes, et le
			Signal doit prot&#233;ger les diff&#233;rents Cantons suivants.
			</ul>
		<li>Si vous voulez que le Feu de Signalisation passe au Rouge quand un Capteur se montre
		Occup&#233; (capteur actif), entrez le Nom du Capteur dans la bo&#238;te suivante.
		<li> Si ce signal est pour prot&#233;ger le trajet, en direction de la pointe de 
		l'aiguillage, vous pouvez avoir le Feu de Signalisation au rouge si
		l'aiguillage est mal orient&#233;. Pour ce faire, entrez
		le Nom de l'Aiguillage &#224; surveiller dans la 3i&#232;me bo&#238;te , et choisissez si
		le Feu de Signalisation  doit &#234;tre  Rouge lorsque l'aiguillage est soit D&#233;vi&#233; ou Direct.
		<li> Si vous voulez une logique multi-cantons , Signalisation de Canton de type Block Automatique Lumineux,
		entrez le nom du Feu de Signalisation suivant dans la derni&#232;re case. Quand ce
		Feu de Signalisation est rouge, celui que vous avez &#224; configurer maintenant sera mis au Jaune pour avertir le m&#233;canicien
		que le train doit &#234;tre capable de s'arr&#234;ter au signal suivant.<br>
		<br>
		Si vous souhaitez donner un avertissement suppl&#233;mentaire, cliquez sur la case "Avec Flash
		Jaune ". Dans ce cas, le signal avant un rouge appara&#238;tra
		jaune, et le signal avant le jaune montrera un Flash Jaune.<br>
        <i>Nous sugg&#233;rons	que vous utilisiez le <a href="AspectSignaling.shtml">Bloc Automatique Lumineux</a> plus
        r&#233;cent &#224; la place de SSL pour toutes les configurations plus complexex.</i>
        <li>Une fois que vous avez d&#233;fini les options , cliquez sur "Appliquer". Vous pouvez

	    <li>Une fois que vous avez d&#233;fini les options, cliquez sur "OK". Vous pouvez
		utilisez ce volet r&#233;p&#233;titivement pour entrer tous autant de fois que vous le voulez, chacun avec son propre nom unique &#233;videmment.
		</ul>
    <li>Vous enregistrez votre travailen s&#233;lectionnant "Sauvegarder Panneaux et Configuration dan le Fichier..." depuis le menu Fichier, et vous avez fini!
</ol>

<p>Maintenant Vous pouvez essayer votre SSL en faisant fonctionner votre r&#233;seau<br>
Bien qu'il soit beaucoup moins amusant que r&#233;ellement l'ex&#233;cution du r&#233;seau,
vous pouvez &#233;galement tester votre en changeant l'Aiguillage
l'&#233;tat des Capteurs dans l'ordinateur lui-m&#234;me. Il suffit de cliquer sur l'&#233;tat des
informations dans les Tableaux pour le changer. Par exemple, l'Aiguillage
"LT23" est montr&#233; "D&#233;vi&#233;", dans le Tableau Aiguillage, cliquez sur ce mot pour le changer en "Directe". 
L'ic&#244;ne du signal sera actualis&#233;e avec la nouvelle Apparence.
<p>
Vous pouvez cr&#233;er un petit Panneau de Commande pour le faire graphiquement. Pour de plus amples
infos sur comment faire, consultez la
<a href="../../apps/PanelPro/Panels.shtml">page d'aide Panneaux </a>.

<p>Retour &#224; la <a href="../../../package/jmri/jmrit/blockboss/BlockBossFrame.shtml">page d'aide Logique Signal Simple</a>.
<p>Situ&#233; &#224; fr\html\tools\signaling\</p>

<!--#include virtual="/Footer" -->
</div>
</div>
</body>
</html>
