<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01//EN"
"http://www.w3.org/TR/html4/strict.dtd">
<!-- UpDated by Herv&#233; BLOREC <bzh56420@yahoo.fr> on 2019-02-02 -->
<html lang="fr">
<head>
  <meta name="generator" content=
  "HTML Tidy for Mac OS X (vers 31 October 2006 - Apple Inc. build 15.17), see www.w3.org">

  <title>JMRI: Transits Documentation</title>
  <meta http-equiv="Content-Type" content=
  "text/html; charset=us-ascii">
  <meta content="Dave Duchamp" name="Author">
  <meta name="keywords" content="JMRI help Sections">
  <!--#include virtual="/Style" -->
</head>

<body>
  <!--#include virtual="/Header" -->

  <div id="mBody">
    <!--#include virtual="Sidebar" -->

    <div id="mainContent">
      <h1>JMRI: Documentation Transits</h1>

      <h2>Qu'est ce qu'un Transit?</h2>

     <p> Un <b> Transit </b> est un groupe de deux <b> <a href="Sections.shtml"> Sections </a> </b>ou plus connect&eacute;es.
        qui d&eacute;crit un itin&eacute;raire autour du r&eacute;seau  pour un train circulant dans une
        direction donn&eacute;e. Une section peut &ecirc;tre dans plusieurs transits, et
       peut &ecirc;tre plusieurs fois dans un transit donn&eacute; . Les sections sont conserv&eacute;es
       dans l'ordre - la premi&egrave;re section est connect&eacute;e &agrave; la seconde, la
       deuxi&egrave;me est connect&eacute; &agrave; la troisi&egrave;me, etc. Cela signifie qu'une section
       dans un transit doit &ecirc;tre connect&eacute;e &agrave; la section avant celle-ci (si
       il y en a une) et &agrave; la section apr&egrave;s (s'il y en a une).
       L'ordre des sections d&eacute;termine le sens du d&eacute;placement
       dans le transit. Les trains voyagent des sections avec le num&eacute;ro
       s&eacute;quence le plus petit vers les sections avec le num&eacute;ro de s&eacute;quencele plus grand.
        Normalement, les transits ne devraient &ecirc;tre d&eacute;finis que pour la ligne principale
       , et parfois en travers&eacute;e de voie de triage. </p>

      <p> Dans les zones sp&eacute;cifi&eacute;es par l'utilisateur d'un Transit,
       des sections  <i> altern&eacute;es </i> peuvent &ecirc;tre d&eacute;sign&eacute;es. Par exemple, pour vous d&eacute;placer entre les
       "2&egrave;me" et "4&egrave;me" Sections dans un Transit, il peut y avoir plusieurs
       "3&egrave;me" Sections, chacune d'elles pouvant &ecirc;tre utilis&eacute;e pour voyager entre
       les 2e et 4e sections. Les autres sections pr&eacute;voient
       les voies de passage et les voies de garage. Les transits pr&eacute;voient &eacute;galement des
       boucles inverses. Pour permettre un fonctionnement en va-et-vient, par ex.
       pour les tramways, une option est fournie dans Dispatcher:
       inverser automatiquement la direction de parcours &agrave; travers un
       Transit lorsque le train atteint la fin de son transit, et
       faire rouler le train en sens inverse vers le d&eacute;but de
       Transit. </P>


      <p> Les transits prennent en charge les op&eacute;rations manuelles et automatiques 
       des trains. Quand un train roule en mode automatique, Transits
       pr&eacute;voir que des <b> actions </b> soient activ&eacute;es lorsqu'un train
       atteint une section d&eacute;sign&eacute;e du Transit. Une action peut &ecirc;tre
       par un certain nombre d'&eacute;v&eacute;nements, par exemple lorsque le train
       entre dans une section ou lorsque le train s'arr&ecirc;te. Une vari&eacute;t&eacute; de
       ces actions sont possibles, telles qu' arr&ecirc;ter le train d'un
       nombre de minutes rapides d&eacute;sign&eacute; par l'utilisateur 
       , revenir en mode manuel pour un fonctionnement manuel local,
       ou d&eacute;clencher le klaxon sur un d&eacute;codeur de son. </p>
       
      <p> Transits et ses <b> <a href = "../../package/jmri/jmrit/beantable/SectionTable.shtml">Sections </a> </b>
       associ&eacute;es, sont con&ccedil;us pour fournir une aide pour l'envoi, soit
       d'une mani&egrave;re manuelle (par un op&eacute;rateurr assis devant un TCO), ou
       l'envoi automatique par l'ordinateur. Le dispatching est 
       l'attribution temporaire de sections &agrave; l'usage exclusif de
       trains, soit g&eacute;r&eacute;s par des op&eacute;rateurs avec un r&eacute;gulateur, et/ou ex&eacute;cut&eacute;
       automatiquement par l'ordinateur. L'aide pour l'envoi est
       fourni par <a href =
       "../../package/jmri/jmrit/dispatcher/Dispatcher.shtml"> <b> Dispatcher </b> </a>,
       qui pr&eacute;voit &eacute;galement la mise en place et l'exploitation des trains
       automatiquement. </p>


     <h2> Configuration requise </h2>

       <p> Les transits peuvent &ecirc;tre utilis&eacute;s avec un &eacute;diteur de panneaux, avec un
       &Eacute;diteur de R&eacute;seaux, avec une machine CTC ou directement sans
       panneau. Les transits (et les sections) s'appuient sur la structure dees cantons et 
       les chemins de JMRI. Donc, avant de tenter de cr&eacute;er des Transits, vous devez initialiser
       compl&egrave;tement les cantons, chemins et sections pour votre
      r&eacute;seau. (Un moyen facile d'initialiser automatiquement vos cantons
       et les chemins est d'esquisser un panneau de l'&eacute;diteur de votre
      r&eacute;seau, avec des cantons assign&eacute;s. En assignant des Cantons &agrave; tous
       les segments de voie aiguillages, etc., les chemins seront cr&eacute;&eacute;s
       automatiquement pour vous par JMRI.) </p>

     <h2> Comment configurer les transits </h2>

       <h3> Affichage et cr&eacute;ation de transits </h3>

       <p> Tous les transits connus de JMRI peuvent &ecirc;tre visualis&eacute;s en utilisant
       le <a href =
       "../../package/jmri/jmrit/beantable/TransitTable.shtml">Tableau Transit
      </a>. S&eacute;lectionnez <b> Transits </b> dans le sous-menu <b> Tableaux </b>.
       du menu <b> Outils </b> du programme principal JMRI.
       .

       <h3> Contr&ocirc;les de la table de transit </h3>

       <p> En dessous de la table de transit, il y a un bouton <a href =
       "../../package/jmri/jmrit/beantable/TransitAddEdit.shtml"> Ajouter ... </a>
       . </p>

       <h3> Cr&eacute;ation d'un nouveau transit </h3>

       <p> Pour cr&eacute;er une nouvelle section, cliquez sur le bouton "<a href =
       "../../package/jmri/jmrit/beantable/TransitAddEdit.shtml"> Ajouter ... "
       </a> au bas du volet Tableau Transit.

       <h3> Enregistrement de sections sur le disque </h3>

      <p> Utilisez l'option <b> Stocker </b> du menu <b> Fichier </b> de la
       Table de transit (ou l'&eacute;l&eacute;ment <b> Stocker Panneaux ... </b> dans la
       fen&ecirc;tre principale de JMRI <b> Panneaux </b> ) pour enregistrer les informations Transit
       sur le disque. Ces informations sont enregistr&eacute;es avec la configuration et les
       panneaux dans un fichier XML, avec la configuration du panneau de commande et
       des choses similaires. Pour stocker vos panneaux dans le m&ecirc;me fichier
       (recommand&eacute;), s&eacute;lectionnez <b> Fichier> Enregistrer> Enregistrer la Configuration.
       et Panneaux dans le Fichier... </b> ou s&eacute;lectionnez <b> Panneaux> Stocker
       Panneaux ... </b> dans la fen&ecirc;tre principale de JMRI. </P>

      <!--#include virtual="/Footer" -->
    </div><!-- closes #mainContent-->
  </div><!-- closes #mBody-->
</body>
</html>
