<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01//EN" "http://www.w3.org/TR/html4/strict.dtd">
<!-- $Id$ -->
<!-- UpDated by Herv&#233; Blorec <bzh56420@yahoo.fr> 2013-10-19-->
<html lang="fr">
<head>
 <TITLE>
      JMRI: AutoTrains Window Help
 </TITLE>
    <META http-equiv=Content-Type content="text/html; charset=iso-8859-1">
    <META content="Dave Duchamp" name=Author>
    <META name="keywords" content="JMRI help Dispatcher Auto Active Trains">

<!-- Style -->
  <META http-equiv=Content-Type content="text/html; charset=iso-8859-1">
  <link rel="stylesheet" type="text/css" href="/css/default.css" media="screen">
  <link rel="stylesheet" type="text/css" href="/css/print.css" media="print">
  <link rel="icon" href="/images/jmri.ico" type="image/png">
  <link rel="home" title="Home" href="/">
<!-- /Style -->
</head>


<!--#include virtual="/Header" -->
  <div class="nomenu" id="mBody">
    <div id="mainContent">

<H1>La fen&#234;tre  AutoTrains</H1>
<H2>Introduction</h2>

<p>La fen&#234;tre <b>AutoTrains</b>  permet au r&#233;partiteur de prendre le contr&#244;le d'un
 Train Automatique actif (un train actif en ex&#233;cution automatique ) depuis le <i>
r&#233;partiteur virtuel</i> en cas de besoin pour r&#233;soudre un probl&#232;me, et pour r&#233;tablir un fonctionnement automatique
apr&#232;s que le probl&#232;me ait &#233;t&#233; r&#233;solu. Exemple de probl&#232;mes n&#233;cessitant au r&#233;partiteur d'intervenir
sont, d&#233;raillement du train, ou d&#233;couplage inattendu de wagons d'un train. Cette
fen&#234;tre est &#233;galement utilis&#233; pour red&#233;marrer un fonctionnement automatique apr&#232;s la suspension par un m&#233;canicien humain pour couper wagons ou effectuer d'autres travaux.</p>
<p> Lorsque le premier Train Auto Actif est cr&#233;&#233; en
<b> <a href="Dispatcher.shtml"> Dispatcher</a></b>, une fen&#234;tre <b>AutoTrains</b> est 
ouverte imm&#233;diatement &#224; droite de la fen&#234;tre du Dispatcher. Cette fen&#234;tre peut &#234;tre d&#233;plac&#233;e
&#224; un autre emplacement, si d&#233;sir&#233;. Une entr&#233;e est ajout&#233;e pour chaque Train Actif Automatique suppl&#233;mentaire quand il est cr&#233;&#233;. Quand un Train Actif Auto est termin&#233;, son entr&#233;e est
retir&#233; de la fen&#234;tre <b>AutoTrains</b>.

<H2>Utilisation de la Fen&#234;tre TrainsAuto
</H2>
<p>Ci-dessous se trouve une fen&#234;tre <b>TrainsAuto</b> montrant deux trains actifs, Amtrak 139 et
GTW 6418. Les entr&#233;es sont s&#233;par&#233;es par une ligne horizontale.</p>
<img src="AutoTrainsA.jpg" height="154" width="255">
<p>Chaque entr&#233;e a un bouton <b>Stop</b> et un bouton <b>Pour Manuel</b>.Si le dispatcher
presses le bouton <b>Stop</b>, le Train Actif en Auto est imm&#233;diatement
arr&#234;t&#233;. L'arr&#234;t est un arr&#234;t d'urgence - pas de r&#233;duction progressive de la vitesse. En cliquant sur le bouton <b>Stop tous les trains Auto</b> en bas de la fen&#234;tre cela &#233;mettra un
arr&#234;t d'urgence pour tous les trains actifs montr&#233;s dans les <b>TrainsAuto</b> de la fen&#234;tre.
Le Bouton <b>STOP</b> Changer en bouton  <b>Reprendre</b> lorsque les trains sont arr&#234;t&#233;s. Chaque
train qui s'est arr&#234;t&#233; doit &#234;tre red&#233;marr&#233; individuellement en cliquant sur le bouton <b>Reprendre</b>.. 
</p>
<p>Si le dispatcheur clique le bouton <b>Pour Manuel</b> pour l'Amtrak 139, la fen&#234;tre ci-dessus va chang&#233;e pour :</p>
<img src="AutoTrainsB.jpg" height="154" width="551">
<p>Le curseur commande la vitesse du train, et les boutons radio <b>AV</b> et <b>AR</b> 
commande la direction du train. Le dispatcheur peut utiliser ces commandes pour faire circuler un train et r&#233;soudre tous les probl&#232;mes pr&#233;sents. Quand le probl&#232;me est r&#233;solu, cliquer le bouton <b>Pour Auto</b> restaurera le fonctionnement du train. ant&#233;rieurement au clic sur <b>Pour Auto</b>, le r&#233;partiteur doit conduire le train au
m&#234;me endroit o&#249; il &#233;tait quand <b>Pour Manuel</b> a &#233;t&#233; cliqu&#233;. Cela assure une reprise en douceur du fonctionnement automatique. </p>
<p> Une des <b>Actions sp&#233;cifi&#233;e par l'utilisateur</b > est de <b>Passer en Mode Manuel</b>. Cette
Action soutient l'ex&#233;cution d'un train Actif Auto automatiquement Pour un travail &#224; c&#244;t&#233;, o&#249; un
conducteur humain prend le relais pour les op&#233;rations pr&#233;form&#233;es ( peut-&#234;tre une commutation voitures), apr&#232;s
quoi la marche automatique est poursuivie suivant la m&#234;me Transit. lorsque l'action
<b>Passer en Mode Manuel</b> est lanc&#233;e, les boutons <b>Arr&#234;t</b > et <b>Pour Manuel</b> sont remplac&#233;s par un bouton <b>Reprendre Auto</b>, et le r&#233;gulateur informatique &#233;tant utilis&#233; par le <i>iconducteur virtuel</i> est lib&#233;r&#233;. Un conducteur humain
peut alors brancher un R&#233;gulateur manuel et acqu&#233;rir le train pour un fonctionnement manuel.
Apr&#232;s que lop&#233;rateur humain ait termin&#233; son/ses travaux, l'op&#233;rateur humain ferme son r&#233;gulateurs manuel et informe le dispatcheur que le fonctionnement automatique peut &#234;tre
repris. Le r&#233;partiteur reprend son fonctionnement automatique en cliquant sur le
<b>Reprendre Ex&#233;cution Automatique</b>. Avant de refermer son r&#233;gulateur, l'op&#233;rateur
 devra conduire le train dans la m&#234;me situation il se trouvait lorsque 
Le fonctionnement en mode manuel &#233;t&#233; initi&#233;. Ceci assure reprise automatique en douceur de l'op&#233;ration . </ p>










<!--#include virtual="/Footer" -->
</body>
</html>
