# NodeConfigBundle_fr.properties
#
# French properties for the jmri.jmrix.maple.nodeconfig window
#
# Translated by Herv\u00e9 BLOREC <bzh56420@yahoo.fr> le 2013-8-19

WindowTitle = Configurer Noeuds Maple
ConfigureMapleNodes = Configurer Noeuds Maple du Panneau

BoxLabelNotes = Remarques

LabelNodeAddress = Adresse Station HMI  :
LabelPollTimeout = D\u00e9lai d'Attente pour R\u00e9pondre au Sondage  :
LabelSendDelay = Envoyer Temporisation:
# LabelPulseWidth = Largeur d'Impulsion:
LabelMilliseconds = (millisecondes)
LabelNumOutputBits = Nombre de Bits de Sortie:
LabelNumInputBits = Nombre de Bits d'Entr\u00e9e:

# special Maple terminology, does not use strings in jmrix.Bundle
TipNodeAddress = Entrez l'adresse de la station, (1-99), tel que configur\u00e9 dans le panneau HMI.
TipPollTimeout = Entrer le temps \u00e0 attendre pour avoir la r\u00e9ponse quand un pannea est interrog\u00e9, avant de confirmer que ce panneau n'est pas branch\u00e9
TipSendDelay = Entrer le temps \u00e0 attendre apr\u00e8s que chaque commande d'\u00e9mission ait \u00e9t\u00e9 diffus\u00e9e.
# TipPulseWidth = largeur de l'impulsion pour la commande par impulsion d'un aiguillage (100 \u00e0 10000 autoris\u00e9).
TipOutputBits = Entrer nombre maximum de bits de sortie (1-8000 autoris\u00e9). S'applique \u00e0 tous les panneaux.
TipInputBits = Entrer nombre maximum de bits d'entr\u00e9e (1 - 1000 permis). S'applique \u00e0 tous les panneaux.
TipAddButton = Ajouter un nouveau n\u0153ud de panneau
TipEditButton = Modifier un n\u0153ud sur le panneau existant
TipDeleteButton = Supprimer un n\u0153ud du panneau existant
TipDoneButton = S\u00e9lectionnez lorsque vous avez termin\u00e9 la configuration des noeuds du panneau
TipUpdateButton = Changer l'information du n\u0153ud du panneau
TipCancelButton = Arr\u00eat modification sans changer les informations du n\u0153ud de panneau

ButtonAdd = Ajt Pann
ButtonEdit = Modif Pann
ButtonDelete = Supp Pann
ButtonUpdate = M \u00e0 J Pann

# Le plus long des trois prochaines lignes d\u00e9termine la largeur de la fen\u00eatre.
NotesStd1 = Ajout d'un nouveau n\u0153ud de panneau, saisissez les informations et s\u00e9lectionnez "Ajouter Panneau".
NotesStd2 = Pour Modifier un n\u0153ud du panneau, saisissez l'adresse de la station, puis s\u00e9lectionnez "Modifier Panneau".
NotesStd3 = Pour Supprimer un n\u0153ud du panneau, saisissez l'adresse de la station, puis s\u00e9lectionnez "Supprimer Panel".
# Ces trois lignes doivent \u00eatre plus courte que la plus longue ligne ci-dessus.
NotesEdit1 = Veuillez v\u00e9rifier l'adresse de la station avant de faire des changements.
NotesEdit2 = Pour changer ce panneau, faire les changements, puis s\u00e9lectionnez "Mise \u00e0 jour du Panneau".
NotesEdit3 = Pour quitter sans modifier ce volet, s\u00e9lectionnez "Annuler".

# Toutes les lignes Errorxx ci-dessous doivent \u00eatre plus courte que la plus longue ligne NotesStdx ci-dessus.
Error3 = Erreur lors de la cr\u00e9ation nouveau n\u0153ud du panneau. Panneau pas ajout\u00e9.
Error4 = Erreur - Aucun n\u0153ud avec  Adresse de la Station entr\u00e9e, veuillez r\u00e9essayer.
Error5 = erreur - mauvaise caract\u00e8re dans l'adresse de station (UA), veuillez r\u00e9essayer.
Error6 = Erreur - Adresse de la station n'est pas entre 0 et 99.
Error7 = Erreur - Mauvais caract\u00e8re dans le D\u00e9lai d'Attente de la R\u00e9ponse au Sondage, veuillez r\u00e9essayer.
Error8 = Erreur - Le D\u00e9lai d'Attente de la R\u00e9ponse au Sondage doit \u00eatre positif, veuillez r\u00e9essayer.
Error9 = Erreur - Le D\u00e9lai d'Attente de la R\u00e9ponse au Sondage ne peut exc\u00e9der 10000, veuillez r\u00e9essayer.
Error10 = Erreur - Mauvais caract\u00e8re dans le Nombre de Bits d'Entr\u00e9e, veuillez r\u00e9essayer.
Error11 = Erreur - Le Nombre de Bits d'Entr\u00e9e doit \u00eatre positif, veuillez r\u00e9essayer.
Error12 = Erreur - Le Nombre de Bits d'Entr\u00e9e ne doit pas d\u00e9passer 1000, veuillez r\u00e9essayer.
Error13 = Erreur - Mauvais caract\u00e8re dans le Nombre de Bits de Sortie, veuillez r\u00e9essayer.
Error14 = Erreur - Le Nombre de Bits de Sortie doit \u00eatre positif, veuillez r\u00e9essayer.
Error15 = Erreur - Le Nombre de Bits de Sortie ne peut pas d\u00e9passer 8000, veuillez r\u00e9essayer.
# Error16 = Erreur - La Largeur d'impulsion doit \u00eatre au moins 100, veuillez r\u00e9essayer.
# Error17 = Erreur - La Largeur d'impulsion doit \u00eatre inf\u00e9rieur \u00e0 10000, veuillez r\u00e9essayer.
# Error18 = Erreur -Mauvais caract\u00e8re de Largeur d'Impulsion, s'il vous pla\u00eet essayer \u00e0 nouveau.
Error19 = Erreur - Mauvais caract\u00e8re dans la Temporisation Envoy\u00e9e, veuillez r\u00e9essayer.
Error20 = Erreur - Temporisation Envoy\u00e9e doit \u00eatre positif, veuillez r\u00e9essayer.
Error21 = Erreur - Temporisation Envoy\u00e9e ne peut pas d\u00e9passer 10000, veuillez r\u00e9essayer.

FeedBackAdd = N\u0153ud Maple ajout\u00e9 au Panel. Adresse de la Station
FeedBackDelete = N\u0153ud Maple du Panneau supprim\u00e9. Adresse de la Station
FeedBackUpdate = N\u0153ud Maple du Panneau mis \u00e0 jour. Adresse de la Station

ConfirmDelete1 = \u00eates-vous s\u00fbr de vouloir effacer le panneau Maple avec l'adresse de la Station
ConfirmUpdate3 = Etes-vous s\u00fbr de vouloir mettre \u00e0 jour la configuration de ce n\u0153ud du panneau?

ReminderNode1 = N'oubliez pas de sauvegarder vos nouvelles informations de configuration Maple sur le disque.
