<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01//EN" "http://www.w3.org/TR/html4/strict.dtd">
<!-- Updated by Blorec Herv&#233; le 2017-01-27; -->
<html lang="fr">
<head>
  <title>JMRI Hardware Support - Digitrax LocoNet</title>
    <meta name="keywords" content="Digitrax LocoNet LocoBuffer LocoBuffer-II
          LocoBuffer-USB MS100 PR2 PR3 DCS100 DCS50 DCS51 DB150 JMRI">

  <!-- Style -->
  <meta http-equiv="content-type" content="text/html; charset=iso-8859-1">
  <link rel="stylesheet" type="text/css" href="/css/default.css" media="screen">
  <link rel="stylesheet" type="text/css" href="/css/print.css" media="print">
  <link rel="icon" href="/images/jmri.ico" type="image/png">
  <link rel="home" title="Home" href="/">
  <!-- /Style -->
</head>

<body>
<!--#include virtual="/Header" -->
<div id="mBody">
    <!--#include virtual="Sidebar" -->
    <div id="mainContent">

    <h1>Support: Digitrax LocoNet&reg;</h1>

<div class="toc">
<ul>
  <li><a href="#LocoNetConnect">Mat&#233;riel pris en charge</a>
  <ul>
  	<li><a href="#Programmer">Programmateurs PR2 et PR3 </a></li>
  </ul></li>
  <li><a href="#Limitation">Limitations</a></li>
  <li><a href="#Setup">Connexion</a>
  <ul>
  	<li><a href="#Using">Utilisation de JMRI avecLocoNet&reg;</a></li>
  	<li><a href="#Network">Mettre en R&#233;seau Ordinateurs etLocoNet&reg;</a></li>
  </ul></li>
  <li><a href="#Debugging">D&#233;bogage</a>
  <ul>
	  <li><a href="#ErraticReadback">Relecture CV Erratique ou non-fonctionnelle </a></li>
	  <li><a href="#TurnoutCmdHandling">Rejet de la Commande de l'Aiguillage par la Centrale 
				et Manipulation de la Commande de l'aiguillage par JMRI</a>
	  <ul>
	    <li><a href="#turncmdhandsettings">Manipulations des R&#233;glages de Commande Aiguillage</a></li>
	    <li><a href="#alternatives">Strat&#233;gies d'&#233;vitement</a></li>
	    <li><a href="#cmdStationTrkPwrOff">Rejet de la Commande Aiguillage quand 
	        L'alimentation voie est coup&#233;e</a></li>
	    <li><a href="#multConnTurnoutReject">Rejet Commande Aiguillage multiple connexions</a></li>
	  </ul></li>      
  </ul></li>
  <li><a href="#SeeAlso">Documentation</a></li>
  <li><a href="#Support">Support</a></li>
</ul>
</div>

<a name="LocoNetConnect"></a><a name="hardware"></a><h2>Mat&#233;riel pris en charge</h2>
<p>Le logiciel JMRI, incluant DecoderPro eet PanelPro, fonctionne avec votre centrale Digitarx 
pour programmer les d&#233;codeurs. Pour ce faire, il communique avec la 
centrale par desuus LocoNet&reg; en utilisant un des nombreux types d'<a href="#adapters">adapteur</a>.</p>

<h3>Centrales</h3>
<p>Lelogiciel JMRI prend en charge les centrales LocoNet suivantes:
<ul>
  <li>Zephyr Starter Set</li>
  <li>Zephyr Xtra Starter Set</li>
  <li>Empire Builder Super Set</li>
  <li>Chief Starter Set</li>
  <li>Super Set Chief</li>
  <li>Super Chief Xtra Set</li> 
  <li>Centrale /Booster/R&#233;gulateur DCS50</li>
  <li>Centrale /Booster/R&#233;gulateur DCS51</li>
  <li>Centrale /Booster DB150</li>
  <li>Centrale /Booster DCS100</li>
  <li>Centrale /Booster DCS200</li>
  <li><a href="Uhlenbrock.shtml">Intellibox: L'Unit&#233; Centrale Uhlenbrock</a></li>
  <li><a href="Uhlenbrock.shtml">Intellibox II or IB-Com</a></li>
  <li> DCC-Mux: multiplexeur de donn&#233;es DCC avec LocoNet int&#233;gr&#233; dans la centrale de commande</li>
</ul>

<p> Pour les syst&#232;mes qui ne fournissent pas de centrale LocoNet, deux autres
   	options sont prises en charges. Quand un r&#233;seau utilise des p&#233;riph&#233;riques LocoNet mais
   	pas de station de commande bas&#233;e sur LocoNet, un LocoNet "autonome" est utilis&#233;. voir
   	<a href="StandaloneLocoNet.shtml"> LocoNet autonome</a>. En outre, lelogiciel JMRI peut &#234;tre configur&#233; pour utiliser une connexion LocoNet 
	simul&#233;e au lieu d'une vraie connexion LocoNet. 
	Il s'agit de la "LocoNet Simulator ".</p>

    <a name="adapters" id="adapters"></a><h3>Interfaces Ordinateurs</h3>
<p>Pour connecter votre ordinateur &#224; LocoNet, et donc &#224; la centrale de commande, 
vous avez besoin d'une des adaptateurs suivants:</p>
<ul>
  	<li><a title="RR-CirKits USB interface" href="LocoBufferUSB.shtml"> LocoBuffer-USB</a></li>
  	<li><a title="Digitrax USB interface" href="PR3.shtml"> PR3</a></li>
  	<li><a title="RR-CirKits s&#233;rie interface" href="LocoBufferII.shtml"> LocoBuffer II</a></li>
  	<li><a title="Original Kit Version" href="LocoBuffer.shtml"> LocoBuffer</a></li>
  	<li><a title="Digitrax s&#233;rie interface" href="MS100.shtml"> MS-100</a></li>
	<li><a title="BT LocoBridge" href="BTLocoBridge.shtml">Bluetooth LocoBridge</a></li> 
</ul>

<p>En r&#232;gle g&#233;n&#233;rale, toutes ces cartes peuvent &#234;tre utilis&#233;es avec tout type d'ordinateurs pour communiquer
avec tout type de centrale de commande. Actuellement, le LocoBuffer-USB et PR3 sont les
solutions recommand&#233;es. La LocoBuffer II et la LocoBuffer originale 
ne sont plus disponibles dans le commerce, leur seul avantage &#233;taient 
qu'elles utilisaientt un port s&#233;rie traditionnel, qui &#233;tait le seul type de connexion 
appropri&#233;e disponible sur quelques vieux ordinateurs.</p>
<p>Le MS100 n'est pas recommand&#233;, il &#233;choue parfois &#224; fournir des communications fiables
   , et il ne peut pas &#234;tre utilis&#233; avec JMRI si vous utilisez Mac OS X ou
   sur la plupart des machines Windows Vista. Si vous avez des probl&#232;mes avec le MS100,
   vous pourriez ne pas &#234;tre en mesure de les corriger, et personne ne pourra &#234;tre en mesure de vous aider</p>

<p>L'Intellibox Uhlenbrock peut &#233;galement &#234;tre command&#233;e directement par son
port s&#233;rie: ou une connexion USB,;il y a une <a href="Uhlenbrock.shtml">page s&#233;par&#233;e</a> sur la mani&#232;re de
le faire.</p>

<a name="Programmer"></a><h2>Programmateur PR2 et PR3</h2>
JMRI peut &#233;galement utiliser <a title="Digitrax programmer" href="PR2.shtml"> Digitrax PR2</a> ou 
<a href="PR3.shtml">PR3</a> pour programmer
et tester les d&#233;codeurs. Le PR2 est une unit&#233; autonome qui ne se connecte 
pas au reste du r&#233;seau, ni &#224; la centrale, ni &#224; un LocoNet. 
Pour plus d'informations sur l'utilisation d'un PR2 avec DecoderPro, s'il vous pla&#238;t voir la
<a href="PR2.shtml"> page de configuration PR2</a>. La PR3 peut &#234;tre configur&#233;e dans JMRI pour agir 
soit comme un programme autonome, soit comme une interface pour LocoNet. Il y a plus 
d'information sur la page de configuration<a href="PR3.shtml"> PR3</a>.

<h2><a name="Limitation">Limitations</a></h2>

<p><b>Intellibox Uhlenbrock</b>
<p>L'Intellibox a deux connexions LocoNet,
appel&#233; LocoNet-T et LocoNet-B. La connexion LocoNet-T peut g&#233;rer plus de
dispositifs, mais ne fournit pas les signaux de Rail-Synch que certains dispositifs LocoNet
(en particulier les boosters et les BDL16, BDL162 remplac&#233; par le BDL168) exigent. Un LocoBuffer devrait &#234;tre
reli&#233; &#224; la connexion LocoNet-T.</p>

<p><b>Intellibox II et IB-Com Uhlenbrock</b>
L'Intellibox II et II-B ont deux connexions LocoNet, 
appel&#233; LocoNet-T et LocoNet-B. La connexion LocoNet-T peut g&#233;rer plus de
dispositifs, mais ne fournit pas les signaux de Rail-Synch que certains dispositifs LocoNet
(en particulier les boosters et les BDL16, BDL162 remplac&#233; par le BDL168) exigent. Un LocoBuffer devrait &#234;tre
reli&#233; &#224; la connexion LocoNet-T.</p>

<p><strong>PR-1 n'est pas pris en charge</strong> - Notez que DecoderPro ne peut pas directement
programmer les d&#233;codeurs par un programmateur PR1. JMRI prend en charge la programmation des d&#233;codeurs 
soit par le PR3 comme programmateur autonome ou par une centrale.</p>

<p><b>Mac OS X et le MS100</b> - Parce que Mac OS X ne peut pas communiquer &#224; la
vitesse de transmission utilis&#233;e par le MS100, le MS100 ne fonctionne pas avec Mac OS X. Vous
devrez &#224; la place prendre un LocoBuffer-USB.</p>

<p><b>Microsoft Vista et le MS100</b> - Il a &#233;t&#233; rapport&#233; que Vista ne
prend pas en charge la vitesse sp&#233;ciale de transmission utilis&#233;e par le MS100. Si vous trouvez que votre
MS-100 ne fonctionne pas sur votre machine Vista vous devrez utiliser &#224; la place un LocoBuffer-USB ou
PR3.</p>

<a name="Setup"></a><h2>Connexion</h2>

<p>Pour connectervotre ordinateur &#224; un syst&#232;me Digitrax DCC, vous avez besoin de 
<a title="RR-CirKits USB interface" href="LocoBufferUSB.shtml">LocoBuffer-USB</a>,
<a title="Digitrax USB interface" href="PR3.shtml">PR3</a>, 
<a title="RR-CirKits Serial interface" href="LocoBufferII.shtml">LocoBuffer-II</a>, 
<a title="Original Kit Version" href="LocoBuffer.shtml">LocoBuffer</a> ou 
<a title="Digitrax Serial interface" href="MS100.shtml">MS100</a> pour agir comme un adaptateur. Voir ci-dessus pour plus 
d'information sur ceux-ci. Le LocoBuffer-USB est hautement recommand&#233;.</p>

<p>Notez qu'&#224; l'exception du PR3, ce ne sont que des interfaces LocoNet, ne sont pas des
programmateurs autonome comme le PR2 Digitrax et PR3. La relecture des CVs d&#233;codeurs,est possible quand vous utilisez une voie contr&#244;l&#233;e 
par un PR3 (en mode programmmation autonome) ou une voie contr&#244;l&#233;e par une centrale Chief ou Zephyr.</p>

<p>L'&#233;tape suivante montre comment ajouter une connexion &#224; JMRI (DecoderPro, PanelPro, etc.) 
pour un syst&#232;me bas&#233; sur LocoNet.</p>
<ol>
 <li>Connectez votre adaptateur au LocoNet, et connectez votre ordinateur, avec
   le c&#226;ble s&#233;rie ou USB appropri&#233;.</li>
  <li>Les utilisateurs Mac et Windows devraient installer les pilotes appropri&#233;s USB s'ils
   	utilisent des dispositifs USB.</li>
  <li>Utilisateurs de Linux et Mac devraient &#234;tre s&#251;r que les communications avec les
   	packages Java ont &#233;t&#233; install&#233;s.</li>
  <li> Ouvrez un programme JMRI et aller au panneau "Pr&#233;f&#233;rences". Celui-ci s'ouvre normalement
  	automatiquement la premi&#232;re fois que le programme s'ex&#233;cute, ou vous pouvez le s&#233;lectionner
  	&#224; partir du menu "&#201;dition".</li>
  <li>S&#233;lectionnez l'&#233;l&#233;ment "Connexion" dans la fen&#234;tre de gauche.</li>
  <li>S&#233;lectionnez "Digitrax" dans la fen&#234;tre "System Manufacturer".</li>
  <li>Vous pouvez ensuite configurer les param&#232;tres appropri&#233;s dans la bo&#238;te Param&#232;tres. le
 	"Serial Port" doit &#234;tre correctement choisi et les param&#232;tres de connexion correctement
  	configur&#233; pour que JMRI puisse communiquer avec l'adaptateur mat&#233;riel. Sur certains syst&#232;mes
  	avec certains types de syst&#233;me d'adaptateurs de connexion, le r&#233;glage "Serial Port" est automatiquement s&#233;lectionn&#233;. Dans d'autres 
	cas, la premi&#232;re "Serial Port" connexion possible sera s&#233;lectionn&#233;e par d&#233;faut. Il peut &#234;tre n&#233;cessaire d'utiliser des 
	outils fourni avec le syst&#232;me d'exploitation de l'ordinateur pour d&#233;terminer quel Port s&#233;rie est appropri&#233; &#224; votre 
	situation 
	particuli&#232;re.</li>
 <li>S&#233;lectionnez le "Type de Centrale".
	<p>Quand la "Connexion Type" est d&#233;finie pour le PR3, le "Type de Centrale" 
	peut &#234;tre d&#233;fini sur PR3, en mode programmation autonome ou d&#233;fini pour une des 
	centrales types. Quand s&#233;lectionn&#233; pour une centrale de commande sp&#233;cifique, la voie de
	programmation PR3 n'est pas utilis&#233;e; &#224; la place, la programmation 
	d&#233;codeur se fait &#224; travers les m&#233;canismes pr&#233;vus par la centrale 
    s&#233;lectionn&#233;e.</p>
 <p>Lorsque "DB150 (Empire Builder)" est s&#233;lectionn&#233;, la programmation d&#233;codeur JMRI est faite
      via les m&#233;canismes de programmation DB150. Le DB150 n'est pas capable de lire les
      valeurs CVs du d&#233;codeur, donc JMRI ne sera pas en mesure de lire les valeurs CVs du d&#233;codeur via
      les m&#233;canismes de programmation DB150. Les utilisateurs Empire Builder peuvent utiliser un PR3 dans le
      mode programmeur autonome, au lieu de la voie de programmation Empire Builder, pourE      permettre la relecture des CV d&#233;codeur. Certains utilisateurs configurent DecoderPro pour la programmation
      d&#233;codeurs en utilisant le PR3 en mode de programmation autonome, puis configurent
      PanelPro pour utiliser le PR3 en mode d'interface LocoNet (aussi appel&#233;
      Mode "MS100") pour permettre &#224; PanelPro de communiquer avec la centrale de commande Empire Builder
      et les p&#233;riph&#233;riques connect&#233;s LocoNet.Plus d'informations sur la de PR3
      s peuvent &#234;tre trouv&#233;es sur la page de configuration <a href="PR3.shtml"> PR3</a>.</p>
 </li>
<li>Le "pr&#233;fixe de connexion" est utilis&#233; pour aider JMRI &#224; communiquer s&#233;par&#233;ment avec
    plusieurs "connexions" au mat&#233;riel du r&#233;seau. Chaque "connexion" doit avoir un
    identifiant unique, qui est d&#233;fini comme le "pr&#233;fixe de connexion". Par d&#233;faut,
    la premi&#232;re connexion de LocoNet est donn&#233;e &#224; un pr&#233;fixe de "L", et LocoNet suppl&#233;mentaire
    sont donn&#233;s pr&#233;fixes comme "L1", "L2", ... La plupart des utilisateurs devraient &#234;tre en mesure
    d'utiliser la valeur par d&#233;faut,de "Connection Prefix", valeur fournie par les outils JMRI.
    <p>Il est recommand&#233; que toutes les connexions pour le mat&#233;riel LocoNet utilisent une
     pr&#233;fixe qui commence par "L", comme les autres caract&#232;res sont normalement associ&#233;s
     avec d'autres types de connexions mat&#233;rielles.</p>     
</li>
  <li>Quand un outil JMRI est configur&#233; pour plusieurs connexions, chaque connexion devient un
      &#233;l&#233;ment de menu de la fen&#234;tre principale des outils JMRI. Pour aider les utilisateurs
      &#224; distinguer entre les diff&#233;rentes connexions, chaque connexion dispose d'un "Nom de connexion",
      qui est utilis&#233; comme le nom de l'&#233;l&#233;ment de menu associ&#233; &#224; la fen&#234;tre
      principale des outils JMRI. Les utilisateurs peuventt changer le champ "Connection Name" pour toute
      connexion en fonction de leurs besoins.</li>
  <li>Certaines cartes peuvent avoir des options de configuration en plus, ce qui peut &#234;tre d&#233;montr&#233;
      en cochant la case "Additional Connection Settings". Cela peut montrer des param&#232;tres suppl&#233;mentaires
      qui peuvent &#234;tre faites pour certains types d'adaptateurs. Ceux-ci incluent, mais ne sont limiter, les
      options &#233;num&#233;r&#233;es ici.</li>

   <li>Le r&#233;glage "Baud Rate". Lorsque plusieurs param&#232;tres sont disponibles,il doit &#234;tre r&#233;gl&#233; pour correspondre aux besoins de l'adaptateur de mat&#233;riel particulier sp&#233;cifi&#233; dans le param&#232;tre "Connection System". Ce r&#233;glage sera pr&#233;-r&#233;gl&#233; et non modifiable si vous avez s&#233;lectionn&#233; une "Connection System" LocoBuffer-USB, PR3 ou MS100. Il y a deux choix de vitesse pour la LocoBuffer et LocoBuffer-II; s&#233;lectionnez celui qui correspond au
        r&#233;glage des cavaliers sur votre unit&#233; LocoBuffer. Nous vous recommandons de commencer
        avec le choix 19.200 pour la LocoBuffer ou LocoBuffer-II; voir les pages
        <a href="LocoBufferII.shtml"> LocoBuffer-II</a> et
        <a href="LocoBuffer.shtml"> LocoBuffer</a> pour plus d'informations.
     </li>
      <li>Le <a href="#TurnoutCmdHandling">param&#232;tre "Command Station command Turnout
          Rejection and JMRI Turnout command Handling"</a>
        d&#233;crit <a href="#TurnoutCmdHandling"> ci-dessus</a>.</li>
     <li>La s&#233;lection "Connexion Utilis&#233;es" d&#233;termine comment le "flow control" est mis en &#339;uvre dans les logiciels. Cette s&#233;lection doit &#234;tre configur&#233;e pour le "hardware flow control"
       sauf si vous obtenez toujours plus tard un message de la console JMRI que les fils Contr&#244;le LocoBuffer &#233;taient mal mis en place, dans ce cas, vous pourriez essayer de contourner en choisissant "no flow control". Cette case sera
    vide si vous avez s&#233;lectionn&#233; LocoBuffer-USB, PR3 ou MS100.</li>
    <li>Cliquez sur "Enregistrer". Il vous sera demand&#233; si c'est OK pour quitter le programme, cliquez sur
   "Oui".</li>
  <li style="text-align:left;">Red&#233;marrer le programme. Vous devriez &#234;tre op&#233;rationnel.</li>
</ol>

<p>Si vous allez commander les aiguillages, signaux ou d'autres appareils sur votre
r&#233;seau depuis JMRI ou un autre programme, nous vous recommandons de placer l'option
"Meter route/switch output when not in trinary" de la centrale de commande sur Off. (T) Quand
On, cette option permet de r&#233;duire consid&#233;rablement le nombre de commandes que LocoNet peut g&#233;rer
chaque seconde, ce qui peut entra&#238;ner des retards importants lorsque vous contr&#244;lez les
signaux, etc. Pour le d&#233;sactiver, vous pouvez utiliser l'outil "Configure Command Station"
dans le menu <b>LocoNet</b> pour r&#233;gler l'interrupteur d'option 31 &#224; "T" (rejet&#233;), ou le mettre
directement dans la centrale &#224; l'aide d'un r&#233;gulateur Digitrax.</p>

<p>Si vous avez de multiples connexions, l'onglet "par D&#233;faut" dans le Fen&#234;tre Pr&#233;f&#233;rences peuvent &#234;tre utilis&#233;s pour diriger certains types d'op&#233;rations sur diff&#233;rentes connexions. Un bon exemple de ceci est un syst&#232;me avec deux connexions PR3, l'une en mode programmateur autonome pour la programmation des CVs du d&#233;codeur, et l'autre pour la communication avec un r&#233;seau LocoNet et de la centrale de commande. Dans ce cas, utilisez les param&#232;tres "Valeurs par d&#233;faut" pour s&#233;lectionner une connexion LocoNet seulement pour "Programmer" et l'autre connexion LocoNet pour "Throttles, "Power Control" et "Command Station". </p>

 <h2><a name="Using"></a>Utiliser JMRI avec LocoNet&reg;</h2>
JMRI fournit un certain nombre de fonctionnalit&#233;s qui lui permettent d'interagir avec LocoNet:
<ul>
  <li>Plusieurs &#233;quipement LocoNet peuvent &#234;tre adress&#233;s directement par JMRI, telles que les
      sorties individuelles aiguillage sur une DS54, ou des d&#233;tection individuelle de canton sur un BFL
      16x Pour plus d'informations sur les outils JMRI LocoNet sp&#233;cifiques. Pour de plus amples informations
      sur la fa&#231;on de trouver ces adresses, voir <a href= "Addressing.shtml"> cette page</a>.</li>
  <li>JMRI fournit une vari&#233;t&#233; d'outils concernant LocoNet. Il s'agit principalement de
   permettre la configuration de la fonctionnalit&#233; de l'appareil LocoNet, mais inclure &#233;galement
   certains outils de surveillance d'&#233;tat. Des informations sur ces outils peuvent &#234;tre trouv&#233;es
   &#224; la <a href="LocoNetTools.shtml"> page outils LocoNet&reg;</a>.</li>
</ul>

<h2><a name="Network">Ordinateurs en r&#233;seau et LocoNet &reg;</a></h2>
Il existe plusieurs m&#233;canismes disponibles pour permettre &#224; plusieurs ordinateurs de
communiquer avec LocoNet. Ceux-ci communiquent via des protocoles TCP/IP standard,
et peuvent m&#234;me travailler &#224; distance. Au moins l'un des ordinateurs en r&#233;seau doit avoir une
Interface LocoNet fonctionnelle. Voir <a href="LocoNetworking.shtml"> cette page</a>
pour plus d'informations.

<h2><a name="Debugging"></a>D&#233;bogage</h2>
<ul>
   <li>Lorsque vous utilisez le LocoBuffer ou LocoBuffer-II, assurez-vous que les pr&#233;f&#233;rences 
		JMRI pour la connexion sont configur&#233;s pour utiliser la m&#234;me vitesse de transmission 
		 le LocoBuffer ou LocoBuffer-II.</li>
   <li>Sur les ordinateurs Windows O/S, assurez-vous que la connexion JMRI est configur&#233;e pour utiliser le port COM correct. Utiliser le 
		Gestionnaire de p&#233;riph&#233;riques" Windows pour vous aider &#224; d&#233;terminer le port COM de votre interface utilise, puis v&#233;rifier
		que JMRI est configur&#233; pour utiliser ce port COM.</li>
   <li> Sur les plateformes Windows, l'affectation du port COM peut changer si l'interface mat&#233;riel est d&#233;plac&#233; d'un port USB sur 		
		l'ordinateur &#224; un autre port USB. &#201;vitez de changer la fa&#231;on dont votre interface LocoNet-ordinateur est connect&#233;e &#224; 
		l'ordinateur.</li>
   <li>Sur les plateformes Windows, l'affectation du port COM peut changer si l'interface
    	 mat&#233;riel est connect&#233;e via un concentrateur USB. Au d&#233;marrage de Windows, l'ordinateur
     	peut attribuer diff&#233;rents num&#233;ros de port COM pour les appareils en aval d'un concentrateurs USB, m&#234;me
     	si tout le mat&#233;riel USB connect&#233; dans le syst&#232;me n'a pas &#233;t&#233; chang&#233;.
     	Evitez de brancher votre mat&#233;riel LocoNet &#224; un ordinateurs en aval d'un concentrateur.
     	Notez qu'un &#233;cran d'ordinateur qui dispose de connecteurs USB, et qui est
     	connect&#233; &#224; un PC via un c&#226;ble USB est consid&#233;r&#233; comme ayant un hub USB int&#233;gr&#233;.</li>
   <li>Certains appareils PR3 ont &#233;t&#233; livr&#233;s avec des c&#226;bles USB de mauvaise qualit&#233;. Ces c&#226;bles 
		ont &#233;t&#233; connus pour provoquer un &#233;chec de communication 
		avec le PR3 ou d'avoir une communication intermittente. Les utilisateurs 	
		devraient remplacer le c&#226;ble USB original de la PR3.</li>
</ul>
  
<h4><a name="ErraticReadback">Non fonctionnement ou Relecture irr&#233;guliere des CVs</a></h4>
    <ul>
    <li>Certains d&#233;codeurs embarqu&#233;s permettent seulement une bonne relecture des valeurs du CV quand il
       	y a une charge &#233;lectrique suffisante reli&#233;e &#224; la connexion F0F (projecteur avant) ou aux connexions de sortie moteur. Cela 
		signifie qu'une lampe &#224; incandescence ou LED est bien branch&#233;e sur la connexion du projecteur avant
        et qu'elle fonctionne. D'autres d&#233;codeurs mobiles ne fourniront pas de relecture correcte CV quand un moteur est reli&#233; aux connexions 
		moteur du d&#233;codeur embarqu&#233;. Consultez la documentation de votre d&#233;codeur pour d&#233;terminer quelles connexions sont 
		n&#233;cessaires pour permettre la bonne relecture des CVs.</li>
   <li>Certains mat&#233;riels Digitrax sont capable de r&#233;ussir des op&#233;rations de lecture et d'&#233;criture de CV sur certains d&#233;codeurs 
		embarqu&#233;s mais est incapable de lire et/ou d'&#233;crire des CV de mani&#232;re fiable 
        pour les autres d&#233;codeurs mobiles. Ce probl&#232;me est plus &#233;vident avec les
         d&#233;codeurs sonores de certains fabricants. Quelques suggestions sont list&#233;s ici.
         <ul>
		       <li>Lorsque vous utilisez une Zephyr (DCS50) ou Zephyr Xtra (DCS51), activez sa
             Fonction de programmation "Blast Mode". Cela permettra souvent des 
             &#233;criture correctes de valeurs de CV dans les d&#233;codeur mobiles.</li>
           <li> "programmation sur la voie principale" peut permettre &#224; une Chief (ou DCS100 DCS200) 
            d'&#233;crire correctement les valeurs CV difficiles dans les d&#233;codeur mobile.</li>
           <li> Un booster , tels que le <i>Soundtraxx</i>
             <b>PTB-100</b> ou le <i>DCC Sp&#233;cialies</i> <b>Power Pax</b>
             peuvent souvent &#234;tre utilis&#233;es entre la centrale de programmation et la voie 
             pour permettre avec succ&#232;s une
             lecture et &#233;criture de CV sur les d&#233;codeurs mobiles qui ne
             permettent pas la relecture sur une voie de programmation reli&#233;e directement au mat&#233;riel de programmation.</li>
           <li> Certains utilisateurs de PR3 rapportent que la programmation PR3 peut avec
             succ&#232;s lire et programmer les d&#233;codeurs sonores lorsque le PR3 est
             aliment&#233; par une alimentation 18VDC au lieu d'une alimentation plus faible tels que le PS12 ou PS14.</li>
         </ul>
        </li>
      </ul>

    <a name="TurnoutCmdHandling"></a><h4>Command Station Turnout Command Rejection
    and JMRI Turnout Command Handling</h4>
     <p>Les centrales de commande Digitrax passent des messages LocoNet de commande de commutation sur
       signal de la voie DCC afin que les d&#233;codeurs d'accessoires connect&#233;s &#224; la voie peuvent
       recevoir les commandes de commutation. Les stations de commande Digitrax semblent stocker
       les demandes de commutation et les transmettre au signal de Voie DCC d'une mani&#232;re
       qui n'ait pas un impact notable sur la r&#233;ponse du d&#233;codeur mobile
       aux commandes du R&#233;gulateur. Ce tampon est limit&#233;, et en raison
       d'un trafic de commande de commutation LocoNet pouvant &#234;tre important, peut d&#233;border.
       Lorsque cela arrive, la station de commande r&#233;pond avec un message
       (a \ &lt;LONG_ACK\&gt; opcode) en disant qu'il a rejet&#233; (ne pas accepter) la commande de commutation. Lorsque la centrale de commande nous donne la r&#233;ponse, la commande de commutation est pas plac&#233;e dans la m&#233;moire tampon et est oubli&#233;e.<br>
     Cela peut &#234;tre probl&#233;matique, en fonction de la r&#233;ponse au message de rejet LocoNet de l'appareil qui a envoy&#233; la
       commande de commutation. De nombreux dispositifs LocoNet ne remarquent pas le message de rejet, il ne faut
       pas essayer d'envoyer &#224; nouveau la commande de commutation. D'autres dispositifs de LocoNet
       peuvent pr&#234;ter attention au message de rejet et peuvent attendre un certain temps avant de
       r&#233;-envoyer le message. Certains appareils LocoNet peuvent &#234;tre programm&#233;s pour soit
       envoyer &#224; nouveau la commande de de commutation si le message de rejet est consid&#233;r&#233;, soit ne pas renvoyer si le message de rejet est per&#231;ue.<br>
       Cette grande vari&#233;t&#233; de comportements peut provoquer une r&#233;action incompatible ou peu fiable
       de l'&#233;quipement qui prend en charge les messages des d&#233;codeurs d'accesoires connect&#233;s &#224; la voie . Notez que cela peut inclure des dispositifs connecter &#224; LocoNet et qui contr&#244;le le signal DCC de la voie qui
       est disponible sur les fils de "RailSync LocoNet".</p>

   <ul>
     <li>JMRI dispose de plusieurs m&#233;canismes pour aider &#224; g&#233;rer ces demandes de commutation LocoNet temporaire
      dans le tampons surcharg&#233;. Ces m&#233;canismes sont contr&#244;l&#233;s par l'option "Turnout 
      Command Handling" pour chaque connexion bas&#233;e sur LocoNet. Les quatre options "Turnout 
      Command Handling" de Traitement des commandes sont d&#233;crites ci-dessous.
     <ul>
      <li>Normal - Le r&#233;glage par d&#233;faut, est recommand&#233; pour la grande majorit&#233; des r&#233;seaux.
       Dans ce mode de fonctionnement, JMRI va rapidement r&#233;essayer la derni&#232;re
       Commande de commutation LocoNet apr&#232;s que la centrale de commande ait envoy&#233; un message de rejet, et continuera &#224; r&#233;p&#233;ter la commande jusqu'&#224; ce qu'une commande de commutation soit accept&#233;e par la centrale de commande.
       Ces nouvelles tentatives peuvent provoquer un niveaux extr&#234;mement &#233;lev&#233; de l'activit&#233; sur LocoNet.</li>
      <li>Spread - Ce mode est le m&#234;me que "Normal", d&#233;crit ci-dessus, sauf que
       JMRI ajoute une temporisation suppl&#233;mentaire entre les commandes de commutation qu'il
       envoie &#224; LocoNet. Cela devrait r&#233;duire les probabilit&#233;s que les commandes JMRI provoqueraient un d&#233;bordement du Tampon de commande de commutation de la centrale Digitrax, mais n'a pas d'effet sur les autres appareils LocoNet qui g&#233;n&#232;rent les commandes de commutations LocoNet. Le m&#233;canisme de relance d&#233;crit ci-dessus pour le mode "Normal"
       est activ&#233;.</li>
	   <li>Unefois seulement - Cela d&#233;sactive le m&#233;canisme de relance de JMRI pour les commandes de
           commutation rejet&#233;es. JMRI va pas renvoyer les messages LocoNet de commande de commutation. La
           temporisation entre deux envois de commandes de commutation de JMRI &#224; LocoNet est le m&#234;me
           qu'en mode "Normal".</li>
      <li> Deux fois - Cette option d&#233;sactive &#224; la fois le m&#233;canisme JMRI de relance des commandes
          rejet&#233;es et augmente le d&#233;lai entre deux commandes de commutation envoy&#233;es par JMRI &#224;
          LocoNet.</li>
    </ul>
    Ces options ne prendronts effet qu'apr&#232;s l'enregistrement des pr&#233;f&#233;rences et le red&#233;mmarage de JMRI.<br>
    Aucune de ces options ne peut <i>garantir</i> que
    <i> tous</i> les messages LocoNet de commutation <i>seront</i> transmis au signal DCC de la voie.
    </li>

    <li><a name="alternatives">Strat&#233;gies d'&#233;vitement</a>
    <ul>
        <li>Certains utilisateurs peuvent &#234;tre en mesure de r&#233;duire les probabilit&#233;s pour ce probl&#232;me en autorisant
       le mat&#233;riel de signalisation &#224; g&#233;n&#233;rer les aspects des signaux clignotants au lieu de programmer
       JMRI pour envoyer s&#233;quentiellement des messages "ON" et "OFF" pour le mat&#233;riel de signalisation.<br>
        D'autres utilisateurs qui n'ont pas <i>tout</i> le mat&#233;riel contr&#244;l&#233;s par des messages de d&#233;codeurs d'accessoires par l'envoi de messages sur le signal DCC de la voie (ou sur les fils du c&#226;ble RailSync de LocoNet) peuvent d&#233;cider d'emp&#234;cher la centrale de commande de transmettre <i>tout</i> les message LocoNet de commande de commutation au signal DCC de la voi (et fils de RailSync) en permettant "le bit Bushby" de la station de commande.
       Voir l'outil JMRI LocoNet de <a href="../../../package/jmri/jmrix/loconet/cmdstnconfig/CmdStnConfigFrame.shtml">
       Configuration de la centrale de commande</a>.
       </li>
	  <li>Une bonne fa&#231;on d'&#233;viter ce probl&#232;me est d'emp&#234;cher la centrale Digitrax de recevoir les messages LocoNet de commande de commutation. Cela peut se faire en utilisant uniquement des dispositifs qui envoient et/ou re&#231;oivent des messages de commande de commutation via le bus de donn&#233;es LocoNet, et de mettre en oeuvre un LocoNet <i>autonome</i> pour une utilisation par ces dispositifs. Ce LocoNet autonome peut &#234;tre reli&#233; s&#233;par&#233;ment &#224; JMRI de sorte que JMRI puisse acc&#233;der &#224; la centrale de commande,
       r&#233;gulateurss, horloge rapide, et d'autres ressources via une connexion LocoNet,
       et des signaux d'acc&#232;s et de branchements via une autre connexion LocoNet.
       Cela n&#233;cessite un adaptateur LocoNet distinct pour chaque connexion.<br>
       Voir <a href="StandaloneLocoNet.shtml"> LocoNet&reg; Autonome</a> pour
       arri&#232;re-plan, des id&#233;es et des suggestions pour la mise en oeuvre d'un LocoNet Autonome.</li>
    </ul></li>
    <li><a name="cmdStationTrkPwrOff"> Rejet Commande Aiguillage quand l'alimentation de la voie est coup&#233;e</a>
		<p>Certaines stations de commande Digitrax plus r&#233;centes refuseront d'accepter la commutation	
			lorsque l'alimentation est coup&#233;e. Cela peut provoquer une "avalanche" 
			de messages de commutationss r&#233;p&#233;t&#233;s sur LocoNet si l'alimentation de la 
			voie est d&#233;sactiv&#233;e lorsque des messages de commutation sont envoy&#233;s. Ce probl&#232;me peut &#234;tre &#233;vit&#233; 
			en s'assurant que l'alimentation de la voie est allum&#233;e lorsque des messages de commutation doivent &#234;tre envoy&#233;s.</p>
    </li>
    <li><a name="multConnTurnoutReject">Rejet Commande Aiguillage et multiple connexions LocoNet Actives</a>
		<p>Quand JMRI a de multiple connexions &#224; un simple LocoNet, il peut
			&#234;tre n&#233;c&#233;ssaire de tout configurer sauf une des connexions 
			actives pour le type "Turnout Command Handling" de "Only One", avec 
			une connexion LocoNet active configur&#233;e pour l'un des autres types
			"Turnout Command Handling". Sinon, les diff&#233;rentes instances 
			de connexion JMRI LocoNet pourraient tenter de r&#233;soudre de mani&#232;re 
			ind&#233;pendante les messages des aiguillages  qui ont &#233;t&#233; rejet&#233;s par la centrale. 
			Cela pourrait entra&#238;ner une avalanche de nouvelles tentatives de commande d'aiguillage sur LocoNet.
			De mani&#232;re similaire, quand de multiples instances JMRI travaillent avec le m&#234;me 
			LocoNet, seul une des connexions JMRI &#224; LocoNet doit &#234;tre configur&#233;e pour le type
			"Turnout Command Handling" autre que "Only One". Sinon, les diff&#233;rentes instances 
			de connexion JMRI LocoNet pourraient tenter de r&#233;soudre de mani&#232;re 
			ind&#233;pendante les messages des aiguillages  qui ont &#233;t&#233; rejet&#233;s par la centrale. 
			Cela pourrait entra&#238;ner une avalanche de nouvelles tentatives de commande d'aiguillage sur LocoNet.
</li>
</ul>

<a name="SeeAlso"></a><h2>Documentation</h2>
<h3>Aide JMRI</h3>
	<p>JMRI fournit un support sp&#233;cifique pour une vari&#233;t&#233; de Digitrax et de
     Mat&#233;riel tierce partie bas&#233; sur LocoNet, ainsi qu'une vari&#233;t&#233; d'outils pour configurer
	le mat&#233;rile LocoNet.<br>
	Quelques liens
<ul>
   <li> Ordinateurs vers les Interfaces mat&#233;rielles LocoNet&reg; 
     <ul>
 		<li><a href="LocoBufferUSB.shtml">RR-CirKits LocoBuffer-USB</a></li>
      	<li><a href="LocoBufferII.shtml">RR-CirKits LocoBuffer-II</a></li>
     	<li><a href="LocoBuffer.shtml">LocoBuffer</a></li>
      	<li><a href="PR3.shtml">Digitrax PR3</a></li>
     	<li><a href="PR2.shtml">Digitrax PR2</a></li>
		<li><a href="BTLocoBridge.shtml">Bluetooth LocoBridge</a></li>	
     	<li><a href="MS100.shtml">Digitrax MS100</a>( Fortement d&#233;conseill&#233;)</li>
  
    </ul>
  </li>
 
  <li><a href="LocoNetTools.shtml">Outils pour les &#233;quipements LocoNet&reg; </a></li>
<li> Outils relatifs &#224; LocoNet
    <ul>
      <li><a href="../../../package/jmri/jmrix/loconet/locomon/LocoMonFrame.shtml">Moniteurr LocoNet</a></li>
      <li><a href="../../../package/jmri/jmrix/loconet/slotmon/SlotMonFrame.shtml">Moniteur Slots</a></li>
      <li><a href="../../../package/jmri/jmrix/loconet/clockmon/ClockMonFrame.shtml">Moniteur Horloge</a></li>
      <li><a href="../../../package/jmri/jmrix/loconet/locostats/LocoStatsFrame.shtml">Moniteurr Statistiques LocoNet</a></li>
      <li><a href="../../../package/jmri/jmrix/loconet/bdl16/BDL16Frame.shtml">Configuration de BDL16x</a></li>
      <li><a href="../../../package/jmri/jmrix/loconet/ds64/DS64Frame.shtml">Configuration de DS64</a></li>
      <li><a href="../../../package/jmri/jmrix/loconet/pm4/PM4Frame.shtml">Configuration de PM4x</a></li>
      <li><a href="../../../package/jmri/jmrix/loconet/se8/SE8Frame.shtml">Configuration de SE8C</a></li>
      <li><a href="../../../package/jmri/jmrix/loconet/locoio/LocoIOFrame.shtml">Configuration de LocoIO</a> (d&#233;sapprouv&#233;, utilisez <a href="../../apps/DecoderPro/index.shtml">DecoderPro</a>)</li>
      <li><a href="../../../package/jmri/jmrix/loconet/cmdstnconfig/CmdStnConfigFrame.shtml">Configuration de la centrale </a></li>
      <li><a href="../../../package/jmri/jmrix/loconet/locoid/LocoIdFrame.shtml">Configuration de LocoNet ID</a></li>
      <li><a href="../../../package/jmri/jmrix/loconet/duplexgroup/DuplexGroupTabbedPanel.shtml">Configuration de Duplex Group</a></li>
      <li><a href="../../../package/jmri/jmrix/loconet/swing/throttlemsg/MessageFrame.shtml">Envoi de Message R&#233;gulateur</a></li>
      <li><a href="../../../package/jmri/jmrix/loconet/locogen/LocoGenFrame.shtml">Envoi de paquet LocoNet</a></li>
      <li><a href="../../../package/jmri/jmrix/loconet/pr3/swing/Pr3Select.shtml">S&#233;lectionner Mode PR3</a></li>
      <li><a href="../../../package/jmri/jmrix/loconet/downloader/LoaderFrame.shtml">T&#233;l&#233;charger le Firmware</a></li>
      <li><a href="../../../package/jmri/jmrix/loconet/soundloader/LoaderFrame.shtml">T&#233;l&#233;charger des Sons</a></li>
    </ul>
  </li>
   <li>autres Centrales
   <ul>
        <li><a href="Fleischmann.shtml">Fleischmann Twin Centre</a></li>
        <li><a href="Uhlenbrock.shtml">Uhlenbrock Command Station</a></li>
   </ul>
</li>

<li>Autres informations relatives &#224; LocoNet et fonctions

    <ul>
      <li><a href="Addressing.shtml">Adressage JMRI </a> Des aiguillages, capteurs, et z&#244;nes de transpondage de LocoNet&reg; </li>
      <li><a href="LocoNetSim.shtml">Simulateur LocoNet&reg;</a></li>
      <li><a href="LocoNetClasses.shtml">Structure de Haut Niveau JMRI pour l'Interfa&#231;age LocoNet&reg;</a></li>
      <li><a href="LocoNetworking.shtml">Connection de Multiple Ordinateurs &#224; un r&#233;seau LocoNet&reg;</a>
        <ul>
        <li><a href="LbServer.shtml">Connection de Multiple Ordinateurs &#224; LocoNet&reg; via LBServer</a></li>
        <li><a href="LocoNetServer.shtml">Connection de Multiple Ordinateurs &#224; LocoNet via LocoNet&reg; Server</a></li>
        </ul>
      </li>
      <li>Une &#233;tude technique ax&#233;e sur <a href="DigitraxPower/index.shtml">les questions d'alimentation</a> dans certains produits Digitrax</li>
      <li><a href="StandaloneLocoNet.shtml">LocoNet Autonome</a></li>
    </ul>
  </li>  
</ul>

<p>LocoNet&reg; est une marque d&#233;pos&#233;e de <a href="http://www.digitrax.com">Digitrax, Inc.</a></p>

<!--#include virtual="/Footer" -->
 </div><!-- closes #mainContent-->
</div> <!-- closes #mBody-->
</body>
</html>
