<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01//EN" "http://www.w3.org/TR/html4/strict.dtd">
 <!--Updated by Herv&#233; Blorec  2017-01-29-->
<html lang="fr">
<head>
 <title>JMRI Hardware Support - Multiple Computers to LocoNet&reg; via LbServer</title>
    <meta name="author" content="Bob Jacobsen">
    <meta name="keywords" content="Digitrax Chief DCS Command Station LocoNet Server LocoBuffer java model railroad JMRI install windows">

<!-- Style -->
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<link rel="stylesheet" type="text/css" href="/css/default.css" media="screen">
<link rel="stylesheet" type="text/css" href="/css/print.css" media="print">
<link rel="icon" href="/images/jmri.ico" type="image/png">
<link rel="home" title="Home" href="/">
<!-- /Style -->
</head>

<body>
<!--#include virtual="/Header" -->
<div id="mBody">
    <!--#include virtual="Sidebar" -->
    <div id="mainContent">

      <h1>Supporte Mat&#233;riel: Connexion de multiples ordinateurs &#224; LocoNet&reg; via LbServer</h1>

Cette page d&#233;crit comment configurer plusieurs n&#339;uds JMRI pour la connexion
clients &#224; un seul
<a href="http://loconetovertcp.sourceforge.net">LbServer LocoNetOverTCP </a>,
qui &#224; son tour est reli&#233; au r&#233;seau ferr&#233;.
<p>
Cette connexion, appel&#233; LocoNetOverTCP, utilise un processus serveur non-Java s&#233;par&#233;
LbServer, qui communique avec des messages sous forme de cha&#238;nes ASCII simples sur sockets TCP/IP,
permettant &#224; des n&#339;uds non-Java de partager aussi le LocoBufer.

<h2>Configuration pour JMRI LocoNetOverTCP</h2>
Un ordinateur ex&#233;cute le programme LbServer qui se connecte &#224; LocoBuffer
et agit comme un serveur pour tous les ordinateurs client JMRI.
Configurez les ordinateurs clients JMRI pour se connecter au LbServer comme suit:
<ul>
<li> Assurez-vous que LbServer est configur&#233; et fonctionne. Voir la documentation LbServer pour plus de d&#233;tails.
<li> Ouvrez le programme JMRI sur le client
<li> Ouvrez les pr&#233;f&#233;rences dans le menu Edition
<li> Pour la connexion r&#233;seau ferr&#233;, s&#233;lectionnez "LbServer LocoNetOverTCP"
<li> Dans la bo&#238;te «serveur hostname" qui appara&#238;t, tapez le nom d'Internet
ou l'adresse de l'ordinateur qui ex&#233;cute l'LbServer.
Une adresse Internet est quelque chose comme 127.0.1.12; un nom est quelque chose
comme jmri.org
<li> Dans la bo&#238;te "TCP Port Number" entrez le num&#233;ro de port que LbServer utilise, qui par d&#233;faut est 1234.
<li> Enregistrer les pr&#233;f&#233;rences et red&#233;marrer le programme.
</ul>

<h2>Notes:</h2>
<ul>
<li>Il est fortement recommand&#233; que vous vous connectiez l'ordinateur ma&#238;tre
&#224; LocoNet&reg; avec un LocoBuffer ou LocoBuffer-II. Bien qu'un MS-100 pourrait
faire essentiellement le travail pour cette application, la correction des erreurs occasionnelles r&#233;sultant de LocoNet 
 peuvent entra&#238;ner des retards notables dans l'actualisation des ordinateurs distants.
<li>
Si les ordinateurs sont tous proches de la LocoNet&reg;, par exemple agissant comme un panneau de commande local
, vous n'avez pas vraiment besoin de Server LocoNet pour ce faire. Vous pouvez, &#224; la place
relier chacun des ordinateurs &#224; la LocoNet via leurs propres LocoBuffer ou LocoBuffer-II
(ou MS-100,m&#234;me si ce n'est pas recommand&#233;) et prennent part individuellement
dans les communications LocoNet. Cela ne cause pas de charge suppl&#233;mentaire de communication.
Il en co&#238;te un peu plus en raisons des cartes suppl&#233;mentaires, et ne vous permettent pas de
mettre un ordinateur distant &#224; partir du r&#233;seau ferr&#233;.
<li> L'ordinateur ex&#233;cutant LbServer peut &#233;galement ex&#233;cuter le logiciel JMRI, dans ce
cas, le client et serveur se trouvent &#234;tre sur le m&#234;me n&#339;ud.
<li> Certains logiciels pare-feu d&#233;tectent l'utilisation du port 1234 par LbServer comme un cheval de Troie et bloquent l'acc&#232;s au port.
Pour contourner ce probl&#232;me, vous aurez soit &#224; permettre l'acc&#232;s par votre logiciel pare-feu ou de changer le port par
un autre num&#233;ro, comme  9999. Le nouveau num&#233;ro de port devra aussi &#234;tre pass&#233; dans LbServer comme une option de ligne de commande.

</ul>
<p>LocoNet&reg; est une marque d&#233;pos&#233;e de <a href="http://www.digitrax.com">Digitrax, Inc.</a></p>
 </div>
  </div>
</body>
</html>
