<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01//EN" "http://www.w3.org/TR/html4/strict.dtd">
<!-- Updated by Blorec Herv&#233;  2017-01-30-->
<html lang="fr">
<head>
 <title>JMRI Hardware Support - LocoBuffer-II to LocoNet&reg;</title>
    <meta name="author" content="Bob Jacobsen">
    <meta name="keywords" content="Digitrax Chief DCS Command Station MS-100 LocoBuffer java model railroad JMRI install windows">

<!-- Style -->
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<link rel="stylesheet" type="text/css" href="/css/default.css" media="screen">
<link rel="stylesheet" type="text/css" href="/css/print.css" media="print">
<link rel="icon" href="/images/jmri.ico" type="image/png">
<link rel="home" title="Home" href="/">
<!-- /Style -->
</head>

<body>
<!--#include virtual="/Header" -->
<div id="mBody">
    <!--#include virtual="Sidebar" -->
    <div id="mainContent">

      <h1>Support Mat&#233;riel: Connexion d'un LocoBuffer II &#224; LocoNet&reg;</h1>

<p>
Le  LocoBuffer II offre un moyen tr&#232;s fiable pour
connecter un port s&#233;rie de l'ordinateur &#224; un LocoNet&reg;.
Il a &#233;t&#233; produit par la soci&#233;t&#233;,de Dick Bronson
<a href="http://www.rr-cirkits.com"> RR-CirKits </a>
, bas&#233; en partie sur la conception LocoBuffer originale, mais est
actuellement en rupture de production. Vous pourriez &#234;tre en mesure d'en trouver un
dans un magasin de mod&#233;lisme local. Il a &#233;t&#233; remplac&#233;
par le
<a href="LocoBufferUSB.shtml"> LocoBuffer-USB </a>,
qui utilise une connexion USB.
</p>

<h2>Configuration conseill&#233;e</h2>
<p>
La configuration recommand&#233;e pour le LocoBuffer II est:</p>
<ul>
<li> 19200 bauds
    <li>RS-232 echo off</li>
    <li>LocoBuffer mode</li>
    <li>ICSP Program Mode off</li>
    <li>Boot Program Mode off</li>
    <li>Alimentation isol&#233;e (<a href="#locoBufferIIPower">voir ci-dessous</a>)</li>
</ul>
<p>La configuration recommandée de JMRI pour le LocoBuffer-II est:
</p>

<ul>
<li>Mettre tous les commutateurs sur off (vers le c&#244;t&#233; avant de l'&#233;tiquette ).
<li>Connecter le LocoBuffer-II &#224; une source d'alimentation appropri&#233;e, par exemple
une alimentation chargeur de batterie  de la tension correcte
<li>
D&#233;marrer DecoderPro ou les autres programmes et les configurer pour :
<ul>
<li>LocoNet LocoBuffer-II
<li>S&#233;lectionnez votre port
<li>19,200 baud ou 57,600 baud, pour correspondre au r&#233;glage des options par le switch interne de LocoBuffer-II
<li>Contr&#244;le de flux mat&#233;riel
</ul>
</ul>

<h2>Test de Boucle</h2>
<p>
Le circuit d'entr&#233;e LocoBuffer-II et le code lus effectivement depuis le jack de sortie LocoNet
, donc si vous installez le terminateur LocoNet
(le petit circuit qui a &#233;t&#233; livr&#233; avec le II LocoBuffer II )
et mettre SW7-8 &#224; ON (en bas) afin que le circuit d'entr&#233;e tire son alimentation du bloc alimentation,
 alors vous avez cr&#233;&#233; un test de bouclage. La seule chose qui n'est pas
test&#233;e est la prise LocoNet elle-m&#234;me.
</p>

<p>
&#233;tapes:
<ol>
    <li> D&#233;branchez le c&#226;ble LocoNet
    <li> Bo&#238;tier ouvert (utiliser un petit tournevis pour travailler les loquets dans les petites fentes sur les c&#244;t&#233;s)
    <li> Installez le terminateur
    <li> Mettre sw 7-8 sur On, tous les autres commutateurs sur OFF
    <li> D&#233;finissez les options JMRI LocoBuffer &#224; 19200 bauds et le mat&#233;riel
    handshake autoris&#233;
    <li> Ouvrez la fen&#234;tre Moniteur JMRI LocoNet .
    <li> En utilisant JMRI envoyer certaines commandes (commandes de commutation, par exemple)
    <li> Les commandes doivent appara&#238;tre dans la fen&#234;tre du moniteur LocoNet et La LED d'activit&#233; LocoBuffer-II doit clignoter
    <li> Retirer le terminateur (&#224; moins que votre application l'exige)
    <li> Restaurer les commutateurs LocoBuffer-II &#224; leurs r&#233;glages normaux pour votre application
</ol>

<h2><a name="locoBufferIIPower">LocoBuffer-II Power</a></h2>

Lorsqu'il est aliment&#233; par une alimentation externe, le LocoBuffer II isole compl&#232;tement
votre ordinateur du LocoNet, supprimant la possibilit&#233;
des courants de terre qui circulent &#224; travers le c&#226;ble LocoNet.
<p>
Si vous utilisez un ordinateur isol&#233;, par exemple un ordinateur portable qui n'est
pas connect&#233; &#224; tous les p&#233;riph&#233;riques, vous pouvez configurer les LocoBuffer II
de sorte qu'il n'a pas besoin d'une alimentation externe. Il recevra alors son
alimentation du c&#226;ble RailSynch dans le LocoNet.
<p>
Il est fortement conseill&#233; que vous obteniez votre connexion &#224; un ordinateur de travail
correctement avec une source d'alimentation externe avant de faire cela. De cette fa&#231;on,
si des probl&#232;mes surviennent lorsque vous essayez d'utiliser l'&#233;nergie interne, vous saurez
ce qui les provoquent et ils seront beaucoup plus facile &#224; diagnostiquer
<p>
Pour configurer LocoBufferII pour "Local Power", emlevezla connexion d'alimentation et r&#233;glez les switches 7 et 8 &#224; ON (vers le bas, vers l'illustration du commutateur).

<p>LocoNet&reg; est une marque d&#233;pos&#233;e de <a href="http://www.digitrax.com">Digitrax, Inc.</a></p>
    </div>
  </div><!--#include virtual="/Footer" -->
</body>
</html>
