<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01//EN" "http://www.w3.org/TR/html4/strict.dtd">
<html lang="fr">
<head>
<!-- Copyright Bob Jacobsen 2008 -->
<!-- $Id$ -->
<!-- UpDated  by Blorec Herv&#233;  2013-09-26-->
<title>JMRI: Scripting Example - Setting Turnouts</title>

<!-- Style -->
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<link rel="stylesheet" type="text/css" href="/css/default.css" media="screen">
<link rel="stylesheet" type="text/css" href="/css/print.css" media="print">
<link rel="icon" href="/images/jmri.ico" TYPE="image/png">
<link rel="home" title="Home" href="/">
<!-- /Style -->
</head>

<body>
<!--#include virtual="/Header" -->

<!--#include virtual="Sidebar" -->
<div id="mainContent">


      <!-- Page Body -->
        <H2>
		JMRI: Scripts pour Aller ... <br>R&#233;glage de l'&#233;tat par D&#233;faut des Aiguillages
        </H2>
de la
		<div class=section>


		    <P>(Exemple contribu&#233; par Jerry Britton)

<p> Mon r&#233;seau, le <a href="http://jbritton.pennsyrr.com/" target=new> Pennsylvania Railroad R&#233;gion de l'Est </a>, pr&#233;sente d&#233;j&#224; plus d'une centaine d'aiguillages, avec davantage &#224; l'avenir. A ce jour et pour un avenir proche, les ade laiguillages ne fournissent pas de r&#233;troaction, c'est une d&#233;pense que je ne suis pas pr&#234;t &#224; assumer.
<p> J'ai d&#233;velopp&#233; des <a href="http://jbritton.pennsyrr.com/control_pan href jels.ws4d" target=new> panneaux PanelPro  </a> pour une paire de dispatcheurs &#224; utiliser pour le contr&#244;le du r&#233;seau. PanelPro interroge les commandes aiguillages via LocoNet (Digitrax syst&#232;me). Les Aiguillages sont actionn&#233;s par des moteurs d'aiguilles Tortoise qui sont contr&#244;l&#233;s par des d&#233;codeurs stationnaires SwitchIt NCE qui surveillent LocoNet pour les commandes.
<p> Le probl&#232;me est, que sans d&#233;tection sur les aiguillages eux-m&#234;mes, chaque fois que PanelPro est ouvert pour la premi&#232;re fois, tous les aiguillages montrent un &#233;tat "?", ce qui signifie que PanelPro ne connait pas leur &#233;tat actuel.</p>
<p> Jusqu'&#224; maintenant, j'ai investi une somme consid&#233;rable de temps &#224; cliquer manuellement sur le r&#233;glage de tous et pour d&#233;finir pour l'&#233;tat de chaque aiguillage,et le mettre dans l'&#233;tat d&#233;sir&#233;. J'ai sugg&#233;r&#233; que le champ &#233;tat par d&#233;faut soit ajout&#233; &#224; la table Aiguillage - et peut-&#234;tre que nous le verrons que dans le futur - mais pour l'instant mon besoin peut &#234;tre satisfait par l'interm&#233;diaire d'un script. Peut-&#234;tre vous en avez besoin d'un, il peut r&#233;pondre aussi &#224; vos besoins. </P>
<p> La raison de cette page web est que je suis un cheminot mod&#233;liste qui utilise JMRI. Notre &#233;quipe de programmation tr&#232;s talentueuse est compos&#233;e de programmeurs qui sont aussi des mod&#233;listes ferroviaires. Quand j'ai demand&#233;: "Comment Je peux faire...", j'ai re&#231;u des informations beaucoup plus que n&#233;cessaires ou souhait&#233;es. Je n'ai aucun int&#233;r&#234;t &#224; devenir un programmeur ou d'apprendre exactement comment il "fonctionne". J'ai juste un besoin que je voudrais voir remplit avec un minimum d'effort. Il a &#233;t&#233; un exemple classique de demander l'heure et d'&#234;tre instruit comment construire une montre! </P>		</div>

		<div class=section>
		    <h2> Le script </h2>

<pre>
class setStartup(jmri.jmrit.automat.AbstractAutomaton):
   def init(self):
     return
    def handle(self):
     self.waitMsec (10000) # temps est en millisecondes
     turnouts.provideTurnout ("1"). setState (DIRECT)
     self.waitMsec (1000)
     turnouts.provideTurnout ("17"). setState (DIRECT) 
     self.waitMsec (1000)
     turnouts.provideTurnout ("9"). setState (DIRECT) &#224; l'utiliser
     self.waitMsec (1000)
     Fausse d&#233;claration # tout est fait, ne pas r&#233;p&#233;ter
setStartup (). start () # cr&#233;ation d'une d'elles, et de lancer son ex&#233;cution </pre>

</Div>

<div class=section>
<h2> Faire usage de l'&#233;criture </h2>

		<p> Vous devriez "copier" et "coller" l'exemple de ce script dans un nouveau document texte. Soyez s&#251;r que le fichier est effectivement enregistr&#233; comme un document texte g&#233;n&#233;rique, et non quelque chose comme un fichier Microsoft Word. Le suffixe du fichier doit &#234;tre ".Py" pour Python, le langage de commande utilis&#233; par JMRI.
		<p> Enregistrer le fichier o&#249; JMRI peut acc&#233;der. J'ai sauver le  mien dans le m&#234;me r&#233;pertoire que mes fichiers PanelPro.
		<p> Il est TR&#232;S IMPORTANT que vous conserviez le formatage du script de la mani&#232;re dont il est fait - avec des onglets principaux. Le langage Python utilise des onglets dans le cadre de sa structure de commande.de la
		<p> Cette premi&#232;re partie du script que vous devriez inclure "telle quelle". Aucune modification n'est n&#233;cessaire: </p>

<pre>

  Class setStartup(jmri.jmrit.automat.AbstractAutomaton):
  def init (self): 
     return
   def handle(self):
     self.waitMsec (10000) # temps est en millisecondes
  </pre>
 		<p> La partie suivante du script est ce que vous devez modifier pour votre propre usage. Voici les commandes pour d&#233;finir l'&#233;tat de trois aiguillages, chacun constitu&#233; de deux lignes.
		<p> La premi&#232;re ligne comprend un certain nombre de citations qui est le nombre de d'aiguillage (d&#233;codeur ID) auquel  vous souhaitez envoyer la commande. L'&#233;tat entre parenth&#232;ses &#224; la fin de la ligne (DIRECTS ou D&#233;VI&#233;S) est la position que vous voulez pour l'aiguillage.
<p> La deuxi&#232;me ligne ajoute un d&#233;lai entre les commandes, en millisecondes. Si vous avez beaucoup d'aiguillages &#224; d&#233;finir, votre alimentation ne serait probablement pas capable de g&#233;rer toutes les commandes d&#233;vi&#233;s  &#224; la fois. Ce d&#233;lai permet aux activations d'&#234;tre &#233;tal&#233;es dans le temps. Des dizaines d'appareils de voie peut &#234;tre r&#233;gl&#233;s sur une p&#233;riode de une minute ou deux. </P>
<p> "coller" plusieurs instances de ces deux commandes en ligne dans votre script comme d&#233;sir&#233;. Vous pouvez &#233;galement ajouter des lignes de commentaires (commen&#231;ant par un "#") afin de documenter des sections de votre mise en page. </P>
<pre>
      turnouts.provideTurnout ("1"). setState (DIRECT)
     self.waitMsec (1000)
     turnouts.provideTurnout ("17"). setState (DIRECT)
     self.waitMsec (1000)turnouts.provideTurnout ("1"). setState (DIRECT)
     self.waitMsec (1000)
     turnouts.provideTurnout ("17"). setState (DIRECT)
     self.waitMsec (1000)</pre>

		    
		    <p> La partie la fermeture du script devrait aussi &#234;tre laiss&#233; "en l'&#233;tat":
<pre>
      return False        # tout est fait, ne pas r&#233;p&#233;ter
setStartup (). start ()    # cr&#233;ation de l'une d'elles, et  lancer son ex&#233;cution <pre>

</div>
		<div class=section>
		    <h2> mise enoeuvre du script </h2>


		<p> Avec une alimentation sur la voie, vous pouvez ex&#233;cuter le script en s&#233;lectionnant Ex&#233;cuter le script &#224; partir du menu du PanelPro JMRI. Il y aura un d&#233;lai avant l'ex&#233;cution du script, mais alors vous verrez vos aiguillage d&#233;vier un par un.
		<p> Vous pouvez &#233;galement s&#233;lectionner le script &#224; ex&#233;cuter automatiquement lorsque PanelPro est lanc&#233; en s&#233;lectionnant le fichier de script dans les pr&#233;f&#233;rences avanc&#233;es. Soyez s&#251;r de l'alimentation disponible avant de lancer PanelPro dans ce cas.


</div>

<div class=section>
Cr&#233;dit <h2> A Qui est D&#251; le Cr&#233;dit </h2>
    
<p> Ma louange sans fin va &#224; tous les d&#233;veloppeurs qui fournissent la communaut&#233; JMRI des mod&#233;lisme ferroviaire. Toutefois, dans le cas rencontr&#233; avec mon besoin de mise en &#233;tat par d&#233;faut d'aiguillages, je tiens &#224; exprimer ma gratitude &#224; "breezlys" de la communaut&#233; JMRI Forum; il a fourni l'exemple de script que, je pense qu'il a interpr&#233;t&#233; et modifi&#233; &#224; partir des exemples de scripts JMRI.
<p> - Page r&#233;dig&#233;e par Jerry Britton, Mars 2006.	</div>

<!--#include virtual="/Footer" -->
</body>
</html>
