# PaletteBundle_fr.properties
# French properties for the jmrit.display.palette package
## Translated by Herv\u00e9 BLOREC <bzh56420@yahoo.fr> le 2014-1-13

# \u00c9tiquettes de l'onglet
Turnout = Aiguillage
Sensor = Capteur
SignalHead =Feu de Signalisation
SignalMast = M\u00e2t de Signalisation
MultiSensor = Multicapteur
Light = Lumi\u00e8re
Memory = M\u00e9moire
Reporter = Rapport
Text = Texte
IndicatorTrack = Indicateur de Voie
IndicatorTO = Indicateur d'Aiguillage

ClearTrack = Effacer
OccupiedTrack = Occup\u00e9e
PositionTrack = Position du Train
AllocatedTrack = Allou\u00e9e
DontUseTrack = Hors service
ErrorTrack = Erreur d'Alimentation

BlockSegment = Segment de Canton
#LeftEndSegment = Extr\u00e9mit\u00e9 Gauche du Segment
#RightEndSegment = Extr\u00e9mit\u00e9 Droite du Segment

block       = Visible
path        = Edition Chemin
hidden      = Cach\u00e9
toArrow     = Fl\u00eache de Sortie
fromArrow   = Fl\u00eache d'Entr\u00e9e 

OccupancySensor = Circuit d'occupation
ErrorSensor = Erreur Capteur
IconSetName=D\u00e9finir Nom de l'Ic\u00f4ne: {0}
#IconName = Nom Ic\u00f4ne :
#editText = Modifier le Texte
LinkName = Panneau ou le Nom de l'URL
ToolTipLink = Entrer lien vers le panneau JMRI ou http URL (facultatif)

# \u00c9tiquettes de touches
CreateNewItem = Ajouter un nouveau \u00c9l\u00e9ment...
ShowIcons = Afficher les Ic\u00f4nes
HideIcons = Masquer les Ic\u00f4nes
ButtonEditIcons = \u00c9diter des Ic\u00f4nes
ButtonShowCatalog = Catalogue d'Ic\u00f4nes 
HideCatalog = Cacher Catalogue
ButtonBackgroundColor=Couleur de fond...
updateButton = M \u00e0 J Panneau
addNewFamily = Ajouter un nouveau jeu d'Ic\u00f4ne
addIcon = Ajouter Ic\u00f4ne
deleteIcon = Supprimer Ic\u00f4ne
createNewFamily = Cr\u00e9er un Jeu d'Ic\u00f4ne
deleteFamily = Supprimer Jeu d'Ic\u00f4ne
ClearSelection = Effacer les Tableaux S\u00e9lectionn\u00e9s 
#leverPosition = Position Levier
LeftRight = clic gauche/droite
UpDown = Cliquez Haut/Bas
ReadMemory = Afficher M\u00e9moire
ReadWriteMemory = Entr\u00e9e Case M\u00e9moire
SpinnerMemory = Compteur m\u00e9moire
ComboMemory = Menu D\u00e9roulant M\u00e9moire
OpenPicklist = Ouvrir Liste de Choix de D\u00e9tecteur
addMissingStatus = Ajouter \u00c9tat Manquant
deleteStatus = Supprimer \u00c9tat
setDefaultIcons = D\u00e9finir Ic\u00f4nes par D\u00e9faut

#title
createNewIconSet = Cr\u00e9er un Nouveau Jeu d'Ic\u00f4nes pour {0}s

dragToPanel = Glissez sur le Panneau
AddToTableTitle = Ajouter un Nouvel \u00c9l\u00e9ment au Tableau
ShowIconsTitle = Afficher les ic\u00f4nes pour {0}
IconFamiliesLabel = Jeux d'Ic\u00f4nes pour {0}:
invisibleIcon = Ic\u00f4ne nvisible 
circuitPaths = Chemins Circuit 

ColorChooser = S\u00e9lecteur Couleur de fond 
PanelColor = Couleur du Panneau de Commande

first = Premier
second = Second
third = Troisi\u00e8me
fourth = Quatri\u00e8me
fifth = Cinqui\u00e8me
sixth = Sixi\u00e8me
seventh = Septi\u00e8me
eighth = Huiti\u00e8me
nineth= Neuvi\u00e8me
tenth = Dixi\u00e8me

FamilyName = Jeu d'Ic\u00f4nes "{0}".
EnterFamilyName = Entrez un nom pour ce jeu d'ic\u00f4nes
NoFamilyName    = Le jeu d'ic\u00f4nes n'a pas de nom. Svp entrez un nom
DuplicateFamilyName = Nom de Famille {0} est d\u00e9j\u00e0 le nom d'un jeu d'ic\u00f4nes pour {1}s.
DuplicatePosition = Le Capteur {0} est d\u00e9j\u00e0 r\u00e9gl\u00e9 sur la position {1}.
NeedPosition = Ce Multicapteurs n\u00e9cessite {0} positions. S\u00e9lectionnez plus de lignes du tableau.
NeedIcon = Ce Multicapteurs n'a que {0} positions. Effacer les s\u00e9lections pour changer l'ordre de position./nPour des Positions suppl\u00e9mentaire, ajouter une autre ic\u00f4ne.
AllFamiliesDeleted = Tout les jeux d'Ic\u00f4nes pour le type {0} ont \u00e9t\u00e9 supprim\u00e9s.
FamilyNotFound = Jeu d'Ic\u00f4ne "{1}" introuvable dans le type "{0}".
#RedX = Rouge X
NoIconName = Veuillez entrer un nom pour l'Ic\u00f4ne:
UnkownFamilyName = Le Jeu d'ic\u00f4nes "{0}" n'est pas connu de la Palette. Voulez-vous le sauvegarder?
DuplicateIconName = Une autre ic\u00f4ne est nomm\u00e9 {0}.
InvalidOccDetector = {0} n'est pas un capteur valide ou d\u00e9tecteur de pr\u00e9sence de OCanton pour indicateur de voie
InvalidErrSensor = {0} n'est pas un nom de capteur d'erreur valide
ShowTrainName = Afficher le Nom du train lorsque occup\u00e9
AllStatus = Le jeu d'ic\u00f4ne  comprend tout les \u00e9tats possibles de la voie
PickStatus = les ic\u00f4nes d'\u00e9tat suivantes sont manquantes. Choisissez ce que vous voulez ajouter.
SelectPathIcons = S\u00e9lectionnez le(s) chemin(s) qui inclut cette ic\u00f4ne

# Instructions
AddToPanel = Pour Ajouter une ic\u00f4ne \u00e0 votre panneau de contr\u00f4le:
PickRowReporter = Pour ajouter un rapport, s\u00e9lectionnez sa rang\u00e9e de le tableau
DragReporter = puis faites glisser le panneau d'affichage ci-dessous dans votre panneau de commande.
DragIconPanel = -- faites glisser une ic\u00f4ne depuis le panneau d'affichage ci-dessous sur votre panneau de commande
DragIconCatalog = -- ou appuyez sur [{0}] et faites glisser une ic\u00f4ne depuis le catalogue vers votre panneau de commande
ToAddDeleteModify = Pour modifier une ic\u00f4ne dans le panneau d'affichage ci-dessous, faites glisser une ic\u00f4ne depuis le catalogue.
ToChangeName = Pour modifier le nom d'une ic\u00f4ne ci-dessous, double-cliquez sur le nom.
ToDeleteIcon = Pour supprimer l'ic\u00f4ne, cliquez sur le nom, puis appuyez sur [{0}].
ToLinkToURL = Pour cliquert sur ce lien {0} pour un autre panneau JMRI ou URL,
enterPanel = - Pour un panneau JMRI, tapez "frame: <nom panneau>" dans le champ en bas.
enterURL = - pour une URL, tapez le lien (c'est \u00e0 dire "http://etc") dans le champ en bas.
ToColorBackground = Pour choisir une couleur de fond: Appuyez sur [{0}]
AddClockToPanel = Faites glisser l'ic\u00f4ne ci-dessous pour ajouter une {0} \u00e0 votre panneau de commande.
nullMemoryIcon = est affich\u00e9 pour l'Affichage Ic\u00f4ne M\u00e9moire lorsque la M\u00e9moire est nulle.
emptyMemoryIcon = Lorsque la m\u00e9moire est une cha\u00eene vide ex: "", l'affichage Ic\u00f4ne M\u00e9moire est vide.
emptyMemoryFix = Lorsque vide, entrez une valeur dans les autres ic\u00f4nes m\u00e9moire pour voir et faites-la glisser.
comboMemory2 = Utilisez la fonction contextuelle [{0}] pour ajouter ou supprimer des \u00e9l\u00e9ments.
comboMemory1 = La zone de liste d\u00e9roulante Ic\u00f4ne M\u00e9moire d\u00e9finit une m\u00e9moire en s\u00e9lectionnant un \u00e9l\u00e9ment dans la liste d\u00e9roulante.
addTextAndAttrs = Saisir du texte et choisir les attributs de l'\u00e9tiquette dans le panneau de pr\u00e9visualisation. Puis

# Infobulles
ToolTipAddToTable = Appuyez sur pour ajouter un nouvel \u00e9l\u00e9ment au tableau ci-dessus
ToolTipShowIcons = Appuyez sur pour afficher les ic\u00f4nes pour le jeu d'ic\u00f4ne actuel
ToolTipEditIcons = Appuyez pour changer les ic\u00f4nes du jeu d'ic\u00f4nes actuel ou pour ajouter et supprimer des jeux d'ic\u00f4nes
ToolTipDragTableRow = Faites glisser une ligne de la table pour ajouter une \u00e9tiquette de l'objet \u00e0 l'\u00e9cran
ToolTipDragSelection = Faites glisser les s\u00e9lections de capteurs du tableau pour ajouter le multicapteur au panneau
ToolTipDragIcon = Faites glisser l'ic\u00f4ne de ce panneau pour l'ajouter au panneau de commande
ToolTipDragCatalog = Faites glisser l'ic\u00f4ne directement \u00e0 partir du panneau de catalogue pour l'ajouter au panneau de commande
ToolTipEnterText = Entrer le texte de l'\u00e9tiquette et appuyez sur la touche Entr\u00e9e
ToolTipDragText = Faites glisser l'\u00e9tiquette \u00e0 partir du panneau de pr\u00e9visualisation pour l'ajouter au panneau de commande
ToolTipSetIconSensor = S\u00e9lectionner des lignes de capteurs dans le tableau dans l'ordre o\u00f9 ces Capteurs devraient se d\u00e9clencher dans le multicapteur.
ToolTipAddFamily = Cr\u00e9er un ensemble d'ic\u00f4nes supplementaires pour cet appareil
ToolTipDeleteFamily = Supprimer ce jeu d'ic\u00f4nes
ToolTipClearSelection = Effacer les lignes s\u00e9lectionn\u00e9es du tableau 
ToolTipAddIcon = Ajouter une autre ic\u00f4ne de votre panneau d'ic\u00f4nes. Entrez un nom pour elle.
ToolTipDeleteIcon = Supprimer une ic\u00f4ne dans votre panneau d'ic\u00f4nes. S\u00e9lectionnez l'ic\u00f4ne \u00e0 supprimer.
ToolTipAddPosition = Ajouter une position Capteur suppl\u00e9mentaire pour ce jeu d'ic\u00f4nes
ToolTipDeletePosition = Supprimer la derni\u00e8re position du Capteur de ce jeu d'ic\u00f4nes
ToolTipEditColor = Choisissez une couleur pour le panneau d'arri\u00e8re-plan
ToolTipCatalog = Ouvrez le catalogue d'ic\u00f4nes  et faites glisser les ic\u00f4nes de l\u00e0 vers le panneau
ToolTipOccupancySensor = Entrez le nom d'un Capteur ou OCanton qui d\u00e9tecte l'occupation de cet \u00e9l\u00e9ment de voie
ToolTipErrorSensor = Entrez le nom du Capteur qui d\u00e9tecte les conditions d'erreur pour cet \u00e9l\u00e9ment de voie
ToolTipPickLists = La liste de s\u00e9lection de tableau affiche un choix de Capteurs ou OCantons faire la d\u00e9tection
ToolTipPickFromTable = S\u00e9lectionnez un \u00e9l\u00e9ment depuis la table et un jeu d'ic\u00f4nes pour mettre \u00e0 jour le panneau
ToolTipPickRowToShowIcon = S\u00e9lectionnez une ligne du tableau pour afficher les ic\u00f4nes de l'\u00e9l\u00e9ment
ToolTipShowTrainName = La section de voie devrait afficher le nom du Train sous le r\u00e9gime de l'Autorisation Restrictive quand il occupe cette section
ToolTipMissingStatus = Rajouter un \u00e9tat de voie pr\u00e9c\u00e9demment supprim\u00e9
ToolTipDeleteStatus = Supprimer un \u00e9tat de voie vous n'allez pas utiliser
ToolTipSelectPathIcons = Cochez les chemins de cette ic\u00f4ne est n\u00e9cessaire pour afficher le chemin.
ToolTipSetDefaultIcons = Changer les ic\u00f4nes par d\u00e9faut du portail par l'ic\u00f4ne de la famille s\u00e9lectionn\u00e9e.

# Cha\u00eenes D\u00e9coration
fixedWidth = largeur fixe
fixedHeight = hauteur fixe
transparentBack = Fond Transparent
sample = \u00c9chantillon
