<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01//EN" "http://www.w3.org/TR/html4/strict.dtd">
<!-- $Id$ -->
<!-- UpDated by Herv&#233; Blorec 2013/10/09-->
<html lang="fr">
<head>
 <TITLE>
      JMRI: Add/Edit Actions
 </TITLE>
    <META http-equiv=Content-Type content="text/html; charset=iso-8859-1">
    <META content="Bob Jacobsen" name=Author>
    <META name="keywords" content="JMRI help Transit Special Actions">

<!-- Style -->
  <META http-equiv=Content-Type content="text/html; charset=iso-8859-1">
  <link rel="stylesheet" type="text/css" href="/css/default.css" media="screen">
  <link rel="stylesheet" type="text/css" href="/css/print.css" media="print">
  <link rel="icon" href="/images/jmri.ico" type="image/png">
  <link rel="home" title="Home" href="/">
<!-- /Style -->
</head>

<body>
<!--#include virtual="/Header" -->
  <div class="nomenu" id="mBody">
    <div id="mainContent">

<H1>Ajouter/&#233;diter Action</H1>
<H2>La fen&#234;tre Ajouter/Modifier Action</H2>

<p>Les <b> <a href="ViewSpecialActions.shtml"> Actions</a></b> sont des t&#226;ches qui
peuvent &#234;tre lanc&#233;es automatiquement comme un train qui traverse en mode automatique
le r&#233;seau. La fen&#234;tre Ajouter/Modifier action (voir ci-dessous pour la version"Ajouter") pr&#233;voit
la cr&#233;ation d'actions nouvelles et pour l'&#233;dition des actions en cours. La version  «Modifier»
 de cette fen&#234;tre est la m&#234;me que celle montr&#233;e ci-dessous, &#224; l'exception du bouton <b>Cr&#233;er
Nouvelle action</b> qui est est remplac&#233; par un bouton <b>Mise &#224; Jour Action</b>et les
s&#233;lections et donn&#233;es sont remplies par les valeurs actuelles de l'action en cours
d'&#233;dition.</p>
<img src="AddEditAction.jpg" height="236" width="307"></li>
<p>Une action est d&#233;finie en sp&#233;cifiant <b>Quelle</b> action est demand&#233;e et
 <b>Quand</b>l'action doit &#234;tre engag&#233;e.</p>
<p>Pour sp&#233;cifier la partie <b> Quand</b>, s&#233;lectionnez une option dans le menu contextuel
 <b>Quand</b>, et  remplir toutes les donn&#233;es qui pourraient &#234;tre n&#233;cessaires. Les Champs d'&#233;l&#233;ment de donn&#233;es ou de menus appara&#238;tront lorsque l'&#233;l&#233;ment qui en a besoin est s&#233;lectionn&#233;. Chaque &#233;l&#233;ment de donn&#233;es est fourni
avec une description textuelle (bulle d'aide) qui peut &#234;tre appel&#233;e en pointant le curseur sur
l'&#233;l&#233;ment. Chaque option <b>Quand</b> est d&#233;crite plus en d&#233;tail dans
 <b> <a href="ViewSpecialActions.shtml"> Actions</a></b>.</p>
<p>Un retard optionnel, sp&#233;cifi&#233; en millisecondes, est disponible pour chaque option <b>Quand</b>
. Aucun retard est un d&#233;faut. Si un d&#233;lai optionnel n'est pas entr&#233; (ou un
temporisation  z&#233;ro est entr&#233;e), l'action sera lanc&#233;e imm&#233;diatement apr&#232;s le
<i>quand</i> l'&#233;v&#233;nement se soit produit. Si un d&#233;lai est sp&#233;cifi&#233;, le programme attendra
pendant le temps sp&#233;cifi&#233; apr&#232;s le <i>quand</i> l'&#233;v&#233;nement se soit produit avant d'initier l'action.</p>
 <p>Pour sp&#233;cifier <b>Quelle</b> action est demand&#233;e, s&#233;lectionner une option dans le menu contextuel <b> Quelle</b>
, et  remplir toutes les donn&#233;es qui pourraient &#234;tre n&#233;cessaires. Les Champs d'&#233;l&#233;ment de donn&#233;es
appara&#238;tront lorsque l'&#233;l&#233;ment qui en a besoin est s&#233;lectionn&#233;. Chaque &#233;l&#233;ment de donn&#233;es est fourni
avec une description textuelle (bulle d'aide) qui peut &#234;tre appel&#233;e en pointant le curseur sur
l'&#233;l&#233;ment. Chaque <b> Quelle</b> action est d&#233;crite plus en d&#233;tail dans
 <b> <a href="ViewSpecialActions.shtml"> Actions</a></b>.</p>

<p>Quand l'action est compl&#232;tement d&#233;finie cliquez sur le bouton <b>Cr&#233;er une Nouvelle
Action</b> (ou le bouton <b>Mise &#224; Jour Action</b> si &#233;dition en cours). Toutes les donn&#233;es n&#233;cessaires
seront valid&#233;es. Si un probl&#232;me est d&#233;tect&#233;, un message appara&#238;tra, et
la fen&#234;tre Ajouter/&#233;diter Actions restera pour permettre la correction du probl&#232;me. Si
tout est v&#233;rifi&#233;, la fen&#234;tre Ajouter/&#233;diter action va dispara&#238;tre et les actions(nouvelles ou
modifi&#233;es) appara&#238;tront dans la fen&#234;tre <b>Voir Actions</b>.</p>

<p> Cliquez sur le bouton <b>Annuler</b> pour refermer la fen&#234;tre Ajouter/Modifier l'Action, sans
cr&#233;er une nouvelle action ou sans achever le montage d'une action existante
. La fermeture de la fen&#234;tre Ajouter/Modifier l'Action &#233;quivaut &#224; cliquer sur le bouton 
 <b>Annuler</b>.</p>




<!--#include virtual="/Footer" -->
</body>
</html>

