<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01//EN"
"http://www.w3.org/TR/html4/strict.dtd">
<!-- $Id$ -->
<!-- UpDated by Herv&#233; Blorec 2013-10-10-->

<html lang="fr">
<head>
  <meta name="generator" content=
  "HTML Tidy for Mac OS X (vers 31 October 2006 - Apple Inc. build 15.17), see www.w3.org">

  <title>JMRI: Cantonk Table Help</title>
  <meta http-equiv="Content-Type" content=
  "text/html; charset=us-ascii">
  <meta content="Bob Jacobsen" name="Author">
  <meta name="keywords" content="JMRI help Memory Table">
  <!-- Style -->
  <meta http-equiv="Content-Type" content=
  "text/html; charset=us-ascii">
  <link rel="stylesheet" type="text/css" href="/css/default.css"
  media="screen">
  <link rel="stylesheet" type="text/css" href="/css/print.css"
  media="print">
  <link rel="icon" href="/images/jmri.ico" type="image/png">
  <link rel="home" title="Home" href="/"><!-- /Style -->
</head>

<body>
  <!--#include virtual="/Header" -->

  <div class="nomenu" id="mBody">
    <div id="mainContent">
      <h1>Le Tableau Canton</h1>

      <h2>Cantons :</h2>

      <p>Les Cantons sont des tron&ccedil;ons de voie dont
      l'occupation peut &ecirc;tre suivie individuellement. Diviser
      la voie en Cantons est facultatif. Les Cantons mis en place
      dans un sch&eacute;ma de voies correspondent normalement aux
      Cantons physiques sur un r&eacute;seau. L'occupation du
      Canton est indiqu&eacute; par l'&eacute;tat d'un
      d&eacute;tecteur de pr&eacute;sence. Lorsque un circuit de
      voie est divis&eacute; en Cantons, toute la voie ne doit pas
      appartenir &agrave; un seul Canton. Par exemple, les voies de
      triage ne peut pas &ecirc;tre dans un Canton, alors que la
      Ligne Principale sera presque toujours divis&eacute;e en
      Cantons. La principale utilisation des Cantons est de
      faciliter la signalisation, mais les Cantons peuvent
      &ecirc;tre utilis&eacute;s pour d'autres commandes du
      r&eacute;seau ou de fonction d'animation sur le
      r&eacute;seau.</p>

      <p>Les Cantons peuvent &ecirc;tre configur&eacute;s &agrave;
      l'aide d'un script, ou automatiquement dans un panneau
      &eacute;diteur de R&eacute;seau. Quand un Canton est
      d&eacute;fini dans un panneau &eacute;diteur de
      R&eacute;seau, un nouveau Canton est cr&eacute;&eacute; s'il
      n'existe pas d&eacute;j&agrave;. Dans l'&eacute;diteur de
      R&eacute;seau, Les Cantons sont identifi&eacute;s par leur
      nom utilisateur, donc si un Canton repr&eacute;sent&eacute;
      dans ce tableau est utilis&eacute; dans un panneau
      &eacute;diteur de R&eacute;seau, son nom d'utilisateur ne
      doit pas &ecirc;tre chang&eacute;. Si vous voulez changer le
      nom d'utilisateur d'un Canton utilis&eacute; dans un panneau
      &eacute;diteur de R&eacute;seau, faire le changement dans
      l'&eacute;diteur de R&eacute;seau, pas i&ccedil;i.</p>

      <p>Pour compl&eacute;ter la d&eacute;finition d'un Canton,
      les Chemins et les R&eacute;glages doivent &ecirc;tre joints
      &agrave; chaque Canton. Les Chemins d&eacute;crivent les
      points d'entr&eacute;e du Canton. Chaque Canton a un ou
      plusieurs chemins qui lui sont associ&eacute;s. Parfois, un
      aiguillage doit &ecirc;tre r&eacute;gl&eacute; d'une certaine
      fa&ccedil;on pour utiliser un chemin; Bean Settings
      r&eacute;alise cette information. Les Chemins et Le
      param&egrave;tres Bean sont mis en place automatiquement pour
      les Cantons d&eacute;finis dans un panneau &eacute;diteur de
      R&eacute;seau. Ils peuvent &eacute;galement &ecirc;tre mis en
      place dans un script. Il y a actuellement aucun moyen
      d'entrer manuellement les chemins ou les param&egrave;tres
      Bean. Les Chemins et param&egrave;tres Bean sont non
      repr&eacute;sent&eacute; sur la table Canton, et sont
      d&eacute;crits ici pour que ce soit complet.</p>

      <p>Pour une utilisation pour les trains circulants
      automatiquement, un attribut de la longueur et un attribut de
      courbure peuvent &eacute;ventuellement &ecirc;tre
      affect&eacute;s &agrave; un Canton. Ces attributs optionnels
      sont entr&eacute;s manuellement dans ce tableau. Si les
      trains ne sont pas ex&eacute;cut&eacute; automatiquement pour
      un Canton, il n'est pas n&eacute;cessaire d'ajouter ces
      attributs.</p>

      <h2>Colonnes dans le Tableau Canton:</h2>

      <ul>
        <li>
          <p><b>Nom syst&egrave;me</b> - Le nom syst&egrave;me du
          Canton. Il n'y a pas d'exigence fonctionnelle pour une
          lettre dans le Nom Syst&egrave;me d'un Canton, mais par
          convention, nous utilisons 'B' pour 'Canton'.
          L'impl&eacute;mentation par d&eacute;faut n'est pas
          sp&eacute;cifique au syst&egrave;me, donc une lettre du
          syst&egrave;me du "I" est appropri&eacute;. Cela conduit
          &agrave; des noms de syst&egrave;me comme "IB201".</p>
        </li>

        <li>
          <p><b>Nom Utilisateur</b> - Le nom Utilisateur du Canton.
          Le nom Utilisateur d'un Canton cr&eacute;&eacute; ici
          peut &ecirc;tre r&eacute;gl&eacute; &agrave; n'importe
          quel texte. Le nom utilisateur pour un Canton
          cr&eacute;&eacute; par l'&eacute;diteur de R&eacute;seau
          est fix&eacute; par l'&eacute;diteur de TCO et ne doit
          pas &ecirc;tre chang&eacute;.</p>
        </li>

        <li>
          <p><b>Valeur</b> - C'est la valeur de cha&icirc;ne de
          n'importe quel objet que le Canton porte. Habituellement,
          ce sera soit un message ou un objet r&eacute;gulateur. Si
          vous modifiez cela, c'est stock&eacute;e dans le Canton
          comme une cha&icirc;ne. Il n'y a actuellement aucun moyen
          d'ajouter manuellement un objet r&eacute;gulateur
          &agrave; un Canton de la table.</p>
        </li>

        <li>
          <p><b>Commentaire</b> - Vous pouvez entrer n'importe quel
          texte dans ce domaine qui vous aideront &agrave;
          distinguer ce Canton parmi d'autres Cantons, ou de
          fournir des notes utiles sur son utilisation.</p>
        </li>

        <li>
          <p><b>Supprimer</b> - Cliquez sur le bouton
          <b>Supprimer</b> dans n'importe quelle rang&eacute;e pour
          supprimer le Canton de cette ligne de la liste des
          Cantons dans l'ordinateur. Vous devez sauvegarder votre
          configuration (et les panneaux pr&eacute;sents) sur le
          disque pour rendre la suppression permanente. La
          radiation peut pas &ecirc;tre annul&eacute;e.
          <b>Attention: Assurez-vous de supprimer toutes les
          r&eacute;f&eacute;rences &agrave; un Canton avant de le
          supprimer</b>. Les Cantons sont
          r&eacute;f&eacute;renc&eacute;s dans les chemins d'autres
          Cantons, dans certains scripts, et dans les panneaux de
          d'&eacute;diteur de R&eacute;seau</p>
        </li>

        <li>
          <p><b>Direction</b> - La direction actuelle
          enregistr&eacute;e dans le canton</p>
        </li>

        <li>
          <p><b>Longueur</b> (facultatif) - Affiche la longueur du
          Canton. En option, vous pouvez entrer la longueur du
          Canton ici. La longueur est utilis&eacute;e pour le
          fonctionnement automatique des trains. Si '0 .0 'est
          affich&eacute;, la longueur n'a pas &eacute;t&eacute;
          indiqu&eacute;e. La longueur indiqu&eacute;e doit
          &ecirc;tre la longueur r&eacute;elle du Canton sur le
          r&eacute;seau mod&egrave;le. La longueur est entr&eacute;
          et affich&eacute; en pouces ou centim&egrave;tres, selon
          l'unit&eacute; est demand&eacute;e au bas du tableau de
          Canton.</p>
        </li>

        <li>
          <p><b>Courbure</b> (facultatif) - Affiche la courbure
          s&eacute;lectionn&eacute;e pour la voie du Canton. La
          courbure est utilis&eacute;e pour l'exploitation
          automatique des trains, et ne doit pas &ecirc;tre
          entr&eacute;e si les trains ne seront pas
          ex&eacute;cut&eacute;s automatiquement. La Courbure, si
          elle est pr&eacute;sente, indique &agrave; l'ordinateur
          qu'il devrait ralentir le train car parcours ce Canton.
          Si <b>Aucune</b> ou <b>Progressive</b> ne sont
          s&eacute;lectionn&eacute;es, un train automatique
          proc&eacute;dera &agrave; une vitesse normale.
          <b>&eacute;lev&eacute;</b> doit &ecirc;tre
          s&eacute;lectionn&eacute; si le train doit ralentir ;
          <b>S&eacute;v&egrave;re</b> doit &ecirc;tre
          s&eacute;lectionn&eacute; si le train doit ralentir d'un
          montant maximum. Si le Canton a une courbure variable,
          votre s&eacute;lection devrait &ecirc;tre faite en
          fonction de la partie la plus s&eacute;v&eacute;re du
          Canton.</p>
        </li>

        <li>
          <p><b>Statut</b> - Montre le statut actuel du canton,
          Occup&eacute; ou Non-occup&eacute;.</p>
        </li>

        <li>
          <p><b>Rapport</b> - Le Rapport affecter &agrave; ce
          Canton. Noir le tableau Rapport. Entrez la valeur du
          Rapport dans la valeur de Canton.</p>
        </li>

        <li>
          <p><b>Utilisation actuelle?</b> - Si l'on
          consid&egrave;re le sc&eacute;nario dans lequel nous
          voulons suivre un train autour du r&eacute;seau,
          g&eacute;n&eacute;ralement ceci est
          r&eacute;alis&eacute;e par l'utilisation d'objets
          M&eacute;moire associ&eacute;s &agrave; des Cantons.
          Jusqu'&agrave; ce que le train soitt connu, nous n'ont
          rien &agrave; suivre. En r&egrave;gle
          g&eacute;n&eacute;rale, nous pouvons saisir manuellement
          le num&eacute;ro de train dans un panneau, puis cela est
          suivi autour du r&eacute;seau par l'occupation de canton.
          Si, toutefois, nous avons un dispositif qui peut nous
          fournir l'identification du train, comme un lecteur RFID,
          nous n'avons plus besoin d' taper manuellement l'ID de
          train - le lecteur fait cela pour nous. En substance, le
          lecteur est un peu plus d'un capteur "intelligent" - il
          peut non seulement sentir que "quelque chose" est
          l&agrave;, il peut nous dire ce que c'est. Maintenant,
          pour la mise en &#399;uvre. Un capteur est purement ACTIf
          ou INACTIf - soit quelque chose est l&agrave; ou elle ne
          l'est pas. Un Rapport, cependant, ne peut nous dire l'un
          des &eacute;l&eacute;ments suivants:</p>

          <ol>
            <li>"Hey, je vois quelque chose d&egrave;s maintenant -
            c'est lui"</li>

            <li>"Hmm, je ne vois rien pour l'instant "</li>

            <li>"Hey, j'ai vu quelque chose de tout &agrave;
            l'heure - c'&eacute;tait lui"</li>

            <li>"Hmm, je n'ai encore rien vu "</li>
          </ol>Les deux premiers sont de CurrentReport, les deux
          derniers de LastReport. Au d&eacute;marrage (en supposant
          qu'il n'y a rien dans la fourchette du lecteur), &agrave;
          la fois 2 et 4 sont le premier &eacute;tat. Une fois que
          quelque chose est vu, &agrave; la fois 1 et 3 renvoient
          le m&ecirc;me r&eacute;sultat. Lorsque la chose est 'hors
          fourchette '2 et 3 sont alors actif. Avec '"utilisation
          actuelle"? s&eacute;lectionn&eacute;e valeur du canton
          commutera entre 1 et 2, alors qu'avec "l'utilisation
          actuelle"? d&eacute;coch&eacute;e valeur du canton
          commutera entre 3 et 4.
        </li>

        <li>
          <p><b>permissive</b> - L'option permissive facultative
          est utilis&eacute;e pour identifier les cantons qui
          peuvent &ecirc;tre saisis alors que le Canton est
          occup&eacute;. Il est utilis&eacute; avec certains outils
          d'automatisation et de la logique, pour aider &agrave;
          d&eacute;terminer si un train peut entrer dans un Canton
          occup&eacute; et quel aspect doit &ecirc;tre
          affich&eacute; sur un m&acirc;t de signalisation.</p>
        </li>

        <li>
          <p><b>Vitesse Canton</b> - La vitesse est utilis&eacute;e
          avec certains outils d'automatisation et de logique, pour
          aider &agrave; d&eacute;terminer &agrave; quelle vitesse
          un train peut &ecirc;tre r&eacute;gl&eacute; &agrave;
          travers le Canton. Elle est &eacute;galement
          utilis&eacute; par la logique du m&acirc;t de
          signalisation pour d&eacute;terminer quel aspect doit
          &ecirc;tre affich&eacute; dans un signal de chemin.</p>

          <p>Dans la liste d&eacute;roulante, vous sont
          pr&eacute;sent&eacute;s un ensemble de vitesses fixes qui
          ont &eacute;t&eacute; pr&eacute;d&eacute;finies dans le
          fichier signalSpeed.xml, en plus d'une option
          globale.<br>
          Il est &eacute;galement possible d'entrer une valeur
          num&eacute;rique pour repr&eacute;senter une vitesse.</p>

          <p>La valeur globale est d&eacute;finie via les
          <b>Vitesses</b> du menu option.</p>
        </li>

        <li style="list-style: none">
          <p><a href=
          "../../../../html/tools/tracker/index.shtml">Plus
          d'information sur les Cantons</a></p>

          <p><a href="../display/LayoutEditor.shtml">Plus
          d'informations sur l'utilisation des Cantons avec
          l'&eacute;diteur de R&eacute;seau</a><br></p>
        </li>

        <li>Localis&eacute; &agrave;
        package/jmri/jmrt/beantable/BlockTable</li>

        <li><!--#include virtual="/Footer" --></li>
      </ul>
    </div>
  </div>
</body>
</html>
