<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01//EN" "http://www.w3.org/TR/html4/strict.dtd">
<HTML LANG="fr">
<head>
  <meta name="generator" content=
  "HTML Tidy for Mac OS X (vers 31 October 2006 - Apple Inc. build 15.17), see www.w3.org">

  <title>JMRI: Adding/Editing Logix Conditionals</title>
  <meta http-equiv="Content-Type" content=
  "text/html; charset=iso-8859-1">
  <meta content="Bob Jacobsen" name="Author">
  <meta name="keywords" content=
  "JMRI help Logix Conditional Add Edit">
  <!--#include virtual="/Style" -->
</head>

<body>
<!--#include virtual="/Header.shtml" -->
  <div class="nomenu" id="mBody">
    <div id="mainContent">
      <h1>Ajouter/Modifier Conditions Logix</h1>

      <p>La fen&#234;tre Modifier Condition c'est o&#249; les
      expressions logiques sont &#233;labor&#233;es et
      o&#249; les actions sont sp&#233;cifi&#233;es. La
      fen&#234;tre Modifier Condition s'affiche quand un Condition est cr&#233;&#233;e, 
      ou lorsque le bouton<strong>&#201;dition</strong> d'une Condition est press&#233; dans
      la <a href="LogixAddEdit.shtml">fen&#234;tre Modifier Logix</a> . La 
      fen&#234;tre "Modification Condition" affiche le nom syst&#232;me et nom 
      utilisateur de la Condition ausommet. Le nom syst&#232;me est 
      automatiquement g&#233;r&#233; par le programme et ne peut pas &#234;tre chang&#233;. 
      Le nom utilisateur peut &#234;tre &#233;dit&#233; par entrer/modifier le texte 
      dans le champ Nom Utilisateur. Le nom d'utilisateur peut ne pas
      &#234;tre le m&#234;me que le nom utilisateur d'une autre Condition dans ce 
      Logix, mais peut &#234;tre le m&#234;me que le nom utilisateur d'une Condition 
      dans un autre Logix.</p>

      <p>A Suivre il y a deux sections - une pour l'installation
      d'une expression logique et une autre pour mettre en place
      des actions. Les Conditions sont des &#233;nonc&#233;s de la forme:</p>

      <div style="margin-left: 2em;"><p><code> if (expression logique) then (action)</code></p></div>
      
      <P>Une Condition a deux parties distinctes: son "expression logique" 
      et ses "Action". La fen&#234;tre a des sections s&#233;par&#233;es pour la mise 
      en param&#233;trer chacune d'elle.</P>

	  <h2>Expression Logique</h2>
      <p>La section expression logique contient un tableau de l'&#233;tat des 
      variables, avec deux boutons en dessous. La premi&#232;re colonne de 
      l'&#233;tat des variables du tableau affiche le num&#233;ro de la ligne de 
      la variable d'&#233;tat. Ceci est important que lorsque le choix
      de <strong>l'Op&#233;rateur Logique</strong> est mis &#224; "Mixte". La 
      deuxi&#232;me colonne contient un AND automatique lorsque le choix de 
      <strong>l'Op&#233;rateur Logique</strong> est mis &#224; "AND" ou un OR 
      automatique lorsque le choix est "OR". Lorsque le choix est "Mixte",
      l'utilisateur peut s&#233;lectionnez AND ou OR au besoin. La troisi&#232;me 
      colonne contient une bo&#238;te de choix qui permet &#224; l'utilisateur de 
      s&#233;lectionner l'op&#233;rateur NOT au besoin. La quatri&#232;me colonne est 
      une description de la variable d'&#233;tat type et la condition pour 
      laquelle elle doit &#234;tre test&#233;e. La suivante est une colonne 
      affichant l'&#233;tat actuel de la description du test. L'&#233;tat affich&#233; 
      inclut l'effet de l'op&#233;rateur NOT, si NOT est s&#233;lectionn&#233;.</p>

      <p>La colonne Calculs Triggers (D&#233;clencheurs) contient des cases &#224; 
      cocher qui, normalement, sont coch&#233;es, de sorte qu'un changement 
      dans la variable d'&#233;tat va d&#233;clencher un calcul du Logix. Pour les 
      rares cas o&#249; un changement dans un entit&#233; sp&#233;cifique (capteur, 
      aiguillage, etc) ne devrait pas d&#233;clencher un r&#233;sultat du calcul,
      vous devez d&#233;cocher la case en cliquant dessus. D&#233;cocher la case 
      indique au programme de surveiller cette entit&#233; pour les changements 
      d'&#233;tat et de calculer l'&#233;tat de la condition, mais il ne prend pas
      d'action en fonction des r&#233;sultats.</p>
      
      <p>Les deux derni&#232;res colonnes du tableau (boutons <strong>Modifier
     </strong> et <strong>Supprimer</strong>) permettent de modifier ou 
      de supprimer cette ligne dans le tableau de variables d'&#233;tat. 
      Supprimez une variable d'&#233;tat si vous d&#233;cidez qu'elle n'est plus 
      n&#233;cessaire. La colonne &#201;tat de la table indique l'&#233;tat (vrai ou faux) 
      de chaque variable d'&#233;tat lors de son &#233;valuation. </P>

	  <p>Les deux derni&#232;res colonnes du tableau (les boutons <strong>
	  Modifier</strong> et <strong>Supprimer</strong> sont utilis&#233;s pour 
	  modifier ou supprimer cette ligne dans la table de variable d'&#233;tat.
	  Supprimez une variable d'&#233;tat si vous d&#233;cidez qu'elle n'est plus 
	  n&#233;cessaire. La colonne &#233;tat du tableau montre l'&#233;tat (vrai ou faux) 
	  de chaque &#233;tat de la variable quand elle est &#233;valu&#233;e.</p>

	<p>&#193; tout moment pendant l'entr&#233;e des donn&#233;es des variable d'&#233;tat, 
	<strong>V&#233;rifier Variables d'&#233;tat</strong> peut &#234;tre cliqu&#233; pour 
	v&#233;rifier les donn&#233;es saisies et d'&#233;valuer l'&#233;tat des variables. 
	Lorsque ce bouton est enfonc&#233;, la v&#233;rification et l'&#233;valuation se 
	produisent jusqu'&#224; ce que la v&#233;rifications se termine correctement, 
	ou si une erreur est d&#233;tect&#233;e. Si une erreur est d&#233;tect&#233;e, la 
	v&#233;rification s'arr&#234;te pour vous permettre de corriger l'erreur et 
	cliquez sur <strong>V&#233;rifiez Variables d'&#233;tat</strong> &#224; nouveau. 
	<em>S'il vous pla&#238;t rappelez vous apr&#232;s l'&#233;dition des &#233;l&#233;ments de 
	donn&#233;es et du nom, cliquez sur une cellule diff&#233;rente dans la table 
	avant de cliquer <strong>V&#233;rifiez Variables d'&#233;tat</strong> (ou 
	<strong>Mise &#224; Jour Conditions</strong> au le bas de la fen&#234;tre) pour 
	que le programme soit averti que vous avez termin&#233; votre saisie. 
	Sinon votre entr&#233;e ne peut prendre effet, et une erreur peut &#234;tre 
	signal&#233;e inutilement.</em> </p>
		
	  <p>L'<strong>Op&#233;rateur Logique</strong> par d&#233;faut est "AND". Dans 
	  ce cas, la condition permettra de tester si tous les tests variables 
	  sont vraies, apr&#232;s la prise du "NON" n&#233;gations en compte .En 
	  utilisant la boite <strong>Op&#233;rateur Logique</strong> sous la 
	  liste des variables, vous pouvez changer celui-ci &#224; "OR" ou "Mixtes". 
	  "OR" signifie que la Condition sera vrai si l'un des tests de 
	  variables sont vraies, apr&#232;s comptabilisation des n&#233;gations.
	  S&#233;lection "Mixtes" vous permettra de saisir une expression logique 
	  dans une nouvelle zone de texte &#224; l'aide de AND, OR et NOT et les 
	  num&#233;ros de ligne. Dans cette expression, chaque variable est 
	  mentionn&#233;e par un num&#233;ro, par exemple R1, R2, pour les trois 
	  premieres variables, vous pouvez utiliser les op&#233;rateurs "and", "or"
	  et "not" en plus de parenth&#232;ses. Quelques exemples:</p>
	  <div style="margin-left: 2em;"><p><code>
	  R1 and R2
	  R1 or (R2 et R3)
	  (R2 and R3) or (R3 and R1)
      </code></p></div>		

	  <H3>Ajout d'une Nouvelle Variable d'&#201;tat</H3>

	  <p>Pressez <strong>Ajouter Variable d'&#233;tat</strong> pour ajouter 
	  une variable d'&#233;tat (une ligne dans la table des variables d'&#233;tat). 
	  Cela affichera une fen&#234;tre avec une bo&#238;te de choix pour 
	  l'utilisateur pour s&#233;lectionner un type de variable d'&#233;tat. Les 
	  variables d'&#233;tat disponibles sont document&#233;es <a href="#variable">
	  ci-dessous</a>. Quand un type est choisi la fen&#234;tre Modifier 
	  Variable affiche un champ de texte pour le nom de l'entit&#233; &#224; 
	  utiliser pour la variable d'&#233;tat. Quand un nom (soit  nom syst&#232;me 
	  ou nom utilisateur) est entr&#233;, il doit correspondre &#224; une entit&#233; 
	  existante (capteur, aiguillage, lumi&#232;re, etc.) Il est utile 
	  d'ouvrir le Tableau Capteur lors de l'entr&#233;e du nom du capteur ou 
	  le Tableau Aiguillage pour montrer les aiguillages disponibles, etc.
	  Le format actuel de saisie des noms d&#233;pend du r&#233;glage de la 
	  m&#233;thode de s&#233;lection de nom de condition. Voir 
	  <a href="LogixTable.shtml#selectMethod"> M&#233;thode de S&#233;lection du 
	  nNom de Condition </a>.</p>
	  
	  <p>Pour les variables conditionnelles, le champ de saisie de texte 
	  est remplac&#233; par deux zones de liste d&#233;roulante. La premi&#232;re case 
	  sert &#224; s&#233;lectionner Logix, la seconde case permet de s&#233;lectionner 
	  une condition appartenant au Logix s&#233;lectionn&#233;. <span class = "since"> 
	  depuis la 4.7.4</span> <a href="images/SelectConditionalReference.png"> 
	  <img src = "images/SelectConditionalReference.png" alt = "Logix/bo&#238;tes 
	  de dialogue conditionnelles" height = "148" width = "558"> </a></p>
      
      <p>Une fois le nom saisi, s&#233;lectionnez l'&#233;tat souhait&#233; dans la 
      liste d&#233;roulante <strong>&#201;tat de la Variable</strong>. En fonction 
      du type et de l'&#233;tat de la variable s&#233;lectionn&#233;e, des champs 
      suppl&#233;mentaires peuvent &#234;tre affich&#233;s.

      <p>Vous pouvez cliquer sur le bouton <strong>V&#233;rifier les Variables 
      d'&#201;tat</strong> &#224; tout moment pendant la saisie des donn&#233;es de 
      variable d'&#201;tat pour v&#233;rifier les donn&#233;es saisies et &#233;valuer les 
      variables d'&#233;tat. Lorsque ce bouton est enfonc&#233;, la v&#233;rification et 
      l'&#233;valuation se poursuivent jusqu'&#224; ce que la v&#233;rification soit 
      r&#233;ussie ou qu'une erreur soit d&#233;tect&#233;e. Si une erreur est d&#233;tect&#233;e, 
      la v&#233;rification est interrompue pour permettre &#224; l'utilisateur de 
      la corriger et de cliquer &#224; nouveau sur <strong>V&#233;rifier les 
      variables d'&#233;tat</strong>. <em> Apr&#232;s avoir modifi&#233; le nom du syst&#232;me 
      et les &#233;l&#233;ments de donn&#233;es, n'oubliez pas de cliquer sur une cellule 
      diff&#233;rente de la table avant de cliquer sur <strong>V&#233;rifier 
      Variables d'&#201;tat</strong> (ou <strong>Mettre &#224; Jour les  Conditions
      </strong> en bas du volet.) afin que le programme soit inform&#233; que 
      vous avez termin&#233; votre entr&#233;e. Sinon, votre entr&#233;e pourrait ne pas 
      prendre effet et une erreur pourrait &#234;tre signal&#233;e inutilement.</Em></p>

      <h2>Action</h2>
      <p>La section action contient un tableau des actions, avec deux 
      boutons ci-dessous. La liste des actions affiche une description 
      de chaque action. Le bouton <strong>Modifier</strong> permet de 
      modifier une action. Le bouton <strong>Supprimer</strong> permet 
      de supprimer une action.

      <p>Les actions sont &#233;valu&#233;es dans l'ordre indiqu&#233;. Pour changer 
      cet ordre, cliquez sur le bouton "R&#233;organiser" dans la fen&#234;tre 
      "Modifier la Condition". Les boutons les plus &#224; droite des actions 
      vous permettront ensuite de s&#233;lectionner le premier, le suivant, etc.</p>

	  <H2> Ajouter une Nouvelle Action</H2>
	  
	  <p>Pour ajouter une nouvelle action, appuyez sur le bouton "Ajouter  
	  Action". Une nouvelle fen&#234;tre "&#201;dition Action" appara&#238;tra.
	  S&#233;lectionnez un type d'action dans les &#233;l&#233;ments de la zone Type, 
	  et les donn&#233;es n&#233;cessaires pour sp&#233;cifier compl&#232;tement l'action
	  apparaissent &#224; la droite de la zone Type. Si vous ne savez pas ce 
	  qui doit &#234;tre entr&#233; dans un champ de donn&#233;es, placez votre curseur 
	  dessus, et un message appara&#238;tra. Quand un nom doit &#234;tre inscrit, 
	  le nom doit correspondre &#224; un nom syst&#232;me ou un nom utilisateur 
	  d'une entit&#233; existante (capteur, aiguillage, signal, etc) du type 
	  appropri&#233;. L'ouverture du Tableau capteur lorsque la saisie des 
	  noms de capteur, ou du tableau aiguillages peut &#234;tre utiles pour 
	  voir les aiguillages disponibles, etc. Les Types d'actions 
	  disponibles sont d&#233;crits en d&#233;tail <a HREF= "# d'action"> 
	  ci-dessous</a>.La m&#233;thode r&#233;elle de saisie des noms d&#233;pend du 
	  param&#232;tre de m&#233;thode de s&#233;lection de nom de condition. Voir 
	  <a href="LogixTable.shtml#selectMethod"> M&#233;thode de s&#233;lection 
	  du nom de condition</a>.</p>
	  
	  
	  <p>Pour chaque action, trois options sont disponibles pour quand 
	  d&#233;clencher des actions:</p> 
	  <ul>
        <li>1) Le changement &#224; True (Vrai)</li>
	    <li>2) sur le changement &#224; False (Faux)</li>
	    <li>3) sur Changement</li> 
	  </ul>  
	  <p></p>Elles font r&#233;f&#233;rence &#224; l'&#233;tat calcul&#233; de la Condition, qui 
	  est &#233;gale &#224; la valeur de l'expression logique tel que sp&#233;cifi&#233;e 
	  dans le tableau des variables d'&#233;tat. Une de ces options doit &#234;tre 
	  s&#233;lectionn&#233;e. Lorsque vous avez termin&#233;, cliquez sur "Mettre &#224; jour" 
	  pour installer vos modifications, "Annuler" pour fermer la fen&#234;tre 
	  sans aucune modification ou "Supprimer" pour supprimer l'action 
	  enti&#232;rement.</p>

	  <p>Lorsque l'expression logique et les actions ont &#233;t&#233; sp&#233;cifi&#233;es,
	  cliquez <strong>Mise &#224; Jour Condition</strong> au bas de la fen&#234;tre.
	  Ceci initie une v&#233;rification de l'expression logique (la m&#234;me que 
	  celle effectu&#233; par <strong>V&#233;rifier Variables d'&#201;tat</strong>) et 
	  une v&#233;rification des donn&#233;es saisies pour les actions. Si le nom 
	  utilisateur a &#233;t&#233; &#233;dit&#233;, il est &#233;galement v&#233;rifi&#233;. Si une erreur 
	  est trouv&#233;e, une bo&#238;te de message s'ouvre annon&#231;ant l'erreur, et 
	  la mise &#224; jour est arr&#234;t&#233; pour vous permettre de corriger l'erreur 
	  et cliquez sur <strong>Mise &#224; Jour Conditions</strong> &#224; nouveau. 
	  Si aucune erreur n'est trouv&#233;e, l'action est mis &#224; jour avec 
	  l'entr&#233;e des donn&#233;es, la fen&#234;tre Modifier Condition est ferm&#233;e, 
	  et l'utilisateur est retourn&#233; &#224; la fen&#234;tre Modifier Logix.</p>


	  <p>Deux autres boutons sont disponibles au bas de la fen&#234;tre 
	  &#201;dition Condition. En cliquant sur <strong>Annuler</strong> vous 
	  fermez la fen&#234;tre &#201;dition Condition sans mise &#224; jour de la 
	  Condition. En cliquant <strong>Annuler</strong> vous perdrez  
	  toutes les donn&#233;e qui ont &#233;t&#233; entr&#233;es. L'autre bouton, <strong>
	  Supprimer Condition</strong>, fournit un moyen facile de supprimer 
	  une Condition inutile. Cliquez <strong>Supprimer Conditions</strong> 
	  pour supprimer le Condition en cours de Modification et revenir &#224; 
	  la fen&#234;tre Modifier Logix.</p>

	  <p>Les variables d'&#233;tat Disponibles et les actions sont list&#233;es 
	  Ci-dessous. Pour de plus amples d'informations, consultez la 
	  documentationprincipale Logix  <a href=
      "../../../../html/tools/Logix.shtml"></a>.</p>

	  <dl>
        <dd>
          <h2><a name="variable" id="variable">Variables d'&#233;tat 
          Disponibles</a></H2>


		  <p>Les variables d'&#233;tat  qui sont actuellement disponibles 
		  pour une utilisation dans les Conditions qui sont &#233;num&#233;r&#233;es 
		  ci-dessous, ainsi que des informations sur chacune. Les variables 
		  d'&#233;tat doivent toujours &#234;tre &#233;valuer soit true ou false. La 
		  condition r&#233;sultant en true est donn&#233;e pour chacune. Si la 
		  condition n'est pas remplie, la variable d'&#233;tat est &#233;valu&#233;e &#224; 
		  false. Quand un Logix est actif, les &#233;tats des entit&#233;s (capteur, 
		  aiguillage, lumi&#232;re, etc) sp&#233;cifi&#233;s dans les variables d'&#233;tat de
		  ces Conditions  sont surveill&#233;s, sauf si la case Calcul D&#233;clencheurs
		  de la variable d'&#233;tat n'est pas coch&#233;e. Un calcul de toutes les 
		  conditions avec Logix est d&#233;clench&#233; lorsqu'un changement d'&#233;tat 
		  surveill&#233; comme indiqu&#233; ci-dessous (S'il n'est pas &#233;vident).</p>
		  <ul>
			  
			<li>Capteur <ul>
			  <li><strong>Capteur Actif</strong>: true si l'&#233;tat du
			  capteur sp&#233;cifi&#233; est actif.</li>
			  
			  <li><strong>Capteur Inactif</strong>: true si l'&#233;tat du
			  capteur sp&#233;cifi&#233; est inactif.</li>
			
			 </ul></li>
            <li>Aiguillage<ul> 
				 
			  <li><strong>Aiguillage D&#233;vi&#233;</strong>: true si l'&#233;tat 
			  connu de l'aiguillage sp&#233;cifi&#233; est d&#233;vi&#233;.</li>
			  
			  <li><strong>Aiguillage Direct</strong>: true si l'&#233;tat 
			  connu de l'aiguillage indiqu&#233; est direct.</li>
			
			</ul></li>
            <li>Lumi&#232;re<ul>  
	
			  <li><strong>Lumi&#232;re On</strong>: true si la lumi&#232;re 
			  sp&#233;cifi&#233;e est allum&#233;e.</li>
			  
			  <li><strong>Lumi&#232;re Off</strong>: true si la lumi&#232;re 
			  sp&#233;cifi&#233;e est &#233;teinte.</li>
			
			</ul></li>
            <li>Signal<ul> 
			  <li><strong>L'apparence du signal est &#233;gale &#224; </strong>: 
			  elle est d&#233;finie sur true si l'apparence du signal 
			  sp&#233;cifi&#233;e correspond &#224; la Variable Aspect (apparence) 
			  s&#233;lectionn&#233;. </li>	
			  
			  <li><strong>Le signal est allum&#233; </strong>: la valeur est 
			  vraie si le signal sp&#233;cifi&#233; est allum&#233;. </li> 
			  
			  <li><strong>Signal de Retenu</strong>: &#233;valu&#233; &#224; vrai si le
               le signal sp&#233;cifi&#233;e est Retenu. </li> 
               
           </ul> </li>
             <li>M&#226;t de Signalisation <ul>
               <li><strong>Aspect du m&#226;t du signal &#233;gal </strong>: 
               renvoie true si l'aspect du m&#226;t du signalisation sp&#233;cifi&#233; 
               est &#233;gal &#224; l'aspect sp&#233;cifi&#233; dans la variable d'&#233;tat. Le 
               calcul est d&#233;clench&#233; lorsque l'aspect du m&#226;t de signalistion 
               change. </Li>   
            
            <li><strong>Le m&#226;t du signalisation est allum&#233; </strong>: 
            la valeur est vraie si le m&#226;t du signalisation sp&#233;cifi&#233; est 
            allum&#233;. </li> 
            
            <li><strong>M&#226;t de signalisation retenu </strong>: la 
            valeur est vraie si le m&#226;t de signalisation sp&#233;cifi&#233; est 
            retenu. </li>
			/ul></li>
            <li>M&#233;moire<ul>
              <li>
			 <strong>M&#233;moire-Comparaison de Valeur</strong>: compare 
			 la valeur enregistr&#233;e dansla m&#233;moire sp&#233;cifi&#233;eavec la valeur 
			 sp&#233;cifi&#233;e dans la variable d'&#233;tat &#224; l'aide d'un op&#233;rateur 
			 de comparaison sp&#233;cifi&#233;. Evalue &#224; true si la comparaison est 
			 vraie. Il existe 5 op&#233;rateurs de comparaison pouvant &#234;tre
			  utilis&#233;s pour l'&#233;valuation:
               <ul>
                 <li>"inf&#233;rieur &#224;" </li>
                 <li>"inf&#233;rieur ou &#233;gal" </li>
                 <li>"est &#233;gal &#224;" </li>
                 <li>"sup&#233;rieur ou &#233;gal" </li>
                 <li>"sup&#233;rieur &#224;" </li>
               </ul> 
             Le calcul est d&#233;clench&#233; lorsque l'une des valeurs de la 
             m&#233;moire surveill&#233;e change, de sorte que la valeur de 
             comparaison change.
             </li>
           </ul></li>

            <li>Condition<ul>
              <li><strong>Condition Vrai</strong>: la valeur est vraie 
              si l'&#233;tat de la condition sp&#233;cifi&#233;e est vrai.</li>

              <li><strong>Condition Fausse</strong>: la valeur est vraie 
              si l'&#233;tat de la condition sp&#233;cifi&#233; est fausse.</li>
           </ul></li>

            <li>Consigne<ul>
              <li><strong>Itin&#233;raire libre</strong>: la valeur vraie 
              lorsque l'Itin&#233;raire est disponible.</li>
              <li><strong>Ensemble de routes</strong>: la valeur est 
              vraie lorsque l'Itin&#233;raire est d&#233;fini.</li>
              <li><strong>Itin&#233;raire allou&#233;e</strong>: la valeur est 
              vrai lorsque l'Itin&#233;raire a &#233;t&#233; allou&#233;.</li>
              <li><strong>Itin&#233;raire occup&#233;</strong>: la valeur est 
              vraie lorsque l'itin&#233;raire est occup&#233;.</li>
              <li><strong>Train en marche</strong>: la valeur est 
              vraie quand un train est en marche./li>
           </ul></li>

            <li>Horloge rapide <ul>
              <li><strong>Plage d'horloge rapide</strong>: indique 
              vrai si l'heure d'horloge rapide actuelle est comprise 
              entre l'heure de d&#233;but et l'heure de fin sp&#233;cifi&#233;es pour 
              la plage. Les heures doivent &#234;tre sp&#233;cifi&#233;es au format 
              hh: mm, o&#249; hh correspond aux heures et mm aux minutes, par 
              rapport &#224; une horloge de 24 heures. Le calcul est d&#233;clench&#233; 
              lorsque l'heure d'horloge rapide entre dans la plage et 
              lorsque l'heure d'horloge rapide quitte la plage.</Li>
           </ul></li>

            <li>Occupation de Canton<ul>
              <li><strong>Occup&#233;</strong>: la valeur est vraie lorsque 
              le Canton est occup&#233;.</li>
              <li><strong>Erreur d'alimentation</strong>: le r&#233;sultat 
              est vrai lorsqu'une erreur d'alimentation s'est produite.</li>
              <li><strong>Hors service</strong>: la valeur est vraie
              lorsqu'un Canton est hors service.</li>
              <li><strong>&#201;teint</strong>: est &#233;valu&#233; &#224; vrai lorsqu'un 
              Canton est &#233;teint.</li>
              <li><strong>Chemin occup&#233;</strong>: &#233;valu&#233; comme &#233;tant 
              vrai lorsqu'un chemin est occup&#233;</li>
              <li><strong>Inoccup&#233;</strong>: &#233;valu&#233; &#224; vrai lorsqu'un 
              chemin n'est pas occup&#233;.</li>
              <li><strong>Allou&#233;</strong>: &#233;valu&#233; &#224; vrai lorsque le 
              Canton est allou&#233;.</li>
           </ul></li>

            <li>Entr&#233;e sortie <ul>
              <li><strong>Actif</strong>: &#233;valu&#233; &#224; vrai lorsque l'entr&#233;e/la sortie
              est actif.</li>
              <li><strong>Inactif</strong>: la valeur est vraie lorsque 
              l'entr&#233;e/la sortie n'est pas active.</li>
           </ul></li>
         </ul>
       </dd>
        <dd>

          <h2> <a name="action" id="action"> Actions disponibles </a></h2>

          <p> Les actions actuellement disponibles pour une utilisation 
          dans les conditions sont r&#233;pertori&#233;es ci-dessous avec des 
          informations sur chacune d'elles:</p>
             
		  <ul>
            <li>Capteur <ul>
              <li><strong>D&#233;finir le capteur</strong>: d&#233;finit le 
              capteur sp&#233;cifi&#233; sur l'&#233;tat choisi. Sp&#233;cifiez le capteur 
              &#224; d&#233;finir en entrant son nom. Sp&#233;cifiez l'&#233;tat &#224; d&#233;finir 
              en choisissant Actif ou Inactif dans le menu contextuel.</Li>

              <li><strong>Capteur avec D&#233;finition Retard&#233;e</strong>: d&#233;finit 
              le capteur sp&#233;cifi&#233; sur l'&#233;tat choisi apr&#232;s avoir attendu 
              pendant un nombre de secondes sp&#233;cifi&#233;. Sp&#233;cifiez le 
              capteur &#224; d&#233;finir en entrant son nom. Sp&#233;cifiez l'&#233;tat &#224; 
              d&#233;finir en choisissant Actif ou Inactif dans le menu 
              contextuel. Sp&#233;cifiez le nombre de secondes &#224; attendre 
              avant de configurer le capteur en entrant un nombre dans 
              le champ le plus &#224; droite. Si cette condition est d&#233;j&#224; en 
              attente de configuration pour ce capteur, cette action est 
              ignor&#233;e et l'action pr&#233;c&#233;dente continue comme pr&#233;vu 
              initialement (voir &#233;galement <strong>R&#233;initialiser le 
              R&#233;glage du Capteur Retard&#233;</strong> ci-dessous).</Li>

              <li><strong>R&#233;initialisation du Capteur avec d&#233;lai de 
              r&#233;initialisation</strong>: d&#233;finit le capteur sp&#233;cifi&#233; sur 
              l'&#233;tat choisi apr&#232;s avoir attendu un nombre sp&#233;cifi&#233; de 
              secondes. Sp&#233;cifiez le capteur &#224; d&#233;finir en entrant son 
              nom. Sp&#233;cifiez l'&#233;tat &#224; d&#233;finir en choisissant Actif ou 
              Inactif dans le menu contextuel. Sp&#233;cifiez le nombre de 
              secondes &#224; attendre avant de configurer le capteur en 
              entrant un nombre dans le champ le plus &#224; droite. Cette 
              action est identique &#224; <strong>Capteur avec D&#233;finition 
              Retard&#233;e</strong>, sauf si cette conditionnelle attend 
              d&#233;j&#224; activement de d&#233;finir le capteur sp&#233;cifi&#233;, si 
              la pr&#233;c&#233;dente attente est annul&#233;e et une nouvelle p&#233;riode 
              d'attente est lanc&#233;e. En effet, le temps d'attente est 
              red&#233;marr&#233;. Le capteur n'est d&#233;fini que lorsque la p&#233;riode 
              d'attente la plus r&#233;cente a expir&#233;.</Li>

              <li><strong>Annuler les Minuteries pour le Capteur</strong>: 
              annule toutes les minuteries en attente de configuration 
              du capteur sp&#233;cifi&#233; dans tous les conditionnels de tous 
              les Logix. Sp&#233;cifiez le capteur en entrant son nom. Le 
              capteur n'est pas d&#233;fini; toutes les actions retard&#233;es 
              actives pour le param&#233;trage du capteur sp&#233;cifi&#233; sont 
              annul&#233;es sans param&#233;trage du capteur.</li>
           </ul></li>

            <li>Aiguillage <ul>

			  <li><strong>D&#233;finir Aiguillage</strong>: D&#233;finit l'aiguillage 
			  indiqu&#233; avec l'&#233;tat choisi.Sp&#233;cifiez l'aiguillage en entrant 
			  son nom. Sp&#233;cifiez l'&#233;tat en choisissant Droit ou D&#233;vi&#233; 
			  dans le menu contextuel.</li>
			
			  <li><strong>D&#233;finir Aiguillage Temporis&#233;</strong>: D&#233;finit 
			  l'aiguillage indiqu&#233; &#224; l'&#233;tat choisi apr&#232;s attente d'un 
			  certain nombre de secondes sp&#233;cifi&#233;es. Pr&#233;cisezl'aiguillage 
			  concern&#233; en entrant son nom. Sp&#233;cifier l'&#233;tat &#224; fixer par
			  le choix Droitou D&#233;vi&#233; dans le menu contextuel. Indiquez le 
			  nombre de secondes &#224; attendre avant de fixer l'aiguillage 
			  en entrant un nombre dans le champ le plus &#224; droite. Si 
			  cette condition est d&#233;j&#224; en attente pour d&#233;finir cet 
			  aiguillage, cette action est ignor&#233;e, et l'action pr&#233;c&#233;dente 
			  se poursuit comme initialement pr&#233;vue. (voir aussi  
			  <strong>R&#233;initialiser Aiguillage Temporis&#233;</strong> 
			  ci-dessous.)</li>
			  
			  <li><strong>Verrouillage Aiguillage</strong>: Verrouille 
			  ou d&#233;verrouille un aiguillage. Entrez le nom de l'aiguillage, 
			  et choisir l'op&#233;ration &#224; partir du menu contextuel. <strong>
			  Remarque:</strong>pour contr&#244;ler le type d'aiguillage &#224; 
			  verrouiller aller &#224; la <A HREF = "TurnoutTable.shtml"> 
			  Tableau Aiguillage</A> et s&#233;lectionnez le mode de verrouillage.</li>
			  <li><strong>Annuler Temporisations Aiguillage</strong>:  
			  Annule toutes les minuteries d'attente pour D&#233;finir 
			  l'aiguillage sp&#233;cifi&#233; dans toutes les Conditions avec tous 
			  les Logixs. Sp&#233;cifiez l'aiguillage enentrant son nom. 
			  L'aiguillage n'est pas d&#233;fini; toutes les actions actives 
			  retard&#233;e pour D&#233;finir les aiguillages sp&#233;cifi&#233;s sont 
			  annul&#233;es sans r&#233;glage de l'aiguillage.</li>
			  
			  <li><strong>R&#233;initialiser la Temporisation d'Aiguillage 
			  </strong>: d&#233;finit l'aiguillage sur l'&#233;tat choisi apr&#232;s un 
			  d&#233;lai d'un nombre sp&#233;cifi&#233; de secondes. Sp&#233;cifiez 
			  l'aiguillage &#224; d&#233;finir en entrant son nom. Sp&#233;cifiez l'&#233;tat 
			  &#224; d&#233;finir en choisissant Droit ou D&#233;vi&#233; dans le menu 
			  contextuel. Sp&#233;cifiez le nombre de secondes &#224; attendre 
			  avant le r&#233;glage de l'aiguillage en entrant un nombre dans 
			  le champ le plus &#224; droite. Cette action est identique &#224;  
			  <strong>D&#233;finir Aiguillage Temporis&#233; </strong>, sauf si cette 
			  Condition attend d&#233;j&#224; activement de retarder un aiguillage 
			  sp&#233;cifi&#233;, une nouveau d&#233;lai est lanc&#233;. En effet, le temps 
			  d'attente est red&#233;marr&#233;. L'aiguillage n'est d&#233;fini que 
			  lorsque le d&#233;lai le plus r&#233;cente a expir&#233;. </Li>
			
			<li>Lumi&#232;re <ul>
              <li><strong>D&#233;finir la Lampe</strong>: d&#233;finit la lampe 
              sp&#233;cifi&#233;e sur l'&#233;tat choisi. Sp&#233;cifiez la lampe &#224; d&#233;finir 
              en entrant son nom. Sp&#233;cifiez l'&#233;tat &#224; d&#233;finir en 
              s&#233;lectionnant Activ&#233; ou D&#233;sactiv&#233; dans le menu contextuel.</Li>

              <li><strong>D&#233;finir l'Intensit&#233; de la Lampe</strong>: 
              d&#233;finit l'intensit&#233; de la lampe &#224; intensit&#233; variable 
              sp&#233;cifi&#233;e sur la valeur d'intensit&#233; entr&#233;e. Sp&#233;cifiez la 
              lampe &#224; d&#233;finir en entrant son nom. Sp&#233;cifiez l'intensit&#233; 
              en entrant le pourcentage d'intensit&#233; sous la forme d'un 
              entier compris entre 0 et 100. Si la lampe sp&#233;cifi&#233;e 
              n'est pas une lampe variable ou si la valeur d'intensit&#233; 
              entr&#233;e n'est pas un entier compris dans la plage requise, 
              un message d'erreur s'affiche. </li>

              <li><strong>D&#233;finir la Dur&#233;e de Transition de la Lampe
              </strong>: d&#233;finit la dur&#233;e de transition d'une lampe &#224; 
              intensit&#233; variable sp&#233;cifi&#233;e sur la dur&#233;e sp&#233;cifi&#233;e. 
              Sp&#233;cifiez la llampe &#224; d&#233;finir en entrant son nom. Sp&#233;cifiez 
              le temps de transition en entrant le nombre de minutes 
              rapides n&#233;cessaires pour passer d'une intensit&#233; de 0% &#224; une 
              intensit&#233; de 100%. Si la lampe sp&#233;cifi&#233;e n'est pas une lampe 
              variable ou si aucun entier positif n'a &#233;t&#233; entr&#233; pour le 
              nombre de minutes rapides, un message d'erreur appara&#238;t.</Li>
           </ul></li>

            <li>Signal <ul>
              <li><strong>D&#233;finir l'Apparence du Signal</strong>: d&#233;finit 
              le signal sp&#233;cifi&#233; sur l'apparence choisie. Sp&#233;cifiez le 
              signal &#224; d&#233;finir en entrant son nom. Sp&#233;cifiez l'apparence 
              &#224; d&#233;finir en choisissant dans le menu contextuel.</Li>

              <li><strong>D&#233;finir le Signal de Retenue</strong>: d&#233;finit le 
              signal sp&#233;cifi&#233;e comme &#233;tant de retenu. Sp&#233;cifiez le signal 
              de retenu en entrant son nom.</Li>

              <li><strong>Supprimer le Signal de Retenu</strong>: efface
               laspect reteenu du signal sp&#233;cifi&#233;. Sp&#233;cifiez le signal en 
               entrant son nom.</Li>  
			  
			  <li><strong>D&#233;sactiver le Signal</strong>: d&#233;finit le 
			  signal sp&#233;cifi&#233; sur non &#233;clair&#233;. Sp&#233;cifiez le signal en 
			  entrant son nom.</Li>

              <li><strong>D&#233;finir le Signal Allum&#233;</strong>: d&#233;finit le 
              signal sp&#233;cifi&#233; sur allum&#233;. Sp&#233;cifiez le signal en entrant 
              son nom.</Li>
           </ul></li>

            <li>M&#226;t de Signalisation <ul>
              <li><strong>D&#233;finir l'Aspect du M&#226;t deSignalisation
              </strong>: d&#233;finit le m&#226;t de signalisation sp&#233;cifi&#233; sur 
              l'aspect choisi. Sp&#233;cifiez le m&#226;t de signalisation &#224; d&#233;finir 
              en entrant son nom. S&#233;lectionnez l'aspect dans la liste 
              Aspect M&#226;t.</Li>

              <li><strong>D&#233;finir le M&#226;t de Signalisation de Retenue
              </strong>: permet de d&#233;finir le m&#226;t de signalisation 
              sp&#233;cifi&#233;. Sp&#233;cifiez le m&#226;t de signalisation de retenu en 
              entrant son nom.</Li>

              <li><strong>Effacer le M&#226;t de Signalisation de Retenue
              </strong>: supprime la retenue  sur le m&#226;t de signalisation  
              sp&#233;cifi&#233;. Sp&#233;cifiez le m&#226;t de signalisation  en entrant son nom.</Li>

              <li><strong>D&#233;finir l'&#201;tat du M&#226;t de Signalisation &#201;teint</strong>: 
              d&#233;finit le m&#226;t de signalisation sp&#233;cifi&#233; &#224; pas allum&#233;
              Sp&#233;cifiez le m&#226;t de signalisation en entrant son nom.</li>

              <li><strong>Effacer M&#226;t de Signalisation &#201;teint</strong>: 
              d&#233;finit le m&#226;t de signalisation sp&#233;cifi&#233; sur allum&#233;. 
              Sp&#233;cifiez le m&#226;t de signalisation en entrant son nom.</Li>
           </ul></li>

            <li></li>M&#233;moire <ul>
              <li><strong>D&#233;finir la M&#233;moire</strong>: d&#233;finit la m&#233;moire 
              sp&#233;cifi&#233;e sur la valeur entr&#233;e. Sp&#233;cifiez la m&#233;moire &#224; 
              d&#233;finir en entrant son nom. Sp&#233;cifiez la valeur &#224; d&#233;finir 
              dans la m&#233;moire en la saisissant dans le champ le plus &#224; 
              droite.</Li>

              <li><strong>Copier la M&#233;moire dans la M&#233;moire</strong>: 
              copie la valeur d'une variable de m&#233;moire dans une autre 
              variable de m&#233;moire. Sp&#233;cifiez la m&#233;moire &#224; copier en 
              entrant son nom dans le champ le plus &#224; gauche. Sp&#233;cifiez 
              la m&#233;moire pour recevoir la valeur copi&#233;e en entrant son 
              nom dans le champ le plus &#224; droite.</Li>
           </ul></li>

            <li>Logix <ul>
              <li><strong>Activer Logix</strong>: active le logix 
              sp&#233;cifi&#233;. Sp&#233;cifiez le logix &#224; activer en entrant son nom.</Li>

              <li><strong>D&#233;sactiver Logix</strong>: d&#233;sactive le logix 
              sp&#233;cifi&#233;. Sp&#233;cifiez le logix &#224; d&#233;sactiver en entrant son nom.</Li>
           </ul></li>

            <li>Consigne<ul>
              <li><strong> Attribution Itin&#233;raire de Consigne</strong>: 
              attribue (r&#233;serve) les verrous OBlocks constituant 
              l'itin&#233;raire de consigne &#224; des fins d'utilisation par 
              celui-ci. Sp&#233;cifiez la consigne en entrant son Nom Syst&#232;me 
              ou son Nom d'Utilisateur.</Li>

              <li><strong>D&#233;sattribution Consigne</strong>: d&#233;salloue 
              les OBlocks composant le trac&#233; dde la consigne afin qu'ils 
              puissent &#234;tre attribu&#233;s &#224; d'autres consignes. Sp&#233;cifiez la 
              consigne en entrant son Nom Syst&#232;me ou son Nom d'Utilisateur.</Li>

              <li><strong>D&#233;finir les Aiguillages de l'Itin&#233;raire</strong>: 
              d&#233;finit tous les aiguillages constituant l'itin&#233;raire de 
              la consigne. Sp&#233;cifiez la consigne en entrant son Nom 
              Syst&#232;me ou son Nom d'Utilisateur.</Li>

              <li><strong>Train G&#233;r&#233; en Automatique</strong>: lance la lecture 
              du script enregistr&#233; pour le train sp&#233;cifi&#233; dans la consigne. 
              Sp&#233;cifiez la consigne en entrant son Nom Syst&#232;me ou son Nom d'Utilisateur.</Li>

              <li><strong>Train G&#233;r&#233; Manuellement</strong>: signale &#224; un 
              op&#233;rateur "autorise" qu'un train g&#233;r&#233; par l'homme dispose 
              de droits de circulation pour l'ensemble de l'itin&#233;raire de 
              la consigne. Sp&#233;cifiez la consigne en entrant son Nom Syst&#232;me 
              ou son Nom d'Utilisateur.</Li>

              <li><strong>Commande Auto-Train</strong>: envoie la commande 
              sp&#233;cifi&#233;e &#224; un train en automatique. Sp&#233;cifiez la consigne 
              du train en entrant son Nom Syst&#232;me ou son Nom d'Utilisateur.
              Les commandes sont: <ul>
                <li>arr&#234;ter</li>
                <li>Reprendre</li>
                <li>Abandonner</li>
              </ul></li>

              <li><strong>D&#233;finir l'Identifiant du Train</strong>: 
              d&#233;finissez l'ID du train &#224; partir de l'inventaire ou 
              de l'adresse DCC. Lorsqu'une adresse DCC est utilis&#233;e, 
              sp&#233;cifiez &#233;galement Longue ou Courte. Exemple: 1234 (L) ou 10 (S).</Li>

              <li><strong>D&#233;finir le Nom du Train</strong>: d&#233;finissez 
              le nom du train pour la consigne s&#233;lectionn&#233;e.</li>

              <li><strong>D&#233;finir le Facteur d'Acc&#233;l&#233;ration</strong>: 
              augmente ou diminue les param&#232;tres d'acc&#233;l&#233;ration d'un 
              train automatique du facteur sp&#233;cifi&#233;. Sp&#233;cifiez la consigne 
              du train en entrant son Nom Syst&#232;me ou son Nom d'Utilisateur.</Li>
            
			  

			<li>Horloge rapide <ul>
              <li><strong>D&#233;finir l'Heure de l'Horloge Rapide</strong>: 
              d&#233;finit l'heure de l'horloge rapide en fonction de l'heure 
              entr&#233;e. L'heure est indiqu&#233;e sous la forme <em> hh: mm</em>, 
              o&#249; <em> hh</em> correspond &#224; heures et <em> mm</em> &#224; 
              minutes sur une horloge de 24 heures. Cette action d&#233;finit 
              l'horloge rapide sur l'heure sp&#233;cifi&#233;e, que celle-ci soit 
              en cours d'ex&#233;cution ou arr&#234;t&#233;e.</Li>

              <li><strong>D&#233;marrer l'Horloge Rapide</strong>: d&#233;marre 
              l'heure rapide JMRI. Si l'horloge rapide est d&#233;j&#224; en cours 
              d'ex&#233;cution, cette action est sans effet.</Li>

              <li><strong>Arr&#234;ter l'Horloge Rapide</strong>: met en pause 
              l'horloge rapide JMRI. Si l'horloge rapide ne fonctionne pas, 
              cette action est sans effet.</Li>
           </ul></li>

            <li>Occupation de Canton <ul>
              <li><strong>D&#233;sallocation de Canton</strong>: d&#233;salloue un 
              Canton occup&#233;. Sp&#233;cifiez le OBlock en entrant son Nom Syst&#232;me 
              ou son Nom d'Utilisateur.</Li>

              <li><strong>D&#233;finir la Valeur du Canton</strong>: d&#233;finissez 
              une valeur pour le Canton s&#233;lectionn&#233;.</li>

              <li><strong>D&#233;finir l'erreur de Canton</strong>: d&#233;finissez 
              le statut du Canton s&#233;lectionn&#233; sur "Erreur de Canton".</li>

              <li><strong>Supprimer l'Erreur de Canton</strong>: Supprimez 
              &#201;tat "erreur de Canton" du Canton s&#233;lectionn&#233;</li>

              <li><strong>D&#233;finir le Canton Hors Service</strong>: d&#233;finit 
              le statut d'un Canton d'occupation sur Hors service. 
              Sp&#233;cifiez le OBlock en entrant son Nom Syst&#232;me ou son Nom 
              Utilisateur.</Li>

              <li><strong>Supprimer la mise Hors Service du Canto</strong>: 
              d&#233;finit le statut d'occupation Canton sur l'&#233;tat normal 
              actuel. Sp&#233;cifiez le OBlock en entrant son Nom Syst&#232;me ou 
              son Nom Utilisateur.</Li>
           </ul></li>

            <li>Audio <ul>
              <li><strong>Lire le Fichier Son</strong>: lit le fichier 
              son sp&#233;cifi&#233;. Sp&#233;cifiez le fichier son &#224; lire en entrant 
              son nom dans le champ fourni. Cliquez sur <strong>D&#233;finir
              </strong> pour afficher une bo&#238;te de dialogue de s&#233;lection 
              de fichier facilitant la recherche du fichier. Acc&#233;dez &#224; 
              votre fichier audio, puis cliquez sur le nom de celui-ci 
              dans la bo&#238;te de dialogue pour le copier (avec son chemin) 
              dans le champ.</Li>

              <li><strong>Contr&#244;le Objet Audio</strong>:</li>
           </ul></li>

            <li>Script <ul>
              <li><strong>Script: Ex&#233;cuter le Script</strong>: d&#233;marre 
              le script sp&#233;cifi&#233;. Sp&#233;cifiez le script &#224; commencer en 
              entrant son nom dans le champ fourni. Cliquez sur <strong>
			  D&#233;finir</strong> pour afficher une bo&#238;te de dialogue de 
			  s&#233;lection de fichier permettant de rechercher le fichier. 
			  Acc&#233;dez &#224; votre fichier de script, puis cliquez sur le nom 
			  de votre fichier de script dans la bo&#238;te de dialogue pour 
			  le copier (avec son chemin) dans le champ.</Li>

              <li><strong>Script: Ex&#233;cuter la Commande Jython</strong>: 
              entrez la commande dans le champ Commande de script.</li>
           </ul></li>

            <li>Autre <ul>
              <li><strong>D&#233;clenchement d'Itin&#233;raire</strong>: d&#233;clenche 
              l'itin&#233;raire sp&#233;cifi&#233;.Sp&#233;cifiez l'itin&#233;raire en entrant 
              son nom.</Li>
	      <p>Traduction 2021-03-10</p>
           </ul></li>
         </ul>
       </dd>
     </dl>
      <! - # include virtual = "/ Footer.shtml" ->
   </div> <! -closes #mainContent ->
 </div> <! - closes #mBody ->
</ body>
</ html>
