<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01//EN" "http://www.w3.org/TR/html4/strict.dtd">
<!-- Updated by Herv&#233; Blorec 2017-02-16-->
<html lang="fr">
<head>
    <title>JMRI: Adding/Editing Logix Conditionals</title>
    <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
    <meta name="author" content="Bob Jacobsen">
    <meta name="keywords" content="JMRI help Logix Conditional Add Edit">

<!--#include virtual="/Style" -->
</head>

<body>
<!--#include virtual="/Header" -->
  <div class="nomenu" id="mBody">
    <div id="mainContent">

      <h1>Ajouter/Modifier Conditions Logix</h1>

      <p>La fen&ecirc;tre Modifier Condition c'est o&ugrave; les
      expressions logiques sont &eacute;labor&eacute;es et
      o&ugrave; les actions sont sp&eacute;cifi&eacute;es. La
      fen&ecirc;tre Modifier Condition s'affiche quand un Condition
      est cr&eacute;&eacute;e, ou lorsque le bouton
      <b>&eacute;dition</b> d'une Condition est press&eacute; dans
      la <a href="LogixAddEdit.shtml">fen&ecirc;tre Modifier
      Logix</a> . La fen&ecirc;tre "Modification Condition" affiche
      le nom syst&egrave;me et nom utilisateur de la Condition au
      sommet. Le nom syst&egrave;me est automatiquement
      g&eacute;r&eacute; par le programme et ne peut pas &ecirc;tre
      chang&eacute;. Le nom utilisateur peut &ecirc;tre
      &eacute;dit&eacute; par entrer/modifier le texte dans le
      champ Nom Utilisateur. Le nom d'utilisateur peut ne pas
      &ecirc;tre le m&ecirc;me que le nom utilisateur d'une autre
      Condition dans ce Logix, mais peut &ecirc;tre le m&ecirc;me
      que le nom utilisateur d'une Condition dans un autre
      Logix.</p>

      <p>A Suivre il y a deux sections - une pour l'installation
      d'une expression logique et une autre pour mettre en place
      des actions. Les Conditions sont des &eacute;nonc&eacute;s de
      la forme:</p>

      <div style="margin-left: 2em">
        if (expression logique) then (action).
      </div>
      Une Condition a deux parties distinctes: son
      "expression logique" et ses "Action". La fen&ecirc;tre a des
      sections s&eacute;par&eacute;es pour la mise en place de
      chacune.

      <p>La section expression logique contient un tableau de
      l'&eacute;tat des variables, avec deux boutons en dessous. La
      premi&egrave;re colonne de l'&eacute;tat des variables du
      tableau affiche le num&eacute;ro de la ligne de la variable
      d'&eacute;tat. Ce n'a que peu d'importance lorsque le choix
      de <b>l'Op&eacute;rateur Logique</b> est mis &agrave;
      "mixte". La deuxi&egrave;me colonne contient un AND
      automatique lorsque le choix de <b>l'Op&eacute;rateur
      Logique</b> est mis &agrave; "AND" ou un OR automatique
      lorsque le choix est "OR". Lorsque le choix est "mixte",
      l'utilisateur peut s&eacute;lectionnez AND ou OR au besoin.
      La troisi&egrave;me colonne contient une bo&icirc;te de choix
      qui permet &agrave; l'utilisateur de s&eacute;lectionner
      l'op&eacute;rateur NOT au besoin. La quatri&egrave;me colonne
      est une description de la variable d'&eacute;tat type et la
      condition pour laquelle elle doit &ecirc;tre test&eacute;e.
      La suivante est une colonne affichant l'&eacute;tat actuel de
      la description du test. L'&eacute;tat affich&eacute; inclut
      l'effet de l'op&eacute;rateur NOT, si NOT est
      s&eacute;lectionn&eacute;.</p>

      <p>La colonne Calculs Triggers (D&eacute;clencheurs) contient
      des cases &agrave; cocher qui, normalement, sont
      v&eacute;rifi&eacute;es, de sorte qu'un changement dans la
      variable d'&eacute;tat va d&eacute;clencher un calcul du
      Logix. Pour les rares cas o&ugrave; un changement dans un
      entit&eacute; sp&eacute;cifique (capteur, aiguillage, etc) ne
      devrait pas d&eacute;clencher un r&eacute;sultat du calcul,
      vous devez d&eacute;cocher la case en cliquant dessus.
      D&eacute;cocher la case indique au programme de surveiller
      cette entit&eacute; pour les changements d'&eacute;tat et de
      calculer l'&eacute;tat de la condition, mais il ne prend pas
      action en fonction des r&eacute;sultats.</p>


<h1> Ajouter/Modifier Conditions Logix </h1>
<p>La fen&#234;tre Modifier Condition c'est o&#249; les expressions logiques sont &#233;labor&#233;es
et o&#249; les actions sont sp&#233;cifi&#233;es. La fen&#234;tre Modifier Condition
s'affiche quand un Condition est cr&#233;&#233;e, ou lorsque le bouton <b>&#233;dition</b>
d'une Condition est press&#233; dans la
<a href="LogixAddEdit.shtml"> fen&#234;tre Modifier Logix </a>. La fen&#234;tre "Modification
Condition" affiche le nom syst&#232;me et nom utilisateur de la
Condition au sommet. Le nom  syst&#232;me est automatiquement g&#233;r&#233; par le
programme et ne peut pas &#234;tre chang&#233;. Le nom utilisateur peut &#234;tre &#233;dit&#233; par
entrer/modifier le texte dans le champ Nom Utilisateur. Le nom d'utilisateur peut ne
pas &#234;tre le m&#234;me que le nom utilisateur d'une autre Condition dans ce Logix,
mais peut &#234;tre le m&#234;me que le nom utilisateur d'une Condition dans un autre
Logix.</p>
<p>A Suivre il y a deux sections - une pour l'installation d'une expression logique
et une autre pour mettre en place des actions. Les Conditions sont des &#233;nonc&#233;s de la forme:</p>
<ul>
    <li>if (expression logique) then (action).</li>
</ul>

<p>Une Condition a deux parties distinctes: son "expression logique" et ses
"Action". La fen&#234;tre a des sections s&#233;par&#233;es pour la mise en place de chacune.
</p>
<p> La section expression logique contient un tableau de l'&#233;tat des 
variables, avec deux boutons en dessous. La premi&#232;re
colonne de l'&#233;tat des variables du tableau affiche le num&#233;ro de la ligne de la
variable d'&#233;tat. Ce n'a que peu d'importance lorsque le choix de <b>l'Op&#233;rateur Logique</b>
 est mis &#224; "mixte". La deuxi&#232;me colonne contient un AND automatique lorsque le choix de
<b>l'Op&#233;rateur Logique</b> est mis &#224; "AND" ou un OR automatique 
lorsque le choix est "OR". Lorsque le choix est "mixte", l'utilisateur peut
s&#233;lectionnez AND ou OR au besoin. La troisi&#232;me colonne contient une bo&#238;te de choix qui 
permet &#224; l'utilisateur de s&#233;lectionner l'op&#233;rateur NOT au besoin. La quatri&#232;me colonne est une description
de la variable d'&#233;tat type et la condition pour laquelle elle doit &#234;tre test&#233;e. La suivante
est une colonne affichant l'&#233;tat actuel de la description du test.
L'&#233;tat affich&#233; inclut l'effet
de l'op&#233;rateur NOT, si NOT est s&#233;lectionn&#233;.
<p> La colonne  Calculs Triggers (D&#233;clencheurs) contient des cases &#224; cocher qui, normalement,
sont v&#233;rifi&#233;es, de sorte qu'un changement dans la variable d'&#233;tat va d&#233;clencher un 
calcul du Logix. Pour les rares cas o&#249; un changement dans un
entit&#233; sp&#233;cifique (capteur, aiguillage, etc) ne devrait pas d&#233;clencher un
r&#233;sultat du calcul, vous devez d&#233;cocher la case en cliquant dessus.
D&#233;cocher la case indique au programme de surveiller cette entit&#233; pour les
changements d'&#233;tat et de calculer l'&#233;tat de la condition, mais il ne prend pas
d'action en fonction des r&#233;sultats.
</p>
<p> Les deux derni&#232;res colonnes du tableau (les boutons <b>Modifier</b> et <b>Supprimer</b>)
sont utilis&#233;s pour modifier ou supprimer cette ligne dans la table de variable d'&#233;tat.
supprimer une variable d'&#233;tat si vous d&#233;cidez qu'elle n'est plus n&#233;cessaire. La colonne &#233;tat
du tableau montre l'&#233;tat (vrai ou faux) de chaque &#233;tat de la
variable quand elle est &#233;valu&#233;e.
</p>
<p> Pour l'expression logique, et
donc la Condition, pour calculer vrai, toutes les variables d'&#233;tat
doivent &#233;valuer &#224; vrai.</p>
<p> &#224; tout moment pendant l'entr&#233;e des donn&#233;es des variable d'&#233;tat, <b> V&#233;rifier
Variables d'&#233;tat </b> peut &#234;tre cliqu&#233; pour v&#233;rifier les donn&#233;es saisies et d'&#233;valuer l'&#233;tat des variables. Lorsque ce bouton est enfonc&#233;, la v&#233;rification et l'&#233;valuation se produisent
jusqu'&#224; ce que la v&#233;rifications se termine correctement, ou si une erreur est d&#233;tect&#233;e. Si une
erreur est d&#233;tect&#233;e, la v&#233;rification s'arr&#234;te pour vous permettre de corriger l'erreur et cliquez sur
<b> V&#233;rifiez Variables d'&#233;tat</b> &#224; nouveau.<i> S'il vous pla&#238;t rappelez vous apr&#232;s l'&#233;dition
des &#233;l&#233;ments de donn&#233;es et du nom, cliquez sur une cellule diff&#233;rente dans la table avant de
cliquer <b>V&#233;rifiez Variables d'&#233;tat</b> (ou <b>Mise &#224; Jour Conditions</b> au
le bas de la fen&#234;tre) pour que le programme soit averti que vous avez
termin&#233; votre saisie. Sinon votre entr&#233;e ne peut prendre effet, et une
erreur peut &#234;tre signal&#233;e inutilement. </i> </p>


<p>
L'<b>Op&#233;rateur Logique</b> par d&#233;faut est "AND". Dans ce cas, la condition
permettra de tester si tous les tests variables sont vraies, apr&#232;s la prise du
"NON" n&#233;gations en compte.
En utilisantla boite <b>Op&#233;rateur Logique </b> dessous la liste des variables, vous pouvez
celui-ci changer à "OR" ou "mixtes". «OR» signifie que la Condition sera
vrai si l'un des tests de variables sont vraies, apr&#232;s comptabilisation des n&#233;gations.
S&#233;lection "Mixtes" vous permettra de saisir une expression logique dans une nouvelle
zone de texte &#224; l'aide de AND, OR et NOT et les num&#233;ros de ligne.
Dans cette expression,
chaque variable est mentionn&#233;e par un num&#233;ro, par exemple R1, R2, R3
pour les trois premieres variables, vous pouvez utiliser les op&#233;rateurs "and", "or"
et "not" en plus de parenth&#232;ses.
Quelques exemples:
<pre>
	R1 and R2
	R1 or (R2 et R3)
	(R2 and R3) or (R3 and R1)
</pre>
<h2> Ajout d'une Nouvelle Variable d'&#233;tat</h2>
 <p>Pressez <b>Ajouter Variable d'&#233;tat </b> pour ajouter une
variable d'&#233;tat (une ligne dans la table des variables d'&#233;tat). Cela affichera une
 fen&#234;tre avec une bo&#238;te de choix pour l'utilisateur pour s&#233;lectionner un type de variable d'&#233;tat.
 Les variables d'&#233;tat disponibles sont document&#233;es
<a href="#variable"> ci-dessous</a>. Quand un type est choisie la  fen&#234;tre Modifier Variable
 affiche un champ de texte pour le nom de l'entit&#233; &#224; utiliser pour
 la variable d'&#233;tat.
  Quand un nom (soit  nom syst&#232;me ou nom utilisateur) est entr&#233;, 
il doit correspondre &#224; une entit&#233; existante (capteur, aiguillage,
 lumi&#232;re, etc.) Il est utile d'ouvrir le Tableau Capteur lors de l'entr&#233;e du nom du capteur
 ou le Tableau Aiguillage pour montrer les aiguillages disponibles, etc</p>
 <p><b>Attention :</b> Si vous utilisez des noms utilisateur pour sp&#233;cifier des variables d'&#233;tat soyez
prudent lorsque vous &#233;ditez vos noms d'utilisateur ou vous pouvez casser vos d&#233;finitions de variable d'&#233;tat
. Le nom utilisateur sp&#233;cifi&#233; doit correspondre, caract&#232;re pour caract&#232;re,
blancs, y compris, au nom 'utilisateur r&#233;el du capteur, aiguillage, etc, pour que
vos variables d'&#233;tat  travaillent. Si vous voulez &#234;tre en mesure d'&#233;diter librement vos
noms utilisateur, utilisez le nom  syst&#232;me pour d&#233;finir vos variables d'&#233;tat.</p>
<p> A tout moment pendant l'entr&#233;e
des donn&#233;es des variables d'&#233;tat, le bouton <b>V&#233;rifier Variable d'&#233;tat</b> peut &#234;tre
cliqu&#233; pour v&#233;rifier les donn&#233;es saisies et &#233;valuer les variables d'&#233;tat. Lorsque
ce bouton est enfonc&#233;, il produit un contr&#244;le et l'&#233;valuation proc&#232;det jusqu'&#224; se terminer
  avec succ&#232;s, ou si une erreur est d&#233;tect&#233;e. Si une erreur est
d&#233;tect&#233;e, la v&#233;rification s'arr&#234;te pour que l'utilisateur corrige l'erreur et clique sur
<b>V&#233;rifier les Variables d'&#233;tat</b> &#224; nouveau. S'il vous pla&#238;t rappelez vous <i> apr&#232;s l'&#233;dition du
nom  syst&#232;me et des donn&#233;es des &#233;l&#233;ments de cliquer sur une cellule diff&#233;rente dans la table avant de
cliquer <b>V&#233;rifiez Variables d'&#233;tat</b> (ou <b>Mise &#224; Jour Conditions</b>
au bas de la fen&#234;tre) pour que le programme soit averti que vous avez
termin&#233; votre saisie. Sinon votre entr&#233;e ne peut prendre effet, et une erreur
peuvent &#234;tre signal&#233;s inutilement.</i></p> 

<h2> Ajouter une Nouvelle Action</h2>

<p> La section action de la fen&#234;tre &#233;diter Condition fournit 
les mesures sp&#233;cifiques qui doivent &#234;tre prises quand une 
Condition est calcul&#233;e.

<p> Pour ajouter une nouvelle action, appuyez sur le bouton "Ajouter  Action". 
Une nouvelle fen&#234;tre «&#233;dition Action"  appara&#238;tra.
S&#233;lectionnez un type d'action dans les
&#233;l&#233;ments de la zone Type, et les donn&#233;es n&#233;cessaires pour sp&#233;cifier compl&#232;tement l'action
apparaissent &#224; la droite de la zone Type. Si vous ne savez pas ce qui doit &#234;tre
entr&#233; dans un champ de donn&#233;es, placez votre curseur dessus, et un message 
appara&#238;tra. Quand un nom doit &#234;tre inscrit, le nom doit correspondre &#224;
un nom syst&#232;me ou un nom utilisateur d'une entit&#233; existante (capteur, aiguillage,
 signal, etc) du type appropri&#233;. L'ouverture du Tableau capteur lorsque
la saisie des noms de capteur, ou du tableau aiguillages peut &#234;tre utiles pour voir les aiguillages disponibles,
etc. Les Types d'actions disponibles sont d&#233;crits en d&#233;tail <a href="#action"> ci-dessous</a>.</p>
<p> Pour chaque action, trois options sont disponibles pour le moment pour d&#233;clencher des actions: 1) Le changement &#224; True (Vrai, 2) sur le changement &#224; False (Faux), et 3) sur
Changement. Elles font r&#233;f&#233;rence &#224; l'&#233;tat calcul&#233; de la condition, qui est
&#233;gale &#224; la valeur de l'expression logique tel que sp&#233;cifi&#233;e dans le
tableau des variables d'&#233;tat. Une de ces options doit &#234;tre s&#233;lectionn&#233;e. Lorsque vous avez termin&#233;, cliquez sur
"Mettre &#224; jour" pour installer vos modifications,
"Annuler" pour fermer la fen&#234;tre sans aucune modification
ou "Supprimer" pour supprimer l'action enti&#232;rement.</p>



<p>Les  Actions sont &#233;valu&#233;es dans l'ordre indiqu&#233;. Pour changer cet ordre,
cliquez sur le bouton  "R&#233;organiser" sur la fen&#234;tre "&#233;diter condition". Les boutons les plus &#224; droite
 par les actions pourront ensuite vous permettent de s&#233;lectionner la premi&#232;re, la suivante, etc

<p> Lorsque l'expression logique et les actions ont &#233;t&#233; sp&#233;cifi&#233;es,
cliquez <b>Mise &#224; Jour Condition</b> au bas de la fen&#234;tre. Ceci
initie une v&#233;rification de l'expression logique (le m&#234;me que celui effectu&#233; par <b>V&#233;rifier Variables d'&#233;tat</b>) et une v&#233;rification des donn&#233;es saisies pour les actions. Si 
le nom utilisateur a &#233;t&#233; &#233;dit&#233;, il est &#233;galement v&#233;rifi&#233;. Si une erreur est trouv&#233;e, une
bo&#238;te de message s'ouvre annon&#231;ant l'erreur, et la mise &#224; jour est arr&#234;t&#233; pour
vous permettre de corriger l'erreur et cliquez sur <b>Mise &#224; Jour Conditions</b>
&#224; nouveau. Si aucune erreur n'est trouv&#233;e, l'action est mis &#224; jour avec l'entr&#233;e des donn&#233;es, la fen&#234;tre Modifier Condition est ferm&#233;e, et l'utilisateur est retourn&#233; &#224;
la fen&#234;tre Modifier Logix.</p>


<p> Deux autres boutons sont disponibles au bas de la fen&#234;tre &#233;dition Condition. En cliquant sur <b>Annuler</b> vous fermez la fen&#234;tre &#233;dition Condition sans mise &#224; jour de la Condition. En cliquant <b>Annuler</b> vous perdrez  toutes les donn&#233;e qui ont &#233;t&#233; entr&#233;es. L'autre bouton, <b>Supprimer
Condition</b>, fournit un moyen facile de supprimer une Condition inutile.
Cliquez <b>Supprimer Conditions </b> pour supprimer le Condition en cours de Modification
et revenir &#224; la fen&#234;tre Modifier Logix.</p>

<p> Les variables d'&#233;tat Disponibles et les actions sont list&#233;es ci-dessous. Pour de plus amples
d'informations, consultez la documentation Logix sur la page web JMRI
http://jmri.org/.</p>

<a name="variable"></a>
<h2> Variables d'&#233;tat Disponibles</h2>

<p>Les variables d'&#233;tat  qui sont actuellement disponibles pour une utilisation dans les
Conditions sont &#233;num&#233;r&#233;es ci-dessous, ainsi que des informations sur chacune. Les
variables d'&#233;tat doivent toujours &#234;tre &#233;valuer soit true ou false. La condition
r&#233;sultant en true est donn&#233;e pour chacune. Si la condition n'est pas remplie, le
variable d'&#233;tat est &#233;valu&#233;e &#224; false. Quand un Logix est actif, les &#233;tats des
entit&#233;s (capteur, aiguillage, lumi&#232;re, etc) sp&#233;cifi&#233;s dans les variables d'&#233;tat de
ses Conditions  sont surveill&#233;s, sauf si la case Calcul D&#233;clencheurs
de la variable d'&#233;tat n'est pas coch&#233;e. Un calcul de toutes les conditions avec
Logix est d&#233;clench&#233; lorsqu'un changement d'&#233;tat surveill&#233; comme indiqu&#233; ci-dessous
(S'il n'est pas &#233;vident).</p>
<ul>
	<li>  <b>Capteur Actif</b>: true si l'&#233;tat du
	capteur sp&#233;cifi&#233; est actif.</li>
	<li>  <b>Capteur Inactif</b>: true si l'&#233;tat du
	capteur sp&#233;cifi&#233; est inactif.</li>
	<li>  <b>Aiguillage D&#233;vi&#233;</b>: true si l'&#233;tat connu de
	l'aiguillage sp&#233;cifi&#233; est d&#233;vi&#233;.</li>
	<li>  <b>Aiguillage Direct</b>: true si l'&#233;tat connu de
	l'aiguillage indiqu&#233; est direct.</li>
	<li>  <b>Condition Vrai</b>: true si l'&#233;tat de la
	Condition sp&#233;cifi&#233;e est vraie.</li>
	<li>  <b>Condition fausse</b>: true si l'&#233;tat de
	la Condition sp&#233;cifi&#233; est faux.</li>
	<li>  <b>Lumi&#232;re On</b>: true si la lumi&#232;re sp&#233;cifi&#233;e est 
	allum&#233;e.</li>
	<li>  <b>Lumi&#232;re Off</b>: true si la lumi&#232;re sp&#233;cifi&#233;e est 
	&#233;teinte.</li>
	<li>  <b>M&#233;moire Egale</b>: true si la valeur enregistr&#233;e dans
	la m&#233;moire sp&#233;cifi&#233;e est la m&#234;me que la valeur sp&#233;cifi&#233;e dans la variable d'&#233;tat. 
	Le calcul est d&#233;clench&#233;e lorsque la valeur de m&#233;moire surveill&#233;e 
	change de ou vers la valeur sp&#233;cifi&#233;e.</li>
	<li>  <b>Intervalle Horloge Acc&#233;l&#233;r&#233;e</b>: true si le temps Horloge Acc&#233;l&#233;r&#233;e en cours
	est entre l'heure de d&#233;but et de fin sp&#233;cifi&#233;es pour le
	gamme. Les heures doivent &#234;tre sp&#233;cifi&#233;es dans le format hh: mm, o&#249; hh est heures et
	mn est minutes, par rapport &#224; une horloge de 24 heures. Le calcul est d&#233;clench&#233;
	lorsque le temps d'horloge rapide entre dans la plage et quand le temps d'horloge rapide
	sort de la gamme.</li>
	<li>  <b>Signal Rouge</b>: true si l'apparition du
	signal sp&#233;cifi&#233; est rouge. Le calcul est d&#233;clench&#233; lorsque 
	rouge.</li>
	<li>  <b>Signal Jaune</b>: true si l'apparition du signal sp&#233;cifi&#233; est jaune. Le calcul est d&#233;clench&#233;e lorsque  l'apparence change du ou vers le jaune.</li>
	<li>  <b>Signal Vert.</b>: true si l'apparition du signal sp&#233;cifi&#233; est vert. Le calcul est d&#233;clench&#233; lorsque  l'apparence change du ou vers le vert.</li>
	<li> <b> Signal  Eteint</b>: true si l'apparition du signal est sombre. Le calcul est d&#233;clench&#233; lorsque l'apparence
	change de ou vers l'obscurit&#233;.</li>
	<li>  <b>Signal Clignotant Rouge</b>: true si l'
	l'apparence du signal sp&#233;cifi&#233; est rouge clignotant. Le calcul est
	d&#233;clench&#233; lorsque l'apparence change de ou vers clignotement rouge.</li>
	<li>  <b>Signal Clignotant Jaune</b>: true si l'
	l'apparence du signal sp&#233;cifi&#233; est jaune clignotant. Le calcul
	est d&#233;clench&#233; lorsque l 'apparence change de ou vers jaune clignotant.</li>
	<li>  <b>Signal Clignotant Vert</b>: true si l'
	l'apparence du signal sp&#233;cifi&#233; est vert clignotant. Le calcul
	est d&#233;clench&#233; lorsque l'apparence change de ou vers vert clignotant.</li>
	<li>  <b>Signal Allum&#233;</b>: true si le signal sp&#233;cifi&#233;  est allum&#233;.</li>
	<li>  <b>Signal Maintenu</b>: true si le signal sp&#233;cifi&#233; maintenu.</li>
	</ul>

<a name="action"></a>
<h2> Actions Disponibles</h2>
<p>Les Actions  qui sont actuellement disponibles pour une utilisation dans les Conditions sont
&#233;num&#233;r&#233;s ci-dessous avec des informations sur chacune d'elles:</p>
<ul>
<li>  <b>D&#233;finir Aiguillage</b>: D&#233;finit l'aiguillage indiqu&#233; avec l'&#233;tat choisi.
 Sp&#233;cifiez l'aiguillage en entrant son nom. Sp&#233;cifiez l'&#233;tat
 en choisissant Closed ou Thrown  dans le menu contextuel.</li>
<li>  <b>D&#233;finir Apparence Signal</b>: D&#233;finit le signal sp&#233;cifi&#233;
avec l'apparence choisie. Pr&#233;cisez le signal &#224; D&#233;finir en entrant
son nom. Sp&#233;cifier l'apparence  en choisissant dans le menu contextuel
.</li>
<li>  <b>D&#233;finir Signal Maintenu</b>: D&#233;finit le signal sp&#233;cifi&#233; &#224; Maintenir
. Pr&#233;cisez le signal &#224; tenir en entrant son nom.</li>
<li>  <b>Effacer Signal Maintenu</b>: Efface le maintient sur le signal pr&#233;cis&#233;. Pr&#233;cisez le signal en entrant son nom.</li>
<li>  <b>D&#233;finir Signal Eteint</b>: D&#233;finit le signal sp&#233;cifi&#233; &#224; ne pas
allum&#233;. Pr&#233;cisez le signal en entrant son nom.</li>
<li>  <b>D&#233;finirt Signal allum&#233;</b>: D&#233;finit la t&#234;te signal sp&#233;cifi&#233; et reste allum&#233;.
Pr&#233;cisez la t&#234;te du signal en entrant son nom.</li>
<li> <b>D&#233;clencheur Itin&#233;raire</b>: Les d&#233;clencheurs de l'itin&#233;raire indiqu&#233;. Pr&#233;cisez
l'itin&#233;raire en entrant son nom.</li>
<li>  <b>D&#233;finir Capteur</b>: D&#233;finit le capteur sp&#233;cifi&#233; dans l'&#233;tat choisi
. Sp&#233;cifiez le capteur en entrant son nom. Sp&#233;cifiez l'
&#233;tat en choisissant actif ou inactif dans le menu contextuel.</li>
<li>  <b>D&#233;finir Capteur Temporis&#233;</b>: D&#233;finit le capteur sp&#233;cifi&#233; pour l'&#233;tat 
choisie apr&#232;s attente d'un certain nombre de secondes sp&#233;cifi&#233;es. Pr&#233;cisez
le capteur en entrant son nom. Sp&#233;cifier l'&#233;tat en choisissant
actif ou inactif dans le menu contextuel. Indiquez le nombre de
secondes &#224; attendre avant de fixer les capteurs en entrant un nombre dans le champ le
plus &#224; droite. Si cette condition est d&#233;j&#224; en attente pour d&#233;finir ce
capteur, cette action est ignor&#233;e, et l'action pr&#233;c&#233;dente se poursuit comme
initialement pr&#233;vue. (voir aussi  <b>R&#233;initialisation du Capteur Temporis&#233;</b> ci-dessous.)</li>
<li>  <b>D&#233;finir Lumi&#232;re</b>: D&#233;finit la lumi&#232;re pr&#233;cis&#233; dans l'&#233;tat choisi
. Pr&#233;cisez la lumi&#232;re en entrant son nom. Sp&#233;cifier l'&#233;tat
&#224; mettre en choisissant On ou Off dans le menu contextuel.</li>
<li> <b>D&#233;finir M&#233;moire </b>: D&#233;finit la m&#233;moire sp&#233;cifi&#233;e pour entrer une 
valeur. Pr&#233;cisez la m&#233;moire  en entrant son nom. Sp&#233;cifiez la
valeur &#224; d&#233;finir dans la m&#233;moire en l'inscrivant dans le champ le plus &#224; droite.</li>
<li>  <b>Active Logix</b>: Active le logix sp&#233;cifi&#233;. Sp&#233;cifiez le
Logix &#224; activer en entrant son nom.</li>
<li>  <b>D&#233;sactive Logix</b>: d&#233;sactive le logix sp&#233;cifi&#233;. Pr&#233;cisez
le Logix &#224; d&#233;sactiver en entrant son nom.</li>
<li><b>Jouer un Fichier Son</b>: lit le fichier son sp&#233;cifi&#233;.
Sp&#233;cifiez le fichier son &#224; jouer en entrant son nom dans le champ
fournis. Cliquez  <b>D&#233;finir</b> pour faire appara&#238;tre une bo&#238;te de dialogue de s&#233;lection de fichier d'aide
pour trouver le fichier. Acc&#233;dez &#224; votre fichier audio, puis cliquez sur votre
nom de fichier son dans la bo&#238;te de dialogue pour le copier (y compris son chemin) dans le champ.
</li>
 <li>  <b>Ex&#233;cuter Script</b>: D&#233;marre le script sp&#233;cifi&#233;. Sp&#233;cifiez le
script &#224; d&#233;marrer en entrant son nom dans le champ pr&#233;vu. Cliquez <b>D&#233;finir</b>
pour faire appara&#238;tre une bo&#238;te de dialogue de s&#233;lection de fichiers pour trouver le fichier. Acc&#233;dez &#224;
votre fichier de script, puis cliquez sur le nom de votre fichier de script dans la bo&#238;te de dialogue pour
copier (y compris son chemin) le champ.</li>
	<li>  <b>D&#233;finir Aiguillage Temporis&#233;</b>: D&#233;finit l'aiguillage indiqu&#233; &#224; l'&#233;tat
choisi apr&#232;s attente d'un certain nombre de secondes sp&#233;cifi&#233;es. Pr&#233;cisez
l'aiguillage concern&#233; en entrant son nom. Sp&#233;cifier l'&#233;tat &#224; fixer par
le choix Closed ou Thrown dans le menu contextuel. Indiquez le nombre de
secondes &#224; attendre avant de fixer l'aiguillage en entrant un nombre dans le champ le
plus &#224; droite. Si cette condition est d&#233;j&#224; en attente pour d&#233;finir cet
aiguillage, cette action est ignor&#233;e, et l'action pr&#233;c&#233;dente se poursuit comme
initialement pr&#233;vue. (voir aussi  <b>R&#233;initialiser Aiguillage Temporis&#233;</b> ci-dessous.)</li>
<li>  <b>Verrouillage Aiguillage</b>: Verrouille ou d&#233;verrouille un aiguillage. Entrez le
nom de l'aiguillage, et de choisir l'op&#233;ration &#224; partir du menu contextuel.
Remarque, pour contr&#244;ler le type d'aiguillage &#224; verrouiller aller &#224; la <A
HREF = "TurnoutTable.shtml"> Tableau Aiguillage</a> et s&#233;lectionnez le mode de verrouillage.</li>
<li>  <b>D&#233;finir Capteur R&#233;armement retard&#233; </b>: D&#233;finit le capteur sp&#233;cifi&#233; dans l'&#233;tat 
choisi apr&#232;s d'attente d'un certain nombre de secondes sp&#233;cifi&#233;es. Pr&#233;cisez
le capteur concern&#233; en entrant son nom. Sp&#233;cifier l'&#233;tat &#224; fixer par le
choix  de actif ou inactif dans le menu contextuel. Indiquez le nombre de
secondes &#224; attendre avant de fixer les capteurs en entrant un nombre dans le champ le
plus &#224; droite sur le terrain. Cette action est la m&#234;me que <b>Delayed Set Sensor</b>,
sauf si cette condition est d&#233;j&#224; activement en attente pour D&#233;finir
de capteur sp&#233;cifi&#233;, l'attente pr&#233;c&#233;dente est annul&#233;e, et une nouvelle p&#233;riode d'attente est d&#233;marr&#233;e.
En effet, le temps d'attente est red&#233;marr&#233;. Le capteur n'est pas activ&#233; jusqu'&#224; ce que la
p&#233;riode d'attente la plus r&#233;cente expire.</li>
<li>  <b>Annulez Temporisations Capteur</b>: Annule toutes les minuteries d'attente pour D&#233;finir le capteur
sp&#233;cifi&#233; dans tous les Conditions  dans tous Logixs. Sp&#233;cifiez le capteur en
entrant son nom. Le capteur n'est pas d&#233;fini; toutes les actions actives retard&#233;e pour des
R&#233;glage du capteur sp&#233;cifi&#233; sont annul&#233;s sans r&#233;glage du capteur.</li>
<li>  <b>D&#233;finir Aiguillage R&#233;armement Retard&#233;</b>: D&#233;finit l'aiguillage indiqu&#233; &#224; l'&#233;tat
choisie apr&#232;s attente d'un certain nombre de secondes sp&#233;cifi&#233;es. Pr&#233;cisez
l'aiguillage concern&#233; en entrant son nom. Sp&#233;cifier l'&#233;tat &#224; fixer par
 le choix Droit ou D&#233;vi&#233; dans le menu contextuel. Indiquez le nombre de
secondes &#224; attendre avant de fixer l'aiguillage en entrant un nombre dans le champ le
plus &#224; droite. Cette action est la m&#234;me que <b>D&#233;finir Aiguillage Temporis&#233;</b>,
sauf si cette Condition est d&#233;j&#224; activement en attente pour D&#233;finir l'aiguillage sp&#233;cifi&#233;e, l'attente pr&#233;c&#233;dente est annul&#233;e, et une nouvelle p&#233;riode d'attente est d&#233;marr&#233;e.
En effet, le temps d'attente est red&#233;marr&#233;. L'Aiguillage n'est pas activ&#233; jusqu'&#224; ce que la
p&#233;riode d'attente la plus r&#233;cente expire.</li>
<li>  <b>Annuler Temporisations Aiguillage</b>:  Annule toutes les minuteries d'attente pour D&#233;finir l'
aiguillage sp&#233;cifi&#233; dans toutes les Conditions avec tous les Logixs. Sp&#233;cifiez l'aiguillage en
entrant son nom. L'aiguillage n'est pas d&#233;fini; toutes les actions actives retard&#233;e pour D&#233;finir
les aiguillages sp&#233;cifi&#233;es sont annul&#233;es sans r&#233;glage de l'aiguillage.</li>
<li>  <b>D&#233;finir Heure Horloge Rapide</b>: D&#233;finit l'heure sur l'horloge rapide. L'heure est entr&#233; comme <i> hh: mm</i> o&#249; <i> hh</i> est des heures et des <i> mn</i>  minutes sur une horloge de 24 heures. Cette action d&#233;finit l'horloge rapide &#224; l'heure sp&#233;cifi&#233;e ind&#233;pendamment du fait que l'horloge rapide fonctionne ou est arr&#234;t&#233;e.</li>
<li>  <b>D&#233;marrage Horloge Rapide</b>: D&#233;marre le horloge rapide JMRI. Si l'horloge fonctionne d&#233;j&#224;
 , cette action n'a aucun effet.</li>
<li> <b>Arr&#234;t Horloge Rapide</b>: Suspend l'horloge rapide JMRI. Si l'Horloge
 ne fonctionne pas, cette action n'a aucun effet.</li>
 <li><b>Copier M&#233;moire dans M&#233;moire</b>: Copie la valeur d'une variable de m&#233;moire pour
une autre variable  m&#233;moire. Pr&#233;cisez la m&#233;moire &#224; copier en entrant son
nom dans le champ gauche. Pr&#233;cisez la m&#233;moirereczevant la valeur copi&#233;e en
entrant son nom dans le champ &#224; droite.</li>
<li>  <b>D&#233;finir Intensit&#233; Lumi&#232;re</b>: D&#233;finit l'intensit&#233; de la variable lumineuse sp&#233;cifi&#233;e &#224; la valeur de l'intensit&#233; entr&#233;. Pr&#233;cisez la lumi&#232;re concern&#233;e en
entrant son nom. Pr&#233;ciser l'intensit&#233; en entrant l'intensit&#233; en pourcentage
comme un nombre entier dans la gamme 0 &#224; 100. Si la lumi&#232;re sp&#233;cifi&#233; n'est pas une
variable de la lumi&#232;re, ou si la valeur d'intensit&#233; entr&#233; n'est pas un entier dans la
 gamme requise, un message d'erreur est affich&#233;.</li>

<li> <b> D&#233;finir la Dur&#233;e de Variation de la Lumi&#232;re </b>: D&#233;finit le temps de transition d'un
d'intensit&#233; lumineuse variable sp&#233;cifi&#233;e  &#224; l'heure indiqu&#233;e. Pr&#233;cisez la lumi&#232;re
concern&#233;e en entrant son nom. Sp&#233;cifiez le temps de transition en entrant le
nombre de minutes d'horloge rapide n&#233;cessaire pour passer de 0% d'intensit&#233; &#224; 100%
intensit&#233;. Si la lumi&#232;re sp&#233;cifi&#233;e n'est pas une variable de la lumi&#232;re, ou si un effet positif
entier n'est pas entr&#233; pour le nombre de minutes d'horloge rapide, un
 message d'erreur en r&#233;sultera.</li>
</ul>

    <!--#include virtual="/Footer" -->
    </div>
  </div>
</body>
</html>
