
<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01//FR"
"http://www.w3.org/TR/html4/strict.dtd">

<html lang="fr">
<head>
  <meta name="generator" content=
  "HTML Tidy for Mac OS X (vers 31 October 2006 - Apple Inc. build 15.17), see www.w3.org">

  <title>JMRI: Light Table Help</title>
  <meta http-equiv="Content-Type" content=
  "text/html; charset=iso-8859-1">
  <meta name="author" content="Bob Jacobsen">
  <meta name="keywords" content="JMRI help Light Table lights enable disable">
  <!--#include virtual="/Style.shtml" -->
</head>

<body>
  <!--#include virtual="/Header.shtml" -->
  <div class="nomenu" id="mBody">
    <div id="mainContent">

      <h1>Le Tableau des Lumi&#232;res</h1>

      <p>Les Lumi&#232;res sont des bits de sortie num&#233;riques qui fonctionnent comme des
      interrupteurs. Les Lumi&#232;res ont &#233;t&#233; cr&#233;&#233;es pour fournir un Commande facile pour
      les Lumi&#232;res des TCO et l'&#233;clairage des d&#233;cors. Les Lumi&#232;res peuvent &#233;galement &#234;tre
      utilis&#233;es pour tout usage n&#233;cessitant un interrupteur marche/arr&#234;t. </p>
      
     </p> <p>Les Lumi&#232;res peuvent &#233;galement &#234;tre d&#233;finies comme &#233;tant d'intensit&#233; variable (et pas seulement On/Off).
      Cela d&#233;pendra de l'interface et du mat&#233;riel qui pilotent la
      Lumi&#232;re.</p>

      </p> <p>La table des Lumi&#232;res contient les colonnes suivantes :</p> <p>

      <ul>
        <li>Nom Syst&#232;me</li>
        <li>Nom Utilisateur (facultatif)</li>
        <li>Etat</li>
        <li>Commentaire (facultatif, double-cliquez pour le modifier)</li>.
        <li>Activ&#233; (Commande automatis&#233; de la Lumi&#232;re, sauf Logix)</li>
        <li>Intensit&#233; (disponible dans certains mat&#233;riels uniquement)</li>
      </ul>   

      </p> <p>Le tableau des Lumi&#232;res contient une colonne 'Activ&#233;e'. Pour qu'une Lumi&#232;re
      soit d&#233;clench&#233;e par son Capteur de commande, l'Horloge Rapide ou son Aiguillage de Commande, 
      elle doit &#234;tre "activ&#233;e", c'est-&#224;-dire que sa case &#224; cocher
      dans la colonne "Activ&#233;e" doit &#234;tre coch&#233;e. 
      Vous pouvez d&#233;cocher cette case pour emp&#234;cher temporairement une Lumi&#232;rede se d&#233;clencher, c'est-&#224;-dire pour 
      l'emp&#234;cher de s'allumer lorsque son m&#233;canisme de commande se d&#233;clenche.<br>
      Vous pouvez modifier l'ordre des colonnes en faisant glisser leurs titres,
      et trier les lignes en cliquant sur l'un des triangles de tri &#224; c&#244;t&#233; du titre d'une colonne</p>
      
    <p>Notez que la colonne activ&#233;e/d&#233;sactiv&#233;e ne s'applique qu'au m&#233;canisme de Commande Automatique  d'une Lumi&#232;re.</p>
     
      <br>Un &#233;tat " d&#233;sactiv&#233; " n'emp&#234;chera pas 
      une Lumi&#232;re d'&#234;tre allum&#233;e ou &#233;teinte &#224; l'aide du bouton
      dans le tableau des Lumi&#232;res ou d'&#234;tre command&#233;e par un Logix.</p>

      <img src="images/LightTableGraphic.png" height="135" width="276"
      alt="Colonne d'&#233;tat de la Lumi&#232;re graphique">
      <p>Choisissez entre l'affichage textuel et graphique de l'&#233;tat de la Lumi&#232;re.
      dans les <a href="../../../apps/TabbedPreferences.shtml#Display" 
      title="Pr&#233;f&#233;rences JMRI principales"
      >Pr&#233;f&#233;rences d'affichage</a>.</p>

<!-- = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = -->

      <h2>Cr&#233;ation de nouvelles Lumi&#232;res</h2>
      Pour d&#233;finir une nouvelle Lumi&#232;re, cliquez sur le bouton <a href="LightAddEdit.shtml">Ajouter...</a>.
      dans le tableau des Lumi&#232;res. Cela vous am&#232;nera &#224; une <a href="LightAddEdit.shtml">nouvelle fen&#234;tre</a>
      pour ajouter ou modifier des Lumi&#232;res.

<!-- = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = -->

      <h2>Allumer/&#233;teindre les Lumi&#232;res/r&#233;gler l'intensit&#233;</h2>

      <p>Les Lumi&#232;res peuvent &#234;tre allum&#233;es ou &#233;teintes en cliquant sur le bouton/ic&#244;ne dans la colonne &#201;tat du
      Tableau des Lumi&#232;res.</p>

      </p> <p>Une Lumi&#232;re peut &#234;tre configur&#233;e dans le Tableau des Lumi&#232;res 
      pour &#234;tre command&#233;e par l'&#233;tat d'un Aiguillage, un Capteur d'Occupation 
      de Canton, ou un ou deux Capteurs. Par exemple, le 
      bouton de TCO peut &#234;tre sp&#233;cifi&#233; comme le Capteur de commande de la Lumi&#232;re, 
      l'allumant ou l'&#233;teignant. La commande &#224; deux Capteurs est utile pour 
      Commander les sons de structure ou les barri&#232;res de passage &#224; niveau.</p>
      
      <p class="note">Une Lumi&#232;re peut &#233;galement &#234;tre command&#233;e &#224; partir d'un Logix, en tant qu'action d'une de ses
      conditions. Si vous avez besoin d'une logique plus puissante pour commander votre Lumi&#232;re, envisagez d'utiliser un <a href=
      "LogixTable.shtml">Logix</a>.</p>

      <p>Notez que l'option Activ&#233;/D&#233;sactiv&#233; ne s'applique qu'au m&#233;canisme de Commande automatis&#233;
     d'une Lumi&#232;re. Un &#233;tat " d&#233;sactiv&#233; " n'emp&#234;chera pas
      une Lumi&#232;re d'&#234;tre allum&#233;e ou &#233;teinte &#224; l'aide du bouton
      du Tableau Lumi&#232;re ou d'&#234;tre Command&#233;e par un Logix.</p><p>

      <p>Une Lumi&#232;re variable peut &#233;galement &#234;tre ajust&#233;e en saisissant une valeur
      de 0,00 &#224; 1,00 dans la <b>colonne Intensit&#233;</b> pour la Lumi&#232;re.
      Une Lumi&#232;re qui ne prend pas en charge les intensit&#233;s variables 
      consid&#232;rera toute valeur non nulle comme signifiant "On". Si une Lumi&#232;re a
      des effets de transition activ&#233;s et configur&#233;s, la Lumi&#232;re
      r&#233;pondra en fonction de ces options.</p>

      </p> <p>Le bouton d'&#233;tat d'une Lumi&#232;re variable sera &#233;galement une
      indication d'&#233;tat de la Lumi&#232;re variable. Lorsqu'il n'est pas activ&#233; ou
      Off, il indiquera si le dernier changement &#233;tait un d&#233;placement vers le haut ou vers le bas.
      . L'intensit&#233; affich&#233;e sera l'intensit&#233; actuelle,
      et non l'intensit&#233; cible, lorsque les effets de transition sont
      activ&#233;s.</p>

<!-- = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = -->

      <h2>Enregistrer les Lumi&#232;res sur le disque</h2>

      <p>Le Tableau Lumi&#232;res est conserv&#233; dans votre <i>configuration de r&#233;seau</i>,
      avec les Aiguillages, les Capteurs, les Feux de signalisation, la configuration du panneau de commande, etc. Pour stocker ces
      informations sur disque, utilisez <b>Enregistrer &gt;</b> dans le menu <b>Fichier</b> en haut du Tableau Lumi&#232;res (ou d'autres Tableaux).
       ou s&#233;lectionnez <b>Sauvegarder Panneau...</b> dans le menu <b>Panneau</b>. Notez que l'&#233;tat activ&#233;/d&#233;sactiv&#233; de
      chaque Lumi&#232;re n'est pas enregistr&#233; dans le fichier de configuration. Lorsque les Lumi&#232;res sont charg&#233;es &#224; partir
      d'un fichier de configuration, elles sont toutes activ&#233;es.</p>

<!-- = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = -->
  
<p> Traduction2021-03-12</p>

      <!--#include virtual="/Footer.shtml" -->
    </div><!-- closes #mainContent-->
  </div><!-- closes #mBody-->
</body>
</html>

   
