<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01//EN"
"http://www.w3.org/TR/html4/strict.dtd">
<!-- Updated by Herv&#233; Blorec 2013-10-11-->

<html lang="fr">
<head>
  <meta name="generator" content=
  "HTML Tidy for Mac OS X (vers 31 October 2006 - Apple Inc. build 15.17), see www.w3.org">

  <title>JMRI: Le Tableau Lumi&egrave;re</title>
  <meta name="author" content="Bob Jacobsen">
  <meta name="keywords" content="JMRI help Light Table">
  <!-- Style -->
  <meta http-equiv="Content-Type" content=
  "text/html; charset=us-ascii">
  <link rel="stylesheet" type="text/css" href="/css/default.css"
  media="screen">
  <link rel="stylesheet" type="text/css" href="/css/print.css"
  media="print">
  <link rel="icon" href="/images/jmri.ico" type="image/png">
  <link rel="home" title="Home" href="/">
  <!-- /Style -->
</head>

<body>
  <!--#include virtual="/Header" -->
  <div class="nomenu" id="mBody">
    <div id="mainContent">

      <h1>Le Tableau Lumi&egrave;re</h1>

      <p>Les Lumi&egrave;res sont des bits de sortie
      num&eacute;rique qui fonctionnent comme des interrupteurs
      marche/arr&ecirc;t. Les Lumi&egrave;res ont &eacute;t&eacute;
      cr&eacute;&eacute;es pour fournir un commande facile pour des
      lumi&egrave;res des d&eacute;cors et '&eacute;clairage du
      TCO. Les lampes peuvent aussi &ecirc;tre utilis&eacute;es
      &agrave; des usage qui n&eacute;cessite un commutateur
      marche/arr&ecirc;t. La lumi&egrave;re peut &ecirc;tre
      utilis&eacute;e, par exemple, pour activer un dispositif
      &eacute;lectromagn&eacute;tique d&eacute;coupleur pour un
      temps pr&eacute;-d&eacute;termin&eacute; en r&eacute;ponse
      &agrave; un bouton du TCO ou de jouer un son via un
      d&eacute;codeur stationnaire.</p>

      <p>Les Lumi&egrave;res partagent les bits de sortie
      num&eacute;riques disponibles avec les Aiguillages. Soit une
      Lumi&egrave;re ou un Aiguillage, mais pas les deux, peut
      commander un bit de sortie num&eacute;rique
      sp&eacute;cifique. Puisque les Lumi&egrave;res n'ont pas la
      structure des commentaires des aiguillages, les
      Lumi&egrave;res ne devraient pas &ecirc;tre utilis&eacute;
      pour commander les appareils de voie (aiguillages) sur le
      r&eacute;seau; les Aiguillages seuls devraient &ecirc;tre
      utilis&eacute;s pour commander les aiguillages. Pour des
      raisons historiques, les apparences de la t&ecirc;te de
      signal sont d&eacute;finies en utilisant les aiguillages,
      m&ecirc;me si elles peuvent &ecirc;tre r&eacute;ellement des
      luminaires physique. Alors les Aiguillages devraient
      &ecirc;tre utilis&eacute;s pour faire r&eacute;f&eacute;rence
      aux bits de sortie num&eacute;riques utilis&eacute; avec les
      T&ecirc;tes de signal JMRI. L'&eacute;clairage doit
      &ecirc;tre utilis&eacute; si vous avez besoin d'un
      m&eacute;canisme simple pour commander l'&eacute;clairage des
      d&eacute;cors ou des voyants du TCO, ou pour d'autres
      t&acirc;ches on/ff o&ugrave; les m&eacute;canismes de
      commande des lumi&egrave;res sont adapt&eacute;s aux
      besoins.</p>

      <p>En option, un lumi&egrave;re peut &ecirc;tre
      command&eacute;e de cinq fa&ccedil;ons: elle peut &ecirc;tre
      command&eacute;e par un seul capteur, par deux capteurs, par
      un aiguillage, par l'horloge rapide JMRI , ou allum&eacute;e
      pendant un certain temps par un capteur. Un ou plusieurs des
      ces coommandes peuvent &ecirc;tre sp&eacute;cifi&eacute;es
      quand la lumi&egrave;re est cr&eacute;&eacute;e, ou quand
      elle est &eacute;dit&eacute;e via le tableau
      lumi&egrave;re.</p>

      <p>Quand une lumi&egrave;re est cr&eacute;&eacute;e, ou quand
      elle est lue &agrave; partir d'un fichier de configuration,
      la lumi&egrave;re est "activ&eacute;e", elle est mise en
      place pour surveiller automatiquement les changements de
      l'&eacute;tat de son capteur de commande (s), l'aiguillage ou
      une horloge rapide. Lorsque le capteur de commande,
      l'aiguillage, ou horloge rapide changent d'une mani&egrave;re
      sp&eacute;cifi&eacute;e par l'utilisateur, la lumi&egrave;re
      est allum&eacute;e ou &eacute;teinte. Les Lumi&egrave;res
      peuvent &eacute;galement &ecirc;tre command&eacute;es par
      <a href="Logix.shtml">logix</a>, si plus de logique de
      commande complexe est n&eacute;cessaire.</p>

      <p>Le Tableau Lumi&egrave;re contient une colonne
      "Activ&eacute;" . Pour une lumi&egrave;re pour &ecirc;tre
      d&eacute;clench&eacute;e par son capteur de commandee,
      l'horloge rapide, l'aiguillage ou par sa commande, elle doit
      &ecirc;tre "activ&eacute;e", c'est &agrave; dire que sa case
      dans la colonne "Activ&eacute;" doit &ecirc;tre
      coch&eacute;e. Vous pouvez d&eacute;cocher cette case pour
      d&eacute;sactiver temporairement une Lumi&egrave;re, c'est
      &agrave; dire &eacute;viter qu'elle commute lorsque son
      m&eacute;canisme de commande prend feux!</p>

      <p>Une lumi&egrave;re peut aussi &ecirc;tre une variable
      lumi&egrave;re. Cela d&eacute;pendra de l'interface et du
      mat&eacute;riel de pilotage de la lumi&egrave;re.</p>

      <h2>Commutation d'une Lumi&egrave;re Allum&eacute;e(On) ou
      &eacute;teinte(Off)</h2>

      <p>Les Lumi&egrave;res peuvent &ecirc;tre activ&eacute;es ou
      d&eacute;sactiv&eacute;es en cliquant sur le bouton dans la
      colonne &eacute;tat du tableau Lumi&egrave;re. Une
      Lumi&egrave;re peut &ecirc;tre mise en place pour suivre
      l'&eacute;tat d'un aiguillage, lorsque l'aiguillage est
      droit, et lorsqu'il est d&eacute;vi&eacute; ou vice-versa.
      Une lumi&egrave;re peut &ecirc;tre r&eacute;gl&eacute;e pour
      suivre l'&eacute;tat d'un capteur d'occupation de canton,
      lorsque le capteur est actif, et d&eacute;sactiv&eacute;
      quand il est inactif, ou vice-versa. Une lumi&egrave;re peut
      &eacute;galement &ecirc;tre r&eacute;gl&eacute;e par un
      bouton du TCO, si un capteur pour ce bouton est d&eacute;fini
      comme le capteur de commande. Une lumi&egrave;re peut
      &ecirc;tre configur&eacute;e pour suivre les horloges rapides
      JMRI, sur une p&eacute;riode de temps
      sp&eacute;cifi&eacute;e, puis s'&eacute;teint. Une
      lumi&egrave;re peut &ecirc;tre command&eacute;e par deux
      capteurs, sur le moment ou l'un ou l'autre des deux capteurs
      est actif (ou inactif). Deux capteur de commande sont utiles
      pour commander les sons des am&eacute;nagement ou pour
      traverser les portes. Une lumi&egrave;re peut
      &eacute;galement &ecirc;tre command&eacute;e &agrave; partir
      d'un Logix, comme l'action d'une de ses conditions. Si vous
      besoin d'une logique plus puissante pour commander votre
      lumi&egrave;re, pensez &agrave; utiliser un <a href=
      "Logix.shtml">Logix</a>.</p>

      <p>Notez que activ&eacute;/d&eacute;sactiv&eacute; s'applique
      uniquement &agrave; un m&eacute;canisme de commande
      automatis&eacute; Lumi&egrave;re . Un &eacute;tat
      "d&eacute;sactiv&eacute;" 'n'emp&ecirc;chera pas une
      Lumi&egrave;re d'&ecirc;tre activ&eacute;e ou
      d&eacute;sactiv&eacute;e en utilisant le bouton dans le
      tableau Lumi&egrave;re ou &agrave; partir d'un Logix.</p>

      <p>Une lumi&egrave;re variable peut &eacute;galement
      &ecirc;tre ajust&eacute;e en entrant une valeur de 0,00
      &agrave; 1,00 dans la colonne <b>intensit&eacute;</b> pour la
      lumi&egrave;re. Une lumi&egrave;re qui ne supporte pas les
      intensit&eacute;s variables aura comme valeur significative
      z&eacute;ro. Si une lumi&egrave;re a des effets de transition
      activ&eacute; et configur&eacute;, la lumi&egrave;re
      r&eacute;pondra en fonction de ces options.</p>

      <p>Le bouton d'&eacute;tat pour une lumi&egrave;re variable
      sera aussi une indication de l'&eacute;tat de la
      lumi&egrave;re variable. Quand elle n'est pas sous ou hors
      tension, il affichera la derni&egrave;re modification plus ou
      moins &eacute;lev&eacute;e L'intensit&eacute; affich&eacute;e
      sera l'intensit&eacute; du courant, et non pas
      l'intensit&eacute; cible, quand des effets de transition sont
      activ&eacute;s.</p>

      <h2>Cr&eacute;er Nouvelles Lumi&egrave;res</h2>Pour
      d&eacute;finir une nouvelle lumi&egrave;re, cliquez sur le
      bouton <a href="LightAddEdit.shtml">Ajouter ...</a> tableau
      lumi&egrave;re Cela vous m&egrave;nera &agrave; une <a href=
      "LightAddEdit.shtml">nouvelle fen&ecirc;tre</a> pour l'ajout
      ou la modification Lumi&egrave;res.

      <h2>Sauvegarde de Lumi&egrave;res sur Disque</h2>

      <p>Les Lumi&egrave;res sont enregistr&eacute;s dans votre
      fichier de configuration r&eacute;seau, avec les aiguillages,
      les capteurs, les t&ecirc;tes de signal, etc. Pour stocker
      ces informations sur le disque, utilisez <b>Sauvegarder</b>
      dans le menu <b>Fichier</b> en haut du tableau Lumi&egrave;re
      (ou d'autres tableaux &agrave; partir du menu Outils), ou
      s&eacute;lectionnez Panneau <b>Sauvegarder ...</b> dans le
      <b>Panneau</b>. Notez que l'&eacute;tat
      activ&eacute;/d&eacute;sactiv&eacute; de chaque
      lumi&egrave;re n'est pas enregistr&eacute; dans le fichier de
      configuration. Lorsque les Lumi&egrave;res sont
      charg&eacute;es &agrave; partir d'un fichier de
      configuration, elles sont tous activ&eacute;es.</p>

      <!--#include virtual="/Footer" -->
    </div>
  </div>
</body>
</html>
