<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01//EN"
"http://www.w3.org/TR/html4/strict.dtd">
<html lang="fr">
<head>
  <meta name="generator" content=
  "HTML Tidy for Mac OS X (vers 31 October 2006 - Apple Inc. build 15.17), see www.w3.org">

  <title>JMRI: Le Tableau L-Itin&#233;raire</title>
  <meta content="Bob Jacobsen" name="Author">
  <meta name="keywords" content="JMRI help LRoute Table">
  <!-- Style -->
  <meta http-equiv="Content-Type" content=
  "text/html; charset=iso-8859-1">
  <link rel="stylesheet" type="text/css" href="/css/default.css"
  media="screen">
  <link rel="stylesheet" type="text/css" href="/css/print.css"
  media="print">
  <link rel="icon" href="/images/jmri.ico" type="image/png">
  <link rel="home" title="Home" href="/"><!-- /Style -->
</head>

<body>
  <!--#include virtual="/Header.shtml" -->

  <div class="nomenu" id="mBody">
    <div id="mainContent">
      <h1>Le Tableau L-Itin&#233;raire</h1>

      <p>Un L-Itin&#233;raire est une version plus g&#233;n&#233;ralis&#233;e d'un itin&#233;raire 
      mise en &#156;uvre en tant que Logix. Il est destin&#233; &#224; &#234;tre utilis&#233; 
      dans des situations o&ugrave; des d&#233;clenchements suppl&#233;mentaires ou
      actions sont souhait&#233;s au-del&#224; des capacit&#233;s des Itin&#233;raires. Il 
      peut &#234;tre utilis&#233; comme point de d&#233;part pour cr&#233;er de nouveaux Logix. 
      Le Tableau L-Itin&#233;raire fournit les listes de s&#233;lection de Capteurs, 
      d'Aiguillages, Lumi&#232;res et Signaux &#224; partir desquels les actions 
      de sortie et les conditions de d&#233;clenchement peuvent &#234;tre choisies.</p>

      <p>Une fois que vous avez quelques Aiguillages, Capteurs, Signaux 
      et/ou des Lumi&#232;res &#224; g&#233;rer, utiliser le bouton <b>Ajouter</b> dans 
      le coin inf&#233;rieur gauche du Tableau L-Itin&#233;raire pour cr&#233;er un 
      nouvel itin&#233;raire Logix. Une fois que vous avez cr&#233;&#233; un itin&#233;raire 
      Logix, vous pouvez ajouter d'autres capacit&#233;s en l'&#233;ditant depuis 
      le Tableau Logix.</p>

      <p>Le Logix qui impl&#233;mente le L-Itin&#233;raire a son nom syst&#232;me 
      pr&#233;fix&#233; par "RTX". Tous les  Logix avec ce pr&#233;fixe sont affich&#233;s 
      dans le Tableau L-Itin&#233;raire. S'il vous pla&icirc;t noter qu'un 
      "RTX" Logix qui a eu ces capacit&#233;s ajout&#233;es avec Logix &#233;dition 
      ne peut pas &#234;tre capable d'afficher ces capacit&#233;s additionnelles 
      pour l'&#233;dition de L-Itin&#233;raire. Une fois que l'&#233;dition Logix est 
      faite pour un L-Itin&#233;raire il est recommand&#233; que les autre
      &#233;ditions soient faites &#224; partir du tableau Logix.</p>

      <h2>Colonnes Tableau L-Itin&#233;raire</h2>

      <dl>
        <dt>Nom Syst&#232;me</dt>

        <dd>Le Nom Syst&#232;me ne peut pas &#234;tre chang&#233; une fois entr&#233; dans 
        le Tableau. Le bouton <b>Ajouter</b> situ&#233; dans le coin
        inf&#233;rieur gauche du Tableau vous permet d'ajouter un nouvel 
        L- Itin&#233;raire au Tableau.</dd>

        <dt>Nom Utilisateur</dt>

        <dd>Vous pouvez directement saisir ou modifier le champ
        "Nom Utilisateur" pour un itin&#233;raire Logix existant</dd>

        <dt>Activ&#233;</dt>

        <dd>Pour d&#233;sactiver un L-Itin&#233;raire &#224;  partir de d&#233;clenchement, 
        d&#233;cochez la case "Activ&#233;" pour l'itin&#233;raire. Ceci d&#233;finit son 
        Logix &#224; un &#233;tat d&#233;sactiv&#233;. Le L-Itin&#233;raire peut  &#234;tre activ&#233; ou 
        d&#233;sactiv&#233; soit &#224; partir du Tableau  L-Itin&#233;raire ou du Tableau
        Logix.</dd>

        <dt>Modifier</dt>

        <dd>Appuyez sur ce bouton pour modifier le L-Itin&#233;raire. Pour 
        plus d'informations, voir:
        <a href="LRouteAddEdit.shtml">Ajout/Edition Litin&#233;raires</a>.</dd>
      </dl>

      <h3>Commandes du Tableau L-Itin&#233;raire</h3>

      <p>Il y a un bouton au bas du Tableau L-Itin&#233;raire</p>

      <dl>
        <dt>Ajouter</dt>

        <dd>Appuyez sur ce bouton pour ajouter un nouvel itin&#233;raire Logix. 
        Pour plus d'informations, voir
        <a href="LRouteAddEdit.shtml">Ajouter/Editer
        L-Itin&#233;raires</a>.</dd>
        <p>Traduction 2021-03-10</p>
      </dl><!--#include virtual="/Footer.shtml" -->
    </div>
  </div>
</body>
</html>
