<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01//EN"
"http://www.w3.org/TR/html4/strict.dtd">
<!-- $Id$ -->
<!-- Updated by Herv&#233; Blorec 2019-04-06-->

<html lang="fr">
<head>
  <meta name="generator" content=
  "HTML Tidy for Mac OS X (vers 31 October 2006 - Apple Inc. build 15.17), see www.w3.org">

  <title>JMRI: Section Table Help</title>
  <meta http-equiv="Content-Type" content=
  "text/html; charset=us-ascii">
  <meta content="Dave Duchamp" name="Author">
  <meta name="keywords" content="JMRI help Section Table">
  <!--#include virtual="/Style" -->
</head>

<body>
  <!--#include virtual="/Header" -->

  <div class="nomenu" id="mBody">
    <div id="mainContent">
     <h1>Tableau de Section</h1>
      <p>Avant de plonger dans le fonctionnement du Tableau de Sections, 
      fournissons quelques informations de base sur les Sections et leur 
      utilisation avec le <a href="../dispatcher/Dispatcher.shtml"> R&#233;partiteur </a>.

      <h2>Conditions d'utilisation des Sections</h2>

      <p>Les sections peuvent &#234;tre utilis&#233;es avec un panneau d'&#233;diteur de 
      panneaux, avec un panneau <a href="../display/LayoutEditor.shtml">
	  &#201;diteur de R&#233;seau </a>, avec un ordinateur CTC ou directement sans 
	  panneau. Les sections font partie de <a href= 
	  "../dispatcher/Dispatcher.shtml"> Dispatcher </a> et s'appuient 
	  sur la structure cantons et Chemins de JMRI. Par cons&#233;quent, avant 
	  de tenter de cr&#233;er des sections, vous devez initialiser les <a href=
	  "CantonkTable.shtml"> Cantons </a> et <a href=
	  "CantonkTable.shtml#cantonkChemins"> Chemins </a> pour votre r&#233;seau. 
	  (Un moyen facile d'initialiser automatiquement, vos cantons
      et Chemin doivent esquisser un <a href=
      "../display/LayoutEditor.shtml"> &#201;diteur de R&#233;seau</a> du panneau 
      de votre R&#233;seau, avec les cantons attribu&#233;s. En attribuant des 
      cantons &#224; tous les segments de voie, aiguillages, etc. dans l'&#233;diteur 
      de r&#233;seau, les chemins seront cr&#233;&#233;s automatiquement par le logiciel.)</P>

      <p>Le cantonnement du r&#233;seau doit &#234;tre soigneusement planifi&#233;, 
      afin de fournir des Sections "<i>raisonnables</i>" - Sections qu'il 
      est judicieux pour un r&#233;partiteur d'allouer &#224; un train. Par exemple, 
      pour les aiguillages droits ou gauches qui changent de voie principale, 
      cela signifie g&#233;n&#233;ralement d'inclure l'aiguille dans le m&#234;me canton 
      que la voie entrant au niveau de l'aiguille et de pr&#233;voir des cantons 
      s&#233;par&#233;s pour les voies continues et divergentes. Certains pr&#233;f&#232;rent 
      avoir un aiguillage dans un canton s&#233;par&#233;, et cela fonctionne tr&#232;s 
      bien aussi. Du point de vue du dispatching, il n'est pas n&#233;cessaire 
      de bloquer s&#233;par&#233;ment les voies de passage des lignes principales 
      desservant des industries, mais le cantonnement est acceptable ici. 
      Un sch&#233;ma de cantonnement du R&#233;seau qui fonctionne bien pour les 
      signaux devrait &#233;galement fonctionner pour les sections.</P>

      <p>Les signaux ne sont pas n&#233;cessaires pour utiliser les sections,
       mais les sections fonctionneront correctement si les signaux sont 
       install&#233;s. Si les <a href=
       "../../../../html/tools/signaling/index.shtml#tools"> signaux </a> 
       sont install&#233;s, les capteurs de direction inclus dans les sections 
       permettent de configurer la signalisation APB simple (voir ci-dessous).</p>

      <h2>Utilisation du Tableau de Section</h2>

      <p>Toutes les sections dont JMRI a connaissance peuvent &#234;tre 
      visualis&#233;es &#224; l'aide du <b>Tableau de Sections</b>. Les Sections 
      peuvent &#234;tre cr&#233;&#233;es manuellement dans le volet Tableau de Section 
      ou automatiquement si vous envisagez &#233;galement d'utiliser la Logique 
      du M&#226;t de Signalisation <a href="#M&#226;t de Signalisation"> (voir ci-dessous) </a>.</P>

      <p>Pour ouvrir cet outil, s&#233;lectionnez <b>Sections</b> dans le 
      sous-menu <b>Tableaux</b> du menu <b>Outils</b> de la fen&#234;tre 
      principale du programme JMRI.</p>

      <h3>Colonnes du Tableau de Section</h3>
      Vous pouvez modifier l'ordre des colonnes en faisant glisser leurs 
      titres et trier les lignes en cliquant sur l'un des triangles de 
      tri en regard d'un titre de colonne. La table des sections comprend 
      huit colonnes:

      <ul>
        <li><b>Nom Syst&#232;me</b> - Le Nom du Syst&#232;me est attribu&#233; &#224; la 
        Section lors de sa cr&#233;ation et ne peut pas &#234;tre modifi&#233;.</li>

        <li><b>Nom Utilisateur</b> - Si vous souhaitez que vos sections 
        portent des noms "lisibles par l'homme", vous pouvez cliquer dans 
        la colonne "Nom Utilisateur" et modifier les informations &#224; votre guise.</li>

        <li><b>&#201;tat</b> - L'&#233;tat d'une section indique si une section est 
        "attribu&#233;e" ou "utilis&#233;e" par un ou plusieurs trains. L'&#233;tat 
        d'une section nouvellement ajout&#233;e est toujours <b>LIBRE</b>. 
        Lorsqu'une Section est affect&#233;e &#224; un d&#233;placement dans la direction 
        allant du "Premier Canton" au "Dernier Canton", l'&#233;tat est 
        <b>AVANT</b>. Lorsqu'il est affect&#233; &#224; un d&#233;placement dans le 
        sens oppos&#233;, l'&#233;tat est <b>INVERSE</b>.</Li>

        <li><b>Commentaire</b>: cette colonne vous permet d'enregistrer 
        les commentaires que vous souhaitez utiliser pour garder une 
        trace de vos sections. C'est pour information seulement.</Li>

        <li><img src = "images/SectionDeleteWarning.png" height = "57" 
        width "279" align = "right"> Cliquez sur le bouton <b>Supprimer</b> 
        dans une ligne sp&#233;cifique pour supprimer la section dans cette 
        rang&#233;e. N'oubliez pas de supprimer tous les Transits utilisant 
        cette Section. Tout Transit utilisant une Section supprim&#233;e sera 
        cass&#233;! Utilisez ce bouton avec prudence!
       </li>

        <li><b>Premier Canton</b>: cette colonne affiche le premier canton 
        de la section. Puisqu'une section est un groupe d'un ou plusieurs 
        cantons connect&#233;s, il y a toujours une entr&#233;e.</Li>

        <li><b>Dernier Canton</b> - Cette colonne indique le dernier canton 
        de la section. Puisqu'une section ne peut contenir qu'un seul 
        canton, le dernier canton peut &#234;tre identique au premier.</Li>
        
        <li>Cliquez sur le bouton <b>Modifier</b> dans une rang&#233;e pour 
        afficher ou modifier les informations entr&#233;es pour une section. 
        Le Nom Syst&#232;me ne peut pas &#234;tre chang&#233;. Le Nom Utilisateur peut 
        &#234;tre modifi&#233;, les cantons peuvent &#234;tre red&#233;finis, les points 
        d'entr&#233;e peuvent &#234;tre reconfigur&#233;s, etc. Une seule Section peut 
        &#234;tre modifi&#233;e &#224; la fois. Une Section ne peut pas &#234;tre modifi&#233;e 
        pendant la cr&#233;ation d'une autre.</Li>
     </ul>

      <h3>Cr&#233;ation d'une Nouvelle Section</h3>

      <p>Pour cr&#233;er une Nouvelle Section, cliquez sur le bouton "<a href=
      "SectionAddEdit.shtml"> Ajouter .." </a> situ&#233; au bas du volet 
      Tableau de Section. Une fen&#234;tre appara&#238;tra vous permettant de 
      d&#233;finir les Cantons inclus dans la nouvelle Section et, le cas 
      &#233;ch&#233;ant, de d&#233;signer les points d'entr&#233;e de la Section entra&#238;nant 
      un d&#233;placement dans les directions AVANT et INVERSE.</P>

      <p>Actuellement, l'utilisateur doit s&#233;lectionner manuellement 
      <b>AVANT</b> ou <b>ARRI&#200;RE</b> pour chaque point d'entr&#233;e apr&#232;s 
      l'ajout de tous les Cantons &#224; une Section. Le programme d&#233;finira 
      automatiquement certaines directions, mais d'autres resteront sous 
      la forme <b>INCONNU</b>. Un point d'entr&#233;e doit &#234;tre r&#233;gl&#233; sur AVANT
       si un train entrant dans la Section &#224; ce point d'entr&#233;e empruntait 
       la direction AVANT. Sinon, il devrait &#234;tre r&#233;gl&#233; sur INVERSE. Un 
       &#233;ventuel ajout consiste &#224; d&#233;finir automatiquement les directions 
       des points d'entr&#233;e &#224; partir de la connectivit&#233; trouv&#233;e dans un 
       panneau de l'&#233;diteur R&#233;seau.</P>

      <p>Pour les sections comportant plus d'un canton, le d&#233;placement 
      d'un canton num&#233;rot&#233; inf&#233;rieur vers un canton num&#233;rot&#233; sup&#233;rieur 
      est un d&#233;placement AVANT. En d'autres termes, passer d'un canton 
      situ&#233; plus haut dans la liste &#224; un canton situ&#233; plus bas dans la 
      liste correspond au voyage AVANT. De la m&#234;me fa&#231;on, le d&#233;placement 
      INVERSE passe d'un canton num&#233;rot&#233; sup&#233;rieur &#224; un canton num&#233;rot&#233; 
      inf&#233;rieur. Pour les sections avec un seul canton, il n'est pas 
      important de savoir quelle direction dans la section est d&#233;sign&#233;e 
      AVANT, &#224; condition que les directions de d&#233;placement du point 
      d'entr&#233;e soient coh&#233;rentes. C'est:</p>

      <ul>
        <li>Les directions de d&#233;placement INVERSE et AVANT doivent &#234;tre 
        oppos&#233;es.</li>

        <li>L'entr&#233;e &#224; n'importe quel point d'entr&#233;e AVANT doit entra&#238;ner 
        le d&#233;placement dans le m&#234;me sens que la saisie &#224; tous les autres 
        points d'entr&#233;e AVANT.</li>

        <li>L'entr&#233;e &#224; tout point d'entr&#233;e INVERSE doit entra&#238;ner le 
        d&#233;placement dans le m&#234;me sens que la saisie &#224; tous les autres 
        points d'entr&#233;e INVERSE.</li>
     </ul>

      <p><b>AVERTISSEMENT: Si les points d'entr&#233;e ne sont pas coh&#233;rents, 
      un comportement &#233;trange peut survenir lors de l'utilisation de la 
      section..</b></p>

      <a name="tools" id="tools"> </a>
      <h3>Outils du Tableau de Section</h3>

      <p>Le Tableau des Sections comporte un menu <b>Outils</b> pour 
      faciliter l'utilisation des Sections. Normalement, ces outils seraient 
      utilis&#233;s une fois toutes les Sections d&#233;finies. Les &#233;l&#233;ments du menu 
      et leur utilisation sont d&#233;crits ci-dessous:</p>

      <ul>
        <li>
          <b>Valider toutes les Sections ...</b> - Lorsque cet &#233;l&#233;ment 
          est s&#233;lectionn&#233;, chaque Section est test&#233;e pour sa coh&#233;rence. 
          Les tests actuels incluent la v&#233;rification de la connectivit&#233; 
          entre plusieurs Cantons, la v&#233;rification de l'absence de points 
          d'entr&#233;e ou de points d'entr&#233;e suppl&#233;mentaires et, si un panneau 
          &#201;diteur de r&#233;seau est disponible, la v&#233;rification que les 
          Chemins d'acc&#232;s sont correctement configur&#233;s pour les Cantons 
          dans les Sections. <b>Cet outil ne v&#233;rifie pas si les directions 
          AVANT et INVERSE sont correctement d&#233;finies pour chaque point 
          d'entr&#233;e</b>, mais cette fonctionnalit&#233; est un ajout futur 
          pr&#233;vu. Une fois les tests termin&#233;s, un message indiquant les 
          r&#233;sultats des tests s'affiche. Les messages d'erreur d&#233;taill&#233;s, 
          le cas &#233;ch&#233;ant, sont plac&#233;s dans le journal des erreurs JMRI.
          
        

		<li>
          <b>D&#233;finir les Capteurs de direction dans la Logique ...</b> 
          (non requis si vous utilisez la logique M&#226;t de Signalisation) - Lorsque 
          cet &#233;l&#233;ment est s&#233;lectionn&#233;, les Capteurs de direction d&#233;finis 
          pour chaque section sont plac&#233;s dans la logique de signal des 
          Signaux appropri&#233;es - ces Signaux responsables internes de la 
          Section ou en prot&#233;geant l'entr&#233;e dans la section. Les Capteurs 
          de direction suivent l'&#233;tat d'attribution de leurs sections. 
          Lorsqu'une section est LIBRE (non attribu&#233;e), ses deux capteurs 
          de direction sont activ&#233;s. En pla&#231;ant ces capteurs dans une 
          logique de signal appropri&#233;e, tous les signaux internes ou 
          prot&#233;geant les points d'entr&#233;e de la Section sont forc&#233;s au ROUGE 
          lorsque la section est LIBRE. Lorsqu'une section est affect&#233;e 
          au d&#233;placement dans le sens AVANT, son Capteur de sens avant 
          est d&#233;fini sur INACTIF, ce qui permet &#224; la logique de signalisation 
          de fonctionner normalement pour le passage dans la section dans 
          le sens AVANT, tout en maintenant les signaux r&#233;gissant le 
          d&#233;placement dans le sens INVERSE d&#233;fini sur ROUGE. De m&#234;me, 
          lorsque la section est affect&#233;e au d&#233;placement dans le sens 
          INVERSE, le capteur de sens INVERSE est d&#233;fini sur INACTIF et 
          le capteur de sens direct est sur ACTIf, permettant ainsi aux 
          signaux de lib&#233;rer le trajet dans le sens INVERSE, mais de bloquer 
          le d&#233;placement dans le sens AVANT. Le r&#233;glage de l'&#233;tat des 
          Capteurs de direction est effectu&#233; automatiquement par le 
          logiciel dans <a href= "../dispatcher/Dispatcher.shtml">
			R&#233;partiteur </a> qui alloue les sections.

          <p>Remarque: Dispatcher peut placer les capteurs de direction 
          dans la logique de signalisation SSL automatiquement lorsqu'un 
          train est activ&#233;. Dispatcher placera des capteurs de direction 
          s'il est dot&#233; d'un panneau Editeur de r&#233;seau et qu'il est 
          autoris&#233; &#224; utiliser sa connectivit&#233; (requis pour un fonctionnement 
          automatique). Cela permet d'utiliser la signalisation de direction 
          m&#234;me si le panneau est enregistr&#233; avec ces capteurs retir&#233;s de 
          la logique du signal.</P>

          <p>Cet outil ne doit &#234;tre utilis&#233; qu'une fois que toutes les 
          sections ont &#233;t&#233; d&#233;finies et que toute la logique de signalisation 
          a &#233;t&#233; configur&#233;e. Un panneau &#201;diteur de R&#233;seau est requis, car 
          le logiciel a besoin de la connectivit&#233; du panneau pour d&#233;terminer 
          quels signaux ont besoin d'un capteur de direction. Si un capteur 
          de direction est d&#233;j&#224; dans la logique de signalisation simple 
          (SSL) pour un signal, il n'est pas dupliqu&#233;. Cependant, si un 
          capteur de direction incorrect est pr&#233;sent dans le protocole 
          SSL, il n'est pas supprim&#233;. (Utilisez l'outil d&#233;crit ci-dessous 
          pour retirer les capteurs de direction.) Une fois les capteurs 
          de direction plac&#233;s, un message indiquant les r&#233;sultats s'affiche. 
          Les messages d'erreur d&#233;taill&#233;s, le cas &#233;ch&#233;ant, sont plac&#233;s 
          dans le journal des erreurs JMRI. Lorsqu'une erreur survient, 
          les raisons les plus courantes sont 1) des informations manquantes 
          (signaux manquants ou logique de signal non configur&#233;e) ou 
          2) des erreurs de configuration des directions de point d'entr&#233;e 
          de section.</P>
       </li>

        <li><b>Supprimer les capteurs de direction de la logique ...</b> 
        (non requis si vous utilisez la logique M&#226;t de Signalisation) - Cet outil 
        assemble une liste de tous les capteurs de direction d&#233;finis dans 
        les sections se trouvant actuellement dans le tableau des sections, 
        puis supprime tous les capteurs qui sont contenus dans cette 
        liste &#224; partir de la logique de signalisation simple (SSL) de 
        toutes les signaux. Cet outil annule l'effet de l'outil 
        <b>D&#233;finir les capteurs de direction dans Logic ...</b>, supprime 
        les capteurs de direction &#233;ventuellement plac&#233;s par <a href= 
        "../dispatcher/Dispatcher.shtml"> Dispatcher.</a>, et supprime 
        en outre tous Les capteurs de direction d&#233;finies pouvant se 
        trouver dans un SSL incorrect. Si des erreurs ont &#233;t&#233; constat&#233;es 
        lors de la configuration des capteurs de direction &#224; l'aide de 
        l'outil ci-dessus, il est parfois utile de l'ex&#233;cuter avant de 
        tenter de configurer &#224; nouveau les capteurs de direction.</Li>

        <li style = "list-style: none">
          Un panneau &#201;diteur de R&#233;seau est requis pour ex&#233;cuter cet outil. 
          Une fois que les capteurs de sens ont &#233;t&#233; supprim&#233;s de la Logique 
          Signal, un message indiquant les r&#233;sultats de l'ex&#233;cution de l'outil 
          s'affiche. Les messages d'erreur d&#233;taill&#233;s, le cas &#233;ch&#233;ant, 
          sont plac&#233;s dans le journal des erreurs JMRI.
       </li>
     </ul>

      <h2>Capteurs de Direction et d'Arr&#234;t</h2>  
      
	  <p>Facultativement, chaque section peut avoir deux <i>capteurs de 
	  direction</i>, un pour le sens direct et un pour le sens inverse. 
	  Ce sont normalement des capteurs internes, portant des Noms Syst&#232;mes 
	  commen&#231;ant par IS. Ils suivent automatiquement l'&#233;tat de leur section. 
	  Une section a trois &#233;tats: <b>LIBRE</b> (non attribu&#233; &#224; un train), 
	  <b>AVANT</b> (attribu&#233; au d&#233;placement aller-retour) et <b>INVERSE</b> 
	  ( Lorsque le statut de la section est <b>LIBRE</b>, les deux capteurs 
	  de sens sont d&#233;finis sur <b>ACTIF</b>. Lorsque l'&#233;tat de la section 
	  est <b>AVANT </b>, le capteur de sens avant est <b>INACTIF</b> et 
	  le capteur de sens inverse est b> ACTIF</b>. De m&#234;me, lorsque l'&#233;tat 
	  de la section est <b>REVERSE</b>, la le capteur de sens avant est 
	  <b>ACTIF</b> et le capteur de sens inverse est <b>INACTIF</b>. 
	  Ces capteurs peuvent &#234;tre utilis&#233;s dans la logique de signal pour 
	  forcer les signaux &#224; se d&#233;placer dans le sens oppos&#233; au sens attribu&#233; 
	  &#224; < b> ROUGE</b> (Arr&#234;t). Des outils sont fournis dans le menu 
	  Tableau des Sections pour ajouter automatiquement des capteurs de 
	  direction &#224; la logique du signal ou pour supprimer automatiquement 
	  tous les capteurs de la Logique du M&#226;t de Signalisation (<a href = 
	  "# outils"> voir ci-dessus </a>). Si vous utilisez <a href= 
	  "../dispatcherDispatcher.shtml"> <b>Dispatcher</b> </a>, vous pouvez 
	  ajouter des capteurs de direction pour indiquer la logique, le cas &#233;ch&#233;ant.</P>

      <p>De plus, chaque section peut &#233;galement disposer de deux <i>capteurs 
      d'arr&#234;t</i> qui indiquent quand un train de la section a atteint la 
      fin de la section en se d&#233;pla&#231;ant dans le sens aller ou dans le 
      sens inverse. Les capteurs d'arr&#234;t doivent &#234;tre des capteurs 
      physiques de la structure, par exemple des d&#233;tecteurs de infrarouges. 
      Pour la r&#233;partition manuelle, ces capteurs peuvent &#234;tre affich&#233;s 
      sur un panneau pour indiquer au r&#233;partiteur quand un train a atteint 
      la fin de son affectation. En mode automatique, ces capteurs peuvent 
      &#234;tre utilis&#233;s pour arr&#234;ter un train avant qu'il n'atteigne la fin 
      de la section qui lui est attribu&#233;e et avant qu'il d&#233;passe un 
      signal rouge, si des signaux sont pr&#233;sents.</P>

      <h2><a name='SignalMast' id="SignalMast"> Utilisation de la logique 
      du M&#226;t de Signalisation avec des sections </a></h2>

      <p>Si votre signalisation est bas&#233;e sur la <a href= 
      "../beantableSignalMastLogicTable.shtml"> logique du M&#226;t de Signalisation </a> 
      et que la logique associ&#233;e a &#233;t&#233; g&#233;n&#233;r&#233;e &#224; l'aide de l'&#201;diteur de 
      R&#233;seau, il est &#233;galement possible d'avoir des sections automatiquement 
      g&#233;n&#233;r&#233;es sur la base de cette m&#234;me logique.</p>

      <p>L'outil pour accomplir se trouve dans la <b>table logique du M&#226;t 
      de Signalisation</b> | <b>Outils</b> | <b>G&#233;n&#233;rer des sections</b>. 
      L'ex&#233;cuter cr&#233;era imm&#233;diatement des sections contenant chacune tous 
      les cantons entre toutes les paires de M&#226;t de Signalisation d&#233;j&#224; 
      d&#233;finies. Il configurera &#233;galement chaque section "g&#233;n&#233;r&#233;e 
      automatiquement" de mani&#232;re &#224; inclure ces cantons dans le bon ordre, 
      avec la direction d&#233;finie comme trajet AVANT, allant de la source 
      au M&#226;t de Signalisation de destination. Veuillez noter que les 
      d&#233;tails du cantonnement ne sont pas enregistr&#233;s lors de l'enregistrement 
      du Panneau, mais sont recr&#233;&#233;s lors du chargement du fichier.</P>

      <p>L'outil cr&#233;era &#233;galement automatiquement des capteurs dans le 
      sens aller et le sens inverse et les placera dans la section. 
      Toutefois, la logique du M&#226;t de Signalisation n'utilise pas ces 
      capteurs et leur cr&#233;ation n'est l&#224; que pour permettre la validation 
      de la section (ou utiliser par l'utilisateur dans Logix non apparent&#233; 
      si d&#233;sir&#233;)).</p>

      <p>Les sections g&#233;n&#233;r&#233;es avec l'outil auront uniquement une paire 
      de points d'entr&#233;e et suivront simplement le chemin entre les deux 
      signaux.</p>
      
      

	  <p>Les capteurs de direction (avant et arri&#232;re) sont cr&#233;&#233;s par 
	  l'outil G&#233;n&#233;rer des Sections mais, si vous le souhaitez, l'utilisateur 
	  doit ajouter manuellement les capteurs d'arr&#234;t (avant et arri&#232;re) 
	  via le volet Modifier les Sections qui s'ouvre lorsque vous cliquez 
	  sur le bouton Modifier pour une section sp&#233;cifique dans le Tableau des Sections.</p>

      <p>Les d&#233;tails des capteurs facultatifs de direction et d'arr&#234;t sont 
      enregistr&#233;s lors de l'enregistrement du fichier du panneau.</p>

      <p>Pour utiliser les sections ainsi construites, vous devez ensuite 
      configurer les <a href="TransitTable.shtml">Transits </a>. Ensuite, 
      vous devrez &#233;galement configurer le <a href= 
      ".../dispatcher/Dispatcher.shtml"> <b>Dispatcher</b> </a> pour qu'il 
      utilise la logique M&#226;t de Signalisation via le Dispatcher<a href =
      " . ./dispatcher/Options.shtml "> Menu <b>Options</b> </a>.</p>

      <h2>Enregistrement de Sections sur le Disque</h2>

      <p>Utilisez l'&#233;l&#233;ment <b>Enregistrer</b> dans le menu <b>Fichier</b> 
      du tableau des Sections (ou l'&#233;l&#233;ment <b>Sauvegarder les panneaux ...</b> 
      dans le <b>. Panneaux</b> de la fen&#234;tre principale JMRI) pour 
      enregistrer les informations de la section sur le disque. Ces 
      informations (ainsi que toutes les informations modifi&#233;es sur la 
      logique du M&#226;t de Signalisation) sont enregistr&#233;es avec la 
      configuration et les panneaux dans un fichier XML, avec la
      configuration du panneau de configuration, etc. Pour stocker vos 
      panneaux dans le m&#234;me fichier (recommand&#233;), s&#233;lectionnez <b>Fichier> 
      Enregistrer> Enregistrer la configuration et les panneaux dans le 
      fichier ...</b> ou s&#233;lectionnez <b>Panneaux> Enregistrer les
      panneaux ...</b> dans la fen&#234;tre principale JMRI.</p>

      <p>Retour &#224; la <a href= "../../../../html/tools/Sections.shtml">page d'aide sur les Sections </a>.</p>
      <! - # include virtual = "/ Footer" ->
   </div> <!-- closes #mainContent -->
 </div> <!-- closes #mBody -->
</body>
</html>
