<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01//EN"
"http://www.w3.org/TR/html4/strict.dtd">
<!-- Updated by Herv&#233; Blorec 2013-10-11-->

<html lang="fr">
<head>
  <meta name="generator" content=
  "HTML Tidy for Mac OS X (vers 31 October 2006 - Apple Inc. build 15.17), see www.w3.org">

  <title>JMRI: Section Table Help</title>
  <meta name="author" content="Dave Duchamp">
  <meta name="keywords" content="JMRI help Section Table">
  <!-- Style -->
  <meta http-equiv="Content-Type" content=
  "text/html; charset=us-ascii">
  <link rel="stylesheet" type="text/css" href="/css/default.css"
  media="screen">
  <link rel="stylesheet" type="text/css" href="/css/print.css"
  media="print">
  <link rel="icon" href="/images/jmri.ico" type="image/png">
  <link rel="home" title="Home" href="/">
  <!-- /Style -->
</head>

<body>
  <!--#include virtual="/Header" -->
  <div class="nomenu" id="mBody">
    <div id="mainContent">

      <h1>Sections et la Table Sections</h1>

      <h2>Qu'est-ce qu'une Section?</h2>

      <p>Une <b>Section</b> est un groupe de un ou plusieurs
      <b>Cantons</b> connect&eacute;s qui peuvent &ecirc;tre
      attribu&eacute;s &agrave; un train circulant dans une
      direction donn&eacute;e. Les sections ont &eacute;t&eacute;
      cr&eacute;&eacute;es pour r&eacute;soudre les probl&egrave;me
      de direction qui peuvent se produire lorsque vous utilisez
      directement les Cantons. Une section a seulement deux
      directions, "avant" ou "inverse". Les Sections peuvent
      &ecirc;tre travers&eacute;es par un train dans les deux
      directions. La direction de la Section est
      ind&eacute;pendante de l'orientation d&eacute;finie pour la
      locomotive par un r&eacute;gulateur En plus de
      r&eacute;soudre le probl&egrave;me de direction, les sections
      offrent &agrave; l'utilisateur d'autres
      fonctionnalit&eacute;s utiles.</p>

      <p>Une Sections peut &ecirc;tre consid&eacute;r&eacute;e
      comme une extension de Cantons. De nombreuses Sections ne
      contiennent qu'un seul Canton. Tous les Cantons contenus dans
      une Section multi - Cantons doivent &ecirc;tre
      diff&eacute;rents. Les Cantons sont conserv&eacute;s dans
      l'ordre - le premier canton est reli&eacute; au second, le
      second est reli&eacute; au troisi&egrave;me, etc. Cela
      signifie qu'un Canton dans une Section doit &ecirc;tre
      connect&eacute; au Canton avant (s'il en existe un) et au
      Canton apr&egrave;s lui (s'il y a un), mais ne peut pas
      &ecirc;tre connect&eacute; &agrave; n'importe quel autre
      Canton de la Section. Une Section ne peut pas contenir une
      boucle de retournement.</p>

      <p>Les Sections et leurs <b><a href=
      "TransitTable.shtml">Transits</a></b> associ&eacute;s sont
      con&ccedil;us pour fournir une assistance pour l'envoi, soit
      manuel, (par un r&eacute;partiteur assis &agrave; un pupitre)
      , ou envoi automatique par l'ordinateur. L'Exp&eacute;dition
      est l'allocation temporaire de Section pour l'usage exclusif
      des trains, soit g&eacute;r&eacute;e par des
      op&eacute;rateurs avec un r&eacute;gulateur, et/ou
      ex&eacute;cuter automatiquement par l'ordinateur. L'aide pour
      Dispatcher est assur&eacute; par <a href=
      "../dispatcher/Dispatcher.shtml"><b>Dispatcher</b></a>, qui
      pr&eacute;voit &eacute;galement la mise en place et le
      fonctionnement des trains automatiquement.</p>

      <p>La direction d'une <b>section</b> est d&eacute;finie par
      la s&eacute;quence dans laquelle les cantons sont
      ajout&eacute;s &agrave; une section multi - cantons. Pour une
      Section &agrave; seul Canton la direction est choisie
      arbitrairement lorsque la Section est cr&eacute;&eacute;e. Un
      train peut fonctionner &agrave; travers une Section dans les
      directions <b>avant</b> (&agrave; partir du premier canton au
      dernier canton) ou <b>inverse</b> (du dernier canton au
      premier canton n). Si une Section a un seul canton, la
      <b>direction</b> de cette section est choisie lors de la mise
      en place de ses <b>Points d'Entr&eacute;e</b> (Voir
      ci-dessous).</p>

      <p>Une Section a un ou plusieurs <b>Points
      d'Entr&eacute;e</b>. Un point d'entr&eacute;e d&eacute;finit
      une connexion &agrave; partir d'un canton &agrave;
      l'int&eacute;rieur de la section &agrave; un canton en dehors
      de la section. Les points sont mis en place en utilisant les
      chemins des Cantons dans la section - Les chemins
      repr&eacute;sentent des connexions aux cantons qui ne
      figurent pas dans la section. Les Points d'entr&eacute;e sont
      regroup&eacute;s soit que l'entr&eacute;e dans cette Section
      &agrave; ce Point d'Entr&eacute;e dans la section se traduira
      par un train circulant dans le sens "avant" soit
      l'entr&eacute;e dans ce Point d'Entr&eacute;e r&eacute;sulte
      du d&eacute;placement d'un train en direction "inverse" , ou
      si l'entr&eacute;e &agrave; ce point d'entr&eacute;e se
      traduira par un train voyageant dans le direction
      "inverse".</p>

      <p>Les Sections sont con&ccedil;ues pour &ecirc;tre
      attribu&eacute;es &agrave; un train &agrave; la fois. Si une
      portion de voie connect&eacute;e est assez longue pour
      soutenir simultan&eacute;ment plusieurs trains voyageant dans
      la m&ecirc;me direction, l'un suivant l'autre, cette voie
      connect&eacute;e devrait &ecirc;tre divis&eacute;e en deux
      sections ou plus, si l'utilisateur veut faire circuler des
      trains suivants dans cette zone.</p>

      <h2>Conditions pour l'utilisation de Sections</h2>

      <p>Les Sections peuvent &ecirc;tre utilis&eacute;es avec un
      panneau &eacute;diteur de panneau, avec un panneau Editeur de
      R&eacute;seau, avec un pupitre manuel (CTC) , ou directement,
      sans aucun panneau pr&eacute;vu. Les Sections sont
      construites sur des Cantons JMRI et des structures de
      Chemins. Alors avant d'essayer de cr&eacute;er des sections,
      vous devriez avoir des cantons et des chemins
      compl&egrave;tement initialis&eacute;s pour votre
      r&eacute;seau. (Une fa&ccedil;on simple d' initialiser
      automatiquement vos cantons et des chemins est d'esquisser un
      panneau &eacute;diteur de votre r&eacute;seau, avec des
      cantons affect&eacute;s.)</p>

      <p>Le cantonnement du r&eacute;seau doit &ecirc;tre
      soigneusement planifi&eacute;e, afin de fournir "des
      Sections<i>raisonnables</i>" - Sections qui ont un sens pour
      un r&eacute;partiteur pour les attribuer &agrave; un train.
      Pour les aiguillages droits ou gauches sur la voie
      principale, , cela signifie habituellement, y compris
      l'inclusion de l'aiguillage dans le m&ecirc;me canton que la
      voie raccord&eacute;e &agrave; la pointe , et en fournissant
      des cantons s&eacute;par&eacute;s pour continuer sur les
      voies divergentes Certains pr&eacute;f&egrave;rent avoir un
      aiguillage dans un canton s&eacute;par&eacute;, et cela
      fonctionne tr&egrave;s bien aussi. Du point de vue
      r&eacute;partition, Les aiguillages des voies principales qui
      se branchent &agrave; des industries n'ont pas besoin
      d'&ecirc;tre bloqu&eacute;es s&eacute;par&eacute;ment, mais
      le cantonnement est ici acceptable. Un sch&eacute;ma de
      cantonnement de r&eacute;seau qui fonctionne bien pour les
      signaux, devrait fonctionner correctement pour les sections
      aussi.</p>

      <p>Les Signaux ne sont pas requis pour l'utilisation de
      Sections, mais les Sections fonctionnent parfaitement avec
      des signaux install&eacute;s. Si les signaux sont
      install&eacute;s, les capteurs de direction inclus dans les
      Sections offrent un moyen facile de mettre en place une
      simple de type signalisation APB* (voir ci-dessous).</p>

      <h2>Support pour les Capteurs Facultatif de Direction et
      d'Arr&ecirc;t</h2>

      <p>En Option chaque section peut avoir deux <i>capteurs de
      direction</i>, l'un pour la direction avant et un pour la
      direction inverse. Ce sont normalement des Capteurs internes,
      avec un nom syst&egrave;me qui commencent par IS. Ils suivent
      automatiquement l'&eacute;tat de leur Section. Une section a
      trois &eacute;tats, <b>LIBRE</b> (non attribu&eacute;
      &agrave; un train), <b>AVANT</b> (Allou&eacute;e pour les
      d&eacute;placements vers l'avant), et <b>INVERSE</b>
      (allou&eacute;e pour les d&eacute;placements en sens inverse.
      Lorsque l'&eacute;tat de la Section est <b>LIBRE</b> les deux
      capteurs de sens sont fix&eacute;s &agrave; <b>ACTIFS</b>.
      Lorsque l'&eacute;tat de la Section est <b>AVANT</b>, le
      capteur de direction avant est <b>INACTIFS</b> et le capteur
      en sens inverse est <b>ACTIF</b>. De m&ecirc;me, lorsque
      l'&eacute;tat de la Section est <b>INVERSE</b>, le capteur de
      direction avant est <b>ACTIF</b> et le capteur en sens
      inverse est <b>INACTIF</b>. Ces capteurs peuvent &ecirc;tre
      utilis&eacute;s dans la logique du signal pour forcer les
      signaux &agrave; <b>ROUGE</b> pour les d&eacute;placements
      dans le sens oppos&eacute;e &agrave; la direction
      affect&eacute;e. Des outils sont fournis ici dans la Table
      Section pour ajouter automatiquement des Capteurs de
      direction &agrave; ajouter &agrave; la logique de signal ou
      pour supprimer automatiquement tous les capteurs de direction
      du signal logique, ( <a href="#tools">voir ci-dessous</a>).
      Alternativement, si <a href=
      "../dispatcher/Dispatcher.shtml"><b>Dispatcher</b></a> est
      utilis&eacute;, il peut ajouter des capteurs de direction au
      signal logique si n&eacute;cessaire.</p>

      <p>&eacute;ventuellement aussi chaque section peut avoir deux
      <i>Capteurs d'arr&ecirc;t</i> qui indiquent quand un train
      dans la section a atteint la fin de la Section en se
      d&eacute;pla&ccedil;ant dans la direction avant ou en sens
      inverse. Les Capteurs d'arr&ecirc;t devrait &ecirc;tre de
      nature physique sur le r&eacute;seau, par exemple des
      d&eacute;tecteurs ponctuels infrarouge. Pour la
      r&eacute;partition manuelle, ces capteurs peuvent &ecirc;tre
      affich&eacute;s sur un panneau pour indiquer au
      r&eacute;partiteur quand un train a atteint la fin dela
      Secton. Pour l'ex&eacute;cution automatique, ces capteurs
      peuvent &ecirc;tre utilis&eacute; pour arr&ecirc;ter un train
      avant qu'il n'atteigne la fin de sa Section allou&eacute;e,
      et avant le d&eacute;passements d'un signal rouge, si les
      signaux sont pr&eacute;sents.</p>

      <h2>Utilisation du Tableau Section pour Afficher et de
      Cr&eacute;er des Sections</h2>

      <p>Toutes les sections que JMRI conna&icirc;t peuvent
      &ecirc;tre consult&eacute;es &agrave; l'aide du <b>Tableau
      Section</b>. S&eacute;lectionnez <b>Sections</b> dans le sous
      - menu <b>tableaux</b> du menu <b>Outils</b> de la
      fen&ecirc;tre principale du programme JMRI. Il y a huit
      colonnes dans la Table Sections:</p>

      <ul>
        <li><b>Nom Syst&egrave;me</b> - Le nom syst&egrave;me est
        affect&eacute; &agrave; la section lors de sa
        cr&eacute;ation, et ne peut pas &ecirc;tre
        chang&eacute;.</li>

        <li><b>Nom Utilisateur</b> - Si vous &ecirc;tes
        int&eacute;ress&eacute;s par le fait que vos sections aient
        des noms "compr&eacute;hensibles" , vous pouvez cliquer
        dans la colonne "Nom Utilisateur" et modifier les
        informations comme vous voulez.</li>

        <li style="list-style: none"><b>&eacute;tat</b> -
        L'&eacute;tat d'une section indique si une section est
        "affect&eacute;e" ou "en utilisation" par un ou plusieurs
        trains. L'&eacute;tat d'une section nouvellement
        ajout&eacute;e est toujours <b>LIBRE</b>. Quand une Section
        est allou&eacute;e pour les d&eacute;placements dans le
        sens du premier au dernier dernier canton, l'&eacute;tat
        est <b>AVANT</b>. Lorsque allou&eacute; pour les
        d&eacute;placements dans la direction oppos&eacute;e,
        l'&eacute;tat est <b>INVERSE</b>.</li>

        <li><b>Commentaire</b> - Cette colonne est pour votre usage
        personnel, pour enregistrer tout commentaire que vous
        voudrez peut-&ecirc;tre utiliser pour garder trace de vos
        Sections. Il est pour information seulement.</li>

        <li>Cliquez sur le bouton <b>Supprimer</b> dans une ligne
        sp&eacute;cifique pour supprimer la section de cette ligne.
        N'oubliez pas d'enlever tous les Transits utilisant cette
        section. Tout Transit qui utilise une section
        supprim&eacute;e sera rompu! Utilisez cette touche avec
        pr&eacute;caution!</li>

        <li><b>Premier canton</b> - Cette colonne affiche le
        premier canton de la section. Puisqu'une section est un
        groupe de un ou plusieurs cantons connect&eacute;s, il y a
        toujours une entr&eacute;e.</li>

        <li><b>Dernier canton</b> - Cette colonne indique le
        dernier canton de la section. Puisqu'une section peut
        contenir un seul canton, le dernier canton peut &ecirc;tre
        le m&ecirc;me que le Premier Canton.</li>

        <li style="list-style: none">Cliquez sur le bouton</li>

        <li><b>Modifier</b> dans une rang&eacute;e pour afficher ou
        modifier les informations saisies pour une Section. Le Nom
        Syst&egrave;me ne peut pas &ecirc;tre chang&eacute;. Le Nom
        Utilisateur peut &ecirc;tre chang&eacute;, les cantons
        peuvent &ecirc;tre red&eacute;finis, les points
        d'entr&eacute;e peuvent &ecirc;tre reconfigur&eacute;s, etc
        une seule section peut &ecirc;tre &eacute;dit&eacute;e
        &agrave; la fois. Une Section ne peut pas &ecirc;tre
        modifi&eacute; si une autre est en cours de
        cr&eacute;ation.</li>
      </ul>

      <p>Pour cr&eacute;er une nouvelle section, cliquez sur le
      bouton " <a href="SectionAddEdit.shtml">Ajouter .."</a>. Une
      fen&ecirc;tre va &ecirc;tre mise en place qui vous permettra
      de d&eacute;finir des cantons inclus dans la nouvelle
      Section, et si n&eacute;cessaire, d&eacute;signer les points
      d'entr&eacute;e pour avoir comme r&eacute;sultat du trajet
      dans la Section les directions AVANT et INVERSE.</p>

      <p>Actuellement, l'utilisateur doit s&eacute;lectionner
      manuellement <b>AVANT</b> ou <b>INVERSE</b> pour chaque Point
      d'entr&eacute;e, apr&egrave;s que tous les cantons aient
      &eacute;t&eacute; ajout&eacute;s &agrave; une section. Le
      programme mettra certaines directions automatiquement, mais
      d'autres sont laiss&eacute;s en <b>INCONNU</b>. Un point
      d'entr&eacute;e doit &ecirc;tre r&eacute;gl&eacute; en AVANT
      si un train entrant dans la section &agrave; ce point
      d'entr&eacute;e se d&eacute;placerait dans le sens AVANT.
      Sinon, il devrait &ecirc;tre fix&eacute; &agrave; INVERSE. Un
      d&eacute;veloppement future possible serait de d&eacute;finir
      les orientations des points d'entr&eacute;e automatiquement
      &agrave; partir de la connectivit&eacute; trouv&eacute;e dans
      un panneau Editeur de R&eacute;seau.</p>

      <p>Pour les sections avec plus d'un canton, un trajet d'un
      canton &agrave; bas-num&eacute;ro vers un canton de
      num&eacute;ro sup&eacute;rieur est une marche AVANT. Dit
      d'une mani&egrave;re diff&eacute;rente, passant d'un canton
      sup&eacute;rieur dans la liste de cantonnement d'un canton
      plus bas dans la liste c'est la marche avant. De m&ecirc;me
      le d&eacute;placement d'un canton de num&eacute;ro
      sup&eacute;rieur &agrave; un canton inf&eacute;rieure est une
      marche INVERSE . Pour les sections avec un seul canton, il
      n'est fait aucune diff&eacute;rence la direction &agrave;
      travers la section est d&eacute;sign&eacute; AVANT, aussi
      longtemps que le Point d'Entr&eacute;e des directions
      directions sont coh&eacute;rents. C'est &agrave; dire:</p>

      <ul>
        <li>Les directions INVERSE et AVANT du d&eacute;placement
        doivent &ecirc;tre oppos&eacute;e.</li>

        <li>La saisie &agrave; n'importe quel point d'entr&eacute;e
        AVANT doit aboutir &agrave; voyager dans les m&ecirc;mes
        direction comme entrant &agrave; tous les autres points
        d'entr&eacute;e AVANT.</li>

        <li>La Saisie &agrave; tout point d'entr&eacute;e INVERSE
        doit entra&icirc;ner de voyager dans la m&ecirc;me
        direction que l'entr&eacute;e &agrave; toutes les autres
        points d'entr&eacute;e INVERSE.</li>
      </ul>

      <p><b>AVERTISSEMENT: Si les points d'entr&eacute;e ne sont
      pas compatibles des comportements &eacute;tranges peuvent
      subvenir lors de l'utilisation de la Section.</b></p>

      <h2><a name='SignalMast' id="SignalMast">Aide Logique
      M&acirc;t signal avec des sections</a></h2>

      <p>Si la signalisation est bas&eacute;e sur l(utilisation de
      m&acirc;ts de signalisation, avec la logique associ&eacute;e
      qui a &eacute;t&eacute; g&eacute;n&eacute;r&eacute;e en
      utilisant l'&eacute;diteur de r&eacute;seau, il est possible
      d'avoir &eacute;galement des sections
      g&eacute;n&eacute;r&eacute;es automatiquement en fonction de
      la logique.</p>

      <p>L'outil peut &ecirc;tre trouv&eacute; dans le <b>Tableau
      Logique Mat Signal</b> | <b>Outils</b> |
      <b>G&eacute;n&eacute;rer des sections</b> L'ex&eacute;cution
      de ceci cr&eacute;era imm&eacute;diatement des sections qui
      contiennent chacune tous les cantonss entre des paires de
      m&acirc;t de signaux d&eacute;j&agrave; d&eacute;finis. Il
      sera &eacute;galement configurer chaque Section "
      G&eacute;n&eacute;r&eacute; automatiquement " afin qu'elles
      comprennent les cantonss dans le bon ordre, avec la direction
      d&eacute;finie comme la marche avant, allant du M&acirc;t
      Signal source au M&acirc;t Signal destination. Veuillez noter
      que les d&eacute;tails des cantonss ne sont pas
      enregistr&eacute;s lorsque le panneau est stock&eacute; ,
      mais sont recr&eacute;&eacute;s lorsque le fichier est
      charg&eacute;.</p>

      <p>L'outil permettra &eacute;galement de cr&eacute;er
      automatiquement des capteurs de direction avant et
      arri&egrave;re et les placera dans la Section, cependant
      actuellement la Logique M&acirc;t Signal n'utilise pas ces
      derniers et leur cr&eacute;ation n'est l&agrave; que pour
      permettre la validation de la section ( ou l'utilisation par
      l'utilisateur dans des Logix ind&eacute;pendant si
      d&eacute;sir&eacute;).</p>

      <p>Les Sections g&eacute;n&eacute;r&eacute;s avec l'outil
      auront seulement une paire de points d'entr&eacute;e et suit
      simplement le chemin entre les deux signaux.</p>

      <p>Les Capteurs de Direction (avant et arri&egrave;re) sont
      cr&eacute;&eacute;s par l'outil G&eacute;n&eacute;rer
      Sections, mais les Capteurs d'Arr&ecirc;t (Avant et
      Arri&egrave;re) doivent &ecirc;tre ajout&eacute;s
      manuellement par l'utilisateur via la fen&ecirc;tre d'Edition
      des Eections pour chaque section, si
      d&eacute;sir&eacute;.</p>

      <p>Les d&eacute;tails de la Direction Facultative et les
      Capteurs d'Arr&ecirc;t sont enregistr&eacute;s lorsque le
      fichier de panneau est stock&eacute;.</p>

      <p>Pour utiliser les sections qui ont &eacute;t&eacute;
      construites cette fa&ccedil;on, vous aurez besoin ensuite de
      configurer les <a href="TransitTable.shtml">Transits</a>,
      ensuite, vous devrez &eacute;galement r&eacute;gler le
      <a href=
      "../dispatcher/Dispatcher.shtml"><b>Dispatcher</b></a> pour
      utiliser la logique M&acirc;tSignal via le menu <a href=
      "../dispatcher/Options.shtml"><b>Options</b></a>.</p>

      <h2><a name="tools" id="tools">Outils Tableau
      section</a></h2>

      <p>Le Tableau Sections a un menu <b>Outils</b> pour faciliter
      l'utilisation des Sections. Normalement, ces outils devraient
      &ecirc;tre utilis&eacute;s apr&egrave;s que toutes les
      sections aient &eacute;t&eacute; d&eacute;finies. Les
      &eacute;l&eacute;ments du menu et leur utilisation sont
      d&eacute;crits ci-dessous:</p>

      <ul>
        <li>Valider tous les Sections ... - Lorsque cette option
        est s&eacute;lectionn&eacute;e, chaque Section est
        test&eacute;e pour voir la coh&eacute;rence. Les tests
        actuels comprennent la v&eacute;rification de la
        connectivit&eacute; entre plusieurs cantons, en
        v&eacute;rifiant qu'il n'y a pas de Points d'Entr&eacute;e
        manquant ou des Points d'Entr&eacute;e
        suppl&eacute;mentaires, et, si un panneau TCO est
        disponible, en v&eacute;rifiant que les chemins sont
        correctement mis en place pour les Cantons dans les
        Sections. Cet outil ne <b>v&eacute;rifier pas si les
        directions AVANT et INVERSE sont correctement
        r&eacute;gl&eacute;es pour chaque Point
        d'Entr&eacute;e</b>, mais cette fonction est un ajout
        pr&eacute;vu dans l'avenir. Apr&egrave;s que les tests sont
        termin&eacute;s, un message s'affiche indiquant les
        r&eacute;sultats de l'essai. Des messages d'erreur
        d&eacute;taill&eacute;s , le cas &eacute;ch&eacute;ant,
        sont plac&eacute;s dans le rapport des erreurs JMRI.</li>

        <li>
          <p><b>Configurer Capteurs de Direction dans
          Logique...</b> - Lorsque cet &eacute;l&eacute;ment est
          s&eacute;lectionn&eacute;, les capteurs de direction
          d&eacute;finis pour chaque section sont plac&eacute;s
          dans la logique de signal du signal appropri&eacute; -
          ces signaux internes pour les Section ou
          prot&eacute;geant l'entr&eacute;e de la Section. Les
          Capteurs de direction suivent l'affectation de
          l'&eacute;tat de leurs Sections. Quand une Section est
          LIBRE (non attribu&eacute;e), deux de ses capteurs de
          direction sont ACTIFS ensembles. En pla&ccedil;ant ces
          capteurs dans la logique appropri&eacute;e du signal,
          tous les signaux internes ou de protection des points
          d'entr&eacute;e de la Section sont forc&eacute;s au ROUGE
          lorsque la section est libre. Quand une Section est
          allou&eacute;e pour circuler dans le sens AVANT, son
          capteur vers l'avant est r&eacute;gl&eacute; INACTIF, la
          logique permettant au signal de fonctionner normalement
          pour circuler &agrave; travers la section dans le sens
          AVANT, mais en gardant les signaux qui r&egrave;glent le
          sens INVERSE mis au ROUGE. De m&ecirc;me, lorsque la
          section est allou&eacute;e pour les d&eacute;placements
          dans le sens INVERSE, le capteur en sens inverse est
          INACTIF, et le capteur de direction avant est
          fix&eacute;e ACTIF, permettant aux signaux de
          lib&eacute;rer le trajet dans la direction INVERSE, mais
          bloquer les d&eacute;placements vers l'AVANT. Le
          r&eacute;glage de l'&eacute;tat des capteurs de direction
          se fait automatiquement par le logiciel de <a href=
          "../dispatcher/Dispatcher.shtml">Dispatcher</a> qui
          alloue les Sections.</p>

          <p>Note: Dispatcher peut placer les capteurs de direction
          dans la logique du signal SSL automatiquement quand un
          train est activ&eacute;. Dispatcher placera les capteurs
          de direction s'ils sont fournis avec un panneau Editeur
          de R&eacute;seau et autoris&eacute; &agrave; utiliser sa
          connectivit&eacute; (requis pour le fonctionnement
          automatique). Cela permet d'utiliser la signalisation
          bas&eacute;e sur l'orientation m&ecirc;me si le panneau
          est stock&eacute; avec ces capteurs retir&eacute;s de la
          logique du signal.</p>

          <p>Cet outil devrait &ecirc;tre utilis&eacute;
          apr&egrave;s que toutes les sections aient
          &eacute;t&eacute; d&eacute;finies et que toute la logique
          du signal a &eacute;t&eacute; mise en place. Un panneau
          Editeur de R&eacute;seau est n&eacute;cessaire, car le
          logiciel a besoins de la connectivit&eacute; du panneau
          pour comprendre quel signal n&eacute;cessite quel capteur
          de direction. Si un capteur de direction est
          d&eacute;j&agrave; dans la Logique simple signal (SSL)
          pour un signal, il n'est pas dupliqu&eacute;. Cependant,
          si un capteur de direction incorrecte est pr&eacute;sent
          dans le protocole SSL, il n'est pas supprim&eacute;.
          (Utilisez l'outil d&eacute;crit ci-dessous pour retirer
          les capteurs de direction.) Apr&egrave;s que le placement
          des capteurs de direction soit termin&eacute;, un message
          s'affiche qui donne des r&eacute;sultats. Le
          d&eacute;tail des messages d'erreur, le cas
          &eacute;ch&eacute;ant, sont plac&eacute;s dans le rapport
          des erreurs JMRI. Quand une erreur survient, les raisons
          les plus communes sont: 1) les informations manquantes
          (signal manquant ou signal logique n'est pas mis en
          place) ou 2) des erreurs dans la mise en place des
          directions des Point d'Entr&eacute;e</p>
        </li>

        <li>Retirer Les Capteurs de Direction depuis la Logique
        ...</li>

        <li style="list-style: none">- Cet outil rassemble une
        liste de tous les capteurs de direction d&eacute;finis dans
        les Sections actuellement dans le Tableau Sections puis
        supprime tous les capteurs qui sont contenus dans cette
        liste &agrave; partir de la logique simple signal (SSL) de
        tous les signaux. Cet outil annule l'effet de l'outil
        <b>Orientation D&eacute;finie des Capteurs dans la Logique
        ...</b>, supprime touts les capteurs de direction qui
        peuvent avoir &eacute;t&eacute; plac&eacute;s par <a href=
        "../dispatcher/Dispatcher.shtml">Dispatcher</a>, et en plus
        retire les capteurs direction d&eacute;finis qui pourraient
        &ecirc;tre dans une mauvaise SSL. Si des erreurs ont
        &eacute;t&eacute; not&eacute;es lors de
        l'&eacute;tablissement de l'orientation des capteurs
        utilisant l'outil ci-dessus, puis corrig&eacute;,
        ex&eacute;cuter cet outil avant de tenter de mettre des
        capteurs de direction est de nouveau parfois utile.</li>

        <li style="list-style: none">
          <p>Un panneau Editeur de R&eacute;seau est requis pour
          ex&eacute;cuter cet outil. Apr&egrave;s le retrait des
          capteurs de direction, la logique du signal est
          termin&eacute;e, un message est affich&eacute; donnant
          les r&eacute;sultats d'ex&eacute;cution de l'outil. Les
          messages d'erreur d&eacute;taill&eacute;s, le cas
          &eacute;ch&eacute;ant, sont plac&eacute;s dans le rapport
          des erreurs JMRI.</p>
        </li>
      </ul>

      <h2>Sauvegarde Sections sur disque</h2>

      <p>Utilisez l'&eacute;l&eacute;ment <b>Stocker</b> dans le
      menu <b>Fichier</b> du Tableau Sections (ou
      l'&eacute;l&eacute;ment <b>Stocker Panneaux...</b> dans le
      menu <b>Panneaux</b> de la fen&ecirc;tre principales JMRI )
      pour enregistrer les informations Section sur le disque.
      Cette information (et toute les information modifi&eacute;es
      de la logique signal ) est enregistr&eacute;e avec la
      configuration et les panneaux dans un fichier XML , ainsi que
      l'installation du panneau de commande et les choses
      similaires. Pour stocker vos panneaux dans le m&ecirc;me
      fichier (recommand&eacute;), s&eacute;lectionnez Fichier
      <b>Stocker Configuration et Panneaux</b> dans Fichier ... ou
      s&eacute;lectionnez <b>Panneaux&gt; Stocker Panneaux ...</b>
      dans la fen&ecirc;tre principale JMRI.</p>

      <p>*APB Bloc syst&egrave;me automatique double sens.</p>
      <!--#include virtual="/Footer" -->
    </div>
  </div>
</body>
</html>
