<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//FR"
"http://www.w3.org/TR/html4/loose.dtd">

<html lang="fr">
<head>
  <meta name="generator" content=
  "HTML Tidy for Mac OS X (vers 31 October 2006 - Apple Inc. build 15.17), see www.w3.org">

  <title>JMRI: Adding/Editing Sensors</title>
  <meta http-equiv="Content-Type" content=
  "text/html; charset=iso-8859-1">
  <meta name="author" content="Bob Jacobsen">
  <meta name="keywords" content="JMRI help Sensor Add Edit">
  <!--#include virtual="/Style.shtml" -->
</head>

<body>
  <!--#include virtual="/Header.shtml" -->
  <div class="nomenu" id="mBody">
    <div id="mainContent">

      <h1>Ajouter/modifier des capteurs</h1>

      <div class="toc">
        <ul>
          <li><a href="#addsensor">Ajouter un capteur</a></li>
          <li><a href="#editsensor">Modifier un capteur</a></li>
          <li><a href="#hardwaresensor">Propri&#233;t&#233;s du capteur sp&#233;cifiques au mat&#233;riel</a></li>.
        </ul>
      </div>

      <a name="addsensor" id="addsensor"></a>
      <h2>Ajouter un nouveau capteur</h2>
      <p>Lorsqu'on ajoute un capteur, dans la liste d&#233;roulante " Connexion au syst&#232;me : ".
     , s&#233;lectionnez la connexion mat&#233;rielle &#224; laquelle ce capteur est
      attach&#233; &#224;.</p><img src="images/AddSensor.png" alt="Add Sensor">.

      <p>Entrez une adresse valide pour le capteur (regardez 
      l'infobulle pour les options de saisie accept&#233;es par syst&#232;me).
      Si vous le d&#233;sirez, entrez un nom d'utilisateur qui peut &#234;tre tout ce que vous
      souhaitez pour d&#233;crire le capteur.<br>
      Terminez en cliquant sur le bouton "OK".</p>>

      <h3>Cr&#233;ation d'un certain nombre de capteurs</h3>

      <p>Il est &#233;galement possible de cr&#233;er un certain nombre de capteurs en une
      fois.<br>
      Lorsqu'elle est prise en charge, la case &#224; cocher " Ajouter une gamme s&#233;quentielle " sera
      activ&#233;e.</p><img src="images/AddSensorNumber.png" alt="Add Sequential Sensor">.

      <p>Cocher cette case permettra d'activer
      le s&#233;lecteur "Nombre d'&#233;l&#233;ments". Cliquez sur les petites fl&#232;ches
      vers le haut ou le bas pour d&#233;finir le nombre de capteurs que vous souhaitez ajouter.
      En cliquant sur "OK", vous cr&#233;erez ce
      nombre de capteurs s&#233;quentiels dans le tableau.<br>
      Si un nom d'utilisateur a &#233;t&#233; saisi, un num&#233;ro sera ajout&#233; &#224; la
      la fin du nom pour que chaque nom d'utilisateur de capteur reste unique.</p>

      <a name="editsensor" id="editsensor"></a>
      <h2>Modifier un capteur</h2>

      </p> <p>Cliquer sur [Modifier] dans n'importe quelle ligne du tableau des capteurs permet d'ouvrir le
      Volet de modification du capteur pour modifier les &#233;l&#233;ments suivants :</p> <p>.

      <div class="toc">
        <ul>
          <li><a href="#basic">Basic</a></li>
          <li><a href="#debounce">D&#233;lais de rebond</a></li>
          <li><a href="#pullup">Pull-up/Down</a></li>
          <li><a href="#usage">Utilisation</a></li>
          <li><a href="#properties">Propri&#233;t&#233;s</a></li>
        </ul>
      </div>

      <a name="basic" id="basic"></a>
      <h3>Basic</h3>
      <p>Cet onglet vous permet de voir et de modifier les informations de base du capteur
      telles que saisies lors de sa cr&#233;ation :</p>
      <ul>
        <li>Nom de l'utilisateur</li>
        <li>un Commentaire sur le capteur (texte libre pour garder une note)</li>.
        <li>une case &#224; cocher pour utiliser ce capteur comme Invers&#233; (Inactif sera
        interpr&#233;t&#233; comme actif et vice versa)</li>
      </ul>

      <a href="images/SensorEditDelaysTab.png"><img
              src="images/SensorEditDelaysTab.png" height="248" width="515"
              align="right" alt="Sensor Edit Debounce Delays pane"></a>

      <a name="debounce" id="debounce"></a>
      <h3>D&#233;lais de rebond</h3>
      <p>Cet onglet vous permet de voir et de modifier les valeurs sp&#233;cifiques au capteur pour les &#233;l&#233;ments suivants .
      le <a href="SensorTable.shtml#Debounce">D&#233;lai de rebond du capteur</a>.</p>

      <a name="pullup" id="pullup"></a>
      <h3>Actif/-Inactif</h3>
      <p>Cet onglet vous permet de d&#233;finir si votre mat&#233;riel dispose d'une r&#233;sistance de forcage de type pull-up ou
      r&#233;sistance pull-down install&#233;e sur l'entr&#233;e du capteur.</p>

      <a name="usage" id="usage"></a>
      <h3>Usage</h3>
      <p>C'est un champ d'information, montrant o&#249; vous avez le
      Capteur affich&#233; sur un panneau.</p>

      <a name="propri&#233;t&#233;s" id="propri&#233;t&#233;s"></a>
      <h3>Propri&#233;t&#233;s</h3>
      <p>Propri&#233;t&#233;s personnalis&#233;es, conseill&#233;es uniquement aux utilisateurs avanc&#233;s.</p>

      <a name="hardwaresensor" id="hardwaresensor"></a>
      <h2>Informations sp&#233;cifiques au mat&#233;riel</h2>

      <p>Veuillez vous r&#233;f&#233;rer &#224; notre
      <a href="../../../../html/doc/Technical/Names.shtml#entrysummary">r&#233;sum&#233; des mod&#232;les d'entr&#233;e autoris&#233;s</a>.
      par connexion.</p>

      <h3>Mappage du num&#233;ro AIU  NCE avec le capteur JMRI</h3>
       L'unit&#233; d'entr&#233;e auxiliaire NCE (ou AIU) permet &#224; la Centrale  NCE de v&#233;rifier l'&#233;tat des entr&#233;es du r&#233;seau.
      . Celles-ci sont
      sont r&#233;f&#233;renc&#233;es dans JMRI en tant que capteurs avec des noms tels que "NS785". "NS
      signifie "NCE Sensor", et "785" est le num&#233;ro d'une entr&#233;e de capteur sp&#233;cifique.
      

      </p> <p>L'adresse mat&#233;rielle peut &#234;tre saisie de deux fa&#231;ons diff&#233;rentes :</p>

      <dl>
        <dd>
          <p>Entrez l'adresse du pupitre AIU suivie du num&#233;ro de broche s&#233;par&#233; par un " :"<br>.
           Ainsi, pour un capteur sur l'adresse du pupitre AIU 50, broche 2, vous devez .
          entrer dans le champ Adresse mat&#233;rielle :<br>
          50:2</p>

          <p>Le num&#233;ro du capteur peut &#233;galement &#234;tre trouv&#233; et entr&#233; dans le
          le champ d'adresse mat&#233;rielle en utilisant la formule suivante :</p>

          <p>Identification du capteur = (adresse du pupitre AIU - 1) * 16 + (num&#233;ro de la broche.
          Sur AIU) -1</p>

          <p>Par exemple : L'adresse du pupitre AIU est r&#233;gl&#233;e sur 50 et un
          des BD20 est connect&#233; &#224; la broche 2. Par cons&#233;quent, l'ID capteur
          serait :</p>

          <p>Identification du capteur = (50 - 1) * 16 + (2) -1</p> <p>.

          </p> <p>ID du capteur = 785</p> <p>.
        </dd>


      </dl>
      <p><a href="../../../../html/hardware/nce/NCE.shtml#names">En savoir plus
      sur le nommage des capteurs NCE</a>.</p>

      <h3>Mappage des capteurs LocoNet et des capteurs JMRI</h3>

      <p>Les adresses des capteurs LocoNet sont soit simplement saisies sous la forme d'un num&#233;ro ordinal.
      ou bien compos&#233;es de deux parties diff&#233;rentes : le num&#233;ro de la carte et
      le num&#233;ro du canal.<br>
      Les capteurs peuvent &#233;galement &#234;tre configur&#233;s &#224; partir des adresses des aiguillages pour
      l'entr&#233;e Aux &amp; Switch.</p>

      </p> <p>L'adresse mat&#233;rielle peut &#234;tre saisie de plusieurs
      diff&#233;rentes mani&#232;res :</p>

      <dl>
        <dd>
          <p>Si vous connaissez le num&#233;ro du capteur, saisissez-le dans le champ Adresse mat&#233;rielle.</p>
        </dd>
        <dd>
          <p>Entrez le num&#233;ro de la carte, suivi du num&#233;ro du canal.
          s&#233;par&#233;s par un " :"<br>
          Ainsi, pour un capteur sur la carte 11, canal 1, vous devez saisir les &#233;l&#233;ments suivants .
          dans le champ Adresse mat&#233;rielle :<br>
          11:1</p>

          <p>Pour les capteurs fix&#233;s &#224; des aiguillages, vous entrez dans le
          champ d'adresse mat&#233;rielle "T :" suivi du num&#233;ro de l'aiguillage.
          Cela ajoutera l'entr&#233;e auxiliaire associ&#233;e &#224;
          l'aiguillage. Pour ajouter &#224; la fois l'entr&#233;e Aux et l'entr&#233;e Switch, cochez la case
          "Ajouter une plage s&#233;quentielle" et r&#233;glez le num&#233;ro &#224; ajouter sur 2.<br>
          Ainsi, pour un capteur attach&#233; &#224; l'aiguillage 81, vous devez entrer ce qui suit .
          ce qui suit :<br>
          T:81</p>
        </dd>
        <br>
          <p>La troisi&#232;me m&#233;thode consiste &#224; calculer l'adresse du
          capteur et de l'ajouter manuellement dans le champ d'adresse du mat&#233;riel
          en utilisant la m&#233;thode suivante :</p>

          <p>Si vous voulez calculer l'adresse d'une entr&#233;e BDL168
          vous pouvez utiliser<br>
          nombre = 16 * (num&#233;ro de carte) + (num&#233;ro de canal) - 16</p> <p>.

          <p>o&#249; le "num&#233;ro de canal" va de 1 &#224; 16. Par exemple ,
          le premier circuit (num&#233;ro 1) sur la carte 11 a pour num&#233;ro :<br>
          nombre = 16 * (11) + (1) - 16 = 161</p> <br>comme nous l'avons vu dans l'exemple ci-dessus.
          
          </p> <p>Si vous voulez calculer l'adresse d'une entr&#233;e auxiliaire de DS54
          DS54, utilisez :<br>
          num&#233;ro = 2 * (num&#233;ro d'aiguillage - 1) + 1</p>.

          <p>Par exemple, l'entr&#233;e auxiliaire associ&#233;e &#224; l'aiguillage 81
          a pour num&#233;ro :<br>
          num&#233;ro = 2 * (81 - 1) + 1 = 161</p> <p>.

          <p>S'il s'agit de l'entr&#233;e de l'aiguillage, on en ajoute un de plus :<br>
          nombre = 2 * (num&#233;ro de l'aiguillage - 1) + 2</p> <p>.

          <p>Par exemple, l'entr&#233;e d'aiguillage associ&#233;e &#224; l'aiguillage
          12 a un num&#233;ro:<br>
          num&#233;ro = 2 * ( 12 - 1 ) + 2 = 24</p> <p>.
        </dd>
      </dl>
      <p><a href="../../../../html/hardware/loconet/Addressing.shtml">En savoir plus
      sur l'attribution de noms aux capteurs LocoNet</a>.</p>

      <h3>Capteur XpressNet de Lenz et mappage de capteur JMRI</h3>

      <p>Les adresses des capteurs XpressNet sont constitu&#233;es de deux parties diff&#233;rentes : 
      l'adresse de l'encodeur de R&#233;trosignalisation et le Contact.</p>

      <p>L'adresse mat&#233;rielle peut &#234;tre saisie de plusieurs
      diff&#233;rentes mani&#232;res</p>

      <dl>
        <dd>
          Saisissez l'adresse de l'encodeur, suivie du contact
          s&#233;par&#233;s par un " :"<br>
          Ainsi, pour un capteur sur l'adresse 99 de l'encodeur de R&#233;trosignalisation, contact 3.
          vous devez entrer dans le champ Adresse mat&#233;rielle :<br>
          99:3

          <br>Si vous souhaitez calculer l'adresse du capteur,
          soustrayez 1 de l'adresse de l'encodeur de R&#233;trosignalisation, multipliez
          ce r&#233;sultat par 8, puis ajoutez le num&#233;ro de l'entr&#233;e que vous utilisez.<br>
          Par exemple, si vous utilisez le contact 3 sur un codeur &#224; R&#233;trosignalisation.
          Encoder avec l'adresse 99, 99 - 1 = 98. 98*8=784.
          784+3=787.<br>
          L'adresse de l'information de R&#233;trosignalisation  que vous utiliserez est 787.</p> <p>.
        </dd>
      </dl>
      <p><a href="../../../../html/hardware/XPressNet/XNetAddressing.shtml">En savoir plus
      sur le nommage des capteurs XPressNet</a>.</p>

      <h3>CBUS&reg; pour le Mappage de Capteur JMRI</h3>
      <p>&#201;v&#233;nement court 18 on et off : "+18".</p>
      <p>&#201;v&#233;nement court 18 on, &#233;v&#233;nement court 21 off : "+18;-21".</p> 
      <p>Ev&#233;nement long N&#339;ud 2 &#201;v&#233;nement 18 on et off : "+N2E18".</p>
      <p>Cha&#238;ne hexad&#233;cimale de la trame CAN : "X9000020012;X91FFFFFFFE".</p>
      <p><a href="../../../../html/hardware/can/cbus/Names.shtml">D&#233;tails complets pour la d&#233;nomination des capteurs CBUS</a>.</p>

      <h3>Mappage des capteurs Maple et C/MRI vers les capteurs JMRI</h3>

      <p>Les adresses des capteurs Maple et C/MRI sont compos&#233;es de deux
       parties diff&#233;rentes : un Id de n&#339;ud et un Id de broche/capteur.</p>

      <p>L'adresse mat&#233;rielle peut &#234;tre saisie de plusieurs
      mani&#232;res diff&#233;rentes :</p>

      <dl>
        <dd>
          Saisissez l'identifiant du n&#339;ud, suivi de l'identifiant du capteur, en les s&#233;parant
          par un " :". Cette m&#233;thode peut &#233;galement &#234;tre utilis&#233;e pour l'
          adressage alternatif/&#233;tendu.<br>
          Ainsi, pour un capteur sur le n&#339;ud 2, broche 3, vous devez entrer ce
          qui suit dans le champ de l'adresse mat&#233;rielle :<br>
          2:3

          <br>Une autre m&#233;thode pour ajouter l'adresse du capteur est d'utiliser
          la formule suivante :</p>ID N&#339;ud x 1000 + pin.<br>
          Ainsi, pour un capteur sur le n&#339;ud 2, broche 3<br>
          (2x1000)+3 = 2003


          <p>Pour utiliser le sch&#233;ma d'adressage alternatif/&#233;tendu,
          consultez le guide de connexion de votre mat&#233;riel C/MRI.</p>
        </dd>
      </dl>
      <p>Plus d'informations sur
      <a href="../../../../html/hardware/maple/index.shtml#naming">Maple</a>
      et
      <a href="../../../../html/hardware/cmri/CMRI.shtml#L001">Nom du capteur C/MRI</a>.</p>

      <h3>Mappage des capteurs Grapevine aux capteurs JMRI</h3>
      <p>Il existe trois types distincts de capteurs Grapevine :</p>

      <dl>
        <dt>D&#233;tecteurs s&#233;riels avanc&#233;s</dt>

        <dd>
          Jusqu'&#224; trois cartes de d&#233;tecteurs s&#233;rie avanc&#233;s peuvent &#234;tre
          &#234;tre fix&#233;es &#224; un n&#339;ud Grapevine. Chacune fournit huit
          d&#233;tecteurs d'occupation, et associe un d&#233;tecteur de mouvement
          &#224; chacun d'entre eux.

          <table>
            <tr>
              <th>Panneau</th>

              <th>Occupation</th>

              <th>Motion</th>
            </tr>

            <tr>
              <td>Ma&#238;tre</td>

              <td>1-8</td>

              <td>9-16</td>
            </tr>

            <tr>
              <td>Esclave 1</td>

              <td>17-24</td>

              <td>25-32</td>
            </tr>

            <tr>
              <td>Esclave 2</td>

              <td>33-40</td>

              <td>41-48</td>
            </tr>
          </tableau>
        </dd>

        <dt>Capteurs de s&#233;rie d'origine</dt>

        </dt>Les capteurs d'occupation sur les cartes s&#233;rie d'origine remplacent...
        les capteurs fix&#233;s par l'interm&#233;diaire des cartes avanc&#233;es aux adresses 1 &#224;
        8. Il n'y a pas de capteurs de mouvement dans ce cas.</dd>

        <dt>Capteurs parall&#232;les</dt>

        </dt>Les capteurs parall&#232;les, connecteurs sur le n&#339;ud Grapevine.
        apparaissent eux-m&#234;mes comme les capteurs JMRI 101 &#224; 108 sur le n&#339;ud. Si
        la deuxi&#232;me banque optionnelle de capteurs s&#233;rie est pr&#233;sente,
        ils apparaissent comme les capteurs 109 &#224; 116 sur le n&#339;ud.</dd>
      </dl>
      <p><a href="../../../../html/hardware/grapevine/Names.shtml">En savoir plus
        sur le nommage des capteurs de Grapevine</a>.</p>

      </p> <p>Retour &#224; la page d'<a href="SensorTable.shtml">aide Table des capteurs
      </a>.</p>

        <h2></h2>
        <p>CBUS&reg; est une marque d&#233;pos&#233;e du Dr Michael Bolton</p>.
        <p></p>

		<p>Traduction 2021-03-10</p>

      <!--#include virtual="/Footer.shtml" -->
    </div><!-- closes #mainContent-->
  </div><!-- closes #mBody-->
</body>
</html>

    

