<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">

<html lang="fr">
<head>
  <meta name="generator" content=
  "HTML Tidy for Mac OS X (vers 31 October 2006 - Apple Inc. build 15.17), see www.w3.org">
  <!-- UpDated by Herv&#233; Blorec  2019-04-05-->

  <title>JMRI: Tableau de Groupe Signaux</title><!-- Style -->
  <meta http-equiv="Content-Type" content=
  "text/html; charset=us-ascii">
  <link rel="stylesheet" type="text/css" href="/css/default.css"
  media="screen">
  <link rel="stylesheet" type="text/css" href="/css/print.css"
  media="print">
  <link rel="icon" href="/images/jmri.ico" type="image/png">
  <link rel="home" title="Home" href="/"><!-- /Style -->
</head>

<body>
  <!--#include virtual="/Header" -->

  
	<div class="nomenu" id="mBody">
    <div id="mainContent">
	  <h1> Ajouter/Modifier un Groupe de Signaux</h1>

      <p>Apr&#232;s avoir cliqu&#233; sur le bouton "Ajouter ..." situ&#233; sous le 
      <a href= ".../beantable/SignalGroupTable.shtml"> Tableau des Groupes 
      de Signaux</a>, le volet suivant appara&#238;t:</p> <a href = 
      "SignalGroupAdd.png"> <img src = "SignalGroupAdd.png" width = "310" height = "269"></a>

      <h3>Entrer dans le Groupe de Signaux</h3>

      <p>Les Groupes de Signaux sont construits &#224; partir d'un ou plusieurs 
      Signaux et comprennent les &#233;l&#233;ments suivants:</p>

      <ul>
        <li>Un M&#226;t de Signalisation parent (par Nom Syst&#232;me) auquel ce 
        Groupe de Signaux est attach&#233;.</li>

        <li>Une liste des Aspects qui rendent le Groupe de Signaux actif, 
        par exemple: le M&#226;t de Signalisation parent doit &#234;tre d&#233;fini sur 
        Continuer ou Avertissement, mais pas sur Danger.</li>

        <li>Une liste des Signaux qui composent chaque indication du
        Groupe de Signaux.<br>
        Les Signaux inclus dans un Groupe de Signaux sont s&#233;lectionn&#233;s 
        dans le Tableau des Signaux, mais seuls les Signaux cr&#233;&#233;es &#224; 
        l'aide du type de connexion <em>Sortie Simple</em> (illustr&#233; &#224; 
        droite) apparaissent dans la liste. <a href= 
        "SingleSignalHead.png"> <img src = "SingleSignalHead.png" 
        height = "185" width = "127" align = "right"></a></li>
     </ul>

      <p>Dans la fen&#234;tre Ajouter/Modifier un Groupe de Signaux, apr&#232;s 
      avoir saisi un Nom Utilisateur pour le nouveau Groupe de Signaux et 
      s&#233;lectionn&#233; le M&#226;t de Signalisation parent dans la liste d&#233;roulante, 
      cochez la case <b>Inclure</b> derri&#232;re un ou plusieurs Aspects du M&#226;t
      dans le tableau directement ci-dessous.<br>
      S&#233;lectionnez ensuite un ou plusieurs Signaaux en cochant les cases 
      <b>Inclure</b> dans la deuxi&#232;me liste.<br>
      Cliquez sur le bouton <b>Appliquer</b> en bas du volet ou poursuivez la configuration.</P>

      <h3>D&#233;finir les Conditions du Groupe de Signaux</h3>

      <p>Chaque signal que vous incluez dans le groupe de signaux a un 
      ensemble de crit&#232;res &#224; satisfaire avant que ce signal ne soit allum&#233;. 
      Ces crit&#232;res sont constitu&#233;s d'&#233;tats d'Aiguillage et/ou de Capteur 
      et peuvent &#234;tre modifi&#233;s en cliquant sur le bouton <b>Modifier</b> 
      correspondant dans la derni&#232;re colonne du volet Ajouter/Modifier 
      un Groupe de Signaux. Un nouveau volet comme celui pr&#233;sent&#233; &#224; droite 
      s'ouvrira, vous permettant de d&#233;finir un signal sp&#233;cifique faisant 
      partie de votre Indicateur.</P> <a href= "SignalGroupAddEditHead.png">
	 <img src = "SignalGroupAddEditHead.png" height = "234" width = "297" 
	 align ="droit"></a>

      <p>Choisissez deux valeurs <i>diff&#233;rentes</i> dans les menus d&#233;roulants 
      en haut du volet pour d&#233;finir les &#233;tats du Signal Indicateur. 
      On lorsque les conditions sont remplies, et Off tant que ce n'est 
      pas le cas.<br>
      Pour compl&#233;ter la d&#233;finition d'un Indicateur de Groupe de Signaux, 
      cochez les cases <b>Inclure</b> appropri&#233;es pour les  Aiguillages 
      et les Capteurs, puis sp&#233;cifiez leur &#233;tat dans la derni&#232;re colonne 
      de chaque liste.<br>
      Entre les deux listes, il y a une option logique finale <b>OU/ET</b> 
      parmi laquelle choisir.</P>

      <p>Vous devrez r&#233;fl&#233;chir profond&#233;ment pour vous pr&#233;parer &#224; cette 
      derni&#232;re &#233;tape, car c'est &#224; cet endroit que vous contr&#244;lerez le 
      comportement de votre Signal. Le mat&#233;riel de signalisation de votre 
      r&#233;seau peut exclure certaines options. Cr&#233;ez-le par petites &#233;tapes 
      et testez-le souvent.</P>

      <p>Terminez la d&#233;finition du Groupe de Signaux en cliquant sur 
      <b>Appliquer</b> dans le volet de configuration de Signaux, puis 
      &#224; nouveau sur <b>Appliquer</b> pour fermer le volet Ajouter un Groupe 
      de Signaux. Votre nouveau Groupe appara&#238;tra dans le Tableau.</P>

      <p>Retour &#224; la <a href="SignalGroupTable.shtml">page d'aide du 
      Tableau Groupes de Signaux</a>.
        <!--# include virtual = "/Footer" -></p>
   </div> <!-- closes #mainContent ->
 </div> <!-- closes #mBody ->
</body>
</html>
