<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">

<html lang="fr">
<head>
  <meta name="generator" content=
  "HTML Tidy for Mac OS X (vers 31 October 2006 - Apple Inc. build 15.17), see www.w3.org">
  <!-- Updated by Herv&#233; Blorec 2013-10-12-->

  <title>JMRI: Signal Group Table</title>
  <!-- Style -->
  <meta http-equiv="Content-Type" content=
  "text/html; charset=us-ascii">
  <link rel="stylesheet" type="text/css" href="/css/default.css"
  media="screen">
  <link rel="stylesheet" type="text/css" href="/css/print.css"
  media="print">
  <link rel="icon" href="/images/jmri.ico" type="image/png">
  <link rel="home" title="Home" href="/">
  <!-- /Style -->
</head>

<body>
  <!--#include virtual="/Header" -->
  <div id="mBody">
    <!--#include virtual="Sidebar" -->
    <div id="mainContent">

      <h1>JMRI: Table Groupe Signal Groupes de Signaux</h1>
      Les Groupes de
      signaux sont utilis&eacute;s pour d&eacute;finir un certain
      nombre de t&ecirc;tes de signal, o&ugrave; une seule
      t&ecirc;te de signal peut &ecirc;tre &eacute;clair&eacute;e
      &agrave; un moment donn&eacute;, en fonction de l'&eacute;tat
      du m&acirc;t de signal associ&eacute; et un ensemble de
      conditions.<br>
      Les Groupes de signaux seront utilis&eacute;s lorsque des
      indicateurs suppl&eacute;mentaires sont utilis&eacute;s pour
      compl&eacute;ter le m&acirc;t du signal principal, tels que
      les &eacute;crans de Direction, Itin&eacute;raire ou la
      Vitesse. Ces indicateurs fournissent des informations
      suppl&eacute;mentaires pour le conducteur qui ne sont pas
      donn&eacute;es par le m&acirc;t du signal principal. Ces
      indicateurs sont fr&eacute;quemment observ&eacute;s en Europe
      et au Royaume-Uni.<br>

      <h2>Indicateurs de Directions</h2>Un indicateur de Direction
      peut &ecirc;tre configur&eacute; pour afficher n'importe
      quelle voie divergente entre 1 &agrave; 6. Un seul indicateur
      sera souvent trouv&eacute; o&ugrave; un aiguillage. diverge
      hors d'une ligne principale. Plusieurs indicateurs se
      trouvent dans des domaines plus complexes tels que l'approche
      des gares et les triages, o&ugrave; plusieurs routes peuvent
      &ecirc;tre prises. L'indicateur de direction informe le
      conducteur qu'il est en train de prendre un itin&eacute;raire
      diff&eacute;rent et doit donc adapter sa vitesse en fonction
      de la signalisation.<br>
      Les indicateurs de direction eux m&ecirc;mes seront en accord
      avec un ensemble de donn&eacute; d'aiguillage pour cette
      jonction.<br>

      <h2>Indicateurs d'Itin&eacute;raires</h2>Un indicateur
      d'Itin&eacute;raire tel qu'il est utilis&eacute; au
      Royaume-Uni, affiche un chiffre ou une lettre, ils sont
      majoritairement trouv&eacute;s li&eacute;s aux signaux
      &agrave; l'approche d'une gare. Ils affichent le quai sur
      lequel le train va &ecirc;tre achemin&eacute;, &eacute;tant
      donn&eacute; la complexit&eacute; de certains acc&egrave;s en
      gare , il peut y avoir un certain nombre d'itin&eacute;raires
      physiques diff&eacute;rents qui pourraient &ecirc;tre pris
      &agrave; partir du signal de destination. Ainsi un indicateur
      de jonction ne pouvait pas &ecirc;tre utilis&eacute;e lorsque
      tided avec des positions de d'aiguillage. De plus
      l'indicateur de jonction ne peut traiter que 6
      itin&eacute;raires diff&eacute;rents, et certaines stations
      ont plus de 6 quais.<br>
      Par cons&eacute;quent, l'indicateur d'itin&eacute;raire ne
      peut afficher qu'une destination &agrave; la fois.
      L'affichage d'un itin&eacute;raire ne signifie pas
      n&eacute;cessairement que le pilote prendra le m&ecirc;me
      chemin pour se rendre au quai de destination.<br>
      <a href="SignalGroup.png"><img src="SignalGroup.png" height=
      "223" width="309"></a>

      <h2>Chaque groupe de signal comprend les
      &eacute;l&eacute;ments suivants</h2>Un m&acirc;t de signal -.
      Auquel ce groupe est attach&eacute;<br>
      Une liste des apparences qui peuvent &ecirc;tre valables pour
      le groupe de signaux devenienne actif.<br>
      Par exemple: le m&acirc;t de signal, doit &ecirc;tre
      fix&eacute; pour Continuer ou Prudence, mais pas
      Arr&ecirc;t.<br>

      <p>Les T&ecirc;tes de signal qui composent chacune des
      indications du groupe. T&ecirc;tes de signaux au sein du
      groupe sont constitu&eacute;s &agrave; partir d'une
      t&ecirc;te de signal cr&eacute;&eacute;e en utilisant le type
      de sortie unique, &agrave; partir de la table t&ecirc;tes de
      signal.<br>
      <a href="SingleSignalHead.png"><img src=
      "SingleSignalHead.png" height="318" width="266"></a></p>

      <p>Alors chaque t&ecirc;te de signal a un ensemble de
      crit&egrave;res qui doivent &ecirc;tre remplis avant que la
      t&ecirc;te de signal soit allum&eacute;e. Il est
      constitu&eacute; d'aiguillages et/ou des &eacute;tats du
      capteur.<br></p>

      <h2>Exemple - Indicateur de Direction</h2>Consid&eacute;rons
      le sch&eacute;ma de voies suivants, vous avez ici six
      directions de sortie possibles de la voie principale.<br>
      <a href="SignalGroupTrackDiagram.png"><img src=
      "SignalGroupTrackDiagram.png" width="233"></a>

      <p>Le signal face &agrave; cette jonction aura un indicateur
      de jonction fix&eacute;, chaque voie possible aura sa propre
      indication. Lorsque l'itin&eacute;raire est fix&eacute; pour
      tout droit, alors aucun indicateur n'est indiqu&eacute;. Si
      l'itin&eacute;raire est fix&eacute; pour la position 1, alors
      l'indicateur position 1 sera affich&eacute;.<br>
      <a href="SignalGroupTrackDiagram1.png"><img src=
      "SignalGroupTrackDiagram1.png" height="90" width=
      "262"></a></p>

      <p>Avec cette configuration, vous devez cr&eacute;er une
      seule t&ecirc;te de signal d'aiguillage pour chaque position,
      configur&eacute;e avec une apparence &eacute;teint et
      lunaire. Vous pouvez utiliser deux combinaisons de couleurs
      que vous aimez, mais &eacute;teinte et lunaire sont plus
      adapt&eacute;s &agrave; cette situation.</p>

      <p>Dans le Groupe Signal, vous s&eacute;lectionnez chacune
      des T&ecirc;tes de Signal qui sont utilis&eacute;es pour
      cr&eacute;er l'indicateur de direction. La logique pour
      chaque t&ecirc;te de signal est alors configur&eacute;e comme
      suit.</p>

      <table>
        <tr>
          <td width="200" valign="top">
            <p>Position 1 - R&eacute;glages Aiguillages</p>

            <p>IT1</p>

            <p>mis D&eacute;vi&eacute;</p>

            <p>IT2 mis D&eacute;vi&eacute;.</p>
          </td>

          <td width="200">
            <p>Position 2 - R&eacute;glages Aiguillages</p>

            <p>IT1</p>

            <p>mis D&eacute;vi&eacute;,</p>

            <p>IT2 mis Droit,</p>

            <p>IT3 mis D&eacute;vi&eacute;.</p>
          </td>

          <td width="200">
            <p>Position 3 - R&eacute;glages Aiguillages</p>

            <p>IT1 mis D&eacute;vi&eacute;,</p>

            <p>IT2 mis Droit</p>

            <p>IT3 mis Droit.</p>
          </td>

          <td width="200">
            <p>Position 4 - R&eacute;glages Aiguillages</p>

            <p>IT1 mis Droit</p>

            <p>IT4 mis D&eacute;vi&eacute;</p>

            <p>IT5 mis D&eacute;vi&eacute;</p>
          </td>

          <td width="200">
            <p>Position 5 - R&eacute;glages Aiguillages</p>

            <p>IT1 mis Droit</p>

            <p>IT4 mis D&eacute;vi&eacute;</p>

            <p>IT5 mis Droitt</p>

            <p>IT6 mis D&eacute;vi&eacute;</p>
          </td>

          <td width="200">
            <p>Position 6 - R&eacute;glages Aiguillages</p>

            <p>IT1 mis Droit</p>

            <p>IT4 mis D&eacute;vi&eacute;</p>

            <p>IT5 mis Droit</p>

            <p>IT6 mis Droit</p>
          </td>
        </tr>
      </table>

      <!--#include virtual="/Footer" -->
    </div>
  </div>
</body>
</html>
