<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01//FR"
"http://www.w3.org/TR/html4/strict.dtd">
<!-- UpDated by Herv&#233; Blorec 2020-07-11-->
<html lang="fr">
<head>
  <meta name="generator" content=
  "HTML Tidy for Mac OS X (vers 31 October 2006 - Apple Inc. build 15.17), see www.w3.org">

  <title>JMRI: Transit Table Help</title>
  <meta name="author" content="Dave Duchamp">
  <meta name="keywords" content="JMRI help Transit Table">
  <meta http-equiv="Content-Type" content=
          "text/html; charset=utf-8">
  <!--#include virtual="/Style.shtml" -->
</head>

<body>
  <!--#include virtual="/Header.shtml" -->
  <div class="nomenu" id="mBody">
    <div id="mainContent">

      <h1>Aide de la table de transit</h1>

      <p>Tous les transits dont JMRI a connaissance peuvent &#234;tre consult&#233;s en utilisant le <strong>Tableau de transit</strong>.</p>

      <p>Pour ouvrir cet outil, s&#233;lectionnez <strong>Transits</strong> dans le sous-menu <strong>Tables</strong> du 
      menu <strong>Outils</strong> de la fen&#234;tre du menu principal du programme JMRI.</p>

      <h2>Utilisation de la table de transit</h2>

      <p>Les transits sont mis en place dans la table de transit. Lorsqu'ils sont configur&#233;s, Les transits sont ind&#233;pendants 
      des trains qui les utilisent.</p>

      <p>Tous les transits qui existent actuellement peuvent &#234;tre r&#233;f&#233;renc&#233;s en utilisant l'outil <strong>Transits</strong> 
      sous <strong>Tables</strong> dans le  menu Outils de la plupart des programmes JMRI. Il y a sept colonnes dans la Table de transit:</p>

      <ul>
        <li><strong>Nom Syst&#232;me</strong> - Le Nom Syst&#232;me est attribu&#233; au Transit lorsqu'il est cr&#233;&#233;, et ne 
        peut &#234;tre modifi&#233;.</li>

        <li><strong>Nom Utilisateur</strong> - Si vous souhaitez avoir vos transits porter des noms "lisibles par l'homme", 
        vous pouvez cliquer dans le "Nom Utilisateur" et modifiez ces informations en fonction de votre choix.</li>

        <li><strong>&#201;tat</strong> - L'&#233;tat d'un transit indique si il est <strong>LIBRE</strong> (disponible 
        pour l'activation et l'affectation &#224; un train), ou <strong>AFFECT&#201;</strong> (li&#233;e &#224; un Train 
        pour former un Train Actif). L'&#233;tat d'un Transit nouvellement ajout&#233; est toujours <strong>LIBRE</strong>.</li>

        <li><strong>Commentaire</strong> - Cette colonne est &#224; votre usage pour enregistrer tout commentaire que 
        vous souhaitez utiliser pour garder une trace de vos transits. C'est pour information seulement.

        <li>Cliquez sur le bouton <strong>Effacer</strong> dans une ligne sp&#233;cifique pour  supprimer le transit 
        dans cette ligne. Utilisez ce bouton avec attention ! Ne supprimez pas un Transit en cours d'ex&#233;cution.</li>

        <li>Cliquez sur le bouton <strong>Editer</strong> dans une rang&#233;e pour afficher ou modifier la saisi des 
        informations pour un transit. Le Nom Syst&#232;me ne peut pas &#234;tre chang&#233;. Le Nom Utilisateur peut &#234;tre 
        modifi&#233;, les Sections peuvent &#234;tre red&#233;finies, etc. Un seul Transit peut &#234;tre &#233;dit&#233; &#224; 
        la fois. Le transit ne peut &#234;tre modifi&#233; si un autre est en cours de cr&#233;ation, ou si le transit n'est pas dans l'&#233;tat LIBRE.</li>

        <li>Cliquez sur le bouton <strong>Dupliquer</strong> dans une rang&#233;e pour ajouter un autre Transit
        identique &#224; celui-ci. Cliquer sur ce bouton est similaire au fait de cliquer sur le bouton <strong>Ajouter...</strong> (voir ci-dessous) sauf que les informations de ce transit sont copi&#233;es dans la fen&#234;tre Ajouter/Modifier de Transit. Cette option offre un moyen facile de saisir plusieurs exemplaires d'un Transit lorsque plusieurs Trains doit suivre le m&#234;me itin&#233;raire au m&#234;me moment.</li>
      </ul>

      <p>Pour d&#233;finir un nouveau Transit, cliquez sur le bouton <strong><a href= "TransitAddEdit.shtml">Ajouter...</a></strong>. 
      Une fen&#234;tre Ajouter/Modifier le Transit appara&#238;tra, vous permettant de d&#233;signer les sections du nouveau Transit. 
      Comme un transit ne peut &#234;tre utilis&#233; que pour un seul train actif &#224; la fois, l'option Dupliquer (voir ci-dessus) 
      peut permettre de gagner du temps lors de la cr&#233;ation de plusieurs copies du m&#234;me transit.

      <h3>Utilisation de l'&#201;diteur de R&#233;seau pour configurer les transits</h3>
      Si vous utilisez un panneau de l'<a href="../display/LayoutEditor.shtml">&#201;diteur de R&#233;seau</a> pour d&#233;finir et g&#233;n&#233;rer la logique des M&#226;ts de Signalisation et des sections, il est possible de cr&#233;er un  transit dans l'&#201;diteur de R&#233;seau. Pour ce faire, affichez le menu contextuel (clic droit) d'un m&#226;t de signalisation sur le panneau. Si les choses ont &#233;t&#233; correctement mises en place, vous verrez la possibilit&#233; de  <strong>Cr&#233;er un transit &#224; partir d'ici</strong>. Apr&#232;s avoir s&#233;lectionn&#233; cette option vous pouvez progresser tout au long de votre parcours et s&#233;lectionner chaque M&#226;ts de Signalisation, en affichant le menu contextuel sur chaque en s&#233;lectionnant <strong>Add to Transit</strong>. Lorsque vous &#234;tes aux M&#226;t de Signalisation de la destination finale sur votre itin&#233;raire, s&#233;lectionnez <strong>Ajouter au transit et Terminer</strong> dans le menu contextuel de ce dernier M&#226;t de Signalisation.
      <br>
      Veuillez noter que vous devrez sauvegarder manuellement les Transits sur disque (voir ci-dessous).

      <h2>Pr&#233;paration pour un Fonctionnement Continu</h2>



      <p>Un transit peut &#234;tre mis en place pour un Fonctionnement Continu, permettant &#224; un Train Actif de voyager &#224; 
      travers son Transit plusieurs fois sans &#234;tre termin&#233; et r&#233;activ&#233;. &#192; condition que son transit soit
      mis en place pour un fonctionnement continu, chaque fois qu'un train actif termine son parcours dans son Transit, Le train 
      peut l'Activer, en option, pour &#234;tre r&#233;initialis&#233; automatiquement par le
      <a href="../dispatcher/Dispatcher.shtml">Dispatcher</a> ainsi  il est pr&#234;t &#224; repasser par son Transit. 
      Pour qu'un Transit soit capable de fonctionnement en continu, sa premi&#232;re section et sa derni&#232;re section 
      doivent &#234;tre les m&#234;mes, et les deux doivent &#234;tre mises en place pour fonctionner dans le  m&#234;me 
      direction. Cela s'applique &#224; la fois aux syst&#232;mes manuels et automatiques de fonctionnement des trains.</p>
      <p>Pour plus d'informations sur le r&#233;glage de l'option de fonctionnement continu, visitez l'Aide 
      <a href="../dispatcher/NewTrain.shtml">Activer de nouveaux Train</a> .</p>

      <h2>Sp&#233;cifier les actions pour le fonctionnement automatique</h2>

      <p>Les Transits soutiennent toute une s&#233;rie d'<strong><a href="ViewSpecialActions.shtml">Actions</a></strong> 
      que se produisent automatiquement lorsqu'un train circule dans le Transit en mode automatique. Une ou plusieurs 
      <strong>Actions</strong> peuvent &#234;tre sp&#233;cifi&#233;es avec chaque section en transit. Les <strong>Action</strong> 
      sont initi&#233;es lorsque leur Section associ&#233;e dans le Transit est p&#233;n&#233;tr&#233;e par le train en automatique.<br>
      Chaque <strong>Action</strong> comporte deux parties:</p>
      <ul>
        <li>Une partie <em>Quand</em>, qui pr&#233;cise quand l'<strong>Action</strong> doit &#234;tre effectu&#233;e, et</li>
        <li>Une partie<em> Quoi</em>, qui sp&#233;cifie quelle <strong>Action</strong>doit &#234;tre effectu&#233;e.</li>
      </ul>
      <p>Une action couramment utilis&#233;e, par exemple, est "Lorsque le  train d&#233;marre, allumez sses feux". 
      Plus d'informations sur les Actions est situ&#233; dans les Actions. Lire <a href="ViewSpecialActions.shtml">plus sur Actions</a>.</p>

      <h2>Sauvegarde des transits sur disque</h2>

      <p>Utiliser l'&#233;l&#233;ment Sauvegarder dans le menu Fichier pour enregistrer les informations du transit 
      sur le disque. Ces informations sont sauvegard&#233;es avec la configuration dans un fichier XML, ainsi que la 
      configuration du panneau de contr&#244;le  et autres articles similaires. Pour stocker vos panneaux dans le m&#234;me 
      fichier (recommand&#233;), s&#233;lectionnez <strong>Fichier</strong> -&gt ; <strong>Sauvegarder &gt ; Sauvegadrer 
      Configuration et panneaux &#224; classer...</strong> ou s&#233;lectionnez <strong> Stocker les Panneaux...</strong> 
      dans la fen&#234;tre principale de JMRI.</p>

      <p>Retour &#224; la <a href="../../../../html/tools/Transits.shtml">Documentation de transit</a>.</p>
      <!--#include virtual="/Footer.shtml" -->
    </div><!-- closes #mainContent-->
  </div><!-- closes #mBody-->
</body>
</html>
