# DispatcherBundle_fr.properties
#
# French properties for the jmri.jmrit.dispatcher GUI elements
# Translated by Herv\u00e9 BLOREC <bzh56420@yahoo.fr> le 2013-8-2

TitleDispatcher = Dispatcheur
ActiveTrainTableTitle = Trains Actifs
RequestedAllocationsTableTitle = Allocations Demand\u00e9es en attente d'\u00eatre Dispatcher
InitiateTrain = Nouveau Train
InitiateTrainButtonHint = Appuyez pour faire appara\u00eetre une fen\u00eatre pour d\u00e9marrer un nouveau train.
AllocateExtra = Allocation Suppl\u00e9mentaire
AllocateExtraButtonHint = Appuyez pour faire appara\u00eetre une fen\u00eatre permettant l'attribution d'une Section Suppl\u00e9mentaire pour un Train Actif.
TerminateTrain = Terminer Train
TerminateTrainButtonHint = Appuyez pour faire appara\u00eetre une fen\u00eatre pour mettre fin \u00e0 un Train Actif.
TerminateTrainChoice = Veuillez s\u00e9lectionner un Train Actif \u00e0 Terminer, ou Annuler.
TerminateTrainTitle = Terminer Train
CancelRestart = Annuler Red\u00e9marrage Auto
CancelRestartButtonHint = Appuyez pour faire appara\u00eetre une fen\u00eatre pour annuler le red\u00e9marrage automatique d'un Train Actif.
CancelRestartChoice = Veuillez s\u00e9lectionner un Train Actif pour annuler le red\u00e9marrage automatique, ou Annuler.
CancelRestartTitle = Annuler Red\u00e9marrage Auto

TransitColumnTitle = Transit
TrainColumnTitle = Train
NextSectionColumnTitle = Section suivante
AllocateButtonName = Allocation Suivante

ActiveColumnTitle = Train Actif
ExtraTitle = Allouer Section Suppl\u00e9mentaire
ATBoxHint = S\u00e9lectionnez un Train Actif pour lui allouer une Section Suppl\u00e9mentaire.
ExtraBoxLabel = Section \u00e0 Allouer
ExtraBoxHint = Choisissez une Section connect\u00e9e \u00e0 allouer.
CancelExtraHint = Cliquez pour annuler sans allouer une section suppl\u00e9mentaire.
AllocateButtonHint = Cliquez pour allouer une section s\u00e9lectionn\u00e9e au train actif.
SectionColumnTitle = Section Requise
AllocatedSectionColumnTitle = Section Allou\u00e9e
StatusColumnTitle = \u00c9tat Section 
TrainStatusColumnTitle = Statut du Train
TrainModeColumnTitle = Mode
OccupancyColumnTitle = Occupation
UseStatusColumnTitle = Utiliser \u00c9tat
TrainTypeColumnTitle = Type de Train
TrainLengthColumnTitle = Longueur
SectionLengthColumnTitle = Longueur
AllocateButton = Allouer
AllocatedSectionsTitle = Sections Allou\u00e9es
AutoReleaseBoxLabel = D\u00e9clenchement automatique
AutoReleaseBoxHint = Cochez pour lib\u00e9rer automatiquement les sections allou\u00e9es qui sont montr\u00e9es comme quitt\u00e9es.
ReleaseButton = Lib\u00e9rer
NotEntered = Pas d'Entr\u00e9e
Entered = Entr\u00e9e
Exited = Sorti

#OptionsMenuTitle = Options
AutoDispatchItem = Allouer Automatiquement
OptionWindowItem = Options Fen\u00eatre 
AutoTurnoutsItem = R\u00e9glage Automatique des Aiguillages
SaveOptionsItem = Sauvegarder Options
UseConnectivity = Utiliser la connectivit\u00e9 \u00e0 partir du panneau de l'\u00c9diteur de R\u00e9seau:
UseConnectivityHint = Cocher pour utiliser la connectivit\u00e9 \u00e0 partir du panneau de l'\u00e9diteur de R\u00e9seau s\u00e9lectionn\u00e9.
SignalTypeHint = S\u00e9lectionnez le type de signalisation utilis\u00e9 sur le panneau et que le r\u00e9partiteur suivra.
LayoutEditorHint = S\u00e9lectionnez le Panneau de l'\u00e9diteur de R\u00e9seau avec la meilleure connectivit\u00e9, s'il y en a plus d'un.
TrainsFromRoster = Trains depuis la Liste
TrainsFromRosterHint = S\u00e9lectionner les Trains devant\u00eatre choisis dans la liste JMRI.
TrainsFromTrains = Trains provenant de l'Exploitation
TrainsFromTrainsHint = S\u00e9lectionner les trains devant\u00eatre choisis \u00e0 partir des trains JMRI en Exploitation.
TrainsFromUser = Trains en provenance de l'Entr\u00e9e Utilisateur
TrainsFromUserHint = S\u00e9lection des informations de Trains devant\u00eatre entr\u00e9 par l'utilisateur.
DetectionBox = Le R\u00e9seau  dispose d'un mat\u00e9riel de d\u00e9tection de canton
DetectionBoxHint = Cochez si le r\u00e9seau  a le mat\u00e9riel de d\u00e9tection d'occupation de canton pour tous les cantons des sections.
AutoAllocateBox = Allouer automatiquement les sections \u00e0 des Trains Actifs.
AutoAllocateBoxHint = Cochez si l'ordinateur attribue automatiquement les sections demand\u00e9es. D\u00e9cochez pour l'attribution manuelle.
AutoTurnoutsBox = R\u00e9gler automatiquement les aiguillages quand un Sections est allou\u00e9e.
AutoTurnoutsBoxHint = Cochez si l'ordinateur r\u00e8gle automatiquement les aiguillages quand une section est allou\u00e9e. D\u00e9cochez pour un r\u00e9glage manuel.
CancelButtonHint2 = Cliquez ici pour annuler sans modifier les options.
ApplyButtonHint = Cliquez pour appliquer les options ci-dessus et fermer cette fen\u00eatre.
ShortNameBox = Utiliser des noms courts pour les Trains Actifs.
ShortNameBoxHint = Cochez pour utiliser le nom de train comme les nom de train actif dans les tableaux et les bo\u00eetes de s\u00e9lection.
NameInBlockBox =Placez le nom du train dans le Canton de D\u00e9part.
NameInBlockBoxHint = Cochez pour placer automatiquement le nom des nouveaux trains dans les valeur de d\u00e9part des Canton.
RosterInBlockBox = Placer l'Entr\u00e9e Liste dans le Canton de d\u00e9part
RosterInBlockBoxHint = Cochez pour placer automatiquement l'Entr\u00e9e Liste de nouveaux trains dans leur valeur de canton de d\u00e9part.
ExtraColorForAllocatedBox = Utiliser une autre couleur alternative pour les Cantons allou\u00e9s
ExtraColorForAllocatedBoxHint = Cocher pour utiliser une autre couleur pour les Cantons inoccup\u00e9s dans les Sections allou\u00e9es.
NameInAllocatedBlockBox = Placer le nom du train dans les Cantons allou\u00e9s
NameInAllocatedBlockBoxHint = Cochez pour placer automatiquement le nom du train dans les Cantons des Sections allou\u00e9es.
OpenDispatcherWithPanelBox = Ouvrir le Dispatcheur avec le Panneau
OpenDispatcherWithPanelBoxHint = Cochez pour ouvrir automatiquement la fen\u00eatre du Dispatcheur lorsque le panneau est charg\u00e9 (fichier Panneau devra\u00eatre sauv\u00e9)
Units = Unit\u00e9s\:
ScaleFeet = \u00c9chelle Pieds 
ScaleFeetHint = S\u00e9lectionnez cette option pour utiliser l'\u00e9chelle en Pieds pour la section et la longueur du train.
ScaleMeters = \u00c9chelle M\u00e8tres
ScaleMetersHint = S\u00e9lectionnez cette option pour utiliser l'\u00e9chelle en m\u00e8tres pour la section et la longueur du train.

AddTrainTitle = Activer Nouveau Train
TransitBoxLabel = Transit
TransitBoxHint = Choisir un transit pour le nouveau Train Actif.
TrainBoxLabel = Train
TrainBoxHint = Choisir un train \u00e0 activer.
TrainFieldLabel = Nom du Train
TrainFieldHint = Entrez un nom de train court.
DccAddressFieldLabel = Adresse DCC 
DccAddressFieldHint = Entrez l'adresse DCC du train (uniquement des chiffres).
TrainInTransit = Train dans le Transit s\u00e9lectionn\u00e9.
InTransitBoxHint = Cochez pour changer la s\u00e9lection de canton si le Train est situ\u00e9 dans un Transit s\u00e9lectionn\u00e9.
StartingBlockBoxLabel = Lieu de D\u00e9part du Train
StartingBlockBoxHint = S\u00e9lectionner le Canton o\u00f9 le train se trouve actuellement.
DestinationBlockBoxLabel = Lieu de Destination du Train
DestinationBlockBoxHint = S\u00e9lectionner le Canton o\u00f9 sera le train quand le Transit sera termin\u00e9.
AutoRun = Ex\u00e9cution Automatique d'un Train
AutoRunBoxHint = Cochez pour demander que le train soit lanc\u00e9 automatiquement par JMRI.
ResetWhenDoneBoxHint = Cochez pour une ex\u00e9cution en continu,  pour r\u00e9initialiser automatiquement pour une autre course \u00e0 travers le Transit s\u00e9lectionn\u00e9.
ResetWhenDone = R\u00e9initialiser quand c'est fait (fonctionnement continu)
ReverseAtEndBoxHint = Inverser automatiquement le sens du Transit s\u00e9lectionn\u00e9 lorsque la fin du Transit est atteinte (Navette).
ReverseAtEnd = Inverser \u00e0 la fin (Navette)
PriorityLabel = Priorit\u00e9
PriorityHint = Entrer un entier pour la priorit\u00e9 - plus grand nombre = priorit\u00e9 la plus \u00e9lev\u00e9e.
DelayedStartNone = Aucun d\u00e9lai
DelayedStartTimed = Temporisation
DelayedStartSensor = Retard du capteur
DelayedStart = D\u00e9part retard\u00e9
DelayedStartHint = Cochez pour demander que le train parte \u00e0 l'heure sp\u00e9cifi\u00e9e de l'horloge rapide.
RestartSensor = Red\u00e9marrer le capteur
RestartSensorHint = S\u00e9lectionnez le capteur qui va d\u00e9clencher la r\u00e9affectation du transit
RestartTimed = Temps en minutes \u00e0 attendre
RestartTimedHint = Entrer la dur\u00e9e en minutes pendant lequel le r\u00e9gulateur devra attendre pour que le transit puisse\u00eatre r\u00e9affect\u00e9
DelayRestart = Ajouter retard :
DelayedReStartHint = Ajouter un retard entre les circuits, lors de l'ex\u00e9cution en continu
DepartureTime = Heure de d\u00e9part :
DepartureTimeHrHint = Entrer l'heure de d\u00e9part en horloge rapide (24 heures) (00-23).
DepartureTimeMinHint = Entrez les minutes de d\u00e9part en horloge rapide (00-59).
AddNewTrainButtonHint = Cliquez pour activer un nouveau train en utilisant les informations saisies.
CancelButtonHint = Cliquez pour annuler sans activation d'un nouveau train.
LoadButton = Charger Info Train
LoadButtonHint = Cliquez pour charger l'information du train enregistr\u00e9 pr\u00e9c\u00e9demment (en option).
SaveButton=Sauv Info Train ...
SaveButtonHint = Cliquez pour enregistrer les informations de train montr\u00e9 ci-dessous (en option).
DeleteButton = Supp ...
DeleteButtonHint = Cliquez pour supprimer un fichier d'information sur le train pr\u00e9c\u00e9demment enregistr\u00e9.

LoadTrainChoice = Veuillez s\u00e9lectionner un fichier Info de train \u00e0 charger, ou Annuler.
LoadTrainTitle = Charge Infos Train
DeleteTrainChoice = Veuillez s\u00e9lectionner un fichier Info de train de supprimer, ou Annuler.
DeleteTrainTitle = Supp Info Train 
EnterFileName = S'il vous pla\u00eet entrer un nom pour votre fichier Info Train, par exemple, SPThruFreight.
TrainTypeBoxLabel = Type de Train:
TrainTypeBoxHint = S\u00e9lectionnez le type de Train que vous utilisez.
SpeedFactorLabel = Facteur de vitesse:
SpeedFactorHint = Entrer un facteur (0,1-1,5) pour modifier la vitesse par d\u00e9faut pour ce train.
MaxSpeedLabel = Vitesse maximale par d\u00e9faut:
MaxSpeedHint = Entrer une vitesse maximale (0,1-1,0) autoris\u00e9e pour ce train.
RampRateBoxLabel = Taux de rampe:
RampRateBoxHint = S\u00e9lectionnez un taux de rampe  pour les variations de vitesse pour ce train.
ResistanceWheels = Toutes les wagons ont des essieux r\u00e9sistifs
ResistanceWheelsBoxHint = Cochez si tous les wagons de ce train montre l'occupation du Canton.
RunInReverse = Circuler en Inverse
RunInReverseBoxHint = Cochez si locomotive peut circuler en arri\u00e8re sur ce Transit.
SoundDecoder = Loco poss\u00e8de un d\u00e9codeur sonore.
SoundDecoderBoxHint = Cochez si d\u00e9codeur peut effectuer des actions sonores.
MaxTrainLengthLabel = Train Longueur Maximum:
MaxTrainLengthHint = Entrer la longueur maximale (\u00e9chelle pieds/m\u00e8tres) de ce train pendant sa course dans ce transit.
TerminateWhenDone = Terminer quand fait

RUNNING = EN CIRCULATION
PAUSED = PAUSE
WAITING = ATTENTE
WORKING = TRAVAIL
READY  = PR\u00caT
STOPPED = ARR\u00caT\u00c9 
DONE = TERMIN\u00c9
START = D\u00c9MARRAGE
AUTOMATIC = AUTOMATIQUE
MANUAL = MANUEL
DISPATCHED = EXP\u00c9DI\u00c9S
FORWARD = AVANT
REVERSE = INVERSE
UNKNOWN = INCONNU
OCCUPIED = OCCUP\u00c9
UNOCCUPIED = INOCCUP\u00c9
FREE = LIBRE
ALLOCATED = ALLOU\u00c9
LOCAL_PASSENGER = PASSAGER_LOCAL
LOCAL_FREIGHT = FRET_LOCAL
THROUGH_PASSENGER = PASSAGER_TRANSIT
THROUGH_FREIGHT = FRET_TRANSIT
EXPRESS_PASSENGER = PASSAGER_EXPRESS
EXPRESS_FREIGHT = FRET_EXPRESS
MOW = MOW 

RAMP_NONE = AUCUNE_RAMPE
RAMP_FAST = RAMPE_RAPIDE
RAMP_MEDIUM = RAMPE_M\u00c9DIUM
RAMP_MED_SLOW = RAMPE_M\u00c9DIUM_LENTE
RAMP_SLOW = RAMPE_LENTE

TitleAutoTrains = Trains Automatique
StopAll = Arr\u00eat de tous les Trains Automatique
StopAllButtonHint = Appuyez sur pour arr\u00eater tous les trains circulant automatiquement.
ResumeButton = CV
ResumeButtonHint = Appuyez sur pour reprendre l'ex\u00e9cution de ce train arr\u00eat\u00e9.
StopButton = Arr\u00eat
StopButtonHint = Appuyez sur pour arr\u00eater ce train - mettre sa vitesse \u00e0 z\u00e9ro.
ToManualButton = Pour Manuel
ToManualButtonHint = Appuyez pour changer le mode de ce train pour une exploitation Manuelle.
ToAutoButton = Pour Auto
ToAutoButtonHint = Appuyez sur pour reprendre l'Exploitationt Automatique de ce train actuellement en mode manuel.
ResumeAutoButton = Reprendre Circulation Auto
ResumeAutoButtonHint = Appuyez sur pour arr\u00eater de TRAVAILLER et de reprendre la CIRCULATION automatique de ce train.
ForwardRadio = Avant
ForwardRadioHint = Pressez pour changer la direction pour Avant
ReverseRadio = Inv
ReverseRadioHint = Appuyez pour changer de direction pour Inverse.

ChoiceFrameTitle = Choisir la Section Suivante
ExplainChoice = Choississez la Section \u00e0 suivre {0} .
WarnCancel = Attention! Vous avez annul\u00e9 au lieu de s\u00e9lectionner une\nSection, aussi l'ordinateur choisira pour vous.

NoTransitsMessage = Pas trouv\u00e9s de Transits - Ne peut pas ouvrir le Dispatcheur.\nS'il vous pla\u00eet ajoutez des Transits et r\u00e9essayez.
NoResetMessage = D\u00e9sol\u00e9, le Transit s\u00e9lectionn\u00e9 n'est pas configur\u00e9 pour continuer\nla circulation. Voir la fen\u00eatre Tableau Transit  pour plus d'informations.
NoEntryBlocks = Le Transit s\u00e9lectionn\u00e9 n'a pas de Canton Entr\u00e9e
AutoTurnoutsWarn = sans connexion \u00e0 partir d'un panneau de l'\u00e9diteur de r\u00e9seau, tous les aiguillages\n ne peuvent pas \u00eatre r\u00e9gl\u00e9s correctement. S'il vous pla\u00eet v\u00e9rifier lors de l'attribution.

Question1 = Section 1 est LIBRE, mais OCCUP\u00c9E. Voulez-vous\nremplacer l'occupation et l'affecter?
Question2 = Section 2 est LIBRE, mais la section aiguillages n'est pas d\u00e9finie\ncorrectement. Voulez-vous la remplacer et l'allouer de toute fa\u00e7on?
ButtonOverride = Remplacez
#ButtonNo = Non, attendez
Question3 = Un Fichier Info de train avec le nom "{0}" existe d\u00e9j\u00e0\nVoulez-vous remplacer ce fichier ou annuler?
Question4 = Section est LIBRE et INOCCUP\u00c9E, mais ce train Actif\nn'a pas encore atteint son heure de d\u00e9part. Voulez-vous\nremplacer  l'heure de d\u00e9part et l'affecter?
ButtonReplace = Remplacez
#FileNo = Non, Annuler
Question5 = La Section Allou\u00e9 "{0}" est occup\u00e9e. Voulez-vous vraiment la lib\u00e9rer?
ButtonRelease = Liberer
#ButtonNoX = Non, Annuler Lib\u00e9ration

Message1 = Veuillez terminer ou annuler un nouveau Train Actif avant de Terminer un Train Actif.
Message2 = Veuillez terminer ou annuler un nouveau Train Actif avant\nd'annuler le red\u00e9marrage automatique d'un Train Actif.

TrainWarn = Le nom de train du fichier - "{0}" n'est pas disponible pour la s\u00e9lection.
TransitWarn = Le nom transit du fichier - "{0}" n'est pas disponible pour la s\u00e9lection.
FastClockWarn = Au moins un Train Actif attend\nl'horloge rapide, mais elle ne fonctionne pas.\n Voulez-vous d\u00e9marrer l'horloge rapide?
FastClockWarn2 = Au moins un Train Actif a besoin de \nl'horloge rapide pour repartir, mais elle ne fonctionne pas. \nVoulez-vous d\u00e9marrer l'horloge rapide?
ButtonYesStart = Oui, d\u00e9marrez-la

# messages d'erreur
Error1 = Le nom "{0}" ne correspond pas \u00e0 un Transit existants\nVeuillez corriger ou cr\u00e9er, au besoin, et essayez \u00e0 nouveau.
Error2 = Le Transit "{0}" est utilis\u00e9 avec un autre train actif.\nVeuillez patienter jusqu'\u00e0 ce qu'il soit en VEILLE, ou utiliser un doublon.
Error3 = ID Train manque dans la demande de cr\u00e9ation d'un train actif.\nVeuillez ajouter une ID train et essayez de nouveau.
Error4 = Le nom "{0}" ne correspond pas \u00e0 un canton de d\u00e9part autoris\u00e9.\nVeuillez corriger et essayer \u00e0 nouveau.
Error5 = Le Canton de D\u00e9part demand\u00e9 "{0}" est une Section attribu\u00e9 \u00e0 un\ntrain Actif diff\u00e9rent. S'il vous pla\u00eet corriger et essayer \u00e0 nouveau.
Error6 = Aucun train d\u00e9tect\u00e9 dans le canton de d\u00e9part "{0}".\nVeuillez corriger et essayez \u00e0 nouveau.
Error7 = Le nom "{0}" ne correspond \u00e0 aucun canton existant dans la demande de Transit. S'il vous pla\u00eet corriger et essayez \u00e0 nouveau.
Error8 = Le Canton de fin est dans le Transit demand\u00e9, mais aucun de num\u00e9ro de s\u00e9quence\nde Section n'a \u00e9t\u00e9 fourni. S'il vous pla\u00eet corriger et essayez \u00e0 nouveau.
Error9 = Le num\u00e9ro "{0}" de s\u00e9quence Section Canton de Fin n'est pas valide.\nVeuillez corriger et essayer \u00e0 nouveau.
Error10 = Exploitation automatique demand\u00e9, mais aucune adresse DCC n'a\n\u00e9t\u00e9 fourni. S'il vous pla\u00eet fournir l'adresse DCC et essayez \u00e0 nouveau.
Error11 = La Cr\u00e9ation d'un nouveau Train Actif a \u00e9chou\u00e9 pour une raison ind\u00e9termin\u00e9e,\nTransit - "{0}", Train - "{1}". S'il vous pla\u00eet v\u00e9rifiez et essayer \u00e0 nouveau.
Error12 = Le Canton de D\u00e9part est pr\u00e9sent et connect\u00e9 , mais le num\u00e9ro\nde s\u00e9quence de la Section n'a pas \u00e9t\u00e9 fourni. S'il vous pla\u00eet corriger et essayez \u00e0 nouveau.
Error13 = Le num\u00e9ro "{0}" de s\u00e9quence Section Canton de D\u00e9part n'est pas valide.\nVeuillez corriger et essayer \u00e0 nouveau.
Error14 = Pas de train disponible.\nImpossible cr\u00e9er un nouveau train actif.
Error15 = Pas de transits disponibles.\nImpossible cr\u00e9er un nouveau train actif.
Error16 = Aucun Train Actif sp\u00e9cifi\u00e9 dans la demande d'allocation\nd'une section. Impossible de traiter la demande.
Error17 = Pas de Section sp\u00e9cifi\u00e9e dans la demande d'allocation \u00e0 partir du Train\nActif "{0}". Impossible de traiter la demande.
Error18 = Direction invalide "{0}" dans la demande d'allocation \u00e0 partir du Train\nActif "{1}". Impossible de traiter la demande.
Error19 = Num\u00e9ro de s\u00e9quence "{0}"en dehors de la plage, dans la demande d'allocation du\nTrain Actif "{1}". Impossible de traiter la demande.
Error20 = Cr\u00e9ation d'une nouvelle demande d'allocation de "{0}"\nen \u00e9chec pour une raison ind\u00e9termin\u00e9e.
Error21 = Identificateur de source du train fourni est ill\u00e9gal. S'il vous pla\u00eet corriger l'identificateur de source de train et r\u00e9essayez.
Error22 = Aucun nom train n'a \u00e9t\u00e9 entr\u00e9.\nImpossible de cr\u00e9er un nouveau Train Actif.
Error24 = Nom de train Entr\u00e9"{0}" est d\u00e9j\u00e0 utilis\u00e9 par un\nTrain Actif. S'il vous pla\u00eet entrez le nom d'un train utilis\u00e9.
Error25 = Nom de fichier entr\u00e9 ill\u00e9gal- la\nrequ\u00eate pour sauver Info Train a \u00e9t\u00e9 ignor\u00e9e.
Error26 = Demande de R\u00e9initialisation Une Fois Termin\u00e9, mais le Transit, "{0}",\nest pas mis en place correctement. Impossible de cr\u00e9er un nouveau Train Actif.
Error27 = Impossible initaliser l'exploitation automatique du train "{0}",\nchang\u00e9 en exploitation manuelle.
Error28 = Impossible de d\u00e9marrer un r\u00e9gulateur pour exploiter le train "{0}"\nautomatiquement, chang\u00e9 en exploitation manuelle.
Error33 = Exploitation automatique requise, mais aucun panneau \u00c9diteur de R\u00e9seau\na \u00e9t\u00e9 sp\u00e9cifi\u00e9 dans la fen\u00eatre Options. S'il vous pla\u00eet essayer de nouveau.
Error34 = "{0}" erreurs constat\u00e9es lors de la v\u00e9rification de la connectivit\u00e9 des Sections\ndans ce Transit. V\u00e9rifiez le journal des messages pour plus de d\u00e9tails.
Error35 = Exploitation automatique requise, mais la d\u00e9tection d'occupation\nRn'est pas sp\u00e9cifi\u00e9e dans la fen\u00eatre Options. S'il vous pla\u00eet essayer de nouveau.
Error36 = "{0}" erreurs constat\u00e9es lors de la v\u00e9rification/r\u00e9glage des capteurs de direction dans\nla logique signal pour ce Transit. V\u00e9rifiez le journal des messages pour plus de d\u00e9tails.
Error39 = AllocationAuto reqi\u00e8re un panneau \u00c9diteur de R\u00e9seau et essayez \u00e0 nouveau.

SupportVSDecoder = Support de positionnement pour le d\u00e9codeur sonore virtuel 
SupportVSDecoderBoxHint = Cochez cette case pour utiliser Dispatcheur pour aider la disposition des sons du trains depuis le D\u00e9codeur Son  Virtuel

trustKnownTurnouts = Confiance en l'\u00c9tat Connu?
trustKnownTurnoutsHint = Faire confiance \u00e0 l'\u00e9tat connu actuel des aiguillages, et ne pas renouveler la commande.
#ms = ms
minThrottleInterval = Intervalle Minimum R\u00e9gulateur
minThrottleIntervalHint = Intervalle Minimum (en ms) entre les commandes r\u00e9gulateur, entre 20ms et 1000ms
fullRampTime = Temps pour Rampe Enti\u00e8re
fullRampTimeHint = Temps (en ms) pour que RAMP_FAST loco passe de 0% \u00e0 100%, entre 1,000ms et 20,000ms. 
