<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01//EN"
"http://www.w3.org/TR/html4/strict.dtd">
<html lang="fr">
<head>
<!-- Updated by Herv&#233; Blorec le 2017-02-05-->
<title>JMRI Hardware Support - OpenLCB Details</title>
<!-- Style -->
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<link rel="stylesheet" type="text/css" href="/css/default.css" media="screen">
<link rel="stylesheet" type="text/css" href="/css/print.css" media="print">
<link rel="icon" href="/images/jmri.ico" type="image/png">
<link rel="home" title="Home" href="/">
<!-- /Style -->
</head>

<body>
<!--#include virtual="/Header" -->
<div id="mBody">
    <!--#include virtual="Sidebar" -->
    <div id="mainContent">

<h1>Documentation Mat&#233;riel: D&#233;tails Techniques-OpenLCB</h1>

<em>Le support sur cette page est en &#233;volution rapide, le
code r&#233;el pourrait &#234;tre en avance ou retard sur la documentation
sur un jour donn&#233;
.</em><p>

Cette page d&#233;crit les d&#233;tails techniques du support de JMRI
<a href="index.shtml"> OpenLCB </a>


<h2>Adaptateurs CAN </h2>

L'approche g&#233;n&#233;rale de JMRI est de soutenir le plus grand nombre de
combinaisons de mat&#233;riel possible. En soutenant les d&#233;sirs d'un plus grand nombre de
personnes et leur mat&#233;riel, nous pouvons  cr&#233;er une communaut&#233; croissante de 
d&#233;veloppeurs, donc plus de
code.

      <h2>Adaptateurs CAN</h2>L'approche g&eacute;n&eacute;rale de
      JMRI est de soutenir le plus grand nombre de combinaisons de
      mat&eacute;riel possible. En soutenant les d&eacute;sirs d'un
      plus grand nombre de personnes et leur mat&eacute;riel, nous
      pouvons cr&eacute;er une communaut&eacute; croissante de
      d&eacute;veloppeurs, donc plus de code.

<h2> N&#339;ud ID </h2>

JMRI sur un r&#233;seau OpenLCB actes, en partie, comme un n&#339;ud OpenLCB.
En tant que tel, il a besoin d'une ID de n&#339;ud unique OpenLCB sur 6-octet   .
Il s'appuie sur cela automatiquement chaque fois qu'il d&#233;marre.
Il est construit &#224; partir du pr&#233;fixe unique OpenLCB JMRI,
avec un octet de l'adresse IP de l'ordinateur,
et deux octets de l'ID de processus du programme.
Cela vous permet par exemple ex&#233;cuter JMRI sur plusieurs ordinateurs
ou des copies multiples sur beaucoup ordinateur sans probl&#232;mes.
<p>
Une am&#233;lioration future rendra ceci persistant d'une ex&#233;cution &#224; l'autre
, de sorte qu'ils peuvent &#234;tre utilis&#233;s pour cr&#233;er facilement une ID ev&#232;nement unique et persistant.


<a name="documentation"></a><h2>Documentation</h2>
<h3>Aide JMRI</h3>
<p><a href="../can/index.shtml">Support d'Aide CAN</a>

<p>Retour &#224; la <a href="index.shtml">page principale d'Aide OpenLCB</a></p>

<!--#include virtual="/Footer" -->
  </div><!-- closes #mainContent-->
</div> <!-- closes #mBody-->
</body>
</html>
