<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01//EN" "http://www.w3.org/TR/html4/strict.dtd">
<html lang="fr">
<head>
<!-- Copyright ($Author: jacobsen $) 2008 -->
<!-- $Id: index.shtml 22760 2013-02-10 02:01:45Z jacobsen $ -->
<!-- UpDated by Herv&#233; Blorec le 2013-09-18-->
<title>JMRI: OpenLCB Support</title>

<!-- Style -->

<META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=iso-8859-1">
<LINK REL="stylesheet" TYPE="text/css" HREF="/css/default.css"
	MEDIA="screen">
<LINK REL="stylesheet" TYPE="text/css" HREF="/css/print.css"
	MEDIA="print">
<LINK REL="icon" HREF="/images/jmri.ico" TYPE="image/png">
<LINK REL="home" TITLE="Home" HREF="/">
<!-- /Style -->
</HEAD>

<BODY>
<!--#include virtual="/Header" -->
  <div class="nomenu" id="mBody">
    <div id="mainContent">

<h1> 
JMRI: Support OpenLCB
</h1>

<em> Le contenu de cette page &#233;volue rapidement; le Code r&#233;el pourrait &#234;tre en avance ou en retard par rapport &#224; la documentation
pour un jour donn&#233;.</em> <p>

JMRI fournit un support pour les
<a href="../../tools/Sensors.shtml"> Capteurs JMRI</a> 
et les
<a href="../../tools/Turnouts.shtml"> Aiguillages</a> en g&#233;n&#233;ral.
en termes "d'&#233;v&#233;nements" OpenLCB.

<p>
Vous pouvez directement utiliser le r&#233;seau OpenLCB
par l'
<a href="../../../package/jmri/jmrix/openlcb/swing/send/OpenLcbCanSendFrame.shtml"> envoi de trame outil</a>.
Pour la navigation et les param&#232;tres de configuration, consultez les
<a href="../../../package/jmri/jmrix/openlcb/swing/networktree/NetworkTreePane.shtml"> outils de  configuration de noeud du navigateur</a>.
<a href="../../../package/jmri/jmrix/openlcb/swing/networktree/NodeWithID.png">
    <img src="../../../package/jmri/jmrix/openlcb/swing/networktree/NodeWithID.png"
         width="128" height="149" align="right"
         alt="Configuration Tool window"></a>


<p>
Voir aussi l'
<a href="../index.shtml"> page d'aide principale</a> pourle support JMRI CAN
y compris des liens vers divers outils g&#233;n&#233;raux et la
page sur les
<a href="Details.shtml"> d&#233;tails techniques</a>
de soutien OpenLCB de JMRI.

<h2>D&#233;signation</h2>

La <a href="../../../html/doc/Technical/Names.shtml"> lettre du syst&#232;me</a>
pour les connexions OpenLCB est "M". Les noms OpenLCB d'&#233;v&#233;nement et d'objet sont
pr&#233;sent&#233; ci-dessous, avec des d&#233;tails et des formats suppl&#233;mentaires sur une
<a href="Names.shtml"> page s&#233;par&#233;e</a>.

<p>
JMRI associ&#233;s &#233;v&#233;nements OpenLCB avec des
Objets JMRI individuels (capteurs, les Aiguillages, etc) via le
Noms syst&#232;me JMRI. Un nom de syst&#232;me comme
"<code> MS1.2.3.4.5.6.7.8; 1.2.3.4.5.6.7.9</code>"
d&#233;finit un capteur qui suit le "1.2.3.4.5.6.7.8"
et l'&#233;v&#233;nements OpenLCB "1.2.3.4.5.6.7.9" 
&#224; changer d'&#233;tat.
<p>
Un autre format pour les ID d'&#233;v&#233;nement est une
cha&#238;ne hexad&#233;cimale continue, tels que
"x0102030405060709".
<p>
Ces noms de syst&#232;me peut devenir tr&#232;s long, dans lequel
cas, les "noms utilisateur" deviennent beaucoup plus utile.


<h2> Capteurs</h2>

Les mMessages OpenLCB &#224; venir dans les applications JMRI peuvent &#234;tre consult&#233;s
via des objets de capteur JMRI. Le  
<a href="Names.shtml">syst&#232;me de nom capteur</a> 
d&#233;termine les &#233;v&#233;nements de OpenLCB il correspond.

<p>
Un capteur est d&#233;fini par deux &#233;v&#233;nements: celui qui la d&#233;finit ACTIFe et
celui qui d&#233;finit INACTIF. Les num&#233;ros d'&#233;v&#233;nements sont essentiellement
arbitraire, et sont d&#233;finis par les noeuds OpenLCB qui les envoient.
Parce que les &#233;v&#233;nements ne sont pas intrins&#232;quement associ&#233;e &#224; un objet mat&#233;riel sp&#233;cifique
, et parce que les gens peuvent utiliser les ID d'&#233;v&#233;nement &#224; bien des fa&#231;ons,
une ID sp&#233;cifique d'ev&#232;nement pour un capteur doit &#234;tre fourni.
Vous cr&#233;ez des Capteurs en utilisant le bouton
<a href="../../../../package/jmri/jmrit/beantable/SensorAddEdit.shtml"> Ajouter ...</a>
 sur le
<a href="../../../../package/jmri/jmrit/beantable/SensorTable.shtml"> tableau Capteur</a>.
Si vous fournissez deux ID d'&#233;v&#233;nement, le premier va r&#233;gler le d&#233;tecteur ACTIF et
le second vous permettra de passer INACTIF. Si vous fournissez un seul, il
fixera le capteur ACTIF, et il se r&#233;initialise automatiquement &#224; INACTIF
peu de temps apr&#232;s. Ceci peut &#234;tre utilis&#233; pour des &#233;v&#233;nements qui indiquent des choses momentan&#233;es sur
le r&#233;seaut comme "il est midi".

<h2> Aiguillages</h2>

Le r&#233;gime des aiguillages est similaire aux capteurs ci-dessus,
sauf que JMRI &#233;met les trames OpenLCB au lieu de les recevoir, et
la lettre type est "T" au lieu de "S", par exemple "<code> MT1.2.3.4.5.6.7.8; 1.2.3.4.5.6.7.9</code>".


<!--#include virtual="/Footer" -->
</body>
</html>
