<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01//EN"
"http://www.w3.org/TR/html4/strict.dtd">
<html lang="fr">
<head>
<!--Updated by Herv&#233; Blorec 2017-02-05-->
<title>JMRI Hardware Support - OpenLCB - Naming</title>
<!-- Style -->
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<link rel="stylesheet" type="text/css" href="/css/default.css" media="screen">
<link rel="stylesheet" type="text/css" href="/css/print.css" media="print">
<link rel="icon" href="/images/jmri.ico" type="image/png">
<link rel="home" title="Home" href="/">
<!-- /Style -->
</head>

<body>
<!--#include virtual="/Header" -->
<div id="mBody">
	<!--#include virtual="Sidebar" -->
	<div id="mainContent">

<h1>Documentation Mat&#233;riel: OpenLCB - D&#233;signation </h1>

Cette page explique comment JMRI utilise les Noms Syst&#232;me pour
acc&#233;der aux ressources li&#233;es-OpenLCB.

<h2>Utilisation des Noms JMRI</h2>
JMRI fournit une interface vers le r&#233;seau r&#233;el via des
objets internes tels que les aiguillages, les capteurs, etc qui
sont &#233;troitement associ&#233;s &#224; des dispositifs physiques correspondants.
Cette cartographie se fait via "Noms Syst&#232;mes", qui &#224; la fois
identifient comment acc&#233;der &#224; un p&#233;riph&#233;rique particulier, et
sont la cl&#233; de la recherche jusqu'&#224; l'objet correspondant dans JMRI.


<a name="openlcbevents"></a><h2>&#233;v&#232;nements OpenLCB</h2>

<a href="http://openlcb.org">OpenLCB</a>
communique les &#233;v&#233;nements via des messages avec un format fixe: huit octets de
contenu. Nous convertissons celui-ci en un code de 16 chiffres hexad&#233;cimaux avec un
 caract&#232;re de t&#234;te "x", par exemple "x1234567890ABCDEF".
Nous vous recommandons d'utiliser les majuscules pour les lettres A-F..

Vous pouvez &#233;galement y entrer avec des p&#233;riodes s&#233;parant les octets: "12.34.56.78.90.AB.CD.EF".
Dans ce cas seulement, un z&#233;ro en t&#234;te par octet peut &#234;tre omit lors de la frappe de l'&#233;v&#233;nement;
JMRI va les ins&#233;rer automatiquement dans les noms. Par exemple, "00.01.02.03.04.05.06.07"peut &#234;tre tap&#233; 
comme "0.1.2.3.4.5.6.7"

<h2>Configuration de la M&#233;moire OpenLCB </h2>

DecoderPro acc&#232;de &#224; la m&#233;moire du d&#233;codeur via les "CVs".  Pour cette raison, l'OpenLCB JMRI
fournit une syntaxe de CV qui peut &#234;tre utilis&#233;e pour acc&#233;der &#224; la M&#233;moire de configuration de noeud OpenLCB:
<ul>
	<li>CV12345 - un octet simple &#224; l'adresse 12345 dans l'espace d'adresse de configuration par d&#233;faut
	<li>CV(252)12345 - un octet simple &#224; l'adresse 12345 dans l'espace d'adresse 252 
	<li>CV12345:4 - Quatre octets d&#233;marrant &#224; l'adresse 12345 dans l'espace d'adresse de configuration par d&#233;faut.
	<li>CV(252)12345:4 - Quatre octets d&#233;marrant &#224; l'adresse 12345 dans l'espace d'adresse 252.
</ul>

<p>Retour &#224; la <a href="index.shtml">page principale d'Aide OpenLCB</a></p>
     
<!--#include virtual="/Footer" -->
  </div><!-- closes #mainContent-->
</div> <!-- closes #mBody-->
</body>
</html>
