<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01//EN" "http://www.w3.org/TR/html4/strict.dtd">
<!-- Updated by Herv&#233; BLOREC <bzh56420@yahoo.fr> on 2016-07-05 -->
 <html lang="fr">
<head>
  <meta name="author" content="Bob Jacobsen">
  <meta name="keywords" content="JMRI technical code ">

  <title>JMRI: Structure de l'Application</title>
  <meta name="author" content="Bob Jacobsen">
  <meta name="keywords" content="JMRI technical code">
  <!-- Style -->
  <meta http-equiv="Content-Type" content="text/html; charset=us-ascii">
  <link rel="stylesheet" type="text/css" href="/css/default.css" media="screen">
  <link rel="stylesheet" type="text/css" href="/css/print.css" media="print">
  <link rel="icon" href="/images/jmri.ico" type="image/png">
  <link rel="home" title="Home" href="/">
  <!-- /Style -->
</head>

<body>
<!--#include virtual="/Header" -->
<div id="mBody">
    <!--#include virtual="Sidebar" -->
    <div id="mainContent">
        <!-- Page Body -->

<h1>JMRI: Structure de l'Application</h1>
        Le programme
      PanelPro est juste un exemple, mais il est cens&eacute;
      &ecirc;tre un bon.

      Le programme PanelPro est juste un exemple, mais il est cens&#233; &#234;tre un bon.
      <p>
    La source de la classe principale est actuellement dans apps/PanelPro/PanelPro.java,
    qui d&#233;finit la classe principale apps.PanelPro.PanelPro.
<p>
La d&#233;mo principale cr&#233;e juste la barre de menus, et la remplit avec les menus
et les &#233;l&#233;ments  d&#233;sir&#233;s. Chaque &#233;l&#233;ment a comme une classe objet "Action" qui lui est associ&#233;e qui fera l'
initialisation n&#233;cessaire en cas de besoin.
<p>
Parce que nous nous attendons &#224; avoir des interfaces diff&#233;rentes dans le paquet  <code>jmrix</code> package, les outils JMRI
ne cr&#233;ent pas directement les objets d'interface dont ils ont besoin. Plut&#244;t, ils demandent des exemples
d'interfaces. Pour les interfaces dans le package <code>jmri</code>, qui pourraient &#234;tre mises en &#339;uvre par
beaucoup de types de r&#233;seau diff&#233;rents, <code>jmri.InstanceManager</code> r&#233;pond &#224; ces demandes.

<p>
Plus d'informations sur la fa&#231;on dont les choses (par exemple des objets repr&#233;sentant les
&#233;l&#233;ments sur le r&#233;seau)
sont nomm&#233;s si disponibles sur <a href="Names.shtml">une page s&#233;par&#233;e </a>.

      <p>Parce que nous nous attendons &agrave; avoir des
      interfaces diff&eacute;rentes dans le paquet jmrix, les
      outils JMRI ne cr&eacute;ent pas directement les objets
      d'interface dont ils ont besoin. Plut&ocirc;t, ils demandent
      des exemples d'interfaces. Pour les interfaces dans le
      package jmri, qui pourraient &ecirc;tre mises en &Aring;"uvre
      par beaucoup de types de r&eacute;seau diff&eacute;rents,
      jmri.InstanceManager r&eacute;pond &agrave; ces demandes.</p>

      <p>Plus d'informations sur la fa&ccedil;on dont les choses
      (par exemple des objets repr&eacute;sentant les
      &eacute;l&eacute;ments sur le sch&eacute;ma) sont
      nomm&eacute;s <a href="Names.shtml">sont disponibles sur une
      page s&eacute;par&eacute;e</a> .</p>

      <p>Voir aussi la page sur <a href=
      "IntroStructure.shtml">Structure de la biblioth&egrave;que
      JMRI</a>.</p>

      <!--#include virtual="/Footer" -->
    </div><!-- closes #mainContent-->
  </div><!-- closes #mBody-->
</body>
</html>
