<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01//EN" "http://www.w3.org/TR/html4/strict.dtd">
<!-- Translated by Herv&#233; Blorec 2013/09/04 -->
<html lang="fr">
<head>
    <TITLE>
 	JMRI: Obtenir le Code Ancien
    </TITLE>
    <META content="Bob Jacobsen" name="Author">
    <meta name="keywords" content="JMRI technical code CVS download">

<!-- Style -->
  <META http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
  <link rel="stylesheet" type="text/css" href="/css/default.css" media="screen">
  <link rel="stylesheet" type="text/css" href="/css/print.css" media="print">
  <link rel="icon" href="/images/jmri.ico" type="image/png">
  <link rel="home" title="Home" href="/">
<!-- /Style -->
</head>
<body>
<!--#include virtual="/Header" -->
    <div id="mBody">
<!--#include virtual="Sidebar" -->

	<div id="mainContent">

	    <h1>JMRI: Obtenir le Code Ancien</h1>

<h2>Cette page est conserv&#233;e dans un but historique seulement!</h2>

<p>JMRI a migr&#233; de l'utilisation de CVS pour le contr&#244;le de version et est
pass&#233;s &#224; Subversion. Ce changement a eu lieu en Juillet 2011. Les
version 2.12 (et versions ant&#233;rieures) de JMRI ont &#233;t&#233; faites &#224; partir de CVS, et pour acc&#233;der &#224; ce
code source, vous devez utiliser les instructions d&#233;taill&#233;es ci-dessous.</p>

<p>Pour acc&#233;derFor au code source de la version actuelle de JMRI, Svp voir
<a href="getgitcode.shtml">L'information sur le d&#233;p&#244;t Git</a>.</p>


<h2>D&#233;marrage Rapide</h2>

Vous pouvez t&#233;l&#233;charger les plus r&#233;cents code souce via CVS en utilisant:
<pre style="font-family: monospace;">
cvs -d:pserver:anonymous@jmri.cvs.sourceforge.net:/cvsroot/jmri login
cvs -d:pserver:anonymous@jmri.cvs.sourceforge.net:/cvsroot/jmri co all 
</pre>
(Si un mode de passe est demand&#233;, tapez juste sur retour)


<h2>D&#233;tails</h2>
Notre code source est distribu&#233; en utilisant CVS. 
(Nous gardons aussi le 
<A href="WebSite.shtml">site web</a>
dans CVS, si vous pr&#233;f&#233;rez travailler avec lui directement.)
Si vous voulez travailler avec le code, quelques minutes pass&#233;es &#224; installer CVS valent bien la peine. Nous sommes d&#233;sol&#233;s, mais nous ne pouvons pas accepter d'autres m&#233;thodes (envoi de fichiers.zip, etc), il y a trop de source d'erreurs.

<P>
Beaucoup d'ordinateur sont fournis avec CVS install&#233;, y compris Linux ety Mac OS X.
Si vous utilisez Windows, vous aurez besoin d'insdaller un programme "client CVS tel que
<A HREF="http://sourceforge.net/project/showfiles.php?group_id=10072&release_id=24467">WinCVS</a>.
Une version r&#233;cente peut&#234;tre t&#233;l&#233;charger depuis: 
<a href="http://prdownloads.sourceforge.net/cvsgui/WinCvs120.zip">http://prdownloads.sourceforge.net/cvsgui/WinCvs120.zip</a>.

<P>
Pour obtenir une copie de la source pour votre propre usage, vous pouvez utiliser "anonymous checkout".
Pour une ligne de commande client cvs, cr&#233;er un nouveau r&#233;pertoire pour le projet,
allez dans ce repertoire, et dites &#224; CVS que vous existez avec
<PRE>
cvs -d:pserver:anonymous@jmri.cvs.sourceforge.net:/cvsroot/jmri login
</PRE>
Cette ligne de "login"n'est n&#233;cessaire qu'une seule fois; apr&#232;s quoi elle est m&#233;moris&#233;e dans votre ordinateur. On peut vous demander un mot de passe. Si c'est le cas, tapez juste sur Retour, comme le mot de passe vide sera accepter.
Vous pouvez obtenir une copie du code avec
<PRE>
cvs -d:pserver:anonymous@jmri.cvs.sourceforge.net:/cvsroot/jmri co all
</PRE>
<P>
Si vous utilisez un client bas&#233;-GUI  comme WinCVS, d&#233;roulez le menu "admin"
 et s&#233;lectionnez "ligne de commande" pour obtenir un lieu o&#249; taper ces commandes.
Sur d'autres ordinateurs, vous pouvez taper directement sur la ligne de commande.
<p>
Si vous avez une copie exixtant du code et que vous vouliez le mettre &#224; jouravec le contenu le plus r&#233;cent de CVS, le seconde commande est:
<PRE>
cvs -d:pserver:anonymous@jmri.cvs.sourceforge.net:/cvsroot/jmri -q update -dA
</PRE>

<P>
Voir aussi la
<A HREF="CVSFAQ.shtml">page FAQ CVS</a>.
<P>
une fois la v&#233;rification termin&#233;e, vous trouverez le r&#233;pertoires appel&#233;s
"xml", "resources", "jython", "help", "lib", "java" et autres.
Changez pour le r&#233;pertoire "java". l&#224;, vous trouverez un r&#233;pertoire "src"
qui contient le code source pour JMRI lui-m&#234;me, et un r&#233;pertoire "tests" 
qui contient diverses routines de test.
<P>
Vous pouvez consulter le code avec votre &#233;diteur de texte favori. Pour compiler et
ex&#233;cuter, vous avez besoin d'un des outils de compilation d&#233;crits sur la barre &#224; 
gauche.
<P>
Une fois que vous aurez travaillez avec le code, vous aurez probablement cr&#233;er quelques am&#233;liorations et
vous souhaitez contribuer en retour au projet. C'est l&#224; que CVS a un &#233;norme
avantages, avec les autorisations et les commandes appropri&#233;es, vous pouvez fusionner vos
modifications dans la source commune automagiquement. Contactez-nous si vous &#234;tes pr&#234;t &#224;
faire ou voir les infos de <A HREF="index.shtml#contributing"> sur la contribution </a>.

<h2>F&#233;n&#234;tres D&#233;tails</h2>

<p>
Obtenir et mette &#224; jour le code avec tortoisecvs
</p>
<p>
Pour obtenir une v&#233;rification initiale de CVS pour votre propre usage apr&#232;s l'installation
http://www.tortoisecvs.org/. Cr&#233;ez un nouveau r&#233;pertoire pour le projet, par
la cr&#233;ation d'un dossier nomm&#233; "JMRISourceCode". Clic droit (Ctrl + clic) sur
ce dossier et s&#233;lectionnez CVS CVS Checkout ".
Dans le volet qui s'ouvre pour le CVSROOT entrer &lt;:pserver:jmri.cvs.sourceforge.net:/cvsroot/jmri&gt;
Pour le serveur, entrez &lt;jmri.cvs.sourceforge.net&gt;.
En bas &#224; droite de l'&#233;cran est une "Fetch List" Cliquez dessus et une liste s'affiche, cliquez sur le "all".
Cliquez ensuite sur le bouton OK en bas de la fen&#234;tre.
Une nouvelle fen&#234;tre s'ouvre et les fichiers seront t&#233;l&#233;charg&#233;s sur le bas de ce volet il y a une case &#224;  appel&#233;e "Close on Completion", cochez la.
Quand il se ferme, le dossier que vous avez cr&#233;er aura des dossiers qui ont tous les &#233;l&#233;ments JMRI.
</p>
<p>
Une fois que vous avez effectu&#233; la v&#233;rification initiale de CVS dans le dossier, les
mettre &#224; jour les s&#233;lectionnera tous, puis faites un Clic-Droit et
s&#233;lectionner "CVS Update". Vous pouvez aussi mettre &#224; jour un seul dossier en le s&#233;lectionnant.
</p>

<!--#include virtual="/Footer" -->

	  </div><!-- closes #mainContent-->
	</div> <!-- closes #mBody-->
</body>
</html>

