<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01//EN"
"http://www.w3.org/TR/html4/strict.dtd">
<!-- Translated by Herv&#233; Blorec 2013/09/04 -->

<html lang="fr">
<head>
  <meta name="generator" content=
  "HTML Tidy for Mac OS X (vers 31 October 2006 - Apple Inc. build 15.17), see www.w3.org">

  <title>JMRI: Obtenir le Code Ancien</title>
  <meta name="author" content="Bob Jacobsen">
  <meta name="keywords" content="JMRI technical code CVS download">
  <!-- Style -->
  <meta http-equiv="Content-Type" content=
  "text/html; charset=us-ascii">
  <link rel="stylesheet" type="text/css" href="/css/default.css" media="screen">
  <link rel="stylesheet" type="text/css" href="/css/print.css" media="print">
  <link rel="icon" href="/images/jmri.ico" type="image/png">
  <link rel="home" title="Home" href="/">
    <!-- /Style -->
</head>

<body>
<!--#include virtual="/Header" -->
<div id="mBody">
    <!--#include virtual="Sidebar" -->
    <div id="mainContent">
        <!-- Page Body -->

<h1>JMRI: Obtenir le Code Ancien</h1>

      <h2>Cette page est conserv&eacute;e dans un but historique
      seulement!</h2>

      <p>JMRI a migr&eacute; de l'utilisation de CVS pour le
      contr&ocirc;le de version et est pass&eacute;s &agrave;
      Subversion. Ce changement a eu lieu en Juillet 2011. Les
      version 2.12 (et versions ant&eacute;rieures) de JMRI ont
      &eacute;t&eacute; faites &agrave; partir de CVS, et pour
      acc&eacute;der &agrave; ce code source, vous devez utiliser
      les instructions d&eacute;taill&eacute;es ci-dessous.</p>

      <p>Pour acc&eacute;derFor au code source de la version
      actuelle de JMRI, Svp voir <a href=
      "getgitcode.shtml">L'information sur le d&eacute;p&ocirc;t
      Git</a>.</p>

      <h2>D&eacute;marrage Rapide</h2>Vous pouvez
      t&eacute;l&eacute;charger les plus r&eacute;cents code souce
      via CVS en utilisant:
      <pre style="font-family: monospace;">
cvs -d:pserver:anonymous@jmri.cvs.sourceforge.net:/cvsroot/jmri login
cvs -d:pserver:anonymous@jmri.cvs.sourceforge.net:/cvsroot/jmri co all 
</pre>(Si un mode de passe est demand&eacute;, tapez juste sur
retour)

      <h2>D&eacute;tails</h2>Notre code source est distribu&eacute;
      en utilisant CVS. (Nous gardons aussi le <a href=
      "WebSite.shtml">site web</a> dans CVS, si vous
      pr&eacute;f&eacute;rez travailler avec lui directement.) Si
      vous voulez travailler avec le code, quelques minutes
      pass&eacute;es &agrave; installer CVS valent bien la peine.
      Nous sommes d&eacute;sol&eacute;s, mais nous ne pouvons pas
      accepter d'autres m&eacute;thodes (envoi de fichiers.zip,
      etc), il y a trop de source d'erreurs.

      <p>Beaucoup d'ordinateur sont fournis avec CVS
      install&eacute;, y compris Linux ety Mac OS X. Si vous
      utilisez Windows, vous aurez besoin d'insdaller un programme
      "client CVS tel que <a href=
      "http://sourceforge.net/project/showfiles.php?group_id=10072&amp;release_id=24467">
      WinCVS</a>. Une version r&eacute;cente peut&ecirc;tre
      t&eacute;l&eacute;charger depuis: <a href=
      "http://prdownloads.sourceforge.net/cvsgui/WinCvs120.zip">http://prdownloads.sourceforge.net/cvsgui/WinCvs120.zip</a>.</p>

      <p>Pour obtenir une copie de la source pour votre propre
      usage, vous pouvez utiliser "anonymous checkout". Pour une
      ligne de commande client cvs, cr&eacute;er un nouveau
      r&eacute;pertoire pour le projet, allez dans ce repertoire,
      et dites &agrave; CVS que vous existez avec</p>
      <pre>
cvs -d:pserver:anonymous@jmri.cvs.sourceforge.net:/cvsroot/jmri login
</pre>Cette ligne de "login"n'est n&eacute;cessaire qu'une seule
fois; apr&egrave;s quoi elle est m&eacute;moris&eacute;e dans votre
ordinateur. On peut vous demander un mot de passe. Si c'est le cas,
tapez juste sur Retour, comme le mot de passe vide sera accepter.
Vous pouvez obtenir une copie du code avec
      <pre>
cvs -d:pserver:anonymous@jmri.cvs.sourceforge.net:/cvsroot/jmri co all
</pre>

      <p>Si vous utilisez un client bas&eacute;-GUI comme WinCVS,
      d&eacute;roulez le menu "admin" et s&eacute;lectionnez "ligne
      de commande" pour obtenir un lieu o&ugrave; taper ces
      commandes. Sur d'autres ordinateurs, vous pouvez taper
      directement sur la ligne de commande.</p>

      <p>Si vous avez une copie exixtant du code et que vous
      vouliez le mettre &agrave; jouravec le contenu le plus
      r&eacute;cent de CVS, le seconde commande est:</p>
      <pre>
cvs -d:pserver:anonymous@jmri.cvs.sourceforge.net:/cvsroot/jmri -q update -dA
</pre>

      <p>Voir aussi la <a href="CVSFAQ.shtml">page FAQ CVS</a>.</p>

      <p>une fois la v&eacute;rification termin&eacute;e, vous
      trouverez le r&eacute;pertoires appel&eacute;s "xml",
      "resources", "jython", "help", "lib", "java" et autres.
      Changez pour le r&eacute;pertoire "java". l&agrave;, vous
      trouverez un r&eacute;pertoire "src" qui contient le code
      source pour JMRI lui-m&ecirc;me, et un r&eacute;pertoire
      "tests" qui contient diverses routines de test.</p>

      <p>Vous pouvez consulter le code avec votre &eacute;diteur de
      texte favori. Pour compiler et ex&eacute;cuter, vous avez
      besoin d'un des outils de compilation d&eacute;crits sur la
      barre &agrave; gauche.</p>

      <p>Une fois que vous aurez travaillez avec le code, vous
      aurez probablement cr&eacute;er quelques am&eacute;liorations
      et vous souhaitez contribuer en retour au projet. C'est
      l&agrave; que CVS a un &eacute;norme avantages, avec les
      autorisations et les commandes appropri&eacute;es, vous
      pouvez fusionner vos modifications dans la source commune
      automagiquement. Contactez-nous si vous &ecirc;tes pr&ecirc;t
      &agrave; faire ou voir les infos de <a href=
      "index.shtml#contributing">sur la contribution</a> .</p>

      <h2>F&eacute;n&ecirc;tres D&eacute;tails</h2>

      <p>Obtenir et mette &agrave; jour le code avec
      tortoisecvs</p>

      <p>Pour obtenir une v&eacute;rification initiale de CVS pour
      votre propre usage apr&egrave;s l'installation
      http://www.tortoisecvs.org/. Cr&eacute;ez un nouveau
      r&eacute;pertoire pour le projet, par la cr&eacute;ation d'un
      dossier nomm&eacute; "JMRISourceCode". Clic droit (Ctrl +
      clic) sur ce dossier et s&eacute;lectionnez CVS CVS Checkout
      ". Dans le volet qui s'ouvre pour le CVSROOT entrer
      &lt;:pserver:jmri.cvs.sourceforge.net:/cvsroot/jmri&gt; Pour
      le serveur, entrez &lt;jmri.cvs.sourceforge.net&gt;. En bas
      &agrave; droite de l'&eacute;cran est une "Fetch List"
      Cliquez dessus et une liste s'affiche, cliquez sur le "all".
      Cliquez ensuite sur le bouton OK en bas de la fen&ecirc;tre.
      Une nouvelle fen&ecirc;tre s'ouvre et les fichiers seront
      t&eacute;l&eacute;charg&eacute;s sur le bas de ce volet il y
      a une case &agrave; appel&eacute;e "Close on Completion",
      cochez la. Quand il se ferme, le dossier que vous avez
      cr&eacute;er aura des dossiers qui ont tous les
      &eacute;l&eacute;ments JMRI.</p>

      <p>Une fois que vous avez effectu&eacute; la
      v&eacute;rification initiale de CVS dans le dossier, les
      mettre &agrave; jour les s&eacute;lectionnera tous, puis
      faites un Clic-Droit et s&eacute;lectionner "CVS Update".
      Vous pouvez aussi mettre &agrave; jour un seul dossier en le
      s&eacute;lectionnant.</p><!--#include virtual="/Footer" -->
    </div><!-- closes #mainContent-->
  </div><!-- closes #mBody-->
</body>
</html>
