<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01//EN" "http://www.w3.org/TR/html4/strict.dtd">
<html lang="fr">
<head>
<!-- Copyright Bob Jacobsen 2008 -->

<!-- Translated by Blorec Herv&eacute; le 2011-07-06-->
<title>JMRI: System Properties</title>

<!-- Style -->
<LINK REL="stylesheet" TYPE="text/css" HREF="/css/default.css"
	MEDIA="screen">
<LINK REL="stylesheet" TYPE="text/css" HREF="/css/print.css"
	MEDIA="print">
<LINK REL="icon" HREF="/images/jmri.ico" TYPE="image/png">
<LINK REL="home" TITLE="Home" HREF="/">
<!-- /Style -->
</HEAD>

<BODY>
<!--#include virtual="/Header" -->
  <div class="nomenu" id="mBody">
    <div id="mainContent">

<h2> JMRI: Propri&eacute;t&eacute;s du Syst&egrave;me</h2>

Cette page liste les propri&eacute;t&eacute;s du syst&egrave;me que JMRI utilise.

<h3>Propri&eacute;t&eacute;s Syst&egrave;me d'Exploitation</h3>
<dl>

<dt>
os.name
<dd>
La plupart de JMRI est ind&eacute;pendant du syst&egrave;me, mais dans quelques
d'endroits nous fournissons le code sp&eacute;cifique au syst&egrave;me pour personnaliser l'exp&eacute;rience de l'utilisateur.
C'est la propri&eacute;t&eacute; que nous utilisons pour dire quel type de syst&egrave;me d 'exploitation
est en cours d'utilisation.
<p>
Par exemple, on localise le<a href="../../apps/DecoderPro/Files.shtml#location"> r&eacute;pertoire pr&eacute;f&eacute;rences </a>
 par d&eacute;faut dans des lieux diff&eacute;rents selon le type de syst&egrave;me.

<dt>
user.dir
<dd>
Java d&eacute;finit celui-ci pour &ecirc;tre le r&eacute;pertoire dans lequel JMRI est ex&eacute;cut&eacute;.
JMRI l'utilise pour trouver bon nombre de ses dossiers; cette propri&eacute;t&eacute; ne devrait pas
&ecirc;tre chang&eacute; par l'utilisateur!

<dt>
user.home
<dd>
Java d&eacute;finit celui-ci comme le r&eacute;pertoire "home" de l'utilisateur actuel.
JMRI l'utilise, sur certains syst&egrave;mes, pour localiser les
emplacements par d&eacute;faut pour le r&eacute;pertoire des pr&eacute;f&eacute;rences.

<dt>
gnu.io.rxtx.SerialPorts
<dd>
La biblioth&egrave;que RXTX communications utilise cette option pour sp&eacute;cifier les
ports suppl&eacute;mentaires &aacute; utiliser. Si vous avez par exemple un adaptateur USB vers un adaptateur s&eacute;rie
 qui ne s'affiche pas dans les bo&icirc;tes du s&eacute;lecteur de pr&eacute;f&eacute;rences,
attribuer son nom &aacute; cette propri&eacute;t&eacute;.
<p>
-Dgnu.io.rxtx.SerialPorts=/dev/ttyUSB0
<p>
Les scripts de d&eacute;marrage Linux le fera si vous avez d&eacute;fini la variable d'environnement JMRI_SERIAL_PORT.

</dl>

<h3>JMRI propri&eacute;t&eacute;s</h3>
<dl>

<dt>
jmri.prefsdir
<dd>
En d&eacute;finissant cette propri&eacute;t&eacute;, vous pouvez d&eacute;finir explicitement o&ugrave; JMRI doit
chercher le r&eacute;pertoire de pr&eacute;f&eacute;rence.

<dt>
jmri.inset.height
<dd>
Si elle est d&eacute;finie, fournit une valeur minimum d'encart pour la hauteur de la fen&egrave;tres JMRI.
L'encart est l'espace allou&eacute; pour les d&eacute;corations en haut et en bas de l'&eacute;cran.
Mettez lui un nombre entier positif N pour s'assurer que les fen&egrave;tres JMRI
seront ouvertes avec N pixels disponibles en haut et/ou en bas.
<p>
-Djmri.inset.height=45

<dt>
jmri.inset.width
<dd>
Si elle est d&eacute;finie, fournit une valeur minimum d'encart la largeur de fen&egrave;tres JMRI.
L'encart est l'espace allou&eacute; pour les d&eacute;corations sur les c&ocirc;t&eacute;s de l'&eacute;cran.
Mettez lui un nombre entier positif N pour s'assurer que les fen&egrave;tres JMRI
seront ouvertes avec N pixels disponibles sur les c&ocirc;t&eacute;s
</dl>
    
<!--#include virtual="/Footer" -->
</body>
</html>
