<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01//EN" "http://www.w3.org/TR/html4/strict.dtd">
<!-- Translated by Herv&#232; Blorec 2016-08-1 -->
<html lang="fr">
<head>
  <meta name="generator" content=
  "HTML Tidy for Mac OS X (vers 31 October 2006 - Apple Inc. build 15.17), see www.w3.org">

  <title>SVN Subversion</title>
  <meta name="author" content="Bob Jacobsen">
  <meta name="keywords" content="JMRI technical code SVN Subversion FAQ">
  <meta http-equiv="Content-Type" content="text/html; charset=us-ascii">
  <link rel="stylesheet" type="text/css" href="/css/default.css" media="screen">
  <link rel="stylesheet" type="text/css" href="/css/print.css" media="print">
  <link rel="icon" href="/images/jmri.ico" type="image/png">
  <link rel="home" title="Home" href="/">
</head>

<body>
<!--#include virtual="/Header" -->
<div id="mBody">
    <!--#include virtual="Sidebar" -->
    <div id="mainContent">
        <!-- Page Body -->

<h1>JMRI: FAQ Subversion</h1>

  <p>Il s'agit d'une liste de questions fr&#232;quemment pos&#232;es sur Subversion,
particuli&#232;rement en ce qui concerne la fa&#231;on dont nous l'utilisons avec JMRI.</p>

  <p>Voir aussi  <a href="index.shtml">l'index Technique</a>
pour plus d'information sur la maintenance du code JMRI.

<h3>Propri&#233;t&#233;s SVN</h3> <i>(Cette propri&#233;t&#233; n'est plus d'actualit&#233; avec GitHub, il n'y a plus de gestion de version)</i>

En g&#233;n&#233;ral, nous gardons tout dans le contr&#244;le de r&#233;vision SVN, donc il n'y a en pas 
besoin pour les diff&#233;rentes lignes de propri&#233;t&#233;s que nous avons utilis&#233; pour en avoir besoin dans CVS. Elles 
ressemblent &#224;:
<code>
# La ligne suivante est maintenue par CVS, SVP ne rien changer.
# $Revision$
</code>

<p>
Mais il y a certain fichier, comme decoder XML, fichier properties, etc,
que les utilisateurs sont susceptibles de modifier et soumettre de nouveau pour l'inclusion. C'est 
tr&#232;s utile si nous pouvons identifier le contenu sp&#233;cifique qui d&#233;marre avec 
<p>
Toutefois, pourles fichiers html, XML, python et properties, nous faisons:

<code>
svn propset svn:keywords "Date Revision Version Id Author" {}
</code>

De cette fa&#231;on, SVN remplira ces balises si/quand elles sont pr&#233;sentes et le fichier est modifi&#233;

      <p>Il s'agit d'une liste de questions fr&eacute;quemment
      pos&eacute;es sur Subversion, particuli&egrave;rement en ce
      qui concerne la fa&ccedil;on dont nous l'utilisons avec
      JMRI.</p>

      <p>Voir aussi <a href="index.shtml">l'index Technique</a>
      pour plus d'information sur la maintenance du code JMRI.</p>

      <p>Il n'y a pas de questions fr&eacute;quemment pos&eacute;es
      pour l'instant.</p>

    <!--#include virtual="/Footer" -->
    </div><!-- closes #mainContent-->
  </div><!-- closes #mBody-->
</body>
</html>
