<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01//EN" "http://www.w3.org/TR/html4/strict.dtd">
<!-- Updated by Blorec Herv&#233; 2016-08-09-->
<html lang="fr">
<head>
  <meta name="generator" content=
  "HTML Tidy for Mac OS X (vers 31 October 2006 - Apple Inc. build 15.17), see www.w3.org">

  <title>JMRI: Web Site</title>
  <meta name="author" content="Bob Jacobsen">
  <meta name="keywords" content="JMRI technical code web site">
  <!-- Style -->
  <meta http-equiv="Content-Type" content=
  "text/html; charset=us-ascii">
  <link rel="stylesheet" type="text/css" href="/css/default.css" media="screen">
  <link rel="stylesheet" type="text/css" href="/css/print.css" media="print">
  <link rel="icon" href="/images/jmri.ico" type="image/png">
  <link rel="home" title="Home" href="/">
<!-- /Style -->
</head>

<body>
<!--#include virtual="/Header" -->
<div id="mBody">
    <!--#include virtual="Sidebar" -->
    <div id="mainContent">
        <!-- Page Body -->

<h1>JMRI: Site Web</h1>

Cette page pr&#233;sente les aspects techniques du site web JMRI.
<p>
Si vous voulez juste savoir comment faire un petit changement dans le site Web ou
la page d'aide, s'il vous pla&#238;t voir la page s&#233;par&#233;e
<a  href="webupdate/UpdatingDocs.shtml"> des instructions</a>.

 <h2>Structure de l'Information</h2>

Nous distinguons trois types d'informations sur le site Web principal:
<ol>
    <li> Les informations pour l'usager qui sont utileS au moment de l'ex&#233;cution.
    Celles-ci sont rendues disponibles &#224; la fois via notre <a href="Help.shtml"> JavaHelp</a>,
    et aussi directement en pla&#231;ant les fichiers sur le Web.</li>
    <li> Les  Informations pour l'usager qui sont soit inutiles au moment de l'ex&#233;cution, tels que les
    instructions pour l'installation du logiciel, ou sont trop grandes pour l'inclusion
    dans les version, par exemple, tutoriels vid&#233;o.</li>
    <li> Les informations de r&#233;f&#233;rences &#224; partir de versions, telles que les d&#233;finitions d&#233;codeur, des copies de scripts,
    JavaDocs, etc</li>
</ol>

<p>Nous fournissons ces informations  s&#233;par&#233;ment:</p>
<ol>
    <li>L'information d'ex&#233;cution pour l'utilisateur- est disponible en pla&#231;ant le syst&#232;me d'aide
    sur le site web.</li>
    <li> Les informations d'autres utilisateurs sont stock&#233;es dans notre
    <a href="https://github.com/JMRI/website"><tt>JMRI/website</tt> r&#233;pertoire GitHub</a>
    plac&#233; directement sur le site web</li>
    <li>Les informations de r&#233;f&#233;rence sont mises sur le site web &#224; partir de leurs propres emplacements de r&#233;pertoire,
    ou cr&#233;&#233;es par des scripts Ant automatis&#233;s lors de la construction de la version.</li>
</ol>

<h2> Technologie</h2>
<p>La mise en page se fait en utilisant CSS, initialement cr&#233;&#233; par John Plocher.
Toutes les pages doivent r&#233;f&#233;rencer les fichiers CSS pour l'&#233;cran et l'impression
du r&#233;pertoire "/css" . Cela signifie &#233;galement que vous devez quitter le formatage
des feuilles de style, et de minimiser le formatage explicite
que vous faites directement dans HTML.</p>

<p>
Parce que nous utilisons nos pages Web dans JavaHelp, il y a des restrictions
sur l'utilisation des &#233;tiquettes. Voir nos
<a href="Help.shtml"> pages web JavaHelp</a> pour plus de d&#233;tails.
<p>
Nous utilisons

<a href="http://httpd.apache.org/docs/1.3/howto/ssi.html"> le server-Side inclut</a>
pour fournir une information coh&#233;rente pour les en-t&#234;tes, les encadr&#233;s et les pieds de page.
Cela nous permet de partager le contenu HTML
entre le web et le syst&#232;me JavaHelp
utilis&#233; par le programme lui-m&#234;me. Chaque page ne contiendra que le contenu,
 en plus elle comprendra les fichiers nomm&#233;s "Header", "Sidebar" et "footer"
qui contiennent les informations de navigation.
Finalement, toutes mais quelques pages qui ont l'extension
".shtml". (Les autres pages index.html gardent ce nom
afin que les gens qui demandent juste une URL r&#233;pertoire soient servi avec quelque chose d'utile)</p>

<p><a name="redirect" id="redirect"></a>
Nous utilisons les fichiers .htaccess pour faire des redirections lorsqu'une page Web est supprim&#233;e. &#199;a
permet que les signets plus &#226;g&#233;s continuent &#224; travailler.
Le fichier
<a href="https://github.com/JMRI/website/tree/master/hardware/.htaccess">hardware/.htaccess</a> fournit un exemple.
Pour plus d'information sur la syntaxe, voir la
<a href="https://httpd.apache.org/docs/current/mod/mod_rewrite.html#rewriterule">documentation Apache mod_rewrite </a>.

<h2>Organisation des R&#233;pertoires</h2>

<p>Le site web contient plusieurs zones s&#233;par&#233;es:</p>
<ul>
    <li>Jython,ressources, xml, web - ils sont prit directement &#224; partir des r&#233;pertoires
     du m&#234;me nom dans le r&#233;pertoire
    <a href="https://github.com/JMRI/website"><tt>JMRI/JMRI</tt></a>
     Ils ne sont que rarement mentionn&#233;s directement.</li>
    <li>help - aussi utilis&#233; pour le syst&#232;me JavaHelp, ce qui a la structure interne
     d&#233;crite ci-dessous et sur notre
    page
    <a href="Help.shtml"> JavaHelp</a>.</li>
</ul>
<p>D'autres groupe sont depuis le r&#233;pertoire
<a href="https://github.com/JMRI/website"><tt>JMRI/website</tt></a>,
et sont v&#233;rifi&#233;s
&#224; la racine du serveur web. </p>
<ul>
    <li>Notes de Version - Des informations sp&#233;cifiques sur chaque test et lib&#233;ration de version</li>
    <li>installer - Renseignements sur la fa&#231;on d'installer le logiciel JMRI sur diff&#233;rents types d'ordinateurs</li>
    <li>Communaut&#233; - Tutoriels, pages web, et autres communaut&#233;s qui ont fourni des informations</li>
    <li>images - (Les images utilis&#233;es par les pages web)</li>
    <li>contact -</li>
</ul>
<p>Finalement, une partie du site est g&#233;n&#233;r&#233; &#224; partir de la source JMRI elle-m&#234;me, plut&#244;t que d'&#234;tre contenue 
dans la source. Le <a href="http://jmri.org/JavaDoc/doc">JavaDoc</a> est une telle section, avec une partie de 
l'information <a href="http://jmri.org/xml/XSLT">human-readable </a> au sujet des d&#233;codeurs d&#233;finis.

<h2>Mise &#224; Jour du site jmri.org</h2>

<p>La plupart des contenus du site web est mis &#224; jour toutes les heures &#224; partir d'un travail en cours sur l'une des 
compilation du projet sur les serveurs Jenkins. Les r&#233;pertoires list&#233;s ci-dessus constituent la majeure partie du site,
et ce contenu est mis &#224; jour depuis le r&#233;pertoire JMRI sans aucun travail suppl&#233;mentaire.</p>
<ul>
    <li><a href="http://builds.jmri.org/jenkins/job/Web%20Site/job/Website%20from%20JMRI%20GitHub%20JMRI%20repository/">Contenu statique depuis le r&#233;pertoire JMRI/JMRI, ex:e.g. help, xml, etc dans les distributions JMRI</a></li>
    <li><a href="http://builds.jmri.org/jenkins/job/Web%20Site/job/Website%20from%20JMRI%20GitHub%20website%20repository/">Contenu statique depuis le r&#233;pertoire JMRI/website, ex:. information website-only</a></li>
<li><a href="http://builds.jmri.org/jenkins/job/Web%20Site/job/Website%20from%20JMRI%20GitHub%20website-legal%20repository/">Contenu statique depuis le r&#233;pertoire JMRI/website-legal , ex: contenu autour de l'affaire juridique JMRI-Katzer</a></li>
</ul>

<p>La r&#233;g&#233;n&#233;ration de la JavaDoc et le contenu XML implique 
beaucoup plus de travail qu'une simple mise &#224; jour d'un r&#233;pertoire, et ainsi celleci ne se fait qu'une fois par jour, selon les besoins,
par la t&#226;che 
<a href="http://jmri.tagadab.com/jenkins/job/WebSite/job/generate-website/">G&#233;n&#233;rer site Web</a>
sur la
<a href="http://jmri.tagadab.com/jenkins/">production serveur Jenkins</a>.</p>

<a name="local" id="local"></a><h2>Local Web Site: Mac OS X</h2>

<p> Si vous souhaitez h&#233;berger une copie du site Web JMRI sur votre machine
Mac OS X locale, suivez ces instructions pour d'abord configurer 
le serveur Apache pour faire les inclusions cot&#233; serveur, et ensuite faire 
une copie des fichiers du site web disponibles sur le serveur. </p>

<p> Un processus similaire peut fonctionner pour les syst&#232;mes Linux (ou m&#234;me Windows)
avec Apache install&#233;.</p>

<ol>
<li> Pour vous assurer que votre serveur local a les options activ&#233;es, modifiez le fichier de configuration du serveur Web Apache.
<ul>
    <li>Sur Mac OS X 10.4 (Tiger), c'est le fichier /etc/httpd/httpd.conf</li>
    <li> Sur Mac OS X 10.5 (Leopard) et, plus tard, c'est le fichier/etc/apache2/httpd.conf
</ul>
Une fois que vous avez trouv&#233; le fichier, ouvrez-le avec votre &#233;diteur favori
(Vous devez vous authentifier avec le mot de passe administrateur pour
modifier ce fichier).
    <ul>
	<li>
     Pour activer les inclusions cot&#233; serveur, trouver la section qui
     ressemble &#224; ce qui suit
<PRE>
# Cela peut &#234;tre aussi "None", "All", ou n'importe quelle combinaison de "index",
# "Includes", "FollowSymLinks", "ExecCGI", ou "MultiViews".
#
# Notez que "MultiViews" devant &#234;tre nomm&#233; *explicitement* --- "Options All"
# Ne vous le donne pas.
#
     Options Index FollowSymLinks MultiViews
</pre>Ajouter le mot "Includes" &agrave; la derni&egrave;re ligne
de sorte qu'elle ressemble &agrave;:
              <pre>
     Options Includes Indexes FollowSymLinks MultiViews
</PRE>

     <li> Maintenant, configurez le serveur pour g&#233;rer les fichiers avec l'extension ".shtml"
   . Trouvez la section qui ressemble (le premier commentaire
     peut &#234;tre diff&#233;rent):
<PRE>
	 #	
     # Pour utiliser les fichiers HTML analys&#233;s par le serveur
     #
     # AddType text/html.shtml
     # AddHandler server-parsed.shtml
</pre>et non commenter les deux derni&egrave;res lignes de sorte
qu'elle ressemble &agrave;
              <pre>
     #
     # Pour utiliser les fichiers HTML analys&eacute;s par le serveur
     #
     AddType text/html.shtml
     AddHandler server-parsed.shtml
</PRE>

	Ensuite, trouver la r&#233;f&#233;rence au include_module et assurez-vous qu'il est charg&#233; par une ligne comme:
<PRE>
LoadModule inclut le_module libexec/apache2/mod_include.so
</PRE>
    Par d&#233;faut, c'est comment&#233; avec un caract&#232;re # leader.</li>

	<li>Finalement, configurez le serveur pour permettre aux <a href="#redirect">fichiers .htaccess de fournir les  redirections</a>.
		Nous utilisons ceci pour permettre aux gens qui ont de vieux URLs dans leurs signets d'atteindre les bonnes pages actuelles.
		<p>
		Trouvez une section qui ressemble &#224;:
<PRE>
DocumentRoot "/Library/WebServer/Documents"
&lt;Directory "/Library/WebServer/Documents"&gt;
</PRE>
		Il y a une section en retrait directement au-dessous. Trouvez la partie qui ressemble &#224;:
<PRE>  
	#
    # AllowOverride controle quelles directives doivent &#234;tre plac&#233;es dans les fichiers .htaccess.
    # Ce peut &#234;tre"All", "None", ou n'importer quelle combinaison de mot-cl&#233;s:
    #   AllowOverride FileInfo AuthConfig Limit
    #
    AllowOverride None
</PRE>
		Changez la derni&#232;re ligne pour permettre les changements ( c'est ce que fait un fichier .htaccess )
<PRE>
    AllowOverride All
</PRE>
		Puis trouvez la r&#233;f&#233;rence au rewrite_module et assurez-vous qu'il est charg&#233; par une ligne comme:
<PRE>
LoadModule rewrite_module libexec/apache2/mod_rewrite.so
</PRE>
		Par d&#233;faut, c'est comment&#233; avec un caract&#232;re # leader.
<p>
		Nous voulons aussi le PHP actif, de telle sorte que les indices pour les pages de ressources travailleront.
		Trouver la ligne de suivi et assurez-vous qu'il est pas comment&#233;e:
<PRE>
LoadModule php5_module libexec/apache2/libphp5.so
</PRE>
    </li>
    </ul>
</li>

<li>Installez les fichiers JMRI qui doivent &#234;tre servis
	<ul>
	<li><a name="link" id="link"></a>V&#233;rifiez &#224; la fois les r&#233;pertoires
		JMRI/JMRI et JMRI/website quelque part dans votre ordinateur. C'est OK que ceux-ci 
		soient en dehors l'arborescence des r&#233;pertoires du serveur Web.
	<li> Changer pour le r&#233;pertoire serveur web
<PRE>
cd /Library/WebServer/Documents
</PRE>	
	<li>R&#233;glez les liens symboliques pour apporter le contenu depuis les r&#233;pertoires
<PRE>
~me/git/website/setSymLinks.sh  ~me/git/JMRI ~me/git/website
</PRE>
o&#249; "~me/git/website" est le chemin pour le r&#233;pertoire que vous venez v&#233;rifi&#233;, 
et  "~me/git/JMRI" est le chemin pour le r&#233;pertoire JMRI/website. setSymLinks.sh met en place
les liens symboliques qui permettent &#224; votre serveur web de voir le haut du site Web JMRI comme si les fichiers
&#233;taient directement pr&#233;sents.
</ul>
<li>Red&#233;marrez votre ordinateur pour r&#233;initialiser le serveur web.
<li>Testez le en essayant d'afficher l'URL
<a href="http://localhost/">http://localhost/index.shtml</a>,
    Qui devrait vous donner une page JMRI de haut niveau.</li>
</ol>

<a name="catalog" id="catalog"></a><h3>Installation d'un catalogue local XML</h3>

Beaucoup de fichiers JMRI XML contiennent XIncludes qui r&#233;f&#233;rence 
d'autres fichiers XML avec des URLs comme "http://jmri.org/xml/schema/types/turnouts-2-9-6.xsd".
Quand un programme JMRI rencontre ceux-ci, il les convertit automatiquement en 
fichier de r&#233;f&#233;rence locale. D'autre outils comme NetBeans ou xmllint, ne savent pas le faire.
<p>
L'installation d'un catalogue local XML, et ensuite dir &#224; vos outils pour l'utiliser, peut r&#233;soudre ce probl&#232;me.
<ul>
	<li>
	Si vous n'ex&#233;cutez pas un serveur web local, vous pouvez fournir une solution limit&#233; en 
	copiant le fichier xml/catalog.xml depuis votre r&#233;pertoire JMRI vers un fichier /etc/xml/catalog.
	( Notez que ceci est pour Linux et Mac OS X et on ne sait pas ce qui fonctionne pour Windows;
     vous pourriez avoir &#224; utiliser sudo pour ce faire; qu'il n'y a pas de suffixe .xml sur la
	fichier r&#233;sultant; s'il y a d&#233;j&#224;
     un fichier, il vous faudra fusionner manuellement le contenu; vous devez mettre &#224; jour
	celui-ci p&#233;riodiquement pour que JMRI continue d'&#233;voluer) </li>
	<li>
	Alternativement, si vous ex&#233;cutez un serveur local comme
	 <a href="#local">d&#233;crit ci-dessus</a>,
	vous pouvez fournir une solution plus g&#233;n&#233;rique en copiant
	Le suivant dans un fichier /etc/xml/catalog
	( Notez que ceci est pour Linux et Mac OS X et on ne sait pas ce qui fonctionne pour Windows;
     vous pourriez avoir &#224; utiliser sudo pour ce faire; qu'il n'y a pas de suffixe .xml sur la
	fichier r&#233;sultant; s'il y a d&#233;j&#224;
     un fichier, il vous faudra fusionner manuellement le contenu; mais au moins vous n'aurez pas
	mettre &#224; jour &#224; l'avenir):
	 <pre>
    &lt;?xml version='1.0'?&gt;
	&lt;catalog xmlns="urn:oasis:names:tc:entity:xmlns:xml:catalog"&gt;

	 &lt;rewriteURI uriStartString="http://jmri.org/xml/"
     rewritePrefix="http://localhost/xml/" /&gt;

    &lt;/catalog&gt;
	</pre>

	Ce catalogue redirige toutes les r&#233;f&#233;rences HTTP vers le r&#233;pertoire "xml" sur le site Web JMRI
	dans le r&#233;pertoire "xml" sur votre serveur web local.</li>
</ul>

        <!--#include virtual="/Footer" -->
	  </div><!-- closes #mainContent-->
	</div> <!-- closes #mBody-->
</body>
</html>
