<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01//EN" "http://www.w3.org/TR/html4/strict.dtd">
<!-- Updated by Blorec Herv&#233;  2017-01-01-->
<html lang="fr">
<head>
 <title>JMRI Hardware Setup Support - Terminal Server Connection</title>
    <meta name="author" content="David D Zuhn">
    <meta name="author" content="John Plocher">
    <meta name="keywords" content="EasyDCC Lantronix terminal server java model railroad JMRI install">
<!-- Style -->
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<link rel="stylesheet" type="text/css" href="/css/default.css" media="screen">
<link rel="stylesheet" type="text/css" href="/css/print.css" media="print">
<link rel="icon" href="/images/jmri.ico" type="image/png">
<link rel="home" title="Home" href="/">
<!-- /Style -->
</head>

<body>
<!--#include virtual="/Header" -->
<div id="mBody">
    <!--#include virtual="Sidebar" -->
    <div id="mainContent">
        <!-- Page Body -->
<h1>Guide Installation JMRI: Connexion Serveur Terminal</h1>

Un <strong>Serveur Terminal</strong> est une bo&#238;te qui connecte un ou plusieurs ports s&#233;rie
 &#224; un r&#233;seau afin qu'ils puissent &#234;tre accessibles &#224; partir d'un ordinateur distant.
JMRI s'ex&#233;cutant sur un ordinateur avec une connexion r&#233;seau peut
se connecter &#224; une centrale EasyDCC ou NCE ou des n&#339;uds C/MRI par l'une de celle-ci. Cela vous permet
de mettre l'ordinateur et la centrale aussi &#233;loign&#233; que vous le souhaitez.

<a name="hardware"></a><h2>Mat&#233;riel prit en charge</h2>

<p>Cette utilisation a &#233;t&#233; initialement cr&#233;&#233;e par Zuhn David, qui
a une <a href="http://stpaulterminal.org/software/jmri/lantronix.html"> page web </a>
d&#233;crivant en d&#233;tail comment il l'a mis en place pour EasyDCC.
Pour NCE et C/MRI le processus est similaire.

<a name="connecting"></a><h2>Connexion</h2>
<p>
Pour faire ce travail,
vous devez configurer &#224; la fois JMRI et le Serveur Terminal, et de faire
	les connexions appropri&#233;es.</p>

<h3>R&#233;glages</h3>
<ul>	
	<li>Pour configurer JMRI:
	<ul>
	<li> S&#233;lectionnez "Pr&#233;f&#233;rences "dans le menu "&#233;dition"
	<li> S&#233;lectionnez "EasyDCC" comme System Manufacturer
	<li> S&#233;lectionnez "EasyDCC over terminal server"comme System Connection
	<li> "Entrez l'adresse IP et le num&#233;ro du Port TCP/UDP 
	     correspondant au port s&#233;rie sur le serveur terminal
	<li> Cliquez sur enregistrer, puis quittez le programme
	</ul>
	<li>
	Configurer le Serveur Terminal pour se connecter &#224; la centrale:
	9600 bauds, sans parit&#233;, 8 bits.</li>
</ul>

<h3>C&#226;blage</h3>
<ul>
	<li>
	Connectez un c&#226;ble s&#233;rie du Serveur Terminal &#224; la centrale.
	Selon le type de Serveur Terminal, cela pourrait exiger que vous fassiez des
	fils sur mesure pour obtenir les bonnes connexions. Notez que vous voulez que le fil
	"&#233;mette des donn&#233;es"  &#224; une extr&#233;mit&#233; pour se connecter &#224; la "r&#233;ception de donn&#233;es" sur 
	l'autre.
	Faites de m&#234;me pour les deux directions, et il comprend &#233;galement un fil de terre.
	<li>Faire les connexions de r&#233;seau n&#233;cessaires.
</ul>

<p>D&#233;marrez JMRI. Si tout est OK, l'application va d&#233;marrer et vous montrer
	qu'il est correctement connect&#233;</p>

<!--#include virtual="/Footer" -->
 </div><!-- closes #mainContent-->
</div> <!-- closes #mBody-->
</body>
</html>
