<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01//EN"
"http://www.w3.org/TR/html4/strict.dtd">
<!--  $Id$ -->
<!-- Updated  by Blorec Herv&#233;  2013-09-09-->
<html lang="fr">
<head>
<meta name="generator" content=
"HTML Tidy for Mac OS X (vers 31 October 2006 - Apple Inc. build 15.17), see www.w3.org">
<title>JMRI: Terminal Server Connection</title>
<meta http-equiv="Content-Type" content=
"text/html; charset=us-ascii">
<meta content="David D Zuhn" name="Author">
<meta content="John Plocher" name="Author">
<meta name="keywords" content=
"EasyDCC Lantronics terminal server java model railroad JMRI install">
<!-- Style -->
<meta http-equiv="Content-Type" content=
"text/html; charset=us-ascii">
<link rel="stylesheet" type="text/css" href="/css/default.css"
media="screen">
<link rel="stylesheet" type="text/css" href="/css/print.css" media=
"print">
<link rel="icon" href="/images/jmri.ico" type="image/png">
<link rel="home" title="Home" href="/"><!-- /Style -->
</head>
<body>
<!--#include virtual="/Header" -->
<div class="nomenu" id="mBody">
<div id="mainContent">
<h2>Guide Installation JMRI: Connexion Serveur Terminal</h2>
Un serveur Terminal est une bo&icirc;te qui connecte un ou
plusieurs ports s&eacute;rie &agrave; un r&eacute;seau afin qu'ils
puissent &ecirc;tre accessibles &agrave; partir d'un ordinateur
distant. JMRI s'ex&eacute;cutant sur un ordinateur avec une
connexion r&eacute;seau peut se connecter &agrave; une centrale de
commande ou EasyDCC NCE par l'une de celle-ci. Cela vous permet
vous de mettre l'ordinateur et la centrale commande aussi
&eacute;loign&eacute; que vous le souhaitez.
<p>Pour faire ce travail, vous devez configurer &agrave; la fois
JMRI et le serveur terminal, et de faire les connexions
appropri&eacute;es.</p>
<p>Cette utilisation a &eacute;t&eacute; initialement
cr&eacute;&eacute;e par Zuhn David, qui a une <a href=
"http://stpaulterminal.org/software/jmri/lantronix.html">page
web</a> d&eacute;crivant en d&eacute;tail comment il l'a mis en
place pour EasyDCC. Ce qui suit est juste un aper&ccedil;u de la
pr&eacute;sente. Le processus des NCE est similaire.</p>
<ul>
<li>Pour configurer JMRI:
<ul>
<li>S&eacute;lectionnez "Pr&eacute;f&eacute;rences "dans le menu
"&eacute;dition"</li>
<li>S&eacute;lectionnez l'option protocole "EasyDCC sur le serveur
terminal "</li>
<li>Entrez l'adresse IP et le num&eacute;ro de port de connexion
correspondant au port s&eacute;rie sur le serveur terminal</li>
<li>Cliquez sur enregistrer, puis quittez le programme</li>
</ul>
</li>
<li>Configurer le serveur Terminal pour se connecter &agrave; la
station de commande: 9600 bauds, sans parit&eacute;, 8 bits.</li>
<li>Connectez un c&acirc;ble s&eacute;rie &agrave; partir du
serveur terminal &agrave; la centrale de commande. Selon le type de
serveur terminal, cela pourrait exiger que vous fassiez les fils
sur mesure pour obtenir les bonnes connexions. Notez que vous
voulez que le fil "&eacute;mette des donn&eacute;es" &agrave; une
extr&eacute;mit&eacute; pour se connecter &agrave; la
"r&eacute;ception de donn&eacute;es" sur l'autre. Faites de
m&ecirc;me pour les deux directions, et il comprend
&eacute;galement un fil de terre.</li>
<li>Faire les connexions de r&eacute;seau n&eacute;cessaires.</li>
<li>D&eacute;marrez le programme en place. Si tout est OK, JMRI va
d&eacute;marrer et vous montrer qu'il est correctement
connect&eacute;</li>
</ul>
<!--#include virtual="/Footer" --></div>
</div>
</body>
</html>
