<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01//FR"
"http://www.w3.org/TR/html4/strict.dtd">

<html lang="fr">
<head>
  <meta name="generator" content=
  "HTML Tidy for Mac OS X (vers 31 October 2006 - Apple Inc. build 15.17), see www.w3.org">
<!-- Tranlation by Herv&#233; BLOREC <bzh56420@yahoo.fr> on 2020-11-11-->
  <title>Comprehensive Programmer - Advanced Features Pane</title>
  <!-- Style -->
  <meta http-equiv="Content-Type" content=
  "text/html; charset=us-ascii">
  <link rel="stylesheet" type="text/css" href="/css/default.css"
  media="screen">
  <link rel="stylesheet" type="text/css" href="/css/print.css"
  media="print">
  <link rel="icon" href="/images/jmri.ico" type="image/png">
  <link rel="home" title="Home" href="/"><!-- /Style -->
</head>

  <body>
  <!--#include virtual="/Header.shtml" -->

  <div id="mBody">
    <!--#include virtual="Sidebar.shtml" -->


    <div id="mainContent">
      <a name="Top"></a>

      <h1>DecoderPro&#174; Fonctions Avanc&#233;es</h1>

      <h2>Volet &#201;tiquettes de fonctions</h2>

      <div align="right">
        <p><a href="index.shtml">Retour &#224; l'Index</a></p>
      </div>
      <hr>

      <p>Ce volet est ouvert avec le bouton <strong>M&#233;dia &amp;
    &#201;tiquettes</strong> dans la fen&#234;tre principale DecoderPro ou 
    depuis le menu <strong>Actions</strong>.</p>

      <p><img src="images/Adv_03_FunctionLabels.png" alt=
      "function labels" height="682" width="900"></p>

      <p> Ce volet est plus qu'un bloc-notes pour garder une 
      trace de ce qui se passe lorsque des boutons de fonction sont enfonc&#233;s. 
      Il interagit aussi avec le <a href="Throttle.shtml">R&#233;gulateur JMRI</a>.</p>

      <p wrap="">L'onglet <strong> Libell&#233; de la fonction </strong> permet 
      de d&#233;finir les param&#232;tres des r&#233;gulateurs logiciels dans JMRI. Principalement les 
      commandes &#224; l'&#233;cran, mais aussi certains param&#232;tres sont mis en miroir sur 
      les smartphones (IPhone/Android) &#224; l'aide de l'interface WiThrottle. </P>

      <p>Lorsque vous utilisez le menu d&#233;roulant de la liste de r&#233;gulateur JMRI pour 
      s&#233;lectionner une locomotive dans votre liste, les boutons de fonction sont 
      marqu&#233;s avec les descriptions que vous avez saisies pour ces fonctions dans ce volet.</p>

      <p>Dans cet exemple, les touches de fonction du r&#233;gulateur seront &#233;tiquet&#233;es 
      pour le FP-45 avec d&#233;codeur de son OEM Tsunami avec fonctions de son et d'&#233;clairage..</p>

      <p><img src="images/Adv_03_FunctionOnThrottle.png" alt=
      "throttle functions" height="523" width="531"></p>

      <p>&#201; l'aide des cases &#224; cocher, les espaces et le bouton radio &#224; droite de chaque fonction peuvent &#234;tre r&#233;gl&#233;s sur:</p>

      <table border="1" cellpadding="2" cellspacing="1" width=
      "80%">
        <tbody>
          <tr>
            <td width="13%"><strong>verrou</strong></td>

            <td width="87%">
              <p>Rend le bouton de fonction "verrouill&#233;" ou "non verrouill&#233;". 
              Lorsque la case est coch&#233;e, la fonction est "verrouill&#233;e" .</p>

              <p><strong>La Fonction Verrouill&#233;e </strong> restera activ&#233;e 
              (position abaiss&#233;e) jusqu'&#224; ce que vous appuyiez &#224; nouveau, 
              c'est-&#224;-dire que le bouton de fonction &#233;tiquet&#233; «Cloche» sonnera 
              jusqu'&#224; ce que vous appuyiez &#224; nouveau ( bouton &#224; bascule)</p>

              <p><strong>Fonction non verrouill&#233;e </strong> lorsque vous appuyez 
              sur cette touche, vous l'activez/d&#233;sactivez. c'est &#224; dire que Le bouton 
              de fonction &#233;tiquet&#233; "trompe courte", lorsqu'il est enfonc&#233; 
              fournit un coup de trompe (bouton &#224; impulsion).</p>
            </td>
          </tr>

          <tr>
            <td><strong>off</strong></td>

            <td>Caract&#232;re de remplacement pour l'ic&#244;ne qui est affich&#233;e sur 
            le bouton de fonction lorsqu'il est &#224; l'&#233;tat d&#233;sactiv&#233;.</td>
          </tr>

          <tr>
            <td><strong>on</strong></td>

            <td>Caract&#232;re de remplacement pour l'ic&#244;ne qui est affich&#233;e sur 
            le bouton de fonction lorsqu'il est &#224; l'&#233;tat activ&#233;.</td>
          </tr>

          <tr>
            <td><strong>Man&#156;uvre</strong></td>

            <td>D&#233;finit la touche de fonction "virtuelle" pour la commande logicielle.
			L'option "verrouiller" doit &#233;galement &#234;tre d&#233;finie simultan&#233;ment &#224; 
			l'activation de la touche de fonction virtuelle "Man&#156;uvre". 
			Lorsque cette touche de fonction est enfonc&#233;e, le r&#233;gulateur de la commande logicielle 
			passe au style "z&#233;ro central d&#233;sactiv&#233;" pour la man&#156;uvre, au lieu de la position 
			"gamme compl&#232;te avec touche de direction s&#233;par&#233;e"."</td>
          </tr>
        </tbody>
      </table>

      <p>Vous pouvez faire glisser et d&#233;poser des ic&#244;nes ici dans ou hors des espaces libres 
      dans les propri&#233;t&#233;s de la sous-fen&#234;tre Fonction du R&#233;gulateur, 
      . </P>
      <p>Vous pouvez &#233;galement &#233;diter le texte du bouton de fonction dans <a href =
       "dp3_Main_Throttle.shtml"> <strong> R&#233;gulateur JMRI </strong> </a> et 
       enregistrez ces modifications dans l'entr&#233;e d'Inventaire s&#233;lectionn&#233;. 
       Pour utiliser ces entr&#233;es modifi&#233;es &#224; l'avenir, assurez-vous de cliquer 
       sur <input name = "button" id = "button" value = "Enregistrer dans la liste" type = "submit"> 
       pour enregistrer ces valeurs dans l'entr&#233;e de l'inventaire en cours d'utilisation. </p>
      <hr>

      <div align="right">
        <p><a href="Comp_LightFX.shtml"></a><a href=
        "index.shtml">Retour &#224; l'Index</a></p>
      </div><!--#include virtual="/Footer.shtml" -->
    </div><!-- closes #mainContent-->
  </div><!-- closes #mBody-->
</body>
</html>
