<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//FR"
"http://www.w3.org/TR/html4/loose.dtd">
<!-- Tranlation by Herv&#233; BLOREC <bzh56420@yahoo.fr> on 2020-11-11 -->
<html lang="fr">
<head>
  <meta name="generator" content=
  "HTML Tidy for Mac OS X (vers 31 October 2006 - Apple Inc. build 15.17), see www.w3.org">

  <title>Comprehensive Programmer - Basic Pane</title>
  <!-- Style -->
  <meta http-equiv="Content-Type" content=
  "text/html; charset=us-ascii">
  <link rel="stylesheet" type="text/css" href="/css/default.css"
  media="screen">
  <link rel="stylesheet" type="text/css" href="/css/print.css"
  media="print">
  <link rel="icon" href="/images/jmri.ico" type="image/png">
  <link rel="home" title="Home" href="/"><!-- /Style -->
</head>

<body>
  <!--#include virtual="/Header.shtml" -->

  <div id="mBody">
    <!--#include virtual="Sidebar.shtml" -->

    <div id="mainContent">
      <a name="Top" id="Top"></a>

      <h1>DecoderPro&reg; Programmer Complet</h1>

      <h2>Volet Basique &#201;tendu</h2>

      <div align="right">
        <a href="Comp_Setup_Roster.shtml">Pr&#233;c&#233;dent</a> | <a href=
        "Comp_Motor.shtml">Suivant</a><br>
        <a href="Comp_Motor.shtml"></a>

        <p><a href="index.shtml#Advanced%20Programmer">Retour &#224; l'Index</a></p>
      </div>
      <hr>

      <p>L'une des premi&#232;res choses que vous remarquerez &#224; propos du 
      volet <strong> Basique </strong> d&#233;velopp&#233; dans le <strong> Programmeur complet </strong> 
      est qu'il existe beaucoup plus d'options que celles que vous avez 
      trouv&#233;es dans le <strong> Programmeur de base </strong>. Utilisez 
      maintenant le bouton Lire la fiche compl&#232;te pour lire les valeurs 
      sur lesquelles la locomotive est programm&#233;e. Vous pouvez maintenant 
      d&#233;terminer si vous souhaitez modifier les valeurs. </P>

      <p style="text-align: center;"><img style=
      "width: 903px; height: 582px;" alt="Extended Basic" src=
      "images/Extended_Basic_Program_Roster.png"><br></p>

      <p>S&#233;lectionnez le bouton radio <b> adressage </b> &#224; 2 ou 4 chiffres 
      pour s&#233;lectionner le mode d'adressage que vous souhaitez activer</p>.

      <p> Vous pouvez entrer les adresses de locomotive &#224; la fois dans 
      <strong> Adresse principale </strong> et/ou dans la valeur <strong> Adresse &#233;tendue </strong>. 
      L'adresse d'un d&#233;codeur est le pr&#233;fixe du code auquel il r&#233;pond. 
      C'est ainsi que vous pourrez faire fonctionner plusieurs locomotives 
      sur une m&#234;me ligne tout en conservant l'ind&#233;pendance de leurs vitesses 
      et de leurs fonctions. &#193; l'origine, les d&#233;codeurs ne pouvaient avoir 
      qu'une adresse &#224; deux chiffres ... apr&#232;s tout, qui pourrait avoir 
      besoin de plus de 100 locomotives? Certaines centrales de commande 
      et d&#233;codeurs bas de gamme utilisent encore un adressage &#224; deux chiffres. 
      Les nouveaux d&#233;codeurs peuvent avoir une adresse allant jusqu'&#224; quatre chiffres.
       L'option "<b> Mode d'adressage </b>" vous permet de choisir une adresse 
       entre deux et quatre chiffres. Les adresses elles-m&#201;mes sont entr&#233;es 
       dans les zones de texte appropri&#233;es. La case &#224; cocher "<b> Adresse &#233;tendue </b>" 
       active et d&#233;sactive le mode d'adresse &#224; 4 chiffres. Cela vous permet 
       d'avoir deux adresses diff&#233;rentes stock&#233;es dans un d&#233;codeur et 
       de basculer entre les deux..</p>

      <p> <strong> Sens normal de marche </strong>: d&#233;finissez la <strong> Direction 
      de la locomotive: normale </strong> ou <strong> invers&#233;e </strong> dans la 
      liste d&#233;roulante. L'option pour le <b> sens de d&#233;placement normal </b> 
      est importante pour les mod&#233;listes comme la NS, les locomotives diesel 
      &#224; capot long, ou pour la personne qui commet parfois une erreur et qui 
      raccorde le d&#233;codeur en sens inverse. Il vous permet de changer 
      la direction d&#233;finie dans le d&#233;codeur en "avant" 
      (pas de d&#233;montage ni de rec&#226;blage). </P>

      <p> <strong> Pas de vitesse: </strong>, choisissez le r&#233;glage 28/128,
       &#224; moins que votre centrale de commande ou votre d&#233;codeur ne puisse 
       g&#233;rer que 14 pas de vitesse. Si votre d&#233;codeur offre un fonctionnement 
       &#224; 128 pas, vous obtiendrez un contr&#244;le beaucoup plus pr&#233;cis de vos locomotives 
       en utilisant le r&#233;glage <strong> 128 crans de vitesse </strong>. Vous choisissez 
       entre 128 et 28 avec votre r&#233;gulateur, lorsque la locomotive est pr&#234;te &#224; rouler sur la voie. </P>

      <p> <strong>Fonctionnement analogique</strong> (permet au d&#233;codeur de fonctionner sous un 
      contr&#244;le de tension continue/analogique standard) Activez le fonctionnement 
      analogique avec pr&#233;caution, car certains d&#233;codeurs passeront &#224; la vitesse maximale, 
      ce qui donnera une "locomotive Folle". s'ils sont activ&#233;s pour le fonctionnement analogique 
      et rencontrent des pics de tensions sur un signal num&#233;rique DCC. Ils semblent pertub&#233;s 
      et reviennent au fonctionnement analogique et utilisent le courant continu pleine 
      tension DCC pour d&#233;coller et ROULER! Il n'est pas possible de les arr&#201;ter sans 
      couper l'alimentation du r&#233;seau. Tr&#232;s d&#233;rangeant pour vos compagnons d'exploitation, 
      mais cela vaut mieux que de percuter les locomotives &#224; pleine vitesse. </P>

      <p> Pour activer le Mode Analogique (style ancien DC, certains fournisseurs 
      l'appellent mode dual), s&#233;lectionnez l'entr&#233;e appropri&#233;e dans la liste d&#233;roulante. </p>

       <p> <strong>ID utilisateur n&#186; 1 </strong> "et <strong> ID utilisateur n&#186; 2 </strong> 
       (&#224; droite}), ces deux CV n'ont rien &#224; voir avec une fonction du d&#233;codeur. Utilisez 
       ces CV, m&#234;me si vous avez un &#233;quipement personnalis&#233; pour votre propre r&#233;seau - 
       il offre un moyen &#233;lectronique d'identifier vos d&#233;codeurs s'ils sont retir&#233;s de la locomotive. </p>

      <div align="right"></div>

      <h2>Les boutons Lire et &#201;crire</h2>

      <p> Au bas de tous les volets du programmateur, vous trouverez trois rang&#233;es de boutons, comme indiqu&#233;: </p>

       <p align = "center"> <img src = "images/Comp_03_Basic.png" alt = "boutons de base comp" height = "168" width = "929"> </p>

       <p> La rang&#233;e sup&#233;rieure utilise <span class = "ACCENT"> <strong> UNIQUEMENT </strong> </span> 
       dans le volet actuellement visible. Ces boutons sont: </p>
       <ol>
         
         <li> <b> Lire les modifications sur la feuille </b> - Ce bouton vous permet 
         de r&#233;cup&#233;rer des donn&#233;es du d&#233;codeur si vous les avez modifi&#233;es accidentellement 
         sur votre ordinateur (sans vous rappeler les valeurs!), 
         mais uniquement si vous ne les avez pas encore &#233;crites. </li>
       
        <li> <b> &#201;crire les modifications sur la feuille </b> - plus rapide que 
        l'&#233;criture de toutes les donn&#233;es de la feuille et id&#233;al pour modifier 
        les modifications en <b>Mode Ops </b>, la programmation sur la voie principale. </li >

         <li> <b> Lire la fiche compl&#232;te </b>: lisez toutes les donn&#233;es de ce volet 
         &#224; partir du d&#233;codeur. Notez que cela peut prendre beaucoup de temps, 
         en fonction de la vitesse de votre ordinateur et de la centrale de commande utilis&#233;e. </Li>

         <li> <b> &#201;crire une feuille compl&#232;te </b> - &#233;crit toutes les donn&#233;es de cet 
         onglet dans le d&#233;codeur. </li>
      </ol>

      <p> La deuxi&#232;me rang&#233;e de boutons remplit essentiellement les m&#234;mes fonctions, 
      mais sur la <strong> plage enti&#232;re </strong> des CV du d&#233;codeur. Cela vous permet, 
      par exemple, de lire tous les CV ou d'effectuer une s&#233;rie de modifications 
      dans plusieurs onglets, puis de les &#233;crire dans le d&#233;codeur. Encore une fois,
       vous avez la possibilit&#233; de lire/&#233;crire uniquement les donn&#233;es modifi&#233;es ou toutes les donn&#233;es. </P>

       <p> Sous les deux rang&#233;es de boutons se trouve une ligne de texte 
       indiquant le r&#233;glage actuel du <b> Mode de Programmation </b>, 
       ainsi qu'un bouton <b> D&#233;finir </b> <strong> ... </strong>. 
       cela vous permet de le changer sans quitter le programmeur. 
       <a href= "Basic_Mode.shtml"> <strong> cliquez ici </strong> </a> pour plus d'informations sur les Modes de Programmation. </p>
       
		<p> Enfin, la derni&#232;re ligne du volet est une barre d'&#233;tat qui vous indique 
		exactement ce que fait le syst&#232;me. Il indique <strong> inactif </strong> dans ces captures d'&#233;cran, 
		car le syst&#232;me ne programmait pas activement les d&#233;codeurs au moment de la capture d'&#233;cran
        </p>

       <p> Maintenant, allons &#224; l'onglet Moteur. </p> </p>
      <hr>

      <div align="right">
        <p><a href="Comp_Motor.shtml"></a><a href=
        "Comp_Setup_Roster.shtml">Pr&#233;c&#233;dent| |</a> <a href=
        "Comp_Motor.shtml">Suivant<br></a></p>

        <p><a href="index.shtml#Advanced%20Programmer">Retour &#224; l'Index </a></p>
      </div><!--#include virtual="/Footer.shtml" -->
    </div><!-- closes #mainContent-->
  </div><!-- closes #mBody-->
</body>
</html>
