<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//FR"
"http://www.w3.org/TR/html4/loose.dtd">

<html lang="fr">
<head>
  <meta name="generator" content=
  "HTML Tidy for Mac OS X (vers 31 October 2006 - Apple Inc. build 15.17), see www.w3.org">
<!-- Translation by Herv&#233; BLOREC <bzh56420@yahoo.fr> on 2019-02-14 -->
  <title>Comprehensive Programmer - Consisting Functions
  Pane</title><!-- Style -->
  <meta http-equiv="Content-Type" content=
  "text/html; charset=us-ascii">
  <link rel="stylesheet" type="text/css" href="/css/default.css"
  media="screen">
  <link rel="stylesheet" type="text/css" href="/css/print.css"
  media="print">
  <link rel="icon" href="/images/jmri.ico" type="image/png">
  <link rel="home" title="Home" href="/"><!-- /Style -->
</head>

<body>
  <!--#include virtual="/Header" -->

  <div id="mBody">
    <!--#include virtual="Sidebar" -->

    <div id="mainContent">
      <a name="Top" id="Top"></a>

      <h1>DecoderPro&reg; Programmeur Complet</h1>

      <h2>Onglet Fonctions Couplage</h2>

      <div align="right">
        <p><a href="Comp_Analog.shtml">Pr&#233;c&#233;dent |</a> <a href=
        "Comp_Advanced.shtml">Suivant</a></p>

        <p><a href="index.shtml#Advanced%20Programmer">Retour &#224; l'Index</a></p>
      </div>
      <hr>

      <p>Le couplage est un moyen de faire en sorte que deux locomotives 
      ou plus r&#233;pondent aux ordres de la centrale de commande et le fassent 
      ensemble &#224; l'unisson. Un certain nombre de termes sont utilis&#233;s 
      pour d&#233;crire le couplage et les fabricants ne sont pas d'accord 
      sur ce que ces termes devraient &#234;tre. Le NMRA a adopt&#233; la 
      terminologie, c'est donc celle-ci qui sera utilis&#233;e dans cette discussion.</p>

      <p>Adresse Couplage. Vous d&#233;finissez simplement l'adresse de chaque 
      locomotive pour qu'elle soit identique, et nous pouvons utiliser 
      l'onglet Programmateur de base pour le faire. Ensuite, une instruction 
      DCC envoy&#233;e &#224; une locomotive d'adresse XX fera r&#233;agir toutes les 
      locomotives d'adresse XX. Cela fonctionne bien pour les locomotives 
      qui roulent toujours ensemble et est portable d'un r&#233;seau &#224; 
      l'autre. L'inconv&#233;nient est qu'il est difficile de r&#233;-adresser 
      vos locomotives si vous ne les utilisez pas toujours ensemble..</p>

      <p>Ainsi, le NMRA a propos&#233; deux moyens suppl&#233;mentaires de couplage. 
      L'une est configur&#233;e et m&#233;moris&#233;e par la centrale de commande, 
      l'autre dans les d&#233;codeurs..</p>

      <p> Le NMRA appelle le syst&#232;me bas&#233; sur la centrale de commande. 
      La centrale de commande conserve une liste de toutes les locomotives 
      du couplage. Lorsqu'une action est n&#233;cessaire, la centrale de 
      commande envoie un paquet individuel &#224; chaque locomotive du couplage, 
      ce qui les force ensuite &#224; agir ensemble. Comme cette m&#233;thode est 
      bas&#233;e sur la centrale de commande, le couplage n'est pas portable 
      sur un autre syst&#232;me. De plus, puisqu'il n'a pas besoin d'&#234;tre 
      programm&#233; dans les d&#233;codeurs, DecoderPro n'a pas besoin de s'en occuper.</p>

      <p>DecoderPro utilise le volet Couplage pour configurer Les Couplages 
      Avanc&#233;s NMRA et la r&#233;ponse de la locomotive aux demandes de 
      fonction envoy&#233;es &#224; l'adresse de couplage. </P>

       <h1><img src="images/Comp_07_Consisting.png" width="920"
      height="799" alt="Consist panel"></h1>
      
      <p> L'adresse de coh&#233;rence avanc&#233;e est destin&#233;e &#224; l'option <strong> EPF </strong> 
      (<strong> format de paquet &#233;tendu </strong>, telle que d&#233;finie par les 
      pratiques recommand&#233;es de la NMRA pour DCC). Si l'adresse de couplage 
      est <strong> une valeur autre que z&#233;ro </strong>, la locomotive est 
      consid&#233;r&#233;e comme &#233;tant dans un couplage et ne r&#233;pondra qu'aux instructions 
      envoy&#233;es &#224; l'adresse de couplage. Nous d&#233;finissons donc ici 
      une adresse courte pour cr&#233;er un groupe de machines multiples qui 
      r&#233;pondront toutes &#224; la m&#234;me adresse. Voyez cela comme une adresse de 
      locomotive sp&#233;cifique &#224; l'UM. &#201;tant donn&#233; que l'adresse est dans la 
      m&#234;me plage que les locomotives non coupl&#233;es avec des adresses courtes, 
      nous devons nous assurer que l'adresse est unique sur le r&#233;seau. 
      Pour ce faire, utilisez une extr&#233;mit&#233; sup&#233;rieure de la plage d'adresses 
      courte &#224; partir de 127 et plus bas. La plupart des gens qui travaillent 
      avec des locomotives simples avec des adresses courtes ont tendance &#224; 
      utiliser les valeurs par d&#233;faut d&#233;finies par le fabricant, soit 3, 
      ou d'autres valeurs faibles, g&#233;n&#233;ralement pour leurs locomotives.</p>

      <p>Cet onglet permet &#233;galement d'indiquer au d&#233;codeur quels effets doivent 
      &#234;tre activ&#233;s lorsque la locomotive est dans un couplage, en supposant 
      que le d&#233;codeur soit capable de r&#233;pondre de mani&#232;re appropri&#233;e. &#193; titre 
      d'exemple, cela vous permet de sp&#233;cifier si les phares et les autres 
      fonctions d'&#233;clairage doivent &#234;tre toujours &#233;teints si la locomotive 
      est au milieu ou &#224; l'arri&#232;re. Cela peut &#234;tre pratique si seulement 
      l'unit&#233; "B" a un son. Vous pouvez r&#233;gler ses lumi&#232;res de mani&#232;re &#224; 
      ce qu'elles soient &#233;teintes, mais le klaxon peut sonner, m&#234;me si 
      elles sont dans le couplage. </P>

       <p> Si vos locomotives se trouvent sur une autre structure et 
       que vous les avez exploit&#233;es ensemble, mais que vous ne parvenez
        pas &#224; les faire fonctionner s&#233;par&#233;ment sur votre syst&#232;me d'origine, 
        v&#233;rifiez si l'adresse correspondante a &#233;t&#233; d&#233;finie.</p>
      <hr>

      <div align="right">
        <p><a href="Comp_Analog.shtml">Pr&#233;c&#233;dent |</a> <a href=
        "Comp_Advanced.shtml">Suivant</a></p>

        <p><a href="index.shtml#Advanced%20Programmer">Retour &#224; l'Index</a></p>
      </div><!--#include virtual="/Footer" -->
    </div><!-- closes #mainContent-->
  </div><!-- closes #mBody-->
</body>
</html>
