<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//FR"
"http://www.w3.org/TR/html4/loose.dtd">
<!-- Translation by Herv&#233; BLOREC <bzh56420@yahoo.fr> on 2019-02-18 -->
<html lang="fr">
<head>
  <meta name="generator" content=
  "HTML Tidy for Mac OS X (vers 31 October 2006 - Apple Inc. build 15.17), see www.w3.org">

  <title>Comprehensive Programmer - Lighting Functions and FX
  Pane</title><!-- Style -->
  <meta http-equiv="Content-Type" content=
  "text/html; charset=us-ascii">
  <link rel="stylesheet" type="text/css" href="/css/default.css"
  media="screen">
  <link rel="stylesheet" type="text/css" href="/css/print.css"
  media="print">
  <link rel="icon" href="/images/jmri.ico" type="image/png">
  <link rel="home" title="Home" href="/"><!-- /Style -->
</head>

<body>
  <!--#include virtual="/Header" -->

  <div id="mBody">
    <!--#include virtual="Sidebar" -->

    <div id="mainContent">
      <a name="Top" id="Top"></a>

      <h1>DecoderPro&reg; Programmeur Complet</h1>

      <h2>Onglet Fontions &#201;clairages et FX</h2>

      <div align="right">
        <p><a href="Comp_FMap.shtml">Pr&#233;c&#233;dent |</a> <a href=
        "Comp_Analog.shtml">Suivant</a></p>

        <p><a href="index.shtml#Advanced%20Programmer">Retour &#224; l'Index</a></p>
      </div>
      <hr>

      <p>Ce volet permet de contr&#244;ler certaines des fonctions les plus 
     "g&#233;niales" du d&#233;codeur. Bien que le r&#233;glage du moteur soit important 
      et que les tableaux de vitesse contribuent au r&#233;alisme du fonctionnement, 
      tout le monde remarque les lumi&#232;res, en particulier lorsqu'elles 
      changent d'intensit&#233;, clignotent, clignotent ou s'estompent. 
     Elles attirent encore plus l'attention lorsque, par exemple, 
      les feux de foss&#233; qui brillaient r&#233;guli&#232;rement lorsque la locomotive
      s'approche du passage &#224; niveau se mettent &#224; clignoter en alternance, 
      puis &#224; redevenir &#233;tincelants; ou lorsqu'une locomotive tire sur une 
      voie de garage, s'arr&#234;te et att&#233;nue son phare pour ne pas g&#234;ner le train qui 
      s'approche. Tous ces effets sont possibles avec le bon d&#233;codeur 
      et la bonne configuration, et DecoderPro est l'installation id&#233;ale. </p>

      <p>Chaque Fabricants et familles de d&#233;codeurs g&#232;re l'&#233;clairage de mani&#232;re 
      unique. Il existe donc de nombreuses versions de cet onglet..</p>

      <p align="center"><img src="images/Comp_06_Lights.png" alt=
      "light pane" height="799" width="918"></p>

      <p>Les effets sp&#233;cifiques disponibles diff&#232;rent consid&#233;rablement 
      entre les fabricants, et m&#234;me entre les diff&#233;rentes "familles" de 
      d&#233;codeurs du m&#234;me fabricant. L'exemple ci-dessus provient d'un 
      d&#233;codeur Digitrax FX. Vous verrez certaines des fonctionnalit&#233;s avanc&#233;es 
      dans de nombreux d&#233;codeurs (bien qu'elles puissent porter des noms 
      diff&#233;rents mais similaires) </p>

       <p> La <b>tension de maintien de la lampe</b> d&#233;termine le degr&#233; 
       d'obscurit&#233; d'une lumi&#232;re entre des instants "allum&#233;s". Cela peut 
       vous permettre d'ajuster les effets pour donner l'impression, par 
       exemple, d'un feu de position qui poss&#232;de &#233;galement une balise 
       rotative dans le m&#234;me bo&#238;tier. Jouez avec cette valeur et voyez 
       quel type de r&#233;sultats vous obtenez pour votre d&#233;codeur sp&#233;cifique.</p>

      <p><b>Le r&#233;glage du taux d'effet</b> d&#233;termine la vitesse &#224; laquelle 
      un effet FX fonctionne. Plus le nombre est &#233;lev&#233;, plus la 
      fr&#233;quence du flash ou de la "rotation" de l'effet est 
      lente. Ceci peut &#234;tre utilis&#233; pour d&#233;finir des diff&#233;rences 
      subtiles entre les locomotives. Comme vous pouvez le voir sur 
      le panneau ci-dessus, il y a deux feux stroboscopiques 
      alternatifs sur les machines. Si vous modifiez l&#233;g&#232;rement 
      le r&#233;glage du <b>Taux FX</b>, les locomotives clignotent 
      &#224; des vitesses l&#233;g&#232;rement diff&#233;rentes. Cela emp&#234;che 
      les unit&#233;s UM de sembler <u>trop</u> coordonn&#233;e! </P>

       <p>Le CV <b>Dur&#233;e de maintien de la lumi&#232;re de foss&#233;</b>  
       d&#233;termine la dur&#233;e pendant laquelle l'effet de lumi&#232;re de 
       foss&#233; (clignotement altern&#233;) reste activ&#233; une fois que vous 
       avez appuy&#233; sur la touche de fonction <b>F2 </b>. &#201;tant donn&#233; 
       que la touche <b>F2</b> ne se verrouille pas (consid&#233;rez-la 
       comme un bouton poussoir), elle s'&#233;teint normalement lorsqu'elle 
       est rel&#226;ch&#233;e. En augmentant la valeur de ce CV, vous pouvez les 
       faire rester jusqu'&#224; 30 secondes apr&#232;s une activation momentan&#233;e</p>

      <p align="center"><img src="images/Comp_06A_Lights.png" alt=
      "lignt pane" height="800" width="923"></p>

      <p>Les d&#233;codeurs sonores tels que le tsunami dans notre OEM FP-45 
      ont un onglet de programme d'&#233;clairage extr&#234;mement compliqu&#233;..</p>

      <p><img style="width: 900px; height: 594px;" alt=
      "Tsunami lighting" src="images/Comp_06B_Lights.png"><br></p>

      <p>Notez que certaines fonctions d'&#233;clairage peuvent &#234;tre li&#233;es &#224; 
      une fonction sonore propre aux d&#233;codeurs sonores. Les d&#233;codeurs 
      sonores ont beaucoup plus de fonctions que les d&#233;codeurs de commande moteur normaux. </P>

       <p> Les autres effets d'&#233;clairage varient fortement d'un d&#233;codeur 
       &#224; l'autre. Consultez la documentation de votre d&#233;codeur pour savoir 
       ce qu'il est suppos&#233; &#234;tre capable de faire et amusez-vous avec eux. 
       Ceux sont les posibilit&#233;s les plus satisfaisantes visuellement des 
      d&#233;codeurs!</p>

      <p>M&#234;me si la fonction et l'effet sont disponibles, vous devrez 
      peut-&#234;tre ajouter un &#233;clairage &#224; votre locomotive pour pouvoir 
      utiliser cette fonction, comme l'ajout de feux de foss&#233;, de balises, etc. </p>.
      <hr>

      <div align="right">
        <p><a href="Comp_Consist.shtml"></a><a href=
        "Comp_FMap.shtml">Pr&#233;c&#233;dent |</a> <a href=
        "Comp_Analog.shtml">Suivant</a></p>

        <p><a href="index.shtml#Advanced%20Programmer">Retour &#224; l'Index</a></p>
      </div><!--#include virtual="/Footer" -->
    </div><!-- closes #mainContent-->
  </div><!-- closes #mBody-->
</body>
</html>
