<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//FR"
"http://www.w3.org/TR/html4/loose.dtd">
<!-- Translation by Herv&#233; BLOREC <bzh56420@yahoo.fr> on 2019-02-25 -->
<html lang="fr">
<head>
  <meta name="generator" content=
  "HTML Tidy for Mac OS X (vers 31 October 2006 - Apple Inc. build 15.17), see www.w3.org">

  <title>Main-Roster group</title><!-- Style -->
  <meta http-equiv="Content-Type" content=
  "text/html; charset=us-ascii">
  <link rel="stylesheet" type="text/css" href="/css/default.css"
  media="screen">
  <link rel="stylesheet" type="text/css" href="/css/print.css"
  media="print">
  <link rel="icon" href="/images/jmri.ico" type="image/png">
  <link rel="home" title="Home" href="/"><!-- /Style -->
</head>

<body>
  <!--#include virtual="/Header" -->

  <div id="mBody">
    <!--#include virtual="Sidebar" -->

    <div id="mainContent">
      <a name="Top" id="Top"></a>

      <h1>DecoderPro&reg; Fen&#234;tre Principale</h1>

      <h2>Menu R&#233;glages - Groupes Inventaire</h2>

      <div align="right">
        <p><a href="dp3_menubar.shtml">Retour &#224; la Barre de Menu</a><a href=
        "#"></a></p>

        <p><a href="index.shtml#Main">Retour &#224; l'Index</a></p>
      </div>
      <hr>

      <p>La fonction <strong>Groupes d'Inventaire </strong> vous permet 
      de prendre l'ensemble de votre inventaire et de le classer. &#193; 
      la maison, vous voudrez peut-&#234;tre faire la distinction entre le 
      diesel et la vapeur ou la compagnie. Dans un club, il serait 
      pratique d'avoir des cat&#233;gories par nom de membre en plus de 
      toute autre cat&#233;gorie &#224; laquelle vous pourriez penser. Une entr&#233;e 
      de l'inventaire peut &#234;tre associ&#233;e &#224; plusieurs groupes. Toujours 
      dans un environnement de club, une entr&#233;e dans l'inventairee peut 
      &#234;tre associ&#233;e aux groupes Vapeur, Union Pacific et John Smith en 
      m&#234;me temps. Il y a toujours un groupe pr&#233;sent qui s'appelle 
      Global. Toutes les entr&#233;es de la liste sont dans le groupe global.</P>

      <h3> Masquer/Afficher les groupes d'Inventaires</h3>

      <p>Le contr&#244;le Masquer/Afficher les groupes d'inventaires est 
      utilis&#233; pour activer/d&#233;sactiver le panneau d'affichage des 
      groupes d'inventaire dans la zone surlign&#233;e en rose. Cela doit 
      d'abord &#234;tre activ&#233; en cliquant sur l'onglet Param&#232;tres, puis 
      sur Masquer/Afficher les groupes d'inventaires. Si le panneau 
      Groupes d'inventaire ne s'affiche pas lorsque vous cliquez sur le 
      param&#232;tre, essayez de saisir le cadre situ&#233; &#224; gauche de la zone 
      et de le faire glisser pour l'ouvrir (assurez-vous que le 
      mode Masquer/Afficher est dans le bon &#233;tat.) </P> la largeur du 
      panneau peut &#234;tre dimensionn&#233;e en faisant glisser le cadre 
      comme indiqu&#233; par les fl&#232;ches rouges. Les petites pointes de 
      fl&#232;che vous permettent de fermer ou d'ouvrir le panneau <br> 
      <img style = "width: 900px; height: 415px;" alt = "groupe d'appels" 
      src = "images/dp3_rosterGroup01.png"> <br>
      Les groupes de l'inventaire seront r&#233;pertori&#233;s dans le panneau de 
      l'inventaire au fur et &#224; mesure de leur cr&#233;ation. <br>

      <h3> <strong> <a name="create" id="create"> </a> Cr&#233;er un Groupe 
      d'Inventaire</strong> </h3>

      <p>Utilisez Cr&#233;er un Groupe d'Inventaire pour d&#233;finir les autres 
      groupes souhait&#233;s. Dans le menu Configuration, Cr&#233;er un groupe 
      d'Inventaire ouvre la bo&#238;te de dialogue <strong> Nouveau groupe 
      d'Inventaire</strong>. Cette m&#234;me bo&#238;te de dialogue <strong>
		Nouveau groupe d'Inventaires</strong> peut &#234;tre ouverte &#224; 
		 l'aide du bouton + ci-dessus. </P>

      <table style="text-align: left; width: 100%;" border="1"
      cellpadding="2" cellspacing="2" summary=
      "Create Roster Group">
        <tbody>
          <tr>
            <td style="width: 30%;" colspan="1" rowspan="5">
            <img style="width: 272px; height: 312px;" alt=
            "Roster groups" src=
            "images/dp3_rosterGroup02.png"></td>

            <td style="width: 15%;"><img style=
            "width: 118px; height: 81px;" alt="add group" src=
            "images/dp3_rosterGroup02a.png"></td>

            <td style="vertical-align: top;">
              Cr&#233;e un Groupe d'Inventaire<img style=
              "width: 297px; height: 128px;" src=
              "images/dp3_settings_rosterGroup_new.png" alt=
              "new group">

              <p>Le bouton <span style = "font-weight: bold;">OK</span> 
              ajoutera le groupe d'Inventaire &#224; la liste du panneau et 
              &#224; la liste d&#233;roulante de la barre d'outils de la fen&#234;tre
               principale. </P>

               <p>Vous pouvez maintenant ajouter des locomotives 
               aux groupes en les faisant glisser depuis la liste 
               de locomotives ou en utilisant le Tableau Associ&#233;, 
               d&#233;crit plus tard.</p>
             </td>
          </tr>

          <tr>
            <td colspan="1" rowspan="1"><img style=
            "width: 147px; height: 77px;" alt="menu button" src=
            "images/dp3_rosterGroup02b.png"></td>

            <td colspan="1" rowspan="1"><img style=
            "width: 216px; height: 209px;" alt="roster group menu"
            src="images/dp3_rosterGroup02c.png"><br>
            Ouvre le menu contextuel pour les groupes d'Inventaire<br>
            <span style="font-weight: bold;">Ouvre dans une 
            Nouvelle Fen&#234;tre</span><br>
            Une fen&#234;tre peut &#234;tre ouverte pour chaque groupe si vous le souhaitez.<br>
             <span style = "font-weight: bold;"> Exporter ... </span> <br>
             Ouvre la bo&#238;te de dialogue Enregistrer vous permettant de sauvegarder le groupe dans
             un fichier. <br>
             <span style = "font-weight: bold;"> Renommer ... </span> <br>
             <img style = "width: 327px; height: 144px;" alt = "renommer"
             src = "images/dp3_RosterGroup_rename.png"> <br>
             <span style = "font-weight: bold;"> Dupliquer </span> <br>
             <img style = "width: 303px; height: 144px;" alt =
             "duplicae" src =
             "images/dp3_RosterGroup_duplicate.png"> <br>
             <span style = "font-weight: bold;"> Supprimer </span> <br>
             <img style = "width: 377px; height: 122px;" alt = "delete"
             src = "images/dp3_RosterGroup_delete.png"> </td>
          </tr>

          <tr>
            <td></td>
          </tr>

          <tr>
            <td></td>
          </tr>

          <tr>
            <td></td>
          </tr>
        </tbody>
      </table>

      <h3><a name="renameRoster" id="renameRoster"></a>Renommer
      Groupe Inventaire</h3>

      <div style="text-align: center;">
        <div style="text-align: left;">
          <img style="width: 327px; height: 144px;" alt=
          "rename roster" src=
          "images/dp3_RosterGroup_rename.png"><br>
        </div>
      </div>

      <h3><a name="DupRosterGroup" id=
      "DupRosterGroup"></a>Dupliquer Groupe Inventaire</h3> <img style =
       "largeur: 303px; hauteur: 144px;" alt = "roster group duplicate"
       src = "images/dp3_RosterGroup_duplicate.png"> <br>

       <h3> <a name="Delete" id="Delete"> </a>Supprimer Groupe 
       Inventaire</h3> <img style = "width: 377px; height: 122px;" alt =
       "delete roster group" src =
       "images/dp3_RosterGroup_delete.png">

       <h3 style = "margin-left: 40px;"> <a name = "table" id =
       "table"> </a> Association de Tableaux de groupes d'Inventaire </h3>

       <p> Une fois les groupes nomm&#233;s, vous "associez" les entr&#233;es 
       d'Inventaire &#224; leur groupe. Pour ce faire, utilisez la s&#233;lection 
       <strong>Tableau Association</strong>. En haut du tableau, 
       s&#233;lectionnez le groupe auquel vous souhaitez associer les entr&#233;es 
       de l'inventaire, puis les entr&#233;es de l'inventaire que vous 
       souhaitez associer &#224; ce groupe.</P>

      <p><img src="images/dp3_setting_rosterGroup_table.png" alt=
      "table" height="591" width="784"></p>

      <p>S&#233;lectionner un groupe d'Inventaire: <select name = "select3" id = "select3">
        <option>
          Santa Fe
        </option>
      </select> le groupe d'Inventaire auquel vous voulez ajouter des entr&#233;es
       </p>

      <p>Le tableau pr&#233;sente toutes les locomotives de votre inventaire. </p>

      <p> Dans la colonne de droite, Inclure ... s&#233;lectionnez les entr&#233;es 
      que vous souhaitez ajouter au groupe d'inventaires, cliquez 
      individuellement pour s&#233;lectionner un seul &#233;l&#233;ment, maintenez 
      la touche Maj enfonc&#233;e pour s&#233;lectionner une plage d'&#233;l&#233;ments, 
      maintenez la touche CNTRL enfonc&#233;e. pour s&#233;lectionner des &#233;l&#233;ments 
      au hasard. Fermez la table et les entr&#233;es seront ajout&#233;es au groupe. </P>

      <p>Une fois les associations &#233;tablies, vous pouvez s&#233;lectionner 
      le Groupe d'Inventaire Actif. Une fois cette op&#233;ration effectu&#233;e, 
      les actions Imprimer et Imprimer le r&#233;sum&#233; ne montreront que les 
      entr&#233;es de l'inventaire associ&#233;es &#224; ce groupe. Par exemple, 
      vous pouvez s&#233;lectionner le groupe <strong>Santa Fe</strong>. 
      Seules les entr&#233;es de l'inventaire de ce groupe seront imprim&#233;es. 
      L'impression ne montre pas actuellement le groupe actif dans 
      l'en-t&#234;te. Le groupe actif influera &#233;galement sur les listes 
      d&#233;roulantes contenant une liste d'entr&#233;es, telles que R&#233;gulateur, 
      &#233;dition entr&#233;e, copie, etc. De plus, lors de l'ajout d'une nouvelle 
      entr&#233;e de l'inventaire, elle sera automatiquement associ&#233;e au 
      groupe actif. Lorsque vous avez fini de travailler avec 
      un groupe, il est recommand&#233; de renvoyer le groupe actif &#224; Global. </p>


      <h4><strong><em><br>
     Restauration de l'Inventaire pour inclure toutes les Machines </em> </strong> </h4>

       <p> Pour que votre inventaire affiche ttoutes les Machines,
       <strong>S&#233;lectionnez le Groupe d'Inventaire</strong> dans 
       Toutes les Entr&#233;es ou Global. Ensuite, vous pouvez &#234;tre certain 
       de travailler avec toutes les Machine de votre Inventaire. </P>

       <p> <strong> <em> Dissociation de l'Entr&#233;e de l'Inventaire dans un Groupe </em> </strong> <br> </p>

       <p> Pour dissocier une entr&#233;e inventaire d'un Groupe d'Inventaire, 
       ouvrez le Tableau des Groupes d'Inventaire, d&#233;cochez la 
       s&#233;lection de l'inventaire et enregistrez le nouveau Groupe en 
       fermant le Tableau du Groupe d'Inventaire.</p>

      <div align="right">
        <p><a href="dp3_menubar.shtml">Retour Barre de Menu</a></p>

        <p><a href="index.shtml#Main">Retour &#224; l'Index</a></p>
      </div><!--#include virtual="/Footer" -->
    </div><!-- closes #mainContent-->
  </div><!-- closes #mBody-->
</body>
</html>
