<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//FR"
"http://www.w3.org/TR/html4/loose.dtd">
<!-- Translation by Herv&#233; BLOREC <bzh56420@yahoo.fr> on 2019-03-02 -->
<html lang="fr">
<head>
  <meta name="generator" content=
  "HTML Tidy for Mac OS X (vers 31 October 2006 - Apple Inc. build 15.17), see www.w3.org">

  <title>Using DecoderPro</title><!-- Style -->
  <meta http-equiv="Content-Type" content=
  "text/html; charset=us-ascii">
  <link rel="stylesheet" type="text/css" href="/css/default.css"
  media="screen">
  <link rel="stylesheet" type="text/css" href="/css/print.css"
  media="print">
  <link rel="icon" href="/images/jmri.ico" type="image/png">
  <link rel="home" title="Home" href="/"><!-- /Style -->
</head>

<body>
  <!--#include virtual="/Header" -->

  <div id="mBody">
    <!--#include virtual="Sidebar" -->

    <div id="mainContent">
      <div align="center">
        <a name="Top" id="Top"></a> <img src="images/Logo.gif" alt=
        "JMRI DecoderPro Logo" border="10" height="117" width="163"
        vspace="15">
     </div>

      <h1>DecoderPro&reg; Modes de programmation</h1>

      <h2>Programmation en mode Ops</h2>

      <div align = "right">
        <p><a href="index.shtml">Retour &#224; l'Index</a></p>
     </div>
      <h>

      <p>S&#233;lectionnez la locomotive &#224; partir de la liste, s&#233;lectionnez 
      <input name = "radio" type = "radio" id = "radio" valeur = "radio" checked>
      <strong>Programmation principale</strong> et appuyez sur 
      <strong>Programme</strong>.</p>

      <p><b> Programmateur en mode Op&#233;rations (Piste principale)</b> - 
      ou <strong>Programmation sur le POM principal</strong>. Ouvre la 
      fen&#234;tre <strong>Mode d'exploitation (piste principale)</strong>. 
      Elle vous permet de programmer un d&#233;codeur sp&#233;cifique sur le r&#233;seau, 
      m&#234;me en cours de fonctionnement. Cependant, &#233;tant donn&#233; qu'il 
      s'adresse &#224; une adresse de d&#233;codeur sp&#233;cifique, certains d&#233;codeurs 
      ne vous permettront pas de changer l'adresse du d&#233;codeur en 
      utilisant cette m&#233;thode!</P>

      <p><img src = "images/Ops_Mode_setup.png" width = "268" height =
      "155" alt = "mode op"></p>

      <p>Certaines centrale de commande ne "diffuseront" que des commandes 
      de programmation, ce qui signifie que chaque locomotive du 
      r&#233;seau re&#231;oit la m&#234;me programmation! Il en va de m&#234;me si vous 
      essayez de programmer une locomotive avec une adresse z&#233;ro 
      (ou si vous oubliez de saisir une adresse lorsque vous d&#233;marrez). 
      En cas de doute, consultez votre documentation.</P>

      <blockquote>
        <strong>Lecture &#224; partir de votre d&#233;codeur dans le menu principal:</strong> <br>
        <br> &#193; quelques exceptions pr&#232;s, il n'est pas possible de lire 
        un CV sur le r&#233;seau. Si la lecture &#233;choue, une erreur 306 est 
        g&#233;n&#233;ralement signal&#233;e (d&#233;lai d'attente pour dialoguer avec la 
        centrale de commande.) <br>
        <br>
        <strong>&#201;crire dans votre d&#233;codeur &#224; partir du menu principal:</strong> <br>
        <br>
        Les programmes sur les &#233;critures principales sont souvent 
        appel&#233;s «&#233;critures aveugles» car le d&#233;codeur ne r&#233;pond pas que 
        l'&#233;criture a r&#233;ussi. Le POM est tr&#232;s utile pour r&#233;gler les 
        performances de la locomotive pendant son fonctionnement et 
        l'accus&#233; de r&#233;ception est le changement de performances. <br> 
        Le d&#233;codeur est d'abord adress&#233; par la station de commande, 
        puis le CV est adress&#233;, puis les donn&#233;es &#224; &#233;crire dans le CV 
        de ce d&#233;codeur est envoy&#233;. Une exception est si l'adresse 
        z&#233;ro est utilis&#233;e (ou si vous oubliez d'entrer une adresse
         lorsque vous d&#233;marrez). Ensuite, les <strong>ALL</strong> 
         d&#233;codeurs du disque principal &#233;crivent ces donn&#233;es dans 
         le CV appropri&#233;, ce qui constitue g&#233;n&#233;ralement une 
         "cons&#233;quence inattendue".
     </blockquote>

      <p>Certaines stations de commande ne "diffuseront" que des 
      commandes de programmation, ce qui signifie que chaque locomotive 
      du r&#233;seau re&#231;oit la m&#234;me programmation! En cas de doute, 
      consultez votre documentation.</P>

      <p>Dans cette fen&#234;tre, vous s&#233;lectionnez la locomotive dans 
      laquelle vous souhaitez modifier les valeurs de CV et le 
      programmeur que vous souhaitez utiliser. Une fois s&#233;lectionn&#233;s, 
      cliquez sur le bouton <strong>Ouvrir un programmateur</strong>, 
      comme vous le feriez avec le <strong>programmeur en mode service</strong>.</P>

      <div align = "right">
        <p><a href="index.shtml#Basic%20Programmer"> Retour &#224;
        Index</a></p>
     </div><!--#include virtual="/Footer" -->
   </div><!-- closes #mainContent-->
 </div><!-- closes #mBody-->
</body>
</html>
