<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//FR"
"http://www.w3.org/TR/html4/loose.dtd">
<!-- Translation by Herv&#233; BLOREC <bzh56420@yahoo.fr> on 2019-03-02 -->
<html lang="fr">
<head>
  <meta name="generator" content=
  "HTML Tidy for Mac OS X (vers 31 October 2006 - Apple Inc. build 15.17), see www.w3.org">

  <title>Using DecoderPro</title><!-- Style -->
  <meta http-equiv="Content-Type" content=
  "text/html; charset=us-ascii">
  <link rel="stylesheet" type="text/css" href="/css/default.css"
  media="screen">
  <link rel="stylesheet" type="text/css" href="/css/print.css"
  media="print">
  <link rel="icon" href="/images/jmri.ico" type="image/png">
  <link rel="home" title="Home" href="/"><!-- /Style -->
</head>

<body>
  <!--#include virtual="/Header" -->

  <div id="mBody">
    <!--#include virtual="Sidebar" -->

    <div id="mainContent">
      <h1> DecoderPro&reg; Modes de programmation </h1>

      <h2> Programmateur en mode service </h2>

      <div align = "right">
        <p><a href="index.shtml"> Retour &#224; l'Index</a></p>
      </div>
      <h>

      <p>Le <strong>Programmeur en Mode Service</strong> est ouvert &#224; 
      l'aide de l'ic&#244;ne <strong>Nouvelle loco</strong> dans la 
      <strong>Barre d'outils</strong> de DecoderPro&reg; ou en 
      s&#233;lectionnant la locomotive dans votre inventaire et en s&#233;lectionnant 
      <input name = "radio" type = "radio" id = "radio" value = "radio" 
      checked> <strong>Voie de programmation </strong > et en appuyant 
      sur le bouton <strong>Programme</strong>.</p>

      <p>Une autre m&#233;thode consiste &#224; cliquer avec le bouton droit de 
      la souris sur une locomotive de votre liste et &#224; s&#233;lectionner 
      <strong>Voie de Programmation</strong> et <strong>Programme</strong> 
      dans le menu contextuel.</p>

      <p>Double-cliquez sur une locomotive de l'inventaire pour ouvrir 
      le Programmeur <strong>Voie de Programmation</strong>..</p>

      <p><b>Programmateur </b> en mode service (voie de programmation) - 
      S&#233;lectionnez cette option pour programmer la locomotive sur la 
      voie de programmation d&#233;di&#233;e. (Probablement parce que la locomotive 
      doit &#234;tre emmen&#233;e sur la voie de programmation pour &#234;tre programm&#233;e). 
      Toutes les centrales de commande ne prennent pas en charge une voie 
      de programmation d&#233;di&#233;e, et certaines marques vont couper 
      l'alimentation principale en mode de programmation (ce qui n'est 
      pas agr&#233;able si vous avez une session d'op&#233;rations en cours.</p>

      <blockquote>
        <p><strong>Lecture de votre d&#233;codeur Sur la Voie de Programmation:</strong> <br>
        <br>
        Pour obtenir des informations du d&#233;codeur sur la voie de programmation, 
        nous nous appuyons sur sa capacit&#233; &#224; r&#233;pondre &#224; une requ&#234;te, 
        ce que l'on appelle <strong>Relecture</strong>. </Strong> La 
        plupart des d&#233;codeurs ne peuvent pas communiquer pour renvoyer 
        des informations &#224; la centrale de commande. Ils r&#233;pondent 
        simplement aux instructions. Des instructions sp&#233;ciales ont 
        donc &#233;t&#233; d&#233;velopp&#233;es pour permettre &#224; la centrale de commande de 
        d&#233;terminer le contenu des m&#233;moires du d&#233;codeur. <br>
        <br>
        En gros, le d&#233;codeur re&#231;oit toute une s&#233;rie de questions et, 
        lorsque la r&#233;ponse est "oui", le moteur ne tourne que tr&#232;s peu 
        de temps. La centrale de commande remarque que le courant est en 
        train d'&#234;tre trac&#233; et cesse de poser des questions, car elle a 
        obtenu la r&#233;ponse <strong><em> oui </em></strong> &#224; la derni&#232;re 
        question. Cela peut prendre un peu de temps car la centrale de 
        commande doit demander toutes les valeurs possibles en attente 
        de la r&#233;ponse <strong><em> oui </em></strong>. Vous pouvez 
        observer le processus en regardant la ligne inf&#233;rieure de 
        tous les volets (la barre d'&#233;tat) o&#249; le mot <strong><em> inactif </em></strong>
         est normalement affich&#233; lorsque le programmeur est inactif. 
         Lorsque DecoderPro fonctionne, il affiche les &#233;v&#233;nements en 
         cours. Parfois, vous pouvez voir la locomotive sauter un peu 
         lorsque le d&#233;codeur r&#233;pond. Les utilisateurs de l'ordinateur appellent 
         cela un accus&#233; de r&#233;ception. Lorsque la centrale de commande 
         envoie les donn&#233;es du d&#233;codeur en accord avec ce qui se trouve 
         dans le CV du d&#233;codeur, le d&#233;codeur envoie un accus&#233; de r&#233;ception. 
         Si l'accus&#233; de r&#233;ception n'est jamais re&#231;u, la centrale informe 
         DecoderPro que le d&#233;codeur n'a pas r&#233;pondu. <br>
        <br>
        <strong>&#201;criture dans le d&#233;codeur sur la voie de programmation:</strong> <br>
        <br>
        Les donn&#233;es de CV sont &#233;crites dans TOUS les d&#233;codeurs 
        de la voie de programmation. Une fois l'&#233;criture r&#233;ussie, le 
        d&#233;codeur accusera r&#233;ception de la centrale de commande num&#233;rique 
        (DCS). Si l'accus&#233; de r&#233;ception n'est pas vu par le DCS, 
        il indique que le d&#233;codeur n'a pas r&#233;pondu. (code d'erreur 308 dans JMRI)</p>

        <p>Cliquez sur <b> Programmateur en mode service (voie de programmation) </b>
         pour ouvrir la fen&#234;tre de configuration du programmeur en 
         mode service (voie de programmation)</p>.

        <div align = "center">
          <img src = "images / Set_Up.png" alt = "Configuration du mode de service"
          border = "5" class = "BOXIT">
        </div>

        <p>Le premier &#233;l&#233;ment en haut du volet de programmation du mode 
       service est une s&#233;lection du mode utilis&#233; pour programmer vos 
       d&#233;codeurs. Ceci est un h&#233;ritage des temps anciens et plut&#244;t 
       technique, mais heureusement, DecoderPro a m&#251;ri au point d'&#234;tre 
       assez bon pour choisir le mode qui vous convient le mieux. Il 
       utilise la s&#233;lection de la centrale de commande parmi vos 
       s&#233;lections Pr&#233;f&#233;rences, combin&#233;e au fabricant du d&#233;codeur et aux 
       s&#233;lections de types (que nous verrons tr&#232;s vite maintenant). 
       Acceptez ce qui est l&#224; comme un bon d&#233;but. Et n'ayez crainte, 
       chaque volet du programmeur dispose d'un bouton qui peut &#234;tre 
       utilis&#233; pour changer de mode de programmation en cas de probl&#232;me. 
       Pour plus d'informations sur le mode de programmation, 
       <a href= "Basic_Mode.shtml"> <strong>cliquez ici</strong></a>.</p>

        <p>D&#233;terminons maintenant le type de d&#233;codeur install&#233; dans la 
        locomotive que vous souhaitez programmer.</p>

        <p>L'identification du d&#233;codeur est entr&#233;e en utilisant les 
        s&#233;lections au milieu de la page.</p>

        <p>Puisque nous voulons savoir quel type de d&#233;codeur se trouve 
        dans la locomotive, nous pouvons rechercher ce qui &#233;tait 
        r&#233;pertori&#233; lorsqu'il a &#233;t&#233; entr&#233; dans la liste stock&#233;e dans cet 
        ordinateur, ou nous pouvons lui demander quelles sont sa version 
        de fabricant et de micrologiciel. La premi&#232;re m&#233;thode est 
        <strong>IDENT</strong> et l'autre <strong>LIRE TYPE. </Strong>. 
        Vous pouvez utiliser l'une ou l'autre, mais elles s'excluent 
        mutuellement.</p>

        <p><strong>IDENT</strong> permet d'identifier une locomotive d&#233;j&#224; 
        stock&#233;e dans la liste de votre ordinateur. Vous pouvez utiliser 
        la fl&#232;che d&#233;roulante pour afficher une liste des locomotives de 
        votre liste, puis s&#233;lectionner la locomotive souhait&#233;e dans la 
        liste. Une alternative consiste &#224; &#234;tre paresseux et &#224; cliquer 
        sur le bouton <strong>IDENT</strong>. Le programme interrogera 
        ensuite la locomotive pour obtenir l'adresse correspondant &#224; 
        l'entr&#233;e de la liste. L'entr&#233;e du programme Decoder Pro comprend 
        le type de d&#233;codeur utilis&#233; lors de la programmation de la 
        locomotive. S'il obtient une adresse valide, mais qu'il n'y a 
        pas d'entr&#233;e de r&#233;pertoire avec cette adresse, vous obtiendrez 
        un message d'erreur.</p>

        <p><strong>LIRE TYPE</strong> est l'autre m&#233;thode situ&#233;e au 
        centre de la page. Si vous cliquez sur le bouton <strong>Lire le 
        type du d&#233;codeur</strong>, le syst&#232;me interroge le d&#233;codeur pour 
        obtenir le fabricant et le num&#233;ro de version du micrologiciel. 
        A partir de cette information, il mettra en &#233;vidence tous les 
        d&#233;codeurs dont on sait qu'ils correspondent. Il peut y en avoir 
        plusieurs, g&#233;n&#233;ralement avec des diff&#233;rences de forme physique et 
        de taille pour s'ins&#233;rer dans la carrosserie d'une locomotive 
        particuli&#232;re, ou encore quelques "cloches et sifflets". Lorsque 
        vous &#234;tes confront&#233; &#224; une large s&#233;lection, vous pouvez soit 
        retirer la coque pour essayer de lire les informations imprim&#233;es 
        sur le d&#233;codeur lui-m&#234;me, soit simplement s&#233;lectionner l'une 
        de celles qui contiennent le moins de lettres du num&#233;ro de 
        mod&#232;le. (Des lettres sont souvent utilis&#233;es pour s&#233;parer les 
        diff&#233;rences de forme qui n'ont aucune incidence sur les fonctions
         &#233;lectroniques du d&#233;codeur.) Sachez simplement que certaines 
         fonctions que Decoder Pro vous permet de programmer peuvent 
         ne pas &#234;tre enti&#232;rement exploitables.</p>

        <p>Comme indiqu&#233; ci-dessus, ces m&#233;thodes ne fonctionneront 
        qu'avec les centrales de commande capables de lire le contenu 
        des CV, et le processus prend un certain temps. De nombreux 
        syst&#232;mes et d&#233;codeurs bas de gamme et / ou anciens ne fournissent 
        pas de capacit&#233; de relecture. Si la centrale de commande ne peut
         pas lire les CV de la voie de programmation, vous devrez 
         s&#233;lectionner le d&#233;codeur manuellement en utilisant la grande 
         bo&#238;te de s&#233;lection au milieu de la page. Avec celui-ci, vous 
         pouvez s&#233;lectionner le fabricant, la famille et le mod&#232;le 
         sp&#233;cifique du d&#233;codeur. Cette m&#233;thode manuelle peut &#234;tre la 
         m&#233;thode la plus rapide et la meilleure si vous savez exactement 
         ce qu'il y a dedans.</p>

        <p>Si vous avez un d&#233;codeur qui ne figure pas dans la liste, 
        vous pouvez v&#233;rifier que vous utilisez bien la version la plus 
        r&#233;cente de Decoder Pro, car les fabricants ajoutent des mod&#232;les 
        presque plus rapidement que l'&#233;quipe ne peut le faire. entrez 
        les nouvelles d&#233;finitions de d&#233;codeur dans les fichiers. Vous 
        pouvez choisir une version du fabricant aussi proche que possible, 
        ou, si vous n'&#234;tes int&#233;ress&#233; que par les fonctions de programmation 
        de base, utilisez le logiciel NMRA&copy; d&#233;codeur qui est un f
        ichier g&#233;n&#233;rique du CV contenu dans leurs normes.</p>

        <p>Le dernier &#233;l&#233;ment de ce volet est l'entr&#233;e Format du 
        programmeur. Il est pr&#233;d&#233;fini par votre entr&#233;e Pr&#233;f&#233;rences, 
        mais vous pouvez s&#233;lectionner d'autres programmeurs &#224; l'aide 
        de la fl&#232;che d&#233;roulante.</p>

        <p>Une fois que vous avez s&#233;lectionn&#233; un d&#233;codeur ou que 
        Decoder Pro l'a fait pour vous, le bouton <strong>Ouvrir le 
        programmeur</strong> s'active et vous permet de passer &#224; la 
        programmation en mode Service.</p>

        <p>Lorsque vous cliquez sur le bouton <strong>Ouvrir le 
        programmeur</strong>, la fen&#234;tre du programmeur s&#233;lectionn&#233;e 
        s'ouvre. Les deux programmeurs, Basique et Complet, s'ouvrent 
        dans la sous-fen&#234;tre Saisie.</p>
      </blockquote>

      <div align = "right">
        <p><a href="index.shtml"> Retour &#224; l'index</a></p>
      </div><!--#include virtual="/Footer" -->
    </div><!-- closes #mainContent-->
  </div><!-- closes #mBody-->
</body>
</html>
