<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//fr"
"http://www.w3.org/TR/html4/loose.dtd">
<!-- Translation by Herv&#233; BLOREC <bzh56420@yahoo.fr> on 2019-03-02 -->
<html lang="fr">
<head>
  <meta name="generator" content=
  "HTML Tidy for Mac OS X (vers 31 October 2006 - Apple Inc. build 15.17), see www.w3.org">

  <title>Using DecoderPro</title><!-- Style -->
  <meta http-equiv="Content-Type" content=
  "text/html; charset=us-ascii">
  <link rel="stylesheet" type="text/css" href="/css/default.css"
  media="screen">
  <link rel="stylesheet" type="text/css" href="/css/print.css"
  media="print">
  <link rel="icon" href="/images/jmri.ico" type="image/png">
  <link rel="home" title="Home" href="/"><!-- /Style -->
</head>

<body>
  <!--#include virtual="/Header" -->

  <div id="mBody">
    <!--#include virtual="Sidebar" -->

    <div id="mainContent">
      <h1>Utilisation decoderPro&reg;</h1>

      <h2> <a name="Setting Up"></a>Comment Configurer la Programmation d'un D&#233;codeur?</h2>

      <div align = "right">
        <p><a href="Basic_Start.shtml"> Suivant</a></p>

        <p><a href="index.shtml"> Retour &#224; l'Index</a></p>
      </div>
      <h>

      <p>Avant d'utiliser le programmeur, vous devez avoir rempli la 
      section pr&#233;c&#233;dente (<a href="Start_DCC.shtml"> Mise en route</a>), 
      connectez votre ordinateur &#224; votre centrale de commande/booster 
      avec le p&#233;riph&#233;rique d'interface requis. pour votre syst&#232;me DCC, 
      vous &#234;tes maintenant pr&#234;t &#224; programmer un d&#233;codeur install&#233; dans 
      votre locomotive.</p>

      <p><br>
      Lors de l'ouverture initiale decoderPro, la page principale 
      s'affiche: (Une fois les pr&#233;f&#233;rences d&#233;finies), de l'inventaire des 
      locomotives programm&#233;es par DecoderPro reste vide jusqu'&#224; ce que 
      vous ajoutiez une locomotive. &#193; partir de ce moment, lorsqu'on 
      ouvrira une inventaire de toutes les locomotives dont les d&#233;codeurs 
      que vous avez d&#233;j&#224; programm&#233;s dans DecoderPro3 ou DecoderPro 
      classique seront list&#233;s.</p>

      <p>DecoderPro fournit un acc&#232;s aux outils JMRI n&#233;cessaires &#224; la 
      programmation des d&#233;codeurs DCC. Si vous &#234;tes un utilisateur 
      exp&#233;riment&#233; et que vous utilisez PanelPro pour ex&#233;cuter votre 
      r&#233;seau, vous pouvez d&#233;marrer PanelPro puis, &#224; partir du menu 
      Fichier, lancer DecoderPro.</p>

      <p>Si vous avez d&#233;j&#224; des entr&#233;es dans de l'inventaire et que vous 
      souhaitez commencer &#224; programmer dans <strong>
		  <a href= "Comp_Setup_Roster.shtml"> Programmeur complet</a>
		  </strong>, double-cliquez sur l'entr&#233;e de l'inventaire.</p>

      <p>DecoderPro peut lui-m&#234;me programmer des d&#233;codeurs DCC et 
      &#233;galement utiliser les autres outils JMRI pour faire fonctionner 
      vos trains manuellement &#224; partir de l'interface de l'ordinateur. 
      Celles-ci incluent le R&#233;gulateur et le contr&#244;le de l'Alimentation 
      de votre r&#233;seau si votre syst&#232;me DCC le permet.</p>

      <p>La fen&#234;tre DecoderPro est divis&#233;e en cinq sections principales 
      de haut en bas.</p>

      <div align = "center">
        <img style = "width: 900px; height: 425px;" alt = "Fen&#234;tre principale"
        src = "images/start_dp_main01.png"> <br>
      </div>

      <p>1 <a href="dp3_menubar.shtml">. <strong> La barre de menus</strong>.</a> <br>
      2. <strong> <a href="dp3_toobar.shtml"> La barre d'outils</a>
      </strong> <br>
      3. <a href="dp3_rosterTable.shtml"> <strong> Tableau des inventaires
      </strong></a>: inventaire de tous les d&#233;codeurs de votre inventaire faisant 
      partie du groupe d'inventaires actif. Pour configurer un groupe de 
      r&#233;pertoires en plus du groupe par d&#233;faut de <strong> Toutes les 
      entr&#233;es</strong>, voir <strong> <a href =
      "dp3_settings_rosterGroups.shtml"> Param&#232;tres des groupes de inventaire.
      </a></strong>. <br> <br>
      4. <strong> <a href="dp3_decoderInfo.shtml"> Zone d'informations 
      du d&#233;codeur</a></strong>. Affichez des informations sur toutes les 
      locomotives s&#233;lectionn&#233;es dans de l'inventaire d'alignement. <br> 
      5. Une barre d'&#233;tat qui affiche des informations sur le fonctionnement 
      decoderPro, y compris les erreurs.</p>

      <p>Vous pouvez cliquer avec le bouton droit de la souris sur le 
      tableau de l'inventaire pour afficher un menu contextuel.</p>

      <p style = "text-align: center;"> <img style =
      "width: 619px; height: 255px;" alt = "menu contextuel" src =
      "images/dp3_main_contextMenu.png"></p>

      <table border = "0" cellpadding = "2" cellspacing = "1" width =
      "90%">
        <tbody>
          <tr>
            <td colspan = "2"> <strong> Cliquez avec le bouton droit de 
            la souris (Menu Contexte)</strong> </td>
          </tr>

          <tr>
            <td width = "26%"> Programme </td>

            <td width = "74%"> </td>
          </tr>

          <tr>
            <td rowspan = "3" valign = "top"> Type de programmeur <img src =
            "images/arrow.gif" height = "9" width = "20"> </td>

            <td> <input name = "radio" id = "radio" valeur = "radio"
            checked = "checked" type = "radio"> <a href =
            "Programmer_ServiceMode.shtml">voie de programmation</a> </td>
          </tr>

          <tr>
            <td> <input name = "radio2" id = "radio2" valeur = "radio2"
            type = "radio"> <a href =
            "Programmer_OpsMode.shtml"> Programmation voie principale</a> </td>
          </tr>

          <tr>
            <td> <input name = "radio3" id = "radio3" valeur = "radio3"
            type = "radio"> Edit (vous permet de modifier l'inventaire 
            sans apporter de modifications au programme) </td>
          </tr>

          <tr>
            <td> &#201;tiquettes et Media </td>

            <td> Ouvre la page de programmation pour s&#233;lectionner 
            l'onglet Etiquettes ou l'onglet M&#233;dia </td>.
          </tr>

          <tr>
            <td> R&#233;gulateur </td>

            <td> Ouvre une R&#233;gulateur JMRI </td>
          </tr>

          <tr>
            <td> Dupliquer </td>

            <td> Duplique l'entr&#233;e de l'inventaire s&#233;lectionn&#233; &#224; utiliser 
            pour le m&#234;me type de locomotive. </td>
          </tr>

          <tr>
            <td> Supprimer </td>

            <td> Supprime l'entr&#233;e de l'inventaire. </td>
          </tr>
        </tbody>
      </table>

      <p>&#193; ce stade, aucun nouvel utilisateur ne sera inscrit dans 
      l'inventaire des locomotives du r&#233;pertoire. Si vous mettez &#224; jour
       un programme et qu'un r&#233;pertoire est install&#233;, vous devez suivre l'inventaire.</p>


      <h4> <strong> <a name="newloco" id="newloco"></a> Ajouter une 
      nouvelle locomotive</strong> </h4>

      <p>Une ic&#244;ne intitul&#233;e <strong> Nouvelle loco</strong> est 
      pr&#233;sente dans la barre d'outils. Cliquez sur l'ic&#244;ne pour ouvrir 
      le volet <strong> Cr&#233;er une nouvelle locomotive</strong>. Placez 
      une locomotive (avec le d&#233;codeur install&#233;) sur la voie de 
      programmation (mode service), cliquez sur le bouton <span 
      style = "font-weight: bold;"> lire le type &#224; partir du d&#233;codeur 
      </span> (en bas de la fen&#234;tre). <br></p>

      <div style = "text-align: center;">
        <img style = "width: 521px; height: 594px;" alt =
        "cr&#233;er une nouvelle loco" src = "images/dp3_createnewloco.png"> <br>
      </div>

      <p>Comme dans l'&#233;cran ci-dessous, plusieurs d&#233;codeurs possibles 
      seront probablement mis en surbrillance. Cela est d&#251; au fait que 
      les d&#233;codeurs sont &#233;lectriquement identiques mais sont emball&#233;s 
      diff&#233;remment pour s'adapter aux locomotives dans lesquelles ils 
      sont utilis&#233;s. Si vous savez quel d&#233;codeur est utilis&#233;, 
      s&#233;lectionnez-le. Sinon, dans la plupart des cas, l'un des d&#233;codeurs 
      en surbrillance fonctionnera et vous devrez s&#233;lectionner celui 
      comportant le moins de lettres &#224; la fin, car les lettres sont 
      souvent utilis&#233;es pour d&#233;signer les variations sp&#233;cifiques &#224; la 
      locomotive. Notez que tous les d&#233;codeurs Tsunami utilisent le 
      m&#234;me mat&#233;riel dans des configurations diff&#233;rentes.</p>

      <p><img style = "width: 556px; height: 594px;" alt =
      "s&#233;lectionner le type de d&#233;codeur all" src =
      "images/dp3_createNewLoco_typeAll.png"></p>

      <p>Je sais que ce d&#233;codeur est un d&#233;codeur OEM Tsunami Diesel 
      Genesis install&#233; en usine par FP-45 d'Athearn N Scale. Je vais 
      donc s&#233;lectionner ce d&#233;codeur dans de l'inventaire.</p>

      <p><img style = "width: 556px; height: 594px;" alt =
      "type de d&#233;codeur" src =
      "images/dp3_createnewloco_type.png"> <br></p>

      <p>Notez que nous avons s&#233;lectionn&#233; un d&#233;codeur, qui est mis en 
      surbrillance. Le bouton <strong> Ouvrir le Programmeur Complet
      </strong> est &#233;galement activ&#233; pour nous permettre de saisir le 
      programmeur.</p>

      <p>Cliquez sur le bouton <strong> Ouvrir le Programmeur Complet
      </strong> pour ouvrir le volet <strong> Entr&#233;e de r&#233;pertoire</strong> 
      du programmeur s&#233;lectionn&#233;. Aller &#224; la page suivante</p>

      <div align = "right">
        <p><a href="Basic_Start.shtml"> Suivant</a></p>

        <p><a href="index.shtml"> Retour &#224; l'index</a></p>
      </div><!--#include virtual="/Footer" -->
    </div><!-- closes #mainContent-->
  </div><!-- closes #mBody-->
</body>
</html>
