<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//FR"
"http://www.w3.org/TR/html4/loose.dtd">
<!-- Translation by Herv&#233; BLOREC <bzh56420@yahoo.fr> on 2019-03-02 -->
<html lang="fr">
<head>
  <meta name="generator" content=
  "HTML Tidy for Mac OS X (vers 31 October 2006 - Apple Inc. build 15.17), see www.w3.org">

  <title>Comprehensive Programmer - Advanced Features Pane</title>
  <!-- Style -->
  <meta http-equiv="Content-Type" content=
  "text/html; charset=us-ascii">
  <link rel="stylesheet" type="text/css" href="/css/default.css"
  media="screen">
  <link rel="stylesheet" type="text/css" href="/css/print.css"
  media="print">
  <link rel="icon" href="/images/jmri.ico" type="image/png">
  <link rel="home" title="Home" href="/"><!-- /Style -->
</head>

<body>
  <!--#include virtual="/Header" -->

  <div id="mBody">
    <!--#include virtual="Sidebar" -->

    <div id="mainContent">
      <a name="Top" id="Top"></a>

      

<h1>DecoderPro&reg; Fonction avanc&#233;e</h1>

      <h2>Volet M&#233;dia de la liste</h2>

      <div align = "right">
        <p><a href="index.shtml">Retour &#224; l'index</a></p>
     </div>
      <h>

      <p>Le volet Support de M&#233;dia s'ouvrira &#224; partir du bouton DecoderPro 
      de la fen&#234;tre principale ou du menu Action, puis s&#233;lectionnez 
      l'onglet Support de M&#233;dia.</p>

      <p>La sous-fen&#234;tre  Multim&#233;dia vous permet d'ajouter une image 
      principale et une ic&#244;ne &#224; la liste des Machines. L'image principale 
      peut &#234;tre utilis&#233;e pour l'image d'arri&#232;re-plan du R&#233;gulateur si elle 
      est s&#233;lectionn&#233;e dans les pr&#233;f&#233;rences du R&#233;gulateur. L'image de 
      l'ic&#244;ne est utilis&#233;e dans la liste des R&#233;gulateur et dans diverses 
      zones de liste d&#233;roulante.</P>

      <p>L'ic&#244;ne est l'image qui appara&#238;tra dans la partie Informations 
      sur le d&#233;codeur de l'&#233;cran initial de DecoderPro, une fois que vous 
      avez s&#233;lectionn&#233; une locomotive dans la liste. L'ic&#244;ne s'affiche &#233;
      galement dans la colonne d'ic&#244;nes de la liste des locomotives.</P>

      <p align = "center"> <img src = "images/Adv_04_RosterMedia.png"
      alt = "roster media" height = "768" width = "916"></p>

      <p align = "left"> <strong>Image &#224; utiliser pour cette locomotive:</strong> 
      le grand cadre correspond au support de l'image. L'image est 
      plac&#233;e dans le porte-image en suivant les instructions ci-dessous.</P>

      <div style = "margin-left: 2em">
        <ol>
          <li> Vous devez d'abord trouver l'image de la locomotive et 
          la stocker sur votre lecteur de disque.

            <ol type = "a">
              <li> Sources

                <ol>
                  <li> Images t&#233;l&#233;charg&#233;es d'un site Web sur votre 
                  ordinateur</li>

                  <li> Photos prises avec un appareil photo num&#233;rique 
                  ou num&#233;ris&#233;es &#224; partir d'un film</li>

                  <li> Autres sources, images de CD, de DVD provenant 
                  de vid&#233;os, etc. enregistr&#233;es sous forme d'image sur 
                  votre ordinateur</li>
               </ol>
             </li>

              <li> Format

                <ol>
                  <li> Le format GIF est pr&#233;f&#233;rable avec un fond 
                  transparent</li>

                  <li> PNG avec fond transparent</li>

                  <li> JPG</li>
               </ol>
             </li>
           </ol>
         </li>

          <li> Apr&#232;s avoir enregistr&#233; l'image sur votre ordinateur, 
          ouvrez le volet M&#233;dia de support, puis ouvrez l'explorateur 
          Windows ou le gestionnaire de fichiers de votre syst&#232;me, 
          puis faites glisser le fichier image dans le grand cadre noire. 
          Vous pouvez &#233;galement enregistrer l'image sur votre bureau, 
          puis faire un glisser-d&#233;poser sur le m&#233;dia d'alignement &#224; 
          partir de l&#224;. N'essayez PAS de glisser-d&#233;poser depuis un 
          site Web.</Li>

          <li style = "list-style: none"> Les images de la liste sont 
          stock&#233;es dans le dossier &lt;Pr&#233;f&#233;rences JMRI&gt;/resources. 
          Lorsqu'une image est mise &#224; jour ou supprim&#233;e, elle n'est 
          pas supprim&#233;e de ce dossier.</Li>
       </ol>
     </div>

      <blockquote>
        <blockquote>
          <p align = "center"> <img src =
          "images/Adv_04a_RosterMedia.png" alt = "glisser-d&#233;poser"
          height = "515" width = "690"></p>
       </blockquote>

        <p>Pour supprimer une image de la liste, cliquez avec le bouton 
        droit de la souris et cliquez sur Supprimer dans le contexte qui 
        s'affiche. Toutefois, l'image ne sera pas supprim&#233;e du dossier 
        Ressources.</p>
<p align = "left"> <strong>Image &#224; utiliser comme ic&#244;ne pour cette 
locomotive, t&#234;te &#224; droite:</strong> de la m&#234;me mani&#232;re, il existe un petit 
cadre pouvant &#234;tre rempli avec une image &#224; utiliser comme ic&#244;ne 
d'identification de la liste. Les instructions sont &#233;galement similaires:</p></blockquote>

      <div style = "margin-left: 4em">
        <ol>
          <li> Ensuite, vous devez trouver l'image de la locomotive &#224; 
          utiliser comme ic&#244;ne et la stocker sur votre lecteur de disque.

            <ol type = "a">
              <li> Sources

                <ol>
                  <li> Images t&#233;l&#233;charg&#233;es d'un site Web sur 
                  votre ordinateur</li>

                  <li> Photos prises avec un appareil photo num&#233;rique 
                  ou num&#233;ris&#233;es &#224; partir d'un film</li>

                  <li> Autres sources, images de CD, de DVD provenant 
                  de vid&#233;os, etc. enregistr&#233;es sous forme d'image sur 
                  votre ordinateur</li>
               </ol>
             </li>

              <li> Format

                <ol>
                  <li> Le format GIF est pr&#233;f&#233;r&#233;</li>

                  <li> PNG avec fond transparent</li>

                  <li> N'utilisez pas de fichier JPG.</li>
               </ol>
             </li>
           </ol>
         </li>

          <li> Apr&#232;s avoir stock&#233; l'image de l'ic&#244;ne sur votre ordinateur,
           ouvrez le volet Multim&#233;dia, l'explorateur Windows ou le 
           gestionnaire de fichiers de votre syst&#232;me, puis faites glisser 
           le fichier image dans le petit cadre. Vous pouvez &#233;galement 
           enregistrer l'image sur votre bureau, puis faire un glisser-
           d&#233;poser sur le m&#233;dia d'alignement &#224; partir de l&#224;. N'essayez 
           PAS de glisser-d&#233;poser depuis un site Web.</Li>
       </ol>
     </div>

      <blockquote>
        <p>Pour supprimer une image de la liste, cliquez avec le bouton 
        droit de la souris et cliquez sur Supprimer dans le contexte qui 
        s'affiche. Toutefois, l'image ne sera pas supprim&#233;e du dossier Ressources.</p>

        <p><strong>R&#233;f&#233;rence Web:</strong> vous pouvez copier l'URL du 
        site Web sur lequel vous avez localis&#233; les images pour r&#233;f&#233;rence</p>.
     </blockquote>

      <p><input name = "button" id = "button" value = "Enregistrer dans 
      la liste" type = "submit"> Apr&#232;s avoir ajout&#233; des images aux zones 
      d'image pour l'image principale et l'ic&#244;ne, cliquez sur ce bouton 
      pour enregistrer les images dans votre Liste. Maintenant, l'image 
      appara&#238;tra dans votre liste d'inventaire dans DecoderPro.</P>

      <p><img src = "images/Adv_04b_RosterMedia.png" alt =
      "support de liste" height = "358" width = "899"></p>

      <p><strong>Les liens pour les ic&#244;nes au format GIF et les images 
      de la plupart des locomotives</strong> <strong>sont 
      r&#233;pertori&#233;s ci-dessous:</strong></p>

      <p><a href = "http://www.railserve.com/TrainGIFs/" target =
      "_blank"> Service Ferroviaire </a></p>

      <p><a href =
      "http://www.djcooley.com/info/gifs/loco/gifloco.htm" target =
      "_blank"> Train GIF Railyard </a></p>

      <p><a target = "_ blank" href =
      "http://www.kls2.com/%7Ekarl/rr/consists/">Pages Karl's RR</a></p>

      <p><a target = "_ blank" href =
      "http://www.bluarcher.com/traingifs/edtraingifsSD40.htm">EDBindler Train GIF.s </a></p>
      <h>

      <div align = "right">
        <p><a href="Comp_LightFX.shtml"> </a> <a href =
        "index.shtml"> Retour &#224; l'index </a></p>
      </div><!--#include virtual="/Footer" -->
    </div><!-- closes #mainContent-->
  </div><!-- closes #mBody-->
</body>
</html>
