<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//FR"
"http://www.w3.org/TR/html4/loose.dtd">
<!-- Translation by Herv&#233; BLOREC <bzh56420@yahoo.fr> on 2019-03-03 -->
<html lang="fr">
<head>
  <meta name="generator" content=
  "HTML Tidy for Mac OS X (vers 31 October 2006 - Apple Inc. build 15.17), see www.w3.org">

  <title>Decoder Pro Manual: Getting Started</title><!-- Style -->
  <meta http-equiv="Content-Type" content=
  "text/html; charset=us-ascii">
  <link rel="stylesheet" type="text/css" href="/css/default.css"
  media="screen">
  <link rel="stylesheet" type="text/css" href="/css/print.css"
  media="print">
  <link rel="icon" href="/images/jmri.ico" type="image/png">
  <link rel="home" title="Home" href="/"><!-- /Style -->
</head>

<body>
  <!--#include virtual="/Header" -->

  <div id="mBody">
    <!--#include virtual="Sidebar" -->

    <div id="mainContent">
     <aname="Top" id="Top"></a> <img src="images/Logo.gif" alt=
      "JMRI DecoderPro Logo" class="BOXIT" border="10" height="117"
      vspace="15" width="163">

      

<h1> Premiers pas avec DecoderPro&reg;</h1>

      <h2> De quel mat&#233;riel ai-je besoin?</h2>

      <div align = "right">
        <p><a href="Start_DCC_Systems.shtml"> Pr&#233;c&#233;dent</a> <a href =
        "Start_DecoderPro.shtml"> | Suivant</a></p>

        <p><a href="index.shtml#Getting%20Started"> Retour &#224; l'index</a></p>
    </div>
      <h>

      <p>Vous aurez besoin d'un moyen de connexion entre votre ordinateur 
      et la voie sur laquelle repose la locomotive, qui prendra des 
      instructions en s&#233;rie et g&#233;n&#233;rera des paquets DCC sur les rails. 
      Au minimum, une centrale de commande/booster (votre syst&#232;me DCC 
      suffira probablement), une interface mat&#233;rielle suppl&#233;mentaire 
      pour envoyer des commandes de votre ordinateur &#224; la centrale de 
      commande (ceci pourrait &#234;tre aussi simple qu'un c&#226;ble s&#233;rie) et 
      une voie de programmation configur&#233;e selon les instructions du fabricant.</p>

      <p>Pour certains syst&#232;mes, vous aurez &#233;galement besoin d'une 
      interface mat&#233;rielle suppl&#233;mentaire pour envoyer les commandes 
      de votre ordinateur &#224; la centrale de commande, puis au d&#233;codeur 
      de la locomotive. Pour un syst&#232;me Digitrax, par exemple, 
      vous aurez besoin du <strong> programmeur PR3</strong> ou d'un 
      <b>LocoBuffer</b>. Le p&#233;riph&#233;rique <b>PR1</b> de Digitrax est
       un programmeur autonome et <span class = "ACCENT"> n'est 
       pas</span> utilisable avec ce logiciel.</P>

      <p>Pour ceux qui ne disposent pas encore de mat&#233;riel DCC et 
      envisagent d'acheter une locomotive DCC et qui souhaitent 
      utiliser Decoder Pro pour la programmer, envisagez le 
      SPROG II USB. Il contient tous les composants &#233;lectroniques 
      dans un m&#234;me paquet avec une sortie suffisante pour faire 
      fonctionner une locomotive. Il est livr&#233; avec le c&#226;ble USB, 
      l'alimentation, les instructions et JMRI sur disque. En plus, 
      tout ce dont vous avez besoin est la voie de programmation.</P>

      <p>Vous aurez &#233;galement besoin, bien s&#251;r, de locomotives avec 
      les d&#233;codeurs install&#233;s que vous pouvez programmer.</p>
      <h>

      <div align = "right">
        <p><a href="Start_DCC_Systems.shtml"> Pr&#233;c&#233;dent</a> <a href =
        "Start_DecoderPro.shtml"> | Suivant</a></p>

        <p><a href="index.shtml#Getting%20Started"> Retour &#224; l'index</a></p>
     </div><!--#include virtual="/Footer" -->
   </div><!-- closes #mainContent-->
 </div><!-- closes #mBody-->
</body>
</html>
