# NodeConfigBundle_fr.properties
#
# Revision $Revision$
#
# Default properties for the jmri.jmrix.secsi.nodeconfig window
#
# Translated by Herv\u00e9 BLOREC <bzh56420@yahoo.fr> le 2013-8-19


WindowTitle = configurer les noeuds

BoxLabelNotes = Remarques

LabelCardSize = Taille de la carte:
LabelNodeAddress = Adresse du Noeud:
LabelNodeType = Type de Noeud:

TipNodeAddress = Entrez l'adresse de noeud, la num\u00e9rotation \u00e0 partir de 0.
TipNodeType = S\u00e9lectionnez le type de noeud.
TipAddButton = Ajouter un nouveau noeud
TipEditButton = Modifier Un noeud existant
TipDeleteButton = Supprimer un noeud existant
TipDoneButton = S\u00e9lectionnez lorsque vous avez termin\u00e9 la configuration des noeuds
TipUpdateButton = Changer informations du noeud
TipCancelButton = Arr\u00eat modification sans changement du noeud

ButtonAdd = Ajt Noeud
ButtonEdit = Modif Noeud
ButtonDelete = Supp Noeud
ButtonDone = Fait
ButtonUpdate = M \u00e0 J Noeud
ButtonCancel = Annuler

# Le plus long des trois prochaines lignes d\u00e9termine la largeur de la fen\u00eatre.
NotesStd1 = Pour ajouter un nouveau noeud, saisir des informations et s\u00e9lectionner \u00abAjt Noeud\u00bb.
NotesStd2 = Pour modifier un noeud, entrez l'adresse de noeud, puis s\u00e9lectionnez \u00abModif Noeud\u00bb.
NotesStd3 = Pour supprimer un noeud, entrez l'adresse de noeud, puis s\u00e9lectionnez \u00abSupp Noeud\u00bb.
# Ces trois lignes doivent \u00eatre plus courte que la plus longue ligne ci-dessus.
NotesEdit1 = Veuillez v\u00e9rifier l'adresse du noeud avant de faire des changements.
NotesEdit2 = Pour modifier ce noeud, effectuez les modifications, puis s\u00e9lectionnez "M \u00e0 J Noeud".
NotesEdit3 = Pour quitter sans changer ce noeud, s\u00e9lectionnez \u00abAnnuler\u00bb.

# Toutes les lignes Errorxx ci-dessous doivent \u00eatre plus courte que la plus longue ligne NotesStdx ci-dessus.
Error1 = Erreur - Noeud avec adresse "
Erreur2 = "existe d\u00e9j\u00e0, veuillez r\u00e9essayer plus tard.
ERROR3 = Erreur lors de la cr\u00e9ation de nouveaux noeuds. Noeud pas ajout\u00e9.
Error4 = Erreur - Aucun noeud avec l'Adresse de Noeud entr\u00e9 (UA), veuillez r\u00e9essayer.
Error5 = Erreur - Mauvais caract\u00e8re dans l'Adresse du Noeud (UA), veuillez r\u00e9essayer.
Error6 = Erreur - l'adresse du noeud n'est pas comprise entre 0 et 255.

FeedBackAdd = Noeud ajout\u00e9. Adresse du Noeud =
FeedBackDelete = Noeud supprim\u00e9. Adresse du Noeud =
FeedBackUpdate = Noeud mis \u00e0 jour. Adresse du Noeud =

ConfirmDelete1 = \u00eates-vous s\u00fbr de vouloir supprimer ce noeud?
ConfirmDelete2 = Les capteurs, les aiguillages, ou les lumi\u00e8res avec cette adresse de noeud seront affect\u00e9s.
ConfirmDeleteTitle = Confirmer la suppression
ConfirmUpdate2 = les adresses de capteur, aiguillage et  lumi\u00e8res peuvent \u00eatre affect\u00e9es.
ConfirmUpdate3 = Etes-vous s\u00fbr que vous voulez mettre \u00e0 jour ce noeud?
ConfirmUpdateTitle = Confirmer Mise \u00e0 Jour

Reminder1 = N'oubliez pas de sauvegarder votre nouvelle information de noeud.
Reminder2 = Utilisez le bouton Enregistrer dans la fen\u00eatre Pr\u00e9f\u00e9rences.
ReminderTitle = Rappel
